
///////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ УПРАВЛЕНИЯ ПЕЧАТЬЮ


// Функция формирования Приложения 4 (ТН)
//
Функция ПечатьТН(ПараметрКоманды) Экспорт  
	
	Если ПараметрКоманды.ОбъектыПечати.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ",ПараметрКоманды.ОбъектыПечати[0]); 
	Если ПараметрКоманды.Идентификатор = "ЭР" Тогда //настройка команды для печатки
		ПараметрыФормы.Вставить("ЭР",Истина); 
	КонецЕсли;
	
	ОткрытьФорму("Обработка.алк_ПечатьТН.Форма", ПараметрыФормы);
	
КонецФункции // ПечатьТН()+ЭР()


/////////////////////////////////////////////////////////////////////////////////
// ПОЛУЧЕНИЕ ДАННЫХ

#Область ВспомогательныеДанные

// Возвращает данные из регистра сведений "Основные объекты"
// ВидОбъекта - элемент справочника "Виды объектов" - как правило предопределенное значение
// Функция позволяет получить объекты предметной области без использования "НайтиПоКоду", "НайтиПоНаименованию" и т.п.
//
Функция ОбъектДанных(ВидОбъекта) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ":" + ВидОбъекта;
	Сообщение.Сообщить(); 
	
	Возврат ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ОсновнойСклад");
	
	//Возврат РфпПолучениеДанныхСервер.ОбъектДанных(ВидОбъекта);
	
КонецФункции

#КонецОбласти



Функция ДатаПереходаНаТриЗнака()Экспорт 

	Возврат Дата('20190101010101'); //'ГГГГММДДччммсс'

КонецФункции // ДатаПереходаНаТриЗнака()
 