


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		
		ЭтотОбъект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000034");  //Участок ГТО
		
		ЭтотОбъект.Дата 			= НачалоМинуты(ТекущаяДата());
		ЭтотОбъект.НачалоЗагрузки 	= ЭтотОбъект.Дата;
		ЭтотОбъект.Сезон 			= ПолучитьСезон(ЭтотОбъект.Дата);
	    		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);

КонецПроцедуры

Функция ПолучитьСезон(ДатаСреза)
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();	
	КонецЕсли; 

	Сезон = Перечисления.алк_СезоныПропарки.Лето;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сезон = ВыборкаДетальныеЗаписи.Сезон;
	КонецЦикла;
	
	Возврат Сезон;

КонецФункции // ПолучитьСезон()
 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ЗагрузкаВКамеруПропарки.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьОстаткиВКамерахПропарки(ДополнительныеСвойства, Движения, Отказ);  
	РфпСервер.ОтразитьСтатусыПропарки(ДополнительныеСвойства, Движения, Отказ);
    //РфпСервер.ОтразитьУчетВремениПропарки(ДополнительныеСвойства, Движения, Отказ);
		
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	КонтрольЗаполнения(Отказ);
	
КонецПроцедуры


// проверка 
// - Заполненали ли камера
Процедура КонтрольЗаполнения(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
	
	// Заполненали ли камера
	
	Момент = Новый МоментВремени(НачалоЗагрузки, Ссылка); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиВКамерахПропаркиОстатки.ОбъемОстаток
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиВКамерахПропарки.Остатки(&ДатаСреза, ) КАК алк_ОстаткиВКамерахПропаркиОстатки
		|ГДЕ
		|	алк_ОстаткиВКамерахПропаркиОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка", КамераПропарки);
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(Момент, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Камера ГТО не пуста!");
		Отказ = Истина;
		
	КонецЦикла;   
	
	
	Если НачалоЗагрузки >= ОкончаниеЗагрузки Тогда
		
		Сообщить("Окончание загрузки должно быть позже начала загрузки!");
		Отказ = Истина;
		
	КонецЕсли; 
	
	Если ОкончаниеЗагрузки > ВремяЗапускаКамеры Тогда
		
		Сообщить("Запуск камеры должен быть позже окончания загрузки!");
		Отказ = Истина;
		
	КонецЕсли  
	
	// контроль хронологии записей по камере - если есть более позняя запись, ее нужно отменить
	
	//ВремяПервойЗаписиСтатуса = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСтатусыПропарки[0].Период;
	
	
	
КонецПроцедуры
 
