
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	ДокладнаяОТК = Параметры.СсылкаНаОбъект; 
	
	Если ПроверитьГруппыДоступа() Тогда   
		
		Если ЗначениеЗаполнено(ДокладнаяОТК.ОтветственныйСотрудник)  тогда
			Автор = ДокладнаяОТК.ОтветственныйСотрудник; 
			Если  НЕ Автор = ТекущийПользователь Тогда     
				Элементы.ЗаписатьКомментарий.Доступность = Ложь;  
				Элементы.КомментарийОтветственногоСотрудника.Доступность = Ложь; 
				Сообщить("Вы не являетесь автором комментария. Изменение комментария запрещено.");
			КонецЕсли;
		Иначе  
			Автор = ТекущийПользователь;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ДокладнаяОТК.КомментарийОтветственногоСотрудника) тогда
			Комментарий = ДокладнаяОТК.КомментарийОтветственногоСотрудника;
		КонецЕсли;  
		
	Иначе  
				
		Если ЗначениеЗаполнено(ДокладнаяОТК.КомментарийОтветственногоСотрудника) тогда
			Комментарий = ДокладнаяОТК.КомментарийОтветственногоСотрудника; 
			Элементы.КомментарийОтветственногоСотрудника.Доступность = Ложь; 
			Элементы.ЗаписатьКомментарий.Доступность = Ложь;

		КонецЕсли;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарийНаСервере()   
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");  
	ОбработкаОбъект.ЗаписатьКомментарийВДок(ДокладнаяОТК,Автор,Комментарий); 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКомментарий(Команда) 
	Если ЗначениеЗаполнено(Комментарий) тогда
		
		ЗаписатьКомментарийНаСервере();   
		Закрыть(ДокладнаяОТК);  
	Иначе
		Сообщить("Нельзя записать пустой комментарий. Заполните данное поле.");
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьГруппыДоступа()        
		
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь(); 
	ПолныеПрава = Пользователи.ЭтоПолноправныйПользователь(Пользователь); 
		
	Если РольДоступна("алк_ДобавлениеКомментарияДокладнаяОТК") ИЛИ  ПолныеПрава Тогда 
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли; 
 	
КонецФункции



