
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;  
	
	//Проверка на уникальность
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВариантыПрипуска.Ссылка
		|ИЗ
		|	Справочник.алк_ВариантыПрипуска КАК алк_ВариантыПрипуска
		|ГДЕ
		|	алк_ВариантыПрипуска.Ссылка <> &Ссылка
		|	И алк_ВариантыПрипуска.ПрипускПоШирине = &ПрипускПоШирине
		|	И алк_ВариантыПрипуска.ПрипускПоТолщине = &ПрипускПоТолщине
		|	И алк_ВариантыПрипуска.ПрипускПоДлине = &ПрипускПоДлине";
	
	Запрос.УстановитьПараметр("ПрипускПоДлине", ПрипускПоДлине);
	Запрос.УстановитьПараметр("ПрипускПоТолщине", ПрипускПоТолщине);
	Запрос.УстановитьПараметр("ПрипускПоШирине", ПрипускПоШирине);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Припуск с такими данными уже существует: "  + ВыборкаДетальныеЗаписи.Ссылка);
		Отказ = Истина;
	КонецЦикла;
		
КонецПроцедуры



