
Процедура ПроизвестиДлительноеВычисление(СтрутураПараметров, АдресХранилища) Экспорт
	
	Пауза(70000);
	
	ПоместитьВоВременноеХранилище("Михаил Щербаков", АдресХранилища);
		
КонецПроцедуры

Процедура Пауза(ПаузаВМс) Экспорт

	Скрипт=Новый ТекстовыйДокумент();
	Скрипт.УстановитьТекст
	("if (WScript.Arguments.Count()==0)
	|    WScript.Quit();
	|else
	|    if (isNaN(parseInt(WScript.Arguments(0))))
	|        WScript.Quit();
	|WScript.Sleep(WScript.Arguments(0));");
	
	GUID = Новый УникальныйИдентификатор;
	ИмяФайлаСкрипта = КаталогВременныхФайлов() + GUID + "_sleep.js";
	Скрипт.Записать(ИмяФайлаСкрипта, КодировкаТекста.ANSI);
	
	WshShell = Новый COMОбъект("wscript.shell");
	WshShell.Run("wscript.exe """ + ИмяФайлаСкрипта + """ " + Формат(ПаузаВМс, "ЧГ=0"), 0, -1);
	
	УдалитьФайлы(ИмяФайлаСкрипта);

КонецПроцедуры
 
 