#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводОстатков, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка,
		|	алк_ВводНачальныхОстатковЗапасы.Номенклатура,
		|	алк_ВводНачальныхОстатковЗапасы.Характеристика,
		|	СУММА(алк_ВводНачальныхОстатковЗапасы.Количество) КАК Количество,
		|	СУММА(алк_ВводНачальныхОстатковЗапасы.Объем) КАК Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.ДатаСмены,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Смена,
		|	алк_ВводНачальныхОстатковЗапасы.Сертификат
		|ИЗ
		|	Документ.алк_ВводНачальныхОстатков.Запасы КАК алк_ВводНачальныхОстатковЗапасы
		|ГДЕ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВводНачальныхОстатковЗапасы.Характеристика,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.ДатаСмены,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВводНачальныхОстатковЗапасы.Сертификат,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Смена,
		|	алк_ВводНачальныхОстатковЗапасы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка,
		|	алк_ВводНачальныхОстатковЗапасы.Номенклатура,
		|	алк_ВводНачальныхОстатковЗапасы.Характеристика,
		|	алк_ВводНачальныхОстатковЗапасы.Количество,
		|	алк_ВводНачальныхОстатковЗапасы.Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ВводНачальныхОстатковЗапасы.Сертификат,
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка.Ячейка КАК Штабель
		|ИЗ
		|	Документ.алк_ВводНачальныхОстатков.Запасы КАК алк_ВводНачальныхОстатковЗапасы
		|ГДЕ
		|	алк_ВводНачальныхОстатковЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ?(ДокументСсылкаВводОстатков.Расход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход));
		Запрос.УстановитьПараметр("Период", РфпСервер.ПериодПроведения(ДокументСсылкаВводОстатков));
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводОстатков);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", МассивРезультатов[1].Выгрузить());
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
#КонецЕсли
