
//РФП
Процедура СохранитьЛогИзмененияДатыЗапрета(НаборЗаписей) Экспорт
	
	ПутьЛога = "\\rfp01-srv023.rfpgroup.ru\Files\1C\Log\logALK.txt";
	Кто = Пользователи.ТекущийПользователь();
	Когда = ТекущаяДата();
	База = СтрокаСоединенияИнформационнойБазы();
	Попытка
	
		ТекстДляЗаписи = Новый ЗаписьТекста; 
		ТекстДляЗаписи.Открыть(ПутьЛога,,,Истина); 
		Для каждого Запись из НаборЗаписей Цикл
			Строка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 | %2 | %3 | %4 | %5 | %6"
				, Когда
				, Кто
				, Запись.ДатаЗапрета
				, Запись.Пользователь
				, Запись.Раздел
				, База);
			ТекстДляЗаписи.ЗаписатьСтроку(Строка); 
		КонецЦикла;
		ТекстДляЗаписи.Закрыть();
		
	Исключение
		ЗаписьЖурналаРегистрации("Запись лога установки даты запрета редактирования", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ДатыЗапретаИзменения, Строка(Кто) + " " + Строка(Когда), "Ошибка при выполнении записи файла лога " + ОписаниеОшибки());
	КонецПопытки
	
КонецПроцедуры 
//\\