
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения.	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
			
		Иначе
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ТранспортировочныеПартии")] = "ЗаполнитьПоТранспортировочнойПартии";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.алк_РеализацияПродукцииЭкспорт.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		РфпСервер.ОтразитьВыполнениеЗаказовЭтапыСерии(ДополнительныеСвойства, Движения, Отказ);
		
		// СерийныеНомера
		УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения на основании данных заполнения.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура.
	//
	Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
		
		Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			
			ОнЖе = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗаполнитьЗапасыПоДокументыОснования();
		
	КонецПроцедуры
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		Если ДанныеЗаполнения.Свойство("Заказ") Тогда
			Заказ = ДанныеЗаполнения.Заказ;	
		КонецЕсли; 
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	СтруктурнаяЕдиница = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		
	КонецПроцедуры
	
	// Обработчик заполнения документа на основании Транспортировочной партии.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоТранспортировочнойПартии(ДанныеЗаполнения, Операция = "") Экспорт
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//ЛогистическийЦентрПолучатель = ДанныеЗаполнения.ЛогистическийЦентрПолучатель;
		//СтруктурнаяЕдиницаПолучатель = ДанныеЗаполнения.СтруктурнаяЕдиницаПолучатель;
		Заказ                        = ДанныеЗаполнения.Заказ;
		ПоФактическимПогрузкам       = ДанныеЗаполнения.Факт;
		
		Покупатель                   = ДанныеЗаполнения.Покупатель;
		Продавец                     = ДанныеЗаполнения.Продавец;
		
		Если ПоФактическимПогрузкам Тогда
			
			ЗаполнитьСУчетомФактическихПогрузок(ДанныеЗаполнения);
			
		Иначе
			
			Для каждого стрЗапас Из ДанныеЗаполнения.Запасы Цикл
				
				НоваяСтрока = Запасы.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрЗапас);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	Процедура ЗаполнитьСУчетомФактическихПогрузок(ДанныеЗаполнения)
		
		НаборЗаписей = РегистрыСведений.алк_ИД_ГруппХарактеристик.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДанныеЗаполнения.Заказ);
		НаборЗаписей.Прочитать();
		ТаблицаИД = НаборЗаписей.Выгрузить();
		
		Для каждого стрЗапас Из ДанныеЗаполнения.Запасы Цикл
			
			Если стрЗапас.Исключен Тогда
				Продолжить;	
			КонецЕсли; 
			
			НоваяСтрока = Запасы.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, стрЗапас);
			
			ИД_Групп = ПолучитьИдентификаторыГрупп(ТаблицаИД, стрЗапас.Характеристика);
			НоваяСтрока.АГ_ИД = ИД_Групп.АГ;
			НоваяСтрока.ОГ_ИД = ИД_Групп.ОГ;
			
		КонецЦикла; 
		
		Запасы.Сортировать("Номенклатура, СерийныйНомер");
		
	КонецПроцедуры
	
	Процедура ЗаполнитьЗапасыПоДокументыОснования()
		
		Запасы.Очистить();
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ТранспортировочныеПартии") Тогда
			
			ЗаполнитьПоТранспортировочнойПартии(ДокументОснование);
			
		КонецЕсли
		
	КонецПроцедуры  //ЗаполнитьПартииПоДокументыОснования()
	
	Функция ПолучитьИдентификаторыГрупп(ТаблицаИсточник, Характеристика)
		
		СтруктураИД = Новый Структура("ОГ, АГ", 0, 0); 
		
		НайденнаяСтрока = ТаблицаИсточник.Найти(Характеристика, "Характеристика"); 
		
		Если НайденнаяСтрока <> Неопределено Тогда
			СтруктураИД.ОГ = НайденнаяСтрока.ОбъемнаяГруппаИД;
			СтруктураИД.АГ = НайденнаяСтрока.АссортиментнаяГруппаИД;
		КонецЕсли; 
		
		Возврат СтруктураИД;
		
	КонецФункции
	
	
	#КонецОбласти
	
#КонецЕсли


Процедура Конец()	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрет = Ложь;
	
	Для каждого стрЗапас Из Запасы Цикл
		
		Если стрЗапас.Сумма = 0 Тогда
			Запрет = Истина;
			Прервать;
		КонецЕсли; 	
		
	КонецЦикла; 
	
	Если Запрет Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не весь товар оценен! Проведение документа невозможно.";
		
		Попытка
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		Сообщение.Сообщить(); 	
	КонецЕсли; 
	
	Отказ = Запрет;
	
КонецПроцедуры





