

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();  
	
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("БуферУпаковки", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000064"));
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата()); 
	
	
	ПериодОтчета = НастройкиКомпоновки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));

	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", 	ПериодОтчета.Значение.ДатаНачала + 3600*8);
	НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", 	ПериодОтчета.Значение.ДатаОкончания + 3600*8);


	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиКомпоновки,ДанныеРасшифровки,,,Ложь);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
	
	УстановитьПривилегированныйРежим(Ложь);
	

КонецПроцедуры
   
	
	
	
