

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Подбор в документ " + Параметры.Документ;	
	
	СписокПодбора.Параметры.УстановитьЗначениеПараметра("Склад",  Параметры.Склад);
	СписокПодбора.Параметры.УстановитьЗначениеПараметра("Ячейка", Параметры.Ячейка);
	СписокПодбора.Параметры.УстановитьЗначениеПараметра("СписокКатегорий", Параметры.СписокКатегорий.ВыгрузитьЗначения());
	
	Если Параметры.Свойство("П1") Тогда
		Если Параметры.П1 = 2 Тогда
			СписокПодбора.ТекстЗапроса =
			"ВЫБРАТЬ
			|	алк_ПараметрыХарактеристик.Порода,
			|	алк_ПараметрыХарактеристик.Сорт,
			|	алк_ПараметрыХарактеристик.Длина,
			|	алк_ПараметрыХарактеристик.Сечение,
			|	алк_ПараметрыХарактеристик.Влажность,
			|	ЕСТЬNULL(алк_ЗапасыНаВнешнихСкладахСерииОстатки.КоличествоПакетовОстаток, 0) КАК КоличествоПакетов,
			|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер КАК Ссылка,
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер.Владелец КАК Владелец,
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер.Наименование КАК Наименование
			|ИЗ
			|	РегистрНакопления.алк_ЗапасыНаВнешнихСкладахСерии.Остатки(
			|			,
			|			СтруктурнаяЕдиница = &Склад
			|				И Ячейка = &Ячейка) КАК алк_ЗапасыНаВнешнихСкладахСерииОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
			|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
			|		ПО алк_ЗапасыНаВнешнихСкладахСерииОстатки.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
			|ГДЕ
			|	алк_ЗапасыНаВнешнихСкладахСерииОстатки.КоличествоПакетовОстаток > 0
			|	И алк_ЗапасыНаВнешнихСкладахСерииОстатки.Номенклатура.КатегорияНоменклатуры В(&СписокКатегорий)";
			
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодобранныеПакетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодбораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокПодбора.ТекущиеДанные;
	
	Если Истина Тогда
		
		СтандартнаяОбработка = Ложь;
		ДобавитьСтроку(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПиФ

&НаКлиенте
Процедура ДобавитьСтроку(ТекущиеДанные)
	
	ПараметрыОтбора = Новый Структура("СерийныйНомер", ТекущиеДанные.Ссылка);
	
	МассивСтрок = Объект.ПодобранныеПакеты.НайтиСтроки(ПараметрыОтбора);
	
	Если МассивСтрок.Количество() = 0 Тогда
		
		НовСтр = Объект.ПодобранныеПакеты.Добавить();
		НовСтр.СерийныйНомер = ТекущиеДанные.Ссылка;
		
		НовСтр.Номенклатура = ТекущиеДанные.Владелец;
		НовСтр.КоличествоПакетов = 1;
		
	КонецЕсли; 
	
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПересчитатьСумму");
	//
	//ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НовСтр, СтруктураДействий);
	//
	//Элементы.ПодобраннаяНоменклатура.ТекущаяСтрока = НовСтр.ПолучитьИдентификатор();
	
КонецПроцедуры // ДобавитьСтроку()

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()

	ТаблицаЗначений = Объект.ПодобранныеПакеты.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначений, УникальныйИдентификатор);	

КонецФункции // ПоместитьДанныеВоВременноеХранилище()


#КонецОбласти 


#Область ОбработчикаКоманд

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)

	АдресВХранилище = ПоместитьДанныеВоВременноеХранилище();
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("АдресПодобранныхДанныхВХранилище", АдресВХранилище);
	
	ОповеститьОВыборе(СтруктураОповещения);	
	
КонецПроцедуры

	
#КонецОбласти 


Процедура Конец()		
КонецПроцедуры






