#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.алк_УпаковкаНоменклатуры.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		РфпСервер.ОтразитьПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьДополнительныеПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
		//РфпСервер.ОтразитьВыпускПродукцииСерии(ДополнительныеСвойства, Движения, Отказ);
		Если Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
			РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);		
		КонецЕсли;

		// СерийныеНомера
		УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		//РфпСервер.ОтразитьПакетыИсторияЗаказов(ДополнительныеСвойства, Движения, Отказ);   
		
		
		ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата);
		
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда 
			РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
			
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		// Контроль
		ОтказПоДублям = КонтрольДублей(РежимПроведения, ДополнительныеСвойства);
		
		Отказ = ОтказПоДублям;  
		
		// Контроль остатков
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда
			Движения.алк_ОстаткиЗапасов.Записать(); 
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);  
		КонецЕсли;
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			
			ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
			
			Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
			
		КонецЕсли;   
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			//Соберем массив для контроля остатков  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|  алк_ОстаткиЗапасов.СерийныйНомер
			|ИЗ
			|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
			
			Запрос.УстановитьПараметр("Регистратор", Ссылка);  
			РезультатЗапроса = Запрос.Выполнить();  
			Выборка = РезультатЗапроса.Выгрузить();
			
			МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
			
			ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);
			
		КонецЕсли;
		
		
	КонецПроцедуры
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

	#КонецОбласти
	
	Функция КонтрольДублей(РежимПроведения, ДополнительныеСвойства)
		
		Возврат Ложь;
		
		//Отказ = Ложь;
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	алк_ПараметрыПакетов.СерийныйНомер,
		//|	СУММА(1) КАК Счетчик
		//|ПОМЕСТИТЬ втРезультат
		//|ИЗ
		//|	РегистрСведений.алк_ПараметрыПакетов КАК алк_ПараметрыПакетов
		//|ГДЕ
		//|	алк_ПараметрыПакетов.СерийныйНомер В(&СерийныйНомера)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	алк_ПараметрыПакетов.СерийныйНомер
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	втРезультат.СерийныйНомер,
		//|	втРезультат.Счетчик
		//|ИЗ
		//|	втРезультат КАК втРезультат
		//|ГДЕ
		//|	втРезультат.Счетчик > 1";
		//
		//Запрос.УстановитьПараметр("СерийныйНомера", ДополнительныеСвойства.ДляПроведения.Ссылка.СерийныеНомераПродукция.Выгрузить(, "СерийныйНомер"));
		//
		//РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
		//
		//Если Не РезультатЗапроса.Пустой() Тогда
		//	
		//	Отказ = Истина;
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Дублируются пакеты!";
		//	Сообщение.Сообщить(); 
		//	
		//КонецЕсли; 	
		//
		//Возврат Отказ;
		
	КонецФункции
	
	
#КонецЕсли


Процедура Конец()
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
		
	Для Каждого эл ИЗ Продукция Цикл 
		РегистрыСведений.алк_ДополнительныеПараметрыПакетов.УдалитьЗаписьВРегистре(ПолучитьСсылкуСН(эл.СерийныеНомера)[0].Ссылка,Ссылка);
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьСсылкуСН(Наименование)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СерийныеНомера.Ссылка
	               |ИЗ
	               |	Справочник.СерийныеНомера КАК СерийныеНомера
	               |ГДЕ
	               |	СерийныеНомера.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции



