
#Область Представление

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "Транспортировка " + Данные.ВидТранспортировки + " (" + Данные.ВидТранспорта+ ": " +Данные.ИдентификаторТС+") №"+ Данные.Номер +" от " + Формат(Данные.Дата, "ДЛФ=D");;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("ИдентификаторТС");
	Поля.Добавить("ВидТранспортировки");
	Поля.Добавить("ВидТранспорта");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти


#Область ИнтерфейсПечати

// Процедура формирования печатной формы М15
//
Процедура СформироватьМ15(ТабличныйДокумент, ТекущийДокумент)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_Тест");
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
	
КонецПроцедуры //СформироватьМ15()	

// Процедура формирования Железнодорожной спецификации для отходов
//
Процедура СформироватьЖДСпецификациюКарандаш(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК Пакет,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец),
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемП,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНеттоП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2 КАК ТолщинаП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3 КАК ШиринаП,
	|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000 КАК ДлинаП,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура.НаименованиеПолное КАК Сорт,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность КАК Грузоподъемность,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоП,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ КАК Диаметр,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Пломбы,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	|					ИЗ
	|						Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|					ГДЕ
	|						алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент)) КАК алк_ПараметрыПакетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем),
	|	СУММА(ОбъемП),
	|	СУММА(ВесНеттоП),
	|	СУММА(КоличествоПакетов),
	|	СУММА(ВесБруттоП)
	|ПО
	|	Ссылка,
	|	СтрокаСертификат";
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка.Выбрать();
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка,
	|	алк_ТранспортировкаЗапасовРеквизит.НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита, 0) КАК ВесРеквизита
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|ГДЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(ВесРеквизита)
	|ПО
	|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИтогРеквизит  = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИтогРеквизит.Следующий();
		
		ВесРеквизита = ВыборкаИтогРеквизит.ВесРеквизита/1000;
		
	Иначе
		
		ВесРеквизита = 0;
		
	КонецЕсли;
	
	//Номенклатура = "Карандаш";
	
	ТаблицаПороды = Новый ТаблицаЗначений;
	ТаблицаПороды.Колонки.Добавить("Порода");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаПороды.Добавить();
		НоваяСтрока.Порода = ВыборкаСтрокЗапасы.Порода;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаПороды.Свернуть("Порода");
	Породы = "";
	Для каждого стрПорода Из ТаблицаПороды Цикл
		Породы = Породы + ?(Породы = "", "", "; ") + стрПорода.Порода;	
	КонецЦикла; 
	
	ТаблицаСорта = Новый ТаблицаЗначений;
	ТаблицаСорта.Колонки.Добавить("Сорт");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаСорта.Добавить();
		НоваяСтрока.Сорт = ВыборкаСтрокЗапасы.Сорт;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаСорта.Свернуть("Сорт");
	Сорта = "";
	Для каждого стрСорт Из ТаблицаСорта Цикл
		Сорта = Сорта + ?(Сорта = "", "", "; ") + стрСорт.Сорт;	
	КонецЦикла; 
	
	Влажность = "60%";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияКарандаш");
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
	+ НомерДокумента
	+ " от "
	+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
	
	ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
	ОбластьМакета.Параметры.Номенклатура = Сорта; //Номенклатура;
	ОбластьМакета.Параметры.Породы       = Породы;
	//		ОбластьМакета.Параметры.Сорта        = Сорта;
	//		ОбластьМакета.Параметры.Влажность    = Влажность;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
	ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
	ОбластьМакета.Параметры.ВидТранспорта    = Шапка.ВидТранспортаПредставление;
	// ОбластьМакета.Параметры.Грузоподъемность = Шапка.Грузоподъемность;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.СтрокаИДКонтейнеров <> "" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Контейнеры");
		ОбластьМакета.Параметры.СтрокаИДКонтейнеров = Шапка.СтрокаИДКонтейнеров;
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	ОбластьМакета.Параметры.ВесГруза = Шапка.ВесБруттоП + ВесРеквизита;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	ВыборкаСертификат = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП"
	
	СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
	// 	- ТД_PEFC
	// 	- ТД_PEFCcont
	
	
	Пока ВыборкаСертификат.Следующий() Цикл
		
		ВыборкаСтрокЗапасы = ВыборкаСертификат.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		Пока ЕстьДанныеДляВывода Цикл
			
			ДанныеСтроки = ВыборкаСтрокЗапасы;
			ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ОбластьМакета.Параметры.Заполнить(ВыборкаСертификат);
		
		Если ВыборкаСертификат.Продавец = ТД Тогда
			
			Если СтрНайти(ВыборкаСертификат.СтрокаСертификат, "controlled") Тогда
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
			Иначе	
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFC") + ">:";
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСертификат.СтрокаСертификат) Тогда
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + ВыборкаСертификат.СтрокаСертификат + ">:";
			
		Иначе
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Не сертифицированная продукция:"
			
		КонецЕсли;  			
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаРеквизит = ВыборкаИтогРеквизит.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаРеквизит");		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРеквизит");
		Пока ВыборкаРеквизит.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаРеквизит);
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		КонецЦикла; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРеквизит");
		ОбластьМакета.Параметры.Заполнить(ВыборкаИтогРеквизит);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Пломбы");
	ОбластьМакета.Параметры.Пломбы  = Шапка.Пломбы;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры //СформироватьЖДСпецификациюКарандаш()	

// Процедура формирования Железнодорожной спецификации для отходов
//
Процедура СформироватьЖДСпецификациюКусковой(ТабличныйДокумент, ТекущийДокумент)
	
	ТЧ = ТекущийДокумент.Запасы;
	
	Если НЕ ТЧ.Количество() = 0 Тогда  
		Если НЕ ТЧ[0].Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000005") Тогда //Шпон кусковой   
			Сообщить("Ошибка! Данная печатная форма используется только для кускового шпона.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК Пакет,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец),
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемП,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНеттоП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2 КАК ТолщинаП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3 КАК ШиринаП,
	|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000 КАК ДлинаП,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ПараметрыХарактеристик.Порода,
	|	""Шпон кусковой"" КАК Сорт,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность КАК Грузоподъемность,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоП,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Пломбы,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	|					ИЗ
	|						Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|					ГДЕ
	|						алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент)) КАК алк_ПараметрыПакетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем),
	|	СУММА(ОбъемП),
	|	СУММА(ВесНеттоП),
	|	СУММА(КоличествоПакетов),
	|	СУММА(ВесБруттоП)
	|ПО
	|	Ссылка,
	|	СтрокаСертификат";
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка.Выбрать();
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка,
	|	алк_ТранспортировкаЗапасовРеквизит.НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита, 0) КАК ВесРеквизита
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|ГДЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(ВесРеквизита)
	|ПО
	|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИтогРеквизит  = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИтогРеквизит.Следующий();
		
		ВесРеквизита = ВыборкаИтогРеквизит.ВесРеквизита/1000;
		
	Иначе
		
		ВесРеквизита = 0;
		
	КонецЕсли;
	
	Номенклатура = "Шпон кусковой";
	
	ТаблицаПороды = Новый ТаблицаЗначений;
	ТаблицаПороды.Колонки.Добавить("Порода");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаПороды.Добавить();
		НоваяСтрока.Порода = ВыборкаСтрокЗапасы.Порода;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаПороды.Свернуть("Порода");
	Породы = "";
	Для каждого стрПорода Из ТаблицаПороды Цикл
		Породы = Породы + ?(Породы = "", "", "; ") + стрПорода.Порода;	
	КонецЦикла; 
	
	ТаблицаСорта = Новый ТаблицаЗначений;
	ТаблицаСорта.Колонки.Добавить("Сорт");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаСорта.Добавить();
		НоваяСтрока.Сорт = ВыборкаСтрокЗапасы.Сорт;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаСорта.Свернуть("Сорт");
	Сорта = "";
	Для каждого стрСорт Из ТаблицаСорта Цикл
		Сорта = Сорта + ?(Сорта = "", "", "; ") + стрСорт.Сорт;	
	КонецЦикла; 
	
	Влажность = "60%";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияКусковой");
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
	+ НомерДокумента
	+ " от "
	+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
	
	ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
	ОбластьМакета.Параметры.Номенклатура = Номенклатура;
	ОбластьМакета.Параметры.Породы       = Породы;
	//		ОбластьМакета.Параметры.Сорта        = Сорта;
	//		ОбластьМакета.Параметры.Влажность    = Влажность;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
	ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
	ОбластьМакета.Параметры.ВидТранспорта    = Шапка.ВидТранспортаПредставление;
	// ОбластьМакета.Параметры.Грузоподъемность = Шапка.Грузоподъемность;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.СтрокаИДКонтейнеров <> "" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Контейнеры");
		ОбластьМакета.Параметры.СтрокаИДКонтейнеров = Шапка.СтрокаИДКонтейнеров;
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	ОбластьМакета.Параметры.ВесГруза = Шапка.ВесБруттоП + ВесРеквизита;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	ВыборкаСертификат = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП"
	
	СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
	// 	- ТД_PEFC
	// 	- ТД_PEFCcont
	
	
	Пока ВыборкаСертификат.Следующий() Цикл
		
		ВыборкаСтрокЗапасы = ВыборкаСертификат.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		Пока ЕстьДанныеДляВывода Цикл
			
			ДанныеСтроки = ВыборкаСтрокЗапасы;
			ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ОбластьМакета.Параметры.Заполнить(ВыборкаСертификат);
		
		Если ВыборкаСертификат.Продавец = ТД Тогда
			
			Если СтрНайти(ВыборкаСертификат.СтрокаСертификат, "controlled") Тогда
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
			Иначе	
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFC") + ">:";
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСертификат.СтрокаСертификат) Тогда
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + ВыборкаСертификат.СтрокаСертификат + ">:";
			
		Иначе
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Не сертифицированная продукция:"
			
		КонецЕсли; 
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаРеквизит = ВыборкаИтогРеквизит.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаРеквизит");		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРеквизит");
		Пока ВыборкаРеквизит.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаРеквизит);
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		КонецЦикла; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРеквизит");
		ОбластьМакета.Параметры.Заполнить(ВыборкаИтогРеквизит);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Пломбы");
	ОбластьМакета.Параметры.Пломбы  = Шапка.Пломбы;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
КонецПроцедуры //СформироватьЖДСпецификациюКусковой()	

// Процедура формирования Железнодорожной спецификации для пиломатериалов
//
Процедура СформироватьЖДСпецификациюПМ_1(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", 		ТекущийДокумент);  
	
	Запрос.Текст =    
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК Пакет,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец),
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемП,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНеттоП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2 КАК ТолщинаП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3 КАК ШиринаП,
	|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000 КАК ДлинаП,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ПараметрыХарактеристик.Порода,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность КАК Грузоподъемность,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	|	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня, 0) КАК ВесБруттоП,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Пломбы,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	|					ИЗ
	|						Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|					ГДЕ
	|						алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент)) КАК алк_ПараметрыПакетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем),
	|	СУММА(ОбъемП),
	|	СУММА(ВесНеттоП),
	|	СУММА(КоличествоПакетов),
	|	СУММА(ВесБруттоП)
	|ПО
	|	Ссылка,
	|	СтрокаСертификат";
	
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка.Выбрать();
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка,
	|	алк_ТранспортировкаЗапасовРеквизит.НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита, 0) КАК ВесРеквизита
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|ГДЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(ВесРеквизита)
	|ПО
	|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИтогРеквизит  = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИтогРеквизит.Следующий();
		
		ВесРеквизита = ВыборкаИтогРеквизит.ВесРеквизита/1000;
		
	Иначе
		
		ВесРеквизита = 0;
		
	КонецЕсли;
	
	Номенклатура = "Пиломатериалы";
	
	ТаблицаПороды = Новый ТаблицаЗначений;
	ТаблицаПороды.Колонки.Добавить("Порода");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаПороды.Добавить();
		НоваяСтрока.Порода = ВыборкаСтрокЗапасы.Порода;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаПороды.Свернуть("Порода");
	Породы = "";
	Для каждого стрПорода Из ТаблицаПороды Цикл
		Породы = Породы + ?(Породы = "", "", "; ") + стрПорода.Порода;	
	КонецЦикла; 
	
	ТаблицаСорта = Новый ТаблицаЗначений;
	ТаблицаСорта.Колонки.Добавить("Сорт");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаСорта.Добавить();
		НоваяСтрока.Сорт = ВыборкаСтрокЗапасы.Сорт;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаСорта.Свернуть("Сорт");
	Сорта = "";
	Для каждого стрСорт Из ТаблицаСорта Цикл
		Сорта = Сорта + ?(Сорта = "", "", "; ") + стрСорт.Сорт;	
	КонецЦикла; 
	
	Влажность = "60%";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияПМ1");
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
	+ НомерДокумента
	+ " от "
	+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
	
	ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
	ОбластьМакета.Параметры.Номенклатура = Номенклатура;
	ОбластьМакета.Параметры.Породы       = Породы;
	ОбластьМакета.Параметры.Сорта        = Сорта;
	//		ОбластьМакета.Параметры.Влажность    = Влажность;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
	ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
	ОбластьМакета.Параметры.ВидТранспорта    = Шапка.ВидТранспортаПредставление;
	// ОбластьМакета.Параметры.Грузоподъемность = Шапка.Грузоподъемность;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.СтрокаИДКонтейнеров <> "" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Контейнеры");
		ОбластьМакета.Параметры.СтрокаИДКонтейнеров = Шапка.СтрокаИДКонтейнеров;
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	ОбластьМакета.Параметры.ВесГруза = ?(Шапка.ВесБруттоП=NULL, 0, Шапка.ВесБруттоП) + ВесРеквизита;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	ВыборкаСертификат = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП"
	
	СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
	// 	- ТД_PEFC
	// 	- ТД_PEFCcont
	
	Пока ВыборкаСертификат.Следующий() Цикл
		
		ВыборкаСтрокЗапасы = ВыборкаСертификат.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		Пока ЕстьДанныеДляВывода Цикл
			
			ДанныеСтроки = ВыборкаСтрокЗапасы;
			ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ОбластьМакета.Параметры.Заполнить(ВыборкаСертификат);
		
		Если ВыборкаСертификат.Продавец = ТД Тогда
			
			Если СтрНайти(ВыборкаСертификат.СтрокаСертификат, "controlled") Тогда
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
			Иначе	
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFC") + ">:";
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСертификат.СтрокаСертификат) Тогда
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + ВыборкаСертификат.СтрокаСертификат + ">:";
			
		Иначе
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Не сертифицированная продукция:"
			
		КонецЕсли; 
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаРеквизит = ВыборкаИтогРеквизит.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаРеквизит");		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРеквизит");
		Пока ВыборкаРеквизит.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаРеквизит);
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		КонецЦикла; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРеквизит");
		ОбластьМакета.Параметры.Заполнить(ВыборкаИтогРеквизит);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Пломбы");
	ОбластьМакета.Параметры.Пломбы  = Шапка.Пломбы;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры //СформироватьЖДСпецификациюПМ()	


// Процедура формирования Железнодорожной спецификации для пиломатериалов
//
Процедура СформироватьЖДСпецификациюПМ(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент",	ТекущийДокумент);    
	Запрос.УстановитьПараметр("Заказ",				ТекущийДокумент.Заказ);  
	Запрос.УстановитьПараметр("ДатаСреза", 			ТекущийДокумент.Дата);  
	
	Запрос.Текст = ТекстЗапросаЖД_ПМ();
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ОбщийВесБрутто = 0;
	
	Для каждого Стр Из ТЗ Цикл  		
		Если ЗначениеЗаполнено(Стр.Пакет) Тогда              				
			ОбщийВесБрутто = ОбщийВесБрутто + Стр.ВесБруттоП;			
		КонецЕсли;              		
	КонецЦикла;                 		
	
	ТЗ.Очистить();
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка.Выбрать();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка,
	|	алк_ТранспортировкаЗапасовРеквизит.НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита, 0) КАК ВесРеквизита
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|ГДЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(ВесРеквизита)
	|ПО
	|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИтогРеквизит  = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИтогРеквизит.Следующий();
		
		ВесРеквизита = ВыборкаИтогРеквизит.ВесРеквизита/1000;
		
	Иначе
		
		ВесРеквизита = 0;
		
	КонецЕсли;
	
	Номенклатура = "Пиломатериалы";
	
	ТаблицаПороды = Новый ТаблицаЗначений;
	ТаблицаПороды.Колонки.Добавить("Порода");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаПороды.Добавить();
		НоваяСтрока.Порода = ВыборкаСтрокЗапасы.Порода;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаПороды.Свернуть("Порода");
	Породы = "";
	Для каждого стрПорода Из ТаблицаПороды Цикл
		Породы = Породы + ?(Породы = "", "", "; ") + стрПорода.Порода;	
	КонецЦикла; 
	
	ТаблицаСорта = Новый ТаблицаЗначений;
	ТаблицаСорта.Колонки.Добавить("Сорт");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаСорта.Добавить();
		НоваяСтрока.Сорт = ВыборкаСтрокЗапасы.Сорт;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаСорта.Свернуть("Сорт");
	Сорта = "";
	Для каждого стрСорт Из ТаблицаСорта Цикл
		Сорта = Сорта + ?(Сорта = "", "", "; ") + стрСорт.Сорт;	
	КонецЦикла; 
	
	Влажность = "60%";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияПМ1");
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
	+ НомерДокумента
	+ " от "
	+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
	
	ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
	ОбластьМакета.Параметры.Номенклатура = Номенклатура;
	ОбластьМакета.Параметры.Породы       = Породы;
	ОбластьМакета.Параметры.Сорта        = Сорта;
	//ОбластьМакета.Параметры.Влажность    = Влажность;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
	ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
	ОбластьМакета.Параметры.ВидТранспорта    = Шапка.ВидТранспортаПредставление;
	// ОбластьМакета.Параметры.Грузоподъемность = Шапка.Грузоподъемность;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.СтрокаИДКонтейнеров <> "" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Контейнеры");
		ОбластьМакета.Параметры.СтрокаИДКонтейнеров = Шапка.СтрокаИДКонтейнеров;
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЕсли; 
	
	Если Шапка.ВесКонтейнера <> 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ВесКонтейнера");
		ОбластьМакета.Параметры.ВесКонтейнера = Шапка.ВесКонтейнера;
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	ОбластьМакета.Параметры.ВесГруза = ?(Шапка.БруттоПорт = 0, ОбщийВесБрутто + ВесРеквизита, Шапка.БруттоПорт + ВесРеквизита); 			
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	ВыборкаСертификат = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КоличествоГруппСертификатов = ВыборкаСертификат.Количество();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ИтогиВесНетто = 0;
	ИтогиВесБрутто = 0;
	
	й = 0;
	КоличествоПакетов = 0;
	
	Пока ВыборкаСертификат.Следующий() Цикл
		
		й = й + 1;
		
		ВыборкаСтрокЗапасы = ВыборкаСертификат.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
		
		БруттоПорт = 0;
		ИтогиВесНеттоСертификат = 0;
		ИтогиВесБруттоСертификат = 0;
		
		Пока ВыборкаСтрокЗапасы.Следующий() Цикл 	
			
			НоваяСтр = ТЗ.Добавить();    				
			ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаСтрокЗапасы); 
			
			БруттоПорт = ВыборкаСтрокЗапасы.БруттоПорт;
			
		КонецЦикла;
		
		Если БруттоПорт > 0 Тогда  			
			
			ОбщийВесБрутто1 = ТЗ.Итог("ВесБруттоП"); // только по этому сертификату, для исправления округлений 			
			ОбщийВесБрутто2 = 0;                     // итоговый по сертификату после пересчета
			
			Для каждого Стр Из ТЗ Цикл
				
				Стр.ВесБруттоП = ?(ОбщийВесБрутто = 0 Или Стр.БруттоПорт = 0, Стр.ВесБруттоП, Стр.БруттоПорт * Стр.ВесБруттоП/ОбщийВесБрутто);
				Стр.ВесБруттоП = Окр(Стр.ВесБруттоП, 3);
				ОбщийВесБрутто2 = ОбщийВесБрутто2 + Стр.ВесБруттоП;	
				
			КонецЦикла; 
			
			ВесПортПоСертификату =  Окр(?(ОбщийВесБрутто = 0, 0, БруттоПорт * ОбщийВесБрутто1/ОбщийВесБрутто),3);
			
			Дельта = ВесПортПоСертификату - ОбщийВесБрутто2;
			
			Для каждого Стр Из ТЗ Цикл 				
				
				Если Дельта > 0 Тогда
					
					Стр.ВесБруттоП = Стр.ВесБруттоП + 0.001;
					Дельта = Дельта - 0.001;
					
				ИначеЕсли Дельта < 0 Тогда	
					
					Стр.ВесБруттоП = Стр.ВесБруттоП - 0.001;
					Дельта = Дельта + 0.001;
					
				КонецЕсли;
				
				Стр.ВесНеттоП = Стр.ВесБруттоП - 0.01;
				
			КонецЦикла;				
			
		КонецЕсли; 
		
		ИтогиВесНеттоСертификат = ТЗ.Итог("ВесНеттоП");
		ИтогиВесБруттоСертификат = ТЗ.Итог("ВесБруттоП");
		
		ИтогиВесНетто = ИтогиВесНетто + ИтогиВесНеттоСертификат;
		ИтогиВесБрутто = ИтогиВесБрутто + ИтогиВесБруттоСертификат;
		
		Если й = КоличествоГруппСертификатов И ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту > 0 Тогда      // для исправления ошибки округления при разбиении по сертификатам
			
			Дельта = ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту - ИтогиВесБрутто;     
			
			Для каждого Стр Из ТЗ Цикл 				
				
				Если Дельта > 0 Тогда
					
					Стр.ВесБруттоП = Стр.ВесБруттоП + 0.001;
					Дельта = Дельта - 0.001;
					
				ИначеЕсли Дельта < 0 Тогда	
					
					Стр.ВесБруттоП = Стр.ВесБруттоП - 0.001;
					Дельта = Дельта + 0.001;
					
				КонецЕсли;
				
				Стр.ВесНеттоП = Стр.ВесБруттоП - 0.01;
				
			КонецЦикла;	
			
			ИтогиВесНеттоСертификат = ТЗ.Итог("ВесНеттоП");
			ИтогиВесБруттоСертификат = ТЗ.Итог("ВесБруттоП");
			
		КонецЕсли; 
		
		Для каждого Стр Из ТЗ Цикл 	
			
			ОбластьМакета.Параметры.Заполнить(Стр);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			КоличествоПакетов = КоличествоПакетов + 1;
			
		КонецЦикла;  		
		
		ТЗ.Очистить();
		
		ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП"
		
		СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
		// 	- ТД_PEFC
		// 	- ТД_PEFCcont
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ОбластьМакета.Параметры.Заполнить(ВыборкаСертификат);
		
		Если ВыборкаСертификат.Продавец = ТД Тогда
			
			Если СтрНайти(ВыборкаСертификат.СтрокаСертификат, "controlled") Тогда
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
			Иначе	
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFC") + ">:";
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСертификат.СтрокаСертификат) Тогда
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + ВыборкаСертификат.СтрокаСертификат + ">:";
			
		Иначе
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Не сертифицированная продукция:"
			
		КонецЕсли; 
		
		ОбластьМакета.Параметры.ВесНеттоП = ИтогиВесНеттоСертификат;
		ОбластьМакета.Параметры.ВесБруттоП = ИтогиВесБруттоСертификат;
		ТабличныйДокумент.Вывести(ОбластьМакета);    			
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ВесНеттоП = ?(ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту = 0, ИтогиВесНетто,ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту - 0.01 * КоличествоПакетов);
	ОбластьМакета.Параметры.ВесБруттоП = ?(ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту = 0, ИтогиВесБрутто,ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту); 
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// вывести реквизит
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаРеквизит = ВыборкаИтогРеквизит.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаРеквизит");		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРеквизит");
		Пока ВыборкаРеквизит.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаРеквизит);
			ТабличныйДокумент.Вывести(ОбластьМакета);		
			
		КонецЦикла; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРеквизит");
		ОбластьМакета.Параметры.Заполнить(ВыборкаИтогРеквизит);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Пломбы");
	ОбластьМакета.Параметры.Пломбы  = Шапка.Пломбы;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);		
	
КонецПроцедуры //СформироватьЖДСпецификациюПМ()	

// Процедура формирования Сертификата VGM
Процедура СформироватьСертификатVGM(ТабличныйДокумент, ТекущийДокумент)
	
	Макет = ПолучитьМакет("СертификатVGM");
	ОбластьПечФормы = Макет.ПолучитьОбласть("Сертификат");
	ВесРеквизита = 0;
	Для Каждого Строка из ТекущийДокумент.Реквизит цикл
		ВесРеквизита = ВесРеквизита + Строка.ВесРеквизита;
	КонецЦикла;
	
	ВесБруттоРасчитанный  = (ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту + ТекущийДокумент.ВесКонтейнера)*1000 + ВесРеквизита;
	
	ОбластьПечФормы.Параметры.НомерСертификат = ТекущийДокумент.СтрокаИДКонтейнеров;
	ОбластьПечФормы.Параметры.ДатаВзвешивания = Формат(ТекущийДокумент.ПриемкаВПортуДата,"ДЛФ=Д");
	ОбластьПечФормы.Параметры.НомерКонтейнера = ТекущийДокумент.СтрокаИДКонтейнеров;;
	ОбластьПечФормы.Параметры.Ответственный   = ТекущийДокумент.Ответственный;
	ОбластьПечФормы.Параметры.МассаБрутто     = ВесБруттоРасчитанный;
	
	ТабличныйДокумент.Вывести(ОбластьПечФормы);
	
КонецПроцедуры  

// Процедура формирования Рапорт сушки 
Процедура СформироватьРапортСушки(ТабличныйДокумент, ТекущийДокумент)	
	
	ДокЗагрузкиВСушку = ПодобратьЗагрузкуВСушку(ТекущийДокумент);
	
	Если ДокЗагрузкиВСушку = "" Тогда	
		Сообщить("Не удалось подобрать рапорт сушки!");
		Возврат;
	КонецЕсли;
	
	Документы.алк_ЗагрузкаВКамеру.Сформировать_РапортПоЗагрузкеВСушильнуюКамеру(ТабличныйДокумент, ДокЗагрузкиВСушку)
	
КонецПроцедуры  


Функция ПодобратьЗагрузкуВСушку(ТекущийДокумент)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ ВТ_Пакеты
		|ИЗ
		|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
		|ГДЕ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	МИНИМУМ(алк_ОстаткиЗапасовОбороты.ПериодСекунда) КАК ПериодСекунда,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК СечениеШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК СечениеТолщинаММ,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода
		|ПОМЕСТИТЬ ВТ_ПериодПакетов
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			,
		|			,
		|			Авто,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВТ_Пакеты.СерийныйНомер КАК СерийныйНомер
		|				ИЗ
		|					ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Порода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПериодПакетов.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ПериодПакетов.ПериодСекунда КАК ПериодСекунда,
		|	ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТ_ПериодПакетов.ПериодСекунда, ДЕНЬ), ВТ_ПериодПакетов.ПериодСекунда, СЕКУНДА)) КАК ВремяСмены,
		|	ВТ_ПериодПакетов.Характеристика КАК Характеристика,
		|	ВТ_ПериодПакетов.ДлинаДлинаММ КАК ДлинаДлинаММ,
		|	ВТ_ПериодПакетов.СечениеШиринаММ КАК СечениеШиринаММ,
		|	ВТ_ПериодПакетов.СечениеТолщинаММ КАК СечениеТолщинаММ,
		|	ВТ_ПериодПакетов.Порода КАК Порода
		|ПОМЕСТИТЬ ВТПакетыВремяСмены
		|ИЗ
		|	ВТ_ПериодПакетов КАК ВТ_ПериодПакетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПакетыВремяСмены.СерийныйНомер КАК СерийныйНомер,
		|	ВТПакетыВремяСмены.ПериодСекунда КАК ПериодСекунда,
		|	ВТПакетыВремяСмены.ВремяСмены КАК ВремяСмены,
		|	алк_Смены.Ссылка КАК Смена,
		|	алк_Смены.Код КАК СменаКод,
		|	ВТПакетыВремяСмены.Характеристика КАК Характеристика,
		|	ВТПакетыВремяСмены.ДлинаДлинаММ КАК ДлинаДлинаММ,
		|	ВТПакетыВремяСмены.СечениеШиринаММ КАК СечениеШиринаММ,
		|	ВТПакетыВремяСмены.СечениеТолщинаММ КАК СечениеТолщинаММ,
		|	ВТПакетыВремяСмены.Порода КАК Порода
		|ПОМЕСТИТЬ ВТ_ПакетыСмена
		|ИЗ
		|	ВТПакетыВремяСмены КАК ВТПакетыВремяСмены
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_Смены КАК алк_Смены
		|		ПО (ВТПакетыВремяСмены.ВремяСмены МЕЖДУ алк_Смены.НачалоСмены И алк_Смены.КонецСмены
		|					И алк_Смены.Код = ""000000001""
		|				ИЛИ ВТПакетыВремяСмены.ВремяСмены МЕЖДУ алк_Смены.НачалоСмены И ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)
		|					И алк_Смены.Код = ""000000002""
		|				ИЛИ ВТПакетыВремяСмены.ВремяСмены МЕЖДУ ДАТАВРЕМЯ(1, 1, 1) И алк_Смены.КонецСмены
		|					И алк_Смены.Код = ""000000002"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПакетыСмена.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ПакетыСмена.ПериодСекунда КАК ПериодСекунда,
		|	ВТ_ПакетыСмена.ВремяСмены КАК ВремяСмены,
		|	ВТ_ПакетыСмена.Смена КАК Смена,
		|	ВЫБОР
		|		КОГДА ВТ_ПакетыСмена.СменаКод = ""000000001""
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТ_ПакетыСмена.ПериодСекунда, ДЕНЬ)
		|		КОГДА ВТ_ПакетыСмена.СменаКод = ""000000002""
		|				И ВТ_ПакетыСмена.ВремяСмены < ДАТАВРЕМЯ(1, 1, 1, 8, 0, 0)
		|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТ_ПакетыСмена.ПериодСекунда, ДЕНЬ), ДЕНЬ, -1)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВТ_ПакетыСмена.ПериодСекунда, ДЕНЬ)
		|	КОНЕЦ КАК ДатаСмены,
		|	ВТ_ПакетыСмена.ДлинаДлинаММ КАК ДлинаДлинаММ,
		|	ВТ_ПакетыСмена.СечениеШиринаММ КАК СечениеШиринаММ,
		|	ВТ_ПакетыСмена.СечениеТолщинаММ КАК СечениеТолщинаММ,
		|	ВТ_ПакетыСмена.Порода КАК Порода
		|ПОМЕСТИТЬ ВТ_ПакетыУпаковка
		|ИЗ
		|	ВТ_ПакетыСмена КАК ВТ_ПакетыСмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_ПакетыУпаковка.ДлинаДлинаММ) КАК ДлинаДлинаММ,
		|	МИНИМУМ(ВТ_ПакетыУпаковка.ДлинаДлинаММ) КАК ДлинаМинимальная
		|ПОМЕСТИТЬ ВТ_МаксимальнаяДлина
		|ИЗ
		|	ВТ_ПакетыУпаковка КАК ВТ_ПакетыУпаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Длины.ДлинаММ КАК ДлинаММ
		|ПОМЕСТИТЬ ВТ_СписокДлин
		|ИЗ
		|	ВТ_МаксимальнаяДлина КАК ВТ_МаксимальнаяДлина
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Длины КАК Длины
		|		ПО (Длины.ДлинаММ >= ВТ_МаксимальнаяДлина.ДлинаМинимальная)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ПакетыУпаковка.ДатаСмены КАК ДатаСмены,
		|	ВТ_ПакетыУпаковка.СечениеШиринаММ КАК СечениеШиринаММ,
		|	ВТ_ПакетыУпаковка.СечениеТолщинаММ КАК СечениеТолщинаММ,
		|	ВТ_ПакетыУпаковка.Порода КАК Порода,
		|	СУММА(1) КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ_УсловияВыбораЗагрузки
		|ИЗ
		|	ВТ_ПакетыУпаковка КАК ВТ_ПакетыУпаковка,
		|	ВТ_МаксимальнаяДлина КАК ВТ_МаксимальнаяДлина
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПакетыУпаковка.Порода,
		|	ВТ_ПакетыУпаковка.СечениеШиринаММ,
		|	ВТ_ПакетыУпаковка.СечениеТолщинаММ,
		|	ВТ_ПакетыУпаковка.ДатаСмены
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоПакетов УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеПроизводственногоКалендаря.Дата КАК Период
		|ПОМЕСТИТЬ ВТ_ДатыСмен
		|ИЗ
		|	ВТ_УсловияВыбораЗагрузки КАК ВТ_УсловияВыбораЗагрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|		ПО (ДанныеПроизводственногоКалендаря.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(ВТ_УсловияВыбораЗагрузки.ДатаСмены, ДЕНЬ, -30) И ВТ_УсловияВыбораЗагрузки.ДатаСмены)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_ПодходящиеХарактетристики
		|ИЗ
		|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|ГДЕ
		|	алк_ПараметрыХарактеристик.Характеристика.Владелец.Код = ""ПБ-00000012""
		|	И (алк_ПараметрыХарактеристик.Порода, алк_ПараметрыХарактеристик.Сечение.ШиринаММ, алк_ПараметрыХарактеристик.Сечение.ТолщинаММ) В
		|			(ВЫБРАТЬ
		|				ВТ_УсловияВыбораЗагрузки.Порода КАК Порода,
		|				ВТ_УсловияВыбораЗагрузки.СечениеШиринаММ КАК СечениеШиринаММ,
		|				ВТ_УсловияВыбораЗагрузки.СечениеТолщинаММ КАК СечениеТолщинаММ
		|			ИЗ
		|				ВТ_УсловияВыбораЗагрузки КАК ВТ_УсловияВыбораЗагрузки)
		|	И алк_ПараметрыХарактеристик.Длина.ДлинаММ В
		|			(ВЫБРАТЬ
		|				ВТ_СписокДлин.ДлинаММ КАК ДлинаММ
		|			ИЗ
		|				ВТ_СписокДлин КАК ВТ_СписокДлин)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамеры.Номенклатура КАК алк_ВыгрузкаИзКамерыНоменклатура
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.ДатаСмены В
		|			(ВЫБРАТЬ
		|				ВТ_ДатыСмен.Период КАК Период
		|			ИЗ
		|				ВТ_ДатыСмен КАК ВТ_ДатыСмен)
		|	И алк_ВыгрузкаИзКамерыНоменклатура.Характеристика В
		|			(ВЫБРАТЬ
		|				ВТ_ПодходящиеХарактетристики.Характеристика КАК Характеристика
		|			ИЗ
		|				ВТ_ПодходящиеХарактетристики КАК ВТ_ПодходящиеХарактетристики)
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.ДатаСмены УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	ДокументОснование = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОснование = ВыборкаДетальныеЗаписи.ДокументОснование;
	КонецЦикла;
	
	Возврат ДокументОснование;

КонецФункции // ПодобратьЗагрузкуВСушку()



 // Процедура формирования Сформировать_ЖД_Пиловочник
Процедура Сформировать_ЖД_Пиловочник(ТабличныйДокумент, ТекущийДокумент)

	Макет = ПолучитьМакет("ПФ_ЖД_Пиловочник");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер КАК Номер,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Дата,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец КАК Продавец,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель КАК Покупатель,
		|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
		|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
		|	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
		|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
		|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС КАК Вагон
		|ИЗ
		|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
		|ГДЕ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(Покупатель),
		|	МАКСИМУМ(НомерСтроки),
		|	СУММА(Количество),
		|	СУММА(Объем),
		|	МАКСИМУМ(Вагон)
		|ПО
		|	Номер";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Шапка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Шапка.Следующий() Цикл
		// Вставить обработку выборки Шапка   
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");  //Расходная накладная № 4433 от 28 июня 2023 г.
		ОбластьМакета.Параметры.ТекстЗаголовка = "Расходная накладная № " 
				+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Истина) + " от " + Формат(Шапка.Дата, "ДЛФ=DD");
				
		ОбластьМакета.Параметры.Вагон = Шапка.Вагон; 
		
		ТабличныйДокумент.Вывести(ОбластьМакета);   	
			
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик"); 
		СведенияОПоставщике	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Продавец, Шапка.Дата,,);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,ЮридическийАдрес");		
		ТабличныйДокумент.Вывести(ОбластьМакета); 

		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель"); 
		СведенияОПокупателе	= УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(Шапка.Покупатель, Шапка.Дата,,);		  
		ОбластьМакета.Параметры.ПредставлениеПолучателя = УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,ЮридическийАдрес");		
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
        ТабличныйДокумент.Вывести(ОбластьМакета); 
        
		ВыборкаДетальныеЗаписи = Шапка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи   
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалТаблицы");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);  
		
		ОбластьМакета = Макет.ПолучитьОбласть("ОбъемПрописью");
		ОбластьМакета.Параметры.Заполнить(Шапка);  
		ОбластьМакета.Параметры.КоличествоСтрокой = ЧислоПрописью(Шапка.Количество,,",,,,,,,,0");
		ОбластьМакета.Параметры.ОбъемСтрокой = ЧислоПрописью(Шапка.Объем ,"ДП = Ложь", "целая,целых,целых,ж,тысячная,тысячных,тысячных,ж,3");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодписьАктаПередачи"); 
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подписи"); 
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
	КонецЦикла; 
		
КонецПроцедуры

// Процедура формирования Железнодорожной спецификации для пиломатериалов
//
Процедура СформироватьЖДСпецификациюПМ_Англ(ТабличныйДокумент, ТекущийДокумент,СертифДЭЛ = Ложь,МакетШпонКитай = Ложь,Подпись = " Barbin A. A.")
	
	Если ТекущийДокумент.Запасы.Количество() = 0 Тогда
		Сообщить("Невозможно сформировать печатную форму, так как табличная часть пустая!");
		Возврат;
	Иначе
		НоменклатураДокумента = ТекущийДокумент.Запасы[0].Номенклатура;
	КонецЕсли;

	Если ТекущийДокумент.Участок <> УстановитьУчастокШпон() И МакетШпонКитай Тогда 
		Сообщить("Данная печатная форма предназначена только для шпона (Китай)!"); 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);      
	
	Если НЕ НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
		|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК Пакет,
		|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс КАК Префикс,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец),
		|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
		|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
		|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемП,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНеттоП,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2 КАК ТолщинаП,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3 КАК ШиринаП,
		|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000 КАК ДлинаП,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер) КАК КоличествоПакетов,
		|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность КАК Грузоподъемность,
		|	алк_ТранспортировкаЗапасовЗапасы.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) КАК СортСсылка,
		|	алк_ПараметрыХарактеристик.Сорт.НаименовАнгл КАК СортА,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Характеристика) КАК Характеристика,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБруттоП,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ЛогистическийЦентрПолучатель.НаименованиеАнгл КАК ЛогистическийЦентрПолучатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
		|	алк_ПараметрыХарактеристик.Влажность,
		|	NULL КАК ВесНеттоР,
		|	NULL КАК ВесБруттоР,
		|	NULL КАК ПородаНаименованиеАнгл
		|ИЗ
		|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ТранспортировкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
		|	И НЕ алк_ТранспортировкаЗапасовЗапасы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Шпон)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
		|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
		|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс,
		|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав,
		|	алк_ТранспортировкаЗапасовЗапасы.Объем,
		|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
		|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель,
		|	алк_ПараметрыХарактеристик.Сорт.НаименовАнгл,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ЛогистическийЦентрПолучатель.НаименованиеАнгл,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
		|	алк_ПараметрыХарактеристик.Влажность,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000,
		|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)),
		|	алк_ТранспортировкаЗапасовЗапасы.Сертификат.ПредставлениеНаПечать,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Характеристика)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
		|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
		|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец),
		|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав,
		|	алк_ТранспортировкаЗапасовЗапасы.Объем,
		|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3,
		|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер),
		|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт),
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность,
		|	алк_ТранспортировкаЗапасовЗапасы.Сертификат.ПредставлениеНаПечать,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)),
		|	алк_ПараметрыХарактеристик.Сорт.НаименовАнгл,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Характеристика),
		|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ЛогистическийЦентрПолучатель.НаименованиеАнгл,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
		|	алк_ПараметрыХарактеристик.Влажность,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл
		|ИЗ
		|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ТранспортировкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
		|	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Шпон)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ТранспортировкаЗапасовЗапасы.Сертификат.ПредставлениеНаПечать,
		|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)),
		|	алк_ПараметрыХарактеристик.Сорт.НаименовАнгл,
		|	алк_ПараметрыХарактеристик.Влажность,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата,
		|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
		|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс,
		|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав,
		|	алк_ТранспортировкаЗапасовЗапасы.Объем,
		|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3,
		|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ЛогистическийЦентрПолучатель.НаименованиеАнгл,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт,
		|	алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт),
		|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Характеристика)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Объем),
		|	СУММА(ОбъемП),
		|	СУММА(ВесНеттоП),
		|	СУММА(КоличествоПакетов),
		|	СУММА(ВесБруттоП),
		|	СУММА(ВесНеттоР),
		|	СУММА(ВесБруттоР)
		|ПО
		|	Ссылка,
		|	СтрокаСертификат"; 
		
	Иначе
		Запрос.Текст = ПолучитьТекстЗапросаШапкиСпецификацииЖДКарандаши(); 
	КонецЕсли;
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Шапка.Следующий(); 
	
	Если НЕ НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
		
		ВыборкаСтрокЗапасы = Шапка.Выбрать();
		
	Иначе
		Запрос.Текст = ПолучитьТекстЗапросСпецификацияЖДКарандаши();  
		
		ВыборкаСтрокЗапасыКарандаш = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		ВыборкаСтрокЗапасыКарандаш.Следующий();
		
		ВыборкаСтрокЗапасы = ВыборкаСтрокЗапасыКарандаш.Выбрать();
	КонецЕсли;
	
	
	//Если НЕ ТекущийДокумент.Запасы[0].Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ТранспортировкаЗапасовРеквизит.Ссылка,
		|	алк_ТранспортировкаЗапасовРеквизит.НомерСтроки,
		|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
		|	ЕСТЬNULL(алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита, 0) КАК ВесРеквизита
		|ИЗ
		|	Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
		|ГДЕ
		|	алк_ТранспортировкаЗапасовРеквизит.Ссылка = &ТекущийДокумент
		|ИТОГИ
		|	СУММА(ВесРеквизита)
		|ПО
		|	ОБЩИЕ"; 
		
	//Иначе
	//	Запрос.Текст = ПолучитьТекстЗапросаШапкиСпецификацииЖДКарандаши();
	//КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИтогРеквизит  = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИтогРеквизит.Следующий();
		
		ВесРеквизита = ВыборкаИтогРеквизит.ВесРеквизита/1000;
		
	Иначе
		
		ВесРеквизита = 0;
		
	КонецЕсли;
	
	Номенклатура = "";
	
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоменклатураДокумента = ВыборкаСтрокЗапасы.Номенклатура;
		Если ТипЗнч(НоменклатураДокумента) = Тип("СправочникСсылка.Номенклатура") Тогда
			Прервать;
		КонецЕсли; 			
	КонецЦикла;
	ВыборкаСтрокЗапасы.Сбросить();
	
	ТаблицаПороды = Новый ТаблицаЗначений;
	ТаблицаПороды.Колонки.Добавить("Порода");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаПороды.Добавить();
		НоваяСтрока.Порода = ВыборкаСтрокЗапасы.Порода;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаПороды.Свернуть("Порода");
	Породы = "";
	Для каждого стрПорода Из ТаблицаПороды Цикл
		Породы = Породы + ?(Породы = "", "", "; ") + стрПорода.Порода;	
	КонецЦикла; 
	
	ТаблицаСорта = Новый ТаблицаЗначений;
	ТаблицаСорта.Колонки.Добавить("Сорт");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаСорта.Добавить();
		НоваяСтрока.Сорт = ВыборкаСтрокЗапасы.СортСсылка;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаСорта.Свернуть("Сорт");
	Сорта = "";
	Для каждого стрСорт Из ТаблицаСорта Цикл
		
		Если стрСорт.Сорт <> NULL Тогда
			Сорта = Сорта + ?(Сорта = "", "", "; ") + стрСорт.Сорт.НаименовАнгл;		
		КонецЕсли; 
		
	КонецЦикла;  		
	
	Влажность = "60%";
			
	Если НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой) 
		ИЛИ НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда  //ТекущийДокумент.Направление = Перечисления.алк_НаправленияДеятельности.Отходы Тогда 
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖД_СпецификацияОтходы_Англ");
		
	Иначе
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖД_СпецификацияПМ_Англ");
		
	КонецЕсли;
	
	Если МакетШпонКитай Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖД_СпецификацияШпонКитай_Англ"); 
	КонецЕсли;
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс); 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Packing list № "
	+ НомерДокумента
	+ " "
	+ Формат(Шапка.ДатаДокумента, "ДЛФ=D");
	
	//формирование представление заказа 
	Если Тип("ДокументСсылка.алк_Аддендумы") = ТипЗнч(ТекущийДокумент.Заказ) Тогда		
		ОбластьМакета.Параметры.Заказ = ТекущийДокумент.Заказ.Договор.НомерДоговора + " Add:"+ ТекущийДокумент.Заказ.НомерАддендума 
		+ " (" + ТекущийДокумент.Заказ.Контрагент.Наименование + ")";		
	Иначе
		ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление; 
	КонецЕсли;	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	//ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ПолучитьАнглНаимКонтрагента(Шапка.Грузоотправитель); //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Грузоотправитель);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	//ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ПолучитьАнглНаимКонтрагента(Шапка.Грузополучатель); //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Грузополучатель);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	//ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ПолучитьАнглНаимКонтрагента(Шапка.Продавец); //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Продавец);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	//ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ПолучитьАнглНаимКонтрагента(Шапка.Покупатель); //РфпПолучениеДанныхСервер.АнглийскоеНаименование(Шапка.Покупатель);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");		
	Если НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Пиломатериал) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
		//ОбластьМакета.Параметры.Номенклатура = Номенклатура;
		
		ОбластьМакета.Параметры.Номенклатура = "Sawn timber";
		//ОбластьМакета.Параметры.Породы       = Породы;
		ОбластьМакета.Параметры.Сорта        = Сорта;
		//ОбластьМакета.Параметры.Влажность    = Влажность;
		
	ИначеЕсли НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой) Тогда 
		
		ОбластьМакета = Макет.ПолучитьОбласть("СортиментОтходы");
		ОбластьМакета.Параметры.Номенклатура = "Scrab non-format veneer";
		
	ИначеЕсли НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
		
		ОбластьМакета = Макет.ПолучитьОбласть("СортиментОтходы");
		ОбластьМакета.Параметры.Номенклатура = "Wood processing waste product ";
		
	ИначеЕсли НоменклатураДокумента = Справочники.Номенклатура.Шпон тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
		ОбластьМакета.Параметры.Номенклатура = "Veneer";
		
		ОбластьМакета.Параметры.Сорта        = Сорта;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	Если НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой) 
		ИЛИ НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда  //ТекущийДокумент.Направление = Перечисления.алк_НаправленияДеятельности.Отходы Тогда	
		
		ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
		ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
		//ОбластьМакета.Параметры.ВидТранспорта    = Шапка.ВидТранспортаПредставление;
		//ОбластьМакета.Параметры.Грузоподъемность = Шапка.Грузоподъемность;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Станция");
		ОбластьМакета.Параметры.СтанцияНазначения = Шапка.ЛогистическийЦентрПолучатель;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("_Транспорт");
		ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
		Если Шапка.СтрокаИДКонтейнеров <> "" Тогда 			
			ОбластьМакета.Параметры.СтрокаИДКонтейнеров = "Container №: " + Шапка.СтрокаИДКонтейнеров + ";";					
		КонецЕсли; 			
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	//		ОбластьМакета.Параметры.ВесГруза = Шапка.ВесНеттоП + ВесРеквизита;
	ТабличныйДокумент.Вывести(ОбластьМакета); 
	
	Если НЕ НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
		
		ВыборкаСертификат = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
		
	Иначе 
		
		ВыборкаСтрокЗапасыКарандаш.Сбросить();
		
		ВыборкаСертификат = ВыборкаСтрокЗапасыКарандаш;
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП" 		
	СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
	// 	- ТД_PEFC
	// 	- ТД_PEFCcont 
	
	
	//Для КАРАНДАШЕЙ, ГРАНУЛ
	МинимальныйПриростВеса = 0.001;
	ДельтаВеса = 0;
	ВесНеттоИтого = 0;
	ВесУпаковкиПакета = 0.028;
	Пеллеты = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018");
	//\\
	
	Пока ВыборкаСертификат.Следующий() Цикл 
		ВесНеттоПоСертификату = 0;
		ИтогоВесПоСертификату = 0;
		
		ВыборкаСтрокЗапасы = ВыборкаСертификат.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		Пока ЕстьДанныеДляВывода Цикл
			
			ДанныеСтроки = ВыборкаСтрокЗапасы;
			ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
			
			Если НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Пиломатериал) Тогда  //ТекущийДокумент.Направление = Перечисления.алк_НаправленияДеятельности.Лесопиление Тогда
				ОбластьМакета.Параметры.Пакет = СтрЗаменить(ОбластьМакета.Параметры.Пакет, "ПМ", "ST");  
				ОбластьМакета.Параметры.moisture =  ДанныеСтроки.Влажность; 
			КонецЕсли;
			
			Если ВыборкаСтрокЗапасы.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой) Тогда
				
				ОбластьМакета.Параметры.Номенклатура = "Scrab non-format veneer";
				ОбластьМакета.Параметры.Характеристика = ВыборкаСтрокЗапасы.Характеристика;
				
				ОбластьМакета.Параметры.Характеристика = СтрЗаменить(ОбластьМакета.Параметры.Характеристика, "Лиственница", "Larch");
				ОбластьМакета.Параметры.Характеристика = СтрЗаменить(ОбластьМакета.Параметры.Характеристика, "Ель", "Spruce");
				
			ИначеЕсли ВыборкаСтрокЗапасы.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
				//ИЛИ ВыборкаСтрокЗапасы.Номенклатура = Пеллеты Тогда 
				
				//Если ВыборкаСтрокЗапасы.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
					ОбластьМакета.Параметры.Номенклатура = "Core";
					ОбластьМакета.Параметры.Характеристика = ВыборкаСтрокЗапасы.Характеристика;
					
					ОбластьМакета.Параметры.Характеристика = СтрЗаменить(ОбластьМакета.Параметры.Характеристика, "Лиственница", "Larch");
					ОбластьМакета.Параметры.Характеристика = СтрЗаменить(ОбластьМакета.Параметры.Характеристика, "Ель", "Spruce");
				//КонецЕсли; 
				
				ДельтаВеса = ДельтаВеса + ОбластьМакета.Параметры.ВесБруттоП-Окр(ОбластьМакета.Параметры.ВесБруттоП,3);
				
				Если ДельтаВеса > МинимальныйПриростВеса/2 Тогда
					ОбластьМакета.Параметры.ВесБруттоП = ОбластьМакета.Параметры.ВесБруттоП + МинимальныйПриростВеса;
					//ОбластьМакета.Параметры.ВесНеттоП = ОбластьМакета.Параметры.ВесНеттоП + МинимальныйПриростВеса;
					ДельтаВеса = ДельтаВеса - МинимальныйПриростВеса;
				ИначеЕсли ДельтаВеса < -МинимальныйПриростВеса/2 Тогда
					ОбластьМакета.Параметры.ВесБруттоП = ОбластьМакета.Параметры.ВесБруттоП - МинимальныйПриростВеса;
					//ОбластьМакета.Параметры.ВесНеттоП = ОбластьМакета.Параметры.ВесНеттоП - МинимальныйПриростВеса;
					ДельтаВеса = ДельтаВеса + МинимальныйПриростВеса;
				КонецЕсли;
				ОбластьМакета.Параметры.ВесБруттоП = Окр(ОбластьМакета.Параметры.ВесБруттоП,3);
				Если Пеллеты <> ВыборкаСтрокЗапасы.Номенклатура Тогда
					ОбластьМакета.Параметры.ВесНеттоП = Окр(ОбластьМакета.Параметры.ВесБруттоП-ВесУпаковкиПакета,3);				
				КонецЕсли; 
				ИтогоВесПоСертификату = ИтогоВесПоСертификату + ОбластьМакета.Параметры.ВесБруттоП;
				ВесНеттоПоСертификату = ВесНеттоПоСертификату + ОбластьМакета.Параметры.ВесНеттоП;
				
			КонецЕсли; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ОбластьМакета.Параметры.Заполнить(ВыборкаСертификат);
		
		Если не СертифДЭЛ тогда
			
			Если ВыборкаСертификат.Продавец = ТД Тогда
				
				Если СтрНайти(ВыборкаСертификат.СтрокаСертификат, "controlled") Тогда
					ОбластьМакета.Параметры.СтрокаСертификат  = "<" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
				Иначе	
					//ОбластьМакета.Параметры.СтрокаСертификат  = "<" + СертификатыТД.Получить("ТД_PEFC") + ">:";
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(ВыборкаСертификат.СтрокаСертификат) Тогда
				
				ОбластьМакета.Параметры.СтрокаСертификат  = "<" + ВыборкаСертификат.СтрокаСертификат + ">:";
				
			Иначе
				
				ОбластьМакета.Параметры.СтрокаСертификат  = "No certificate:" ;
				
			КонецЕсли;
		Иначе 
			ОбластьМакета.Параметры.СтрокаСертификат  = "100% certified No.DEL 2025/1" ;
		КонецЕсли;
		
		Если НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
			//ИЛИ НоменклатураДокумента = Пеллеты Тогда
			
			ОбластьМакета.Параметры.ВесБруттоП = ИтогоВесПоСертификату;
			ОбластьМакета.Параметры.ВесНеттоП = ВесНеттоПоСертификату;
			ВесНеттоИтого = ВесНеттоИтого + ВесНеттоПоСертификату;
			
		КонецЕсли; 
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	Если НоменклатураДокумента = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши) Тогда 
		//ИЛИ НоменклатураДокумента = Пеллеты Тогда
		ОбластьМакета.Параметры.ВесНеттоП = ВесНеттоИтого;
		Если ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту > 0 тогда
			ОбластьМакета.Параметры.ВесБруттоП = ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту;
		КонецЕсли;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);  
		
	ОбластьМакета = Макет.ПолучитьОбласть("Подпись");
	ОбластьМакета.Параметры.РасшифровкаПодписи = ?(МакетШпонКитай, "", Подпись); //" Bezrukov D. M."
	ТабличныйДокумент.Вывести(ОбластьМакета);	
	
КонецПроцедуры //СформироватьЖДСпецификациюПМ_Англ()	

// Процедура формирования печатной формы "Справка расчета веса груза"
//
Процедура СформироватьСправкаВес(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСерии,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ОбъемТаможняДокумента,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК БруттоПорт,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров КАК ИДКонтейнеров
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	
	ВесГруза = 1000 * ?(ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту = 0, ТекущийДокумент.Запасы.Итог("ВесБрутто"), ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту);
	ВесРеквизита = ТекущийДокумент.Реквизит.Итог("ВесРеквизита");
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Шапка = РезультатЗапроса.Выбрать(); 
	
	Шапка.Следующий();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_СправкаВес");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.НомерВагона  			= Шапка.ИдентификаторТС;  
	ОбластьЗаголовок.Параметры.ИДКонтейнеров  			= ?(ЗначениеЗаполнено(Шапка.ИДКонтейнеров), " контейнер " + Шапка.ИДКонтейнеров, "");
	ОбластьЗаголовок.Параметры.ОбъемТаможняДокумента  	= Шапка.ОбъемТаможняДокумента;
	ОбластьЗаголовок.Параметры.Номенклатура 			= Шапка.Номенклатура;
	
	ОбластьЗаголовок.Параметры.ВесГруза = ВесГруза;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьЯчейка = Макет.ПолучитьОбласть("ОбластьСтрока|ОбластьКолонка"); 
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	КоличествоПакетов = ТЗ.Количество();
	
	Если КоличествоПакетов > 0 Тогда
		
		БруттоПорт = ТЗ[0].БруттоПорт;
		ОбщийВесБрутто0 = ТЗ.Итог("ВесБрутто");
		ОбщийВесБрутто1 = 0;
		
		Если БруттоПорт > 0 И ОбщийВесБрутто0 > 0 Тогда
			
			Для каждого Стр Из ТЗ Цикл
				
				Стр.ВесБрутто = Окр(БруттоПорт * Стр.ВесБрутто/ОбщийВесБрутто0, 3);
				ОбщийВесБрутто1 = ОбщийВесБрутто1 + Стр.ВесБрутто; 				
				
			КонецЦикла; 
			
			Дельта = БруттоПорт - ОбщийВесБрутто1;
			
			Для каждого Стр Из ТЗ Цикл 				
				
				Если Дельта > 0 Тогда
					
					Стр.ВесБрутто = Стр.ВесБрутто + 0.001;
					Дельта = Дельта - 0.001;
					
				ИначеЕсли Дельта < 0 Тогда	
					
					Стр.ВесБрутто = Стр.ВесБрутто - 0.001;
					Дельта = Дельта + 0.001;
					
				КонецЕсли;
				
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЕсли; 
	
	
	КолСтрок = Цел(КоличествоПакетов / 5);
	Хвостик = КоличествоПакетов % 5;
	
	ИндексСтрокиТЗ = 0;
	
	Для й = 1 По КолСтрок Цикл
		ОбластьЯчейка.Параметры.НПП = (й-1)*5 + 1;			
		ОбластьЯчейка.Параметры.ВесБрутто = ТЗ[ИндексСтрокиТЗ].ВесБрутто;
		ТабличныйДокумент.Вывести(ОбластьЯчейка);
		ИндексСтрокиТЗ = ИндексСтрокиТЗ + 1;
		Для ц = 1 По 4 Цикл
			ОбластьЯчейка.Параметры.НПП = (й-1)*5 + 1 + ц; 
			ОбластьЯчейка.Параметры.ВесБрутто = ТЗ[ИндексСтрокиТЗ].ВесБрутто;
			ТабличныйДокумент.Присоединить(ОбластьЯчейка);
			ИндексСтрокиТЗ = ИндексСтрокиТЗ + 1;
		КонецЦикла; 
	КонецЦикла; 
	
	Если Хвостик <> 0 Тогда
		ОбластьЯчейка.Параметры.НПП = (КолСтрок*5)+1;			
		ОбластьЯчейка.Параметры.ВесБрутто = ТЗ[ИндексСтрокиТЗ].ВесБрутто;
		ТабличныйДокумент.Вывести(ОбластьЯчейка);
		ИндексСтрокиТЗ = ИндексСтрокиТЗ + 1;
		Для й = 1 По Хвостик-1 Цикл
			ОбластьЯчейка.Параметры.НПП = (КолСтрок*5)+1 + й;
			ОбластьЯчейка.Параметры.ВесБрутто = ТЗ[ИндексСтрокиТЗ].ВесБрутто;
			ТабличныйДокумент.Присоединить(ОбластьЯчейка);
			ИндексСтрокиТЗ = ИндексСтрокиТЗ + 1;
		КонецЦикла; 
	КонецЕсли; 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ВесГруза = ВесГруза;
	ОбластьПодвал.Параметры.ВесРеквизита = ВесРеквизита;
	ОбластьПодвал.Параметры.ОбщийВес = (ВесГруза + ВесРеквизита);
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ОбластьПодписанты = Макет.ПолучитьОбласть("Подписанты");
	ТабличныйДокумент.Вывести(ОбластьПодписанты);
	
КонецПроцедуры //СформироватьСправкаВес()

Функция ПолучитьТекстЗапросаШапкиСпецификацииЖДКарандаши()
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	        |	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК Пакет,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс КАК Префикс,
	        |	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель),
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Перевозчик) КАК ГрузополучательПредставление,
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель),
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец),
	        |	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	        |	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	        |	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемП,
	        |	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт, алк_ТранспортировкаЗапасовЗапасы.ВесНетто) КАК ВесНеттоП,
	        |	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	        |	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	        |	алк_ПараметрыХарактеристик.Порода,
	        |	алк_ТранспортировкаЗапасовЗапасы.Номенклатура.НаименованиеПолное КАК Сорт,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность КАК Грузоподъемность,
	        |	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	        |	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБруттоП,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Пломбы,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец,
	        |	алк_ПараметрыХарактеристик.Сорт.Ссылка,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ЛогистическийЦентрПолучатель,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ЛогистическийЦентрОтправитель
	        |ИЗ
	        |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	        |				,
	        |				СерийныйНомер В
	        |					(ВЫБРАТЬ
	        |						алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	        |					ИЗ
	        |						Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	        |					ГДЕ
	        |						алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент)) КАК алк_ПараметрыПакетовСрезПоследних
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	        |			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	        |		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	        |ГДЕ
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	        |ИТОГИ
	        |	СУММА(Количество),
	        |	СУММА(Объем),
	        |	СУММА(ОбъемП),
	        |	СУММА(ВесНеттоП),
	        |	СУММА(КоличествоПакетов),
	        |	СУММА(ВесБруттоП)
	        |ПО
	        |	Ссылка,
	        |	СтрокаСертификат";
КонецФункции
Функция ПолучитьТекстЗапросСпецификацияЖДКарандаши()
	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер КАК Номер,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	        |	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК Пакет,
	        |	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс КАК Префикс,
	        |	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ) КАК ЗаказПредставление,
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель) КАК ГрузоотправительПредставление,
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель) КАК ГрузополучательПредставление,
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель) КАК ПокупательПредставление,
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец) КАК ПродавецПредставление,
	        |	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	        |	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	        |	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемП,
	        |	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНеттоП,
	        |	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
	        |	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
	        |	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК Длина,
	        |	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2 КАК ТолщинаП,
	        |	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3 КАК ШиринаП,
	        |	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000 КАК ДлинаП,
	        |	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	        |	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	        |	алк_ПараметрыХарактеристик.Порода КАК Порода,
	        |	ПОДСТРОКА(алк_ТранспортировкаЗапасовЗапасы.Номенклатура.НаименованиеПолное, 1, 100) КАК Сорт,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС КАК ИдентификаторТС,
	        |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта) КАК ВидТранспортаПредставление,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность КАК Грузоподъемность,
	        |	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	        |	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня, алк_ТранспортировкаЗапасовЗапасы.ВесБрутто) КАК ВесБруттоП,
	        |	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ КАК Диаметр,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Пломбы КАК Пломбы,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец КАК Продавец,
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	        |	алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт КАК ВесНеттоПорт,
	        |	алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт КАК ВесБруттоПорт,
	        |	алк_ПараметрыХарактеристик.Сорт.Ссылка,
	        |	алк_ПараметрыХарактеристик.Характеристика
	        |ПОМЕСТИТЬ ВТ_Товары
	        |ИЗ
	        |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	        |				,
	        |				СерийныйНомер В
	        |					(ВЫБРАТЬ
	        |						алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	        |					ИЗ
	        |						Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	        |					ГДЕ
	        |						алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент)) КАК алк_ПараметрыПакетовСрезПоследних
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	        |			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	        |		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	        |ГДЕ
	        |	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВТ_Товары.Ссылка,
	        |	ВТ_Товары.ВесБруттоПриВзвешиванииВПорту,
	        |	СУММА(ВТ_Товары.ВесБруттоП) КАК ИтогоВесБруттоП,
	        |	СУММА(ВТ_Товары.ВесНеттоП) КАК ИтогоВесНеттоП
	        |ПОМЕСТИТЬ ВТ_ИтоговыйВес
	        |ИЗ
	        |	ВТ_Товары КАК ВТ_Товары
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Товары.Ссылка,
	        |	ВТ_Товары.ВесБруттоПриВзвешиванииВПорту
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Товары.Номер КАК Номер,
	        |	ВТ_Товары.ДатаДокумента КАК ДатаДокумента,
	        |	ВТ_Товары.Ссылка КАК Ссылка,
	        |	ВТ_Товары.Пакет КАК Пакет,
	        |	ВТ_Товары.НомерСтроки КАК НомерСтроки,
	        |	ВТ_Товары.Префикс КАК Префикс,
	        |	ВТ_Товары.ЗаказПредставление КАК ЗаказПредставление,
	        |	ВТ_Товары.ГрузоотправительПредставление КАК ГрузоотправительПредставление,
	        |	ВТ_Товары.ГрузополучательПредставление КАК ГрузополучательПредставление,
	        |	ВТ_Товары.ПокупательПредставление КАК ПокупательПредставление,
	        |	ВТ_Товары.ПродавецПредставление КАК ПродавецПредставление,
	        |	ВТ_Товары.Количество КАК Количество,
	        |	ВТ_Товары.Объем КАК Объем,
	        |	ВТ_Товары.ОбъемП КАК ОбъемП,
	        |	ВЫБОР
	        |		КОГДА ВТ_Товары.ВесНеттоПорт = 0
	        |			ТОГДА ВТ_Товары.ВесНеттоП * ВложенныйЗапрос.Коэффициент
	        |		ИНАЧЕ ВТ_Товары.ВесНеттоПорт
	        |	КОНЕЦ КАК ВесНеттоП,
	        |	ВТ_Товары.Ширина КАК Ширина,
	        |	ВТ_Товары.Толщина КАК Толщина,
	        |	ВТ_Товары.Длина КАК Длина,
	        |	ВТ_Товары.ТолщинаП КАК ТолщинаП,
	        |	ВТ_Товары.ШиринаП КАК ШиринаП,
	        |	ВТ_Товары.ДлинаП КАК ДлинаП,
	        |	ВТ_Товары.КоличествоПакетов КАК КоличествоПакетов,
	        |	ВТ_Товары.Номенклатура КАК Номенклатура,
	        |	ВТ_Товары.Порода КАК Порода,
	        |	ВТ_Товары.Сорт КАК Сорт,
	        |	ВТ_Товары.ИдентификаторТС КАК ИдентификаторТС,
	        |	ВТ_Товары.ВидТранспортаПредставление КАК ВидТранспортаПредставление,
	        |	ВТ_Товары.Грузоподъемность КАК Грузоподъемность,
	        |	ВТ_Товары.СтрокаСертификат КАК СтрокаСертификат,
	        |	ВЫБОР
	        |		КОГДА ВТ_Товары.ВесБруттоПорт = 0
	        |			ТОГДА ВТ_Товары.ВесБруттоП * ВложенныйЗапрос.Коэффициент
	        |		ИНАЧЕ ВТ_Товары.ВесБруттоПорт
	        |	КОНЕЦ КАК ВесБруттоП,
	        |	ВТ_Товары.Диаметр КАК Диаметр,
	        |	ВТ_Товары.Пломбы КАК Пломбы,
	        |	ВТ_Товары.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	        |	ВТ_Товары.Продавец КАК Продавец,
	        |	ВТ_Товары.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	        |	ВТ_Товары.ВесБруттоП КАК ВесБруттоПТовар,
	        |	ВТ_Товары.ВесНеттоП КАК ВесНеттоПТовар,
	        |	(ВЫРАЗИТЬ(ВТ_Товары.ВесНеттоП * ВложенныйЗапрос.Коэффициент КАК ЧИСЛО(15, 3))) - ВТ_Товары.ВесНеттоП * ВложенныйЗапрос.Коэффициент КАК ДельтаВеса,
	        |	ВТ_Товары.СортСсылка,
	        |	ВТ_Товары.Характеристика
	        |ИЗ
	        |	ВТ_Товары КАК ВТ_Товары
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ВТ_ИтоговыйВес.Ссылка КАК Ссылка,
	        |			ВЫБОР
	        |				КОГДА ВТ_ИтоговыйВес.ИтогоВесБруттоП > 0
	        |						И ВТ_ИтоговыйВес.ВесБруттоПриВзвешиванииВПорту > 0
	        |					ТОГДА ВЫРАЗИТЬ(ВТ_ИтоговыйВес.ВесБруттоПриВзвешиванииВПорту / ВТ_ИтоговыйВес.ИтогоВесБруттоП КАК ЧИСЛО(10, 6))
	        |				ИНАЧЕ 1
	        |			КОНЕЦ КАК Коэффициент,
	        |			ВТ_ИтоговыйВес.ИтогоВесБруттоП КАК ИтогоВесБруттоП,
	        |			ВТ_ИтоговыйВес.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту
	        |		ИЗ
	        |			ВТ_ИтоговыйВес КАК ВТ_ИтоговыйВес) КАК ВложенныйЗапрос
	        |		ПО ВТ_Товары.Ссылка = ВложенныйЗапрос.Ссылка
	        |ИТОГИ
	        |	СУММА(Количество),
	        |	СУММА(Объем),
	        |	СУММА(ОбъемП),
	        |	СУММА(ВесНеттоП),
	        |	СУММА(КоличествоПакетов),
	        |	СУММА(ВесБруттоП)
	        |ПО
	        |	СтрокаСертификат";
КонецФункции
Функция ПолучитьПолучитьМассивКникальныхЗначенийКолонкиВыборки(Выборка, ИмяКолонка)
	МассивЗначений = новый массив;
	Пока Выборка.Следующий() Цикл
		МассивЗначений.Добавить(Выборка[ИмяКолонка]);
	КонецЦикла; 
	Выборка.Сбросить();
	МассивЗначений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗначений);
	Результат = "";
	Для каждого Значение Из МассивЗначений Цикл
		Результат = Результат + ?(Результат = "", "", "; ") + Значение;	
	КонецЦикла;
	Возврат Результат;
КонецФункции
Процедура ЗаполнитьШапкуСпецификацияЖДКарандаши(ТабличныйДокумент, Макет, Данные, ВыводитьРеквизит)
	ВыборкаСтрокЗапасы = Данные.Выбрать();
	
	Породы = ПолучитьПолучитьМассивКникальныхЗначенийКолонкиВыборки(ВыборкаСтрокЗапасы, "Порода");
	Сорта = ПолучитьПолучитьМассивКникальныхЗначенийКолонкиВыборки(ВыборкаСтрокЗапасы, "Сорт");
	Влажность = "60%";
	
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Данные.ДатаДокумента, Данные.Номер, Данные.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
	+ НомерДокумента
	+ " от "
	+ Формат(Данные.ДатаДокумента, "ДЛФ=DD");
	
	ОбластьМакета.Параметры.Заказ = Данные.ЗаказПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Данные.ГрузоотправительПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Данные.ГрузополучательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Данные.ПродавецПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = Данные.ПокупательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
	ОбластьМакета.Параметры.Номенклатура = Сорта;
	ОбластьМакета.Параметры.Породы       = Породы;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
	ОбластьМакета.Параметры.ИдентификаторТС  = Данные.ИдентификаторТС;
	ОбластьМакета.Параметры.ВидТранспорта    = Данные.ВидТранспортаПредставление;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Данные.СтрокаИДКонтейнеров <> "" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Контейнеры");
		ОбластьМакета.Параметры.СтрокаИДКонтейнеров = Данные.СтрокаИДКонтейнеров;
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	
	ОбластьМакета.Параметры.ВесГруза = ?(Данные.Ссылка.ВесБруттоПриВзвешиванииВПорту > 0, Данные.Ссылка.ВесБруттоПриВзвешиванииВПорту, Данные.ВесБруттоП) 
	+ ?(ВыводитьРеквизит, Данные.Ссылка.Реквизит.Итог("ВесРеквизита")/1000, 0);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры
// Нач мод [Пакушев И.С.] [18.05.2018] 
// Обращение № [0000090454] [_БезРеквизитов]
// Было
// Стало


// Процедура формирования Железнодорожной спецификации для отходов
//
Процедура СформироватьЖДСпецификациюКарандаш_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент, ВыводитьРеквизит = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = ПолучитьТекстЗапросаШапкиСпецификацииЖДКарандаши();
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Шапка.Следующий();
	
	Если ТекущийДокумент.Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы 
		Или ТекущийДокумент.Участок.Код = "000000039" Тогда //СГП ДГ
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияГранулы");
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияКарандаш");		
	КонецЕсли; 
	
	
	ЗаполнитьШапкуСпецификацияЖДКарандаши(ТабличныйДокумент, Макет, Шапка, ВыводитьРеквизит);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = ПолучитьТекстЗапросСпецификацияЖДКарандаши();
	
	ВыборкаТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Шапка2.Следующий();
	//ВесРеквизита = ТекущийДокумент.Реквизит.Итог("ВесРеквизита")/1000;		
	//ВыборкаСертификат = Шапка2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП" 	
	
	СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
	// 	- ТД_PEFC
	// 	- ТД_PEFCcont
	МинимальныйПриростВеса = 0.001;
	ДельтаВеса = 0;
	ВесНеттоИтого = 0;
	ВесУпаковкиПакета = 0.028;
	
	Пиллеты = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018");
	
	КоличествоСтрока = ВыборкаТовары.Количество();
	Пока ВыборкаТовары.Следующий() Цикл
		ВесНеттоПоСертификату = 0;
		ИтогоВесПоСертификату = 0;
		ВыборкаСтрокЗапасы = ВыборкаТовары.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
		
		Пока ВыборкаСтрокЗапасы.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокЗапасы);
			ДельтаВеса = ДельтаВеса + ОбластьМакета.Параметры.ВесБруттоП-Окр(ОбластьМакета.Параметры.ВесБруттоП,3);
			Если ДельтаВеса > МинимальныйПриростВеса/2 Тогда
				ОбластьМакета.Параметры.ВесБруттоП = ОбластьМакета.Параметры.ВесБруттоП + МинимальныйПриростВеса;
				//ОбластьМакета.Параметры.ВесНеттоП = ОбластьМакета.Параметры.ВесНеттоП + МинимальныйПриростВеса;
				ДельтаВеса = ДельтаВеса - МинимальныйПриростВеса;
			ИначеЕсли ДельтаВеса < -МинимальныйПриростВеса/2 Тогда
				ОбластьМакета.Параметры.ВесБруттоП = ОбластьМакета.Параметры.ВесБруттоП - МинимальныйПриростВеса;
				//ОбластьМакета.Параметры.ВесНеттоП = ОбластьМакета.Параметры.ВесНеттоП - МинимальныйПриростВеса;
				ДельтаВеса = ДельтаВеса + МинимальныйПриростВеса;
			КонецЕсли;
			ОбластьМакета.Параметры.ВесБруттоП = Окр(ОбластьМакета.Параметры.ВесБруттоП,3);
			Если Пиллеты <> ВыборкаСтрокЗапасы.Номенклатура Тогда
				ОбластьМакета.Параметры.ВесНеттоП = Окр(ОбластьМакета.Параметры.ВесБруттоП-ВесУпаковкиПакета,3);				
			КонецЕсли; 
			ИтогоВесПоСертификату = ИтогоВесПоСертификату + ОбластьМакета.Параметры.ВесБруттоП;
			ВесНеттоПоСертификату = ВесНеттоПоСертификату + ОбластьМакета.Параметры.ВесНеттоП;
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ОбластьМакета.Параметры.Заполнить(ВыборкаТовары);
		Если ВыборкаТовары.Продавец = ТД Тогда
			Если СтрНайти(ВыборкаТовары.СтрокаСертификат, "controlled") Тогда
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
			Иначе	
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFC") + ">:";
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ВыборкаТовары.СтрокаСертификат) Тогда
			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + ВыборкаТовары.СтрокаСертификат + ">:";
		Иначе
			ОбластьМакета.Параметры.СтрокаСертификат  = "Не сертифицированная продукция:"
		КонецЕсли;
		ОбластьМакета.Параметры.ВесБруттоП = ИтогоВесПоСертификату;
		ОбластьМакета.Параметры.ВесНеттоП = ВесНеттоПоСертификату;
		ВесНеттоИтого = ВесНеттоИтого + ВесНеттоПоСертификату;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ВесНеттоП = ВесНеттоИтого;
	Если ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту > 0 тогда
		ОбластьМакета.Параметры.ВесБруттоП = ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту;
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета); 				
	
	Если ВыводитьРеквизит Тогда
		Если ТекущийДокумент.Реквизит.Количество() > 0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаРеквизит");		
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРеквизит");
			НомерПП = 1;
			Для каждого Реквизит из ТекущийДокумент.Реквизит Цикл
				
				ОбластьМакета.Параметры.Заполнить(Реквизит);
				ОбластьМакета.Параметры.НомерСтроки = НомерПП;
				ТабличныйДокумент.Вывести(ОбластьМакета);		
				НомерПП = НомерПП+1;
			КонецЦикла; 
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРеквизит");
			ОбластьМакета.Параметры.ВесРеквизита = ТекущийДокумент.Реквизит.Итог("ВесРеквизита");
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Пломбы");
		ОбластьМакета.Параметры.Пломбы  = Шапка.Пломбы;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
КонецПроцедуры //СформироватьЖДСпецификациюКарандаш()	

// Процедура формирования Сертификата VGM

Процедура ЗаполнитьШаблонСертификатаVGM(ПутьКФайлуНаДиске,ТекущийДокумент)
	
	WordApp = Новый COMОбъект("Word.Application");
	Док = WordApp.Documents.Add(ПутьКФайлуНаДиске);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
	              |	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Транспортировка,
	              |	алк_ПараметрыПакетовСрезПоследних.Сертификат.НомерСертификата КАК НомерСертификата,
	              |	(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесКонтейнера + алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту + алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита) * 1000 КАК ВесБрутто,
	              |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Ответственный,
	              |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров КАК ИДКонтейнеров
	              |ИЗ
	              |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	              |		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасовРеквизит.Ссылка
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
	              |		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	              |ГДЕ
	              |	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_ПараметрыПакетовСрезПоследних.Сертификат,
	              |	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
	              |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
	              |	(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесКонтейнера + алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту + алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита) * 1000,
	              |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Ответственный,
	              |	алк_ПараметрыПакетовСрезПоследних.Сертификат.НомерСертификата";
	Запрос.УстановитьПараметр("Ссылка",ТекущийДокумент);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() цикл
		
		Док.Content.Find.Execute("<<НомерСертификат>>", , , , , , , , , Результат.НомерСертификата, 2);
		Док.Content.Find.Execute("<<ДатаВзвешивания>>", , , , , , , , , ТекущийДокумент.Дата, 2);
		Док.Content.Find.Execute("<<НомерКонтейнера>>", , , , , , , , , Результат.ИДКонтейнеров, 2);
		//Док.Content.Find.Execute("<<Ответственный>>", , , , , , , , , Результат.Ответственный, 2);
		//Док.Content.Find.Execute("<<МассаБрутто>>", , , , , , , , , Результат.ВесБрутто, 2);
		
	КонецЦикла;
	
	//Док.Content.Find.Execute("<<НомерСертификат>>", , , , , , , , , Контейнер, 2);
	//Док.Content.Find.Execute("<<ДатаВзвешивания>>", , , , , , , , , ДатаВзвешивания, 2);
	//Док.Content.Find.Execute("<<НомерКонтейнера>>", , , , , , , , , Контейнер, 2);
	//Док.Content.Find.Execute("<<Ответственный>>", , , , , , , , , АвторРедактор, 2);
	//Док.Content.Find.Execute("<<МассаБрутто>>", , , , , , , , , ВесБруттоРасчитанный, 2);
	
	Док.Saved = Истина;
	
	WordApp.Visible = Истина;
	
	WordApp.WindowState = 2;
	WordApp.WindowState = 1;	
	
КонецПроцедуры

// Процедура формирования Железнодорожной спецификации для отходов
//
Процедура СформироватьЖДСпецификациюКусковой_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент)
	
	ТЧ = ТекущийДокумент.Запасы;
	
	Если НЕ ТЧ.Количество() = 0 Тогда  
		Если НЕ ТЧ[0].Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000005") Тогда //Шпон кусковой   
			Сообщить("Ошибка! Данная печатная форма используется только для кускового шпона.");
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаДокумента,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК Пакет,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоотправитель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Покупатель),
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец),
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемП,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНеттоП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2 КАК ТолщинаП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3 КАК ШиринаП,
	|	(алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000 КАК ДлинаП,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ПараметрыХарактеристик.Порода,
	|	""Шпон кусковой"" КАК Сорт,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС,
	|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта),
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузоподъемность КАК Грузоподъемность,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыПакетовСрезПоследних.Сертификат = ЗНАЧЕНИЕ(Справочник.СертификатыНаПродукцию.ПустаяСсылка)
	|				ИЛИ алк_ПараметрыПакетовСрезПоследних.Сертификат.Наименование = ""Не сертифицирован""
	|			ТОГДА ""Не сертифицированная продукция:""
	|		ИНАЧЕ ""Сертифицированная продукция <"" + алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать + "">:""
	|	КОНЕЦ КАК СтрокаСертификат,
	|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоП,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Пломбы,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтрокаИДКонтейнеров,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Продавец
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	|					ИЗ
	|						Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|					ГДЕ
	|						алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент)) КАК алк_ПараметрыПакетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем),
	|	СУММА(ОбъемП),
	|	СУММА(ВесНеттоП),
	|	СУММА(КоличествоПакетов),
	|	СУММА(ВесБруттоП)
	|ПО
	|	Ссылка,
	|	СтрокаСертификат";
	
	Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Шапка.Следующий();
	
	ВыборкаСтрокЗапасы = Шапка.Выбрать();
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка,
	|	алк_ТранспортировкаЗапасовРеквизит.НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита, 0) КАК ВесРеквизита
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|ГДЕ
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка = &ТекущийДокумент
	|ИТОГИ
	|	СУММА(ВесРеквизита)
	|ПО
	|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаИтогРеквизит  = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаИтогРеквизит.Следующий();
		
		ВесРеквизита = ВыборкаИтогРеквизит.ВесРеквизита/1000;
		
	Иначе
		
		ВесРеквизита = 0;
		
	КонецЕсли;
	Номенклатура = "Шпон кусковой";
	
	ТаблицаПороды = Новый ТаблицаЗначений;
	ТаблицаПороды.Колонки.Добавить("Порода");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаПороды.Добавить();
		НоваяСтрока.Порода = ВыборкаСтрокЗапасы.Порода;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаПороды.Свернуть("Порода");
	Породы = "";
	Для каждого стрПорода Из ТаблицаПороды Цикл
		Породы = Породы + ?(Породы = "", "", "; ") + стрПорода.Порода;	
	КонецЦикла; 
	
	ТаблицаСорта = Новый ТаблицаЗначений;
	ТаблицаСорта.Колонки.Добавить("Сорт");
	Пока ВыборкаСтрокЗапасы.Следующий() Цикл
		НоваяСтрока = ТаблицаСорта.Добавить();
		НоваяСтрока.Сорт = ВыборкаСтрокЗапасы.Сорт;
	КонецЦикла; 
	ВыборкаСтрокЗапасы.Сбросить();
	ТаблицаСорта.Свернуть("Сорт");
	Сорта = "";
	Для каждого стрСорт Из ТаблицаСорта Цикл
		Сорта = Сорта + ?(Сорта = "", "", "; ") + стрСорт.Сорт;	
	КонецЦикла; 
	
	Влажность = "60%";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияКусковой");
	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
	+ НомерДокумента
	+ " от "
	+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
	
	ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
	ОбластьМакета.Параметры.Номенклатура = Номенклатура;
	ОбластьМакета.Параметры.Породы       = Породы;
	//		ОбластьМакета.Параметры.Сорта        = Сорта;
	//		ОбластьМакета.Параметры.Влажность    = Влажность;
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
	ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
	ОбластьМакета.Параметры.ВидТранспорта    = Шапка.ВидТранспортаПредставление;
	// ОбластьМакета.Параметры.Грузоподъемность = Шапка.Грузоподъемность;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Если Шапка.СтрокаИДКонтейнеров <> "" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Контейнеры");
		ОбластьМакета.Параметры.СтрокаИДКонтейнеров = Шапка.СтрокаИДКонтейнеров;
		ТабличныйДокумент.Вывести(ОбластьМакета);			
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	//РФП Осипов (20.09.2018)+
	//Обращение 0000095820
	//Было:
	//ОбластьМакета.Параметры.ВесГруза = Шапка.ВесБруттоП + ВесРеквизита;
	//Стало
	ОбластьМакета.Параметры.ВесГруза = Шапка.ВесБруттоП;
	//РФП Осипов (20.09.2018)-		
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
	ВыборкаСертификат = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП"
	
	СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
	// 	- ТД_PEFC
	// 	- ТД_PEFCcont
	
	Пока ВыборкаСертификат.Следующий() Цикл
		
		ВыборкаСтрокЗапасы = ВыборкаСертификат.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
		
		ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
		Пока ЕстьДанныеДляВывода Цикл
			
			ДанныеСтроки = ВыборкаСтрокЗапасы;
			ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ЕстьДанныеДляВывода = ВыборкаСтрокЗапасы.Следующий();
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ОбластьМакета.Параметры.Заполнить(ВыборкаСертификат);
		
		Если ВыборкаСертификат.Продавец = ТД Тогда
			
			Если СтрНайти(ВыборкаСертификат.СтрокаСертификат, "controlled") Тогда
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
			Иначе	
				ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFC") + ">:";
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСертификат.СтрокаСертификат) Тогда
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + ВыборкаСертификат.СтрокаСертификат + ">:";
			
		Иначе
			
			ОбластьМакета.Параметры.СтрокаСертификат  = "Не сертифицированная продукция:"
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабличныйДокумент.Вывести(ОбластьМакета);		
	
КонецПроцедуры //СформироватьЖДСпецификациюКусковой()	

// Процедура формирования Железнодорожной спецификации для пиломатериалов
Процедура СформироватьЖДСпецификациюПМ_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент,СРеквизитом)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияПМ1");
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьКонтейнера		= Макет.ПолучитьОбласть("Контейнер");
	ОбластьГОСТ 			= Макет.ПолучитьОбласть("Гост");
	ОбластьШапкаТабл		= Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ОбластьИтогПоТаблице 	= Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьПломбы 			= Макет.ПолучитьОбласть("Пломбы");
	
	
	Контейнер 	=  Ложь;
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",	ТекущийДокумент);
	
	Запрос.Текст = ТекстЗапросаЖД_ПМ_Новый_1();
	
	ТЗ 				= Запрос.ВыполнитьПакет();
	Шапка 			= Тз[0].Выгрузить();
	ДанныеТЧ_Итог	= ТЗ[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);// ОБЩИЕ);
	Порода_Сорт 	= ТЗ[8].Выгрузить();
	
	Если СРеквизитом тогда
		ОбластьРеквизитШапка 		= Макет.ПолучитьОбласть("ШапкаРеквизит");
		ОбластьИтогиПоРеквизитам 	= Макет.ПолучитьОбласть("ИтогРеквизит");
		ДанныеПоРеквизитам 		= Тз[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ОБЩИЕ");
	КонецЕсли;
	
	Для  каждого СтрокаДанных из Шапка цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,СтрокаДанных);
		ОбластьЗаголовок.Параметры.Дата = Формат(СтрокаДанных.Дата, "ДЛФ=DD");
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВесКонтейнера) Или  ЗначениеЗаполнено(СтрокаДанных.СтрокаИДКонтейнеров) тогда
			ЗаполнитьЗначенияСвойств(ОбластьКонтейнера.Параметры,СтрокаДанных);
			Контейнер = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Порода = Порода_Сорт.ВыгрузитьКолонку("Порода");
	Порода = СвернутьМассив(Порода);
	ОбластьЗаголовок.Параметры.Породы = СтрСоединить(Порода,",");
	
	Сорта = Порода_Сорт.ВыгрузитьКолонку("Сорт");
	Сорта = СвернутьМассив(Сорта); 
	ОбластьЗаголовок.Параметры.Сорта = СтрСоединить(Сорта,",");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Если Контейнер тогда
		ТабличныйДокумент.Вывести(ОбластьКонтейнера);
	КонецЕсли;		
	
	ДанныеТЧ_Итог.Следующий();		// Общий итог
	
	ВесБруттоПриВзвешиванииВПорту 			= ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту;
	ИтогиВесБруттоЗапрос 					= ДанныеТЧ_Итог.ВесБрутто;
	Дельта									= ВесБруттоПриВзвешиванииВПорту - ИтогиВесБруттоЗапрос;
	
	ДельтаОбъем = ДанныеТЧ_Итог.ОбъемП_2 - Окр(ДанныеТЧ_Итог.ОбъемП, 2);	
	
	ВесПриВзвешивании = ЗначениеЗаполнено(ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту);
	
	Если ЗначениеЗаполнено(ДанныеТЧ_Итог.ВесРеквизита) тогда 
		ОбластьГОСТ.Параметры.ВесГруза = ?(ВесПриВзвешивании,ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту+ДанныеТЧ_Итог.ВесРеквизита ,ДанныеТЧ_Итог.ВесБрутто + ДанныеТЧ_Итог.ВесРеквизита);
	Иначе 
		ОбластьГОСТ.Параметры.ВесГруза =  ?(ВесПриВзвешивании,ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту,ДанныеТЧ_Итог.ВесБрутто); 
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьГОСТ);
	
	
	ДанныеТЧ = ДанныеТЧ_Итог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);//ПО Сертификату
	
	ИтогиВесНетто = 0;
	ИтогиВесБрутто = 0;
	ИтогиКоличествоПакетов = 0;
	ИтогиКоличество = 0;
	ИтогиОбъем = 0;
	ИтогиОбъемП = 0;
	
	Пока ДанныеТЧ.Следующий() цикл           //по сертификату
		
		ИтогиВесНеттоСертификат = 0;
		ИтогиВесБруттоСертификат = 0;
		ИтогиКоличествоПакетовСертификат = 0;
		ИтогиКоличествоСертификат = 0;
		ИтогиОбъемСертификат = 0;
		ИтогиОбъемПСертификат = 0;
		
		
		//	ВесПриВзвешивании = ЗначениеЗаполнено(ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту);
		//	
		//	Если ЗначениеЗаполнено(ДанныеТЧ.ВесРеквизита) тогда 
		//		ОбластьГОСТ.Параметры.ВесГруза = ?(ВесПриВзвешивании,ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту+ДанныеТЧ.ВесРеквизита ,ДанныеТЧ.ВесБрутто + ДанныеТЧ.ВесРеквизита);
		//	Иначе 
		//		ОбластьГОСТ.Параметры.ВесГруза =  ?(ВесПриВзвешивании,ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту,ДанныеТЧ.ВесБрутто); 
		//	КонецЕсли;
		//
		//	ТабличныйДокумент.Вывести(ОбластьГОСТ);
		ТабличныйДокумент.Вывести(ОбластьШапкаТабл);
		
		ОбластьИтогПоСертификату = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ЗаполнитьЗначенияСвойств(ОбластьИтогПоСертификату.Параметры,ДанныеТЧ);
		ДанныеСтрокиТЧ = ДанныеТЧ.Выбрать();
		
		//Дельта = ВесБруттоПриВзвешиванииВПорту - ИтогиВесБруттоЗапрос;
		
		Пока ДанныеСтрокиТЧ.Следующий() цикл  
			
			СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаПрипуски");
			ЗаполнитьЗначенияСвойств(СтрокаТЧ.Параметры,ДанныеСтрокиТЧ);
			СтрокаТЧ.Параметры.ОбъемП = ДанныеСтрокиТЧ.ОбъемП_2;
			
			Если не ДанныеСтрокиТЧ.РасчетныеДанные тогда
				
				Если ВесБруттоПриВзвешиванииВПорту > 0 Тогда
					
					Если Дельта > 0  и Дельта <> 0 Тогда
						
						СтрокаТЧ.Параметры.ВесБрутто = ДанныеСтрокиТЧ.ВесБрутто + 0.001;
						Дельта = Дельта - 0.001;
						
					ИначеЕсли Дельта < 0 И Дельта <> 0 Тогда	
						
						СтрокаТЧ.Параметры.ВесБрутто = ДанныеСтрокиТЧ.ВесБрутто - 0.001;
						Дельта = Дельта + 0.001;
						
					КонецЕсли;
					
					СтрокаТЧ.Параметры.ВесНетто = СтрокаТЧ.Параметры.ВесБрутто - 0.01;
					
				КонецЕсли; 	
				
				//СтрокаТЧ.Параметры.ОбъемП = ДанныеСтрокиТЧ.ОбъемП_2;
				
				Если ДельтаОбъем > 0  и ДельтаОбъем <> 0 Тогда
					
					СтрокаТЧ.Параметры.ОбъемП = ДанныеСтрокиТЧ.ОбъемП_2 - 0.01;
					ДельтаОбъем = ДельтаОбъем - 0.01;
					
				ИначеЕсли ДельтаОбъем < 0 И ДельтаОбъем <> 0 Тогда	
					
					СтрокаТЧ.Параметры.ОбъемП = ДанныеСтрокиТЧ.ОбъемП_2 + 0.01;
					ДельтаОбъем = ДельтаОбъем + 0.01;
					
				КонецЕсли;   						
			КонецЕсли;
			
			
			ИтогиВесНеттоСертификат 			= ИтогиВесНеттоСертификат + СтрокаТЧ.Параметры.ВесНетто;
			ИтогиВесБруттоСертификат 			= ИтогиВесБруттоСертификат + СтрокаТЧ.Параметры.ВесБрутто; 
			ИтогиКоличествоПакетовСертификат 	= ИтогиКоличествоПакетовСертификат + ДанныеСтрокиТЧ.КоличествоПакетов;
			ИтогиКоличествоСертификат 			= ИтогиКоличествоСертификат + СтрокаТЧ.Параметры.Количество;
			ИтогиОбъемСертификат 				= ИтогиОбъемСертификат + СтрокаТЧ.Параметры.Объем;
			ИтогиОбъемПСертификат 				= ИтогиОбъемПСертификат + СтрокаТЧ.Параметры.ОбъемП;
			
			ТабличныйДокумент.Вывести(СтрокаТЧ);
			
		КонецЦикла;
		
		ОбластьИтогПоСертификату.Параметры.ВесНетто  = ИтогиВесНеттоСертификат;
		ОбластьИтогПоСертификату.Параметры.ВесБрутто = ИтогиВесБруттоСертификат;
		ОбластьИтогПоСертификату.Параметры.ОбъемП    = ИтогиОбъемПСертификат;
		
		
		ТабличныйДокумент.Вывести(ОбластьИтогПоСертификату);
		//ЗаполнитьЗначенияСвойств(ОбластьИтогПоТаблице.Параметры,ДанныеТЧ);
		
		ИтогиВесНетто = ИтогиВесНетто + ИтогиВесНеттоСертификат;
		ИтогиВесБрутто = ИтогиВесБрутто + ИтогиВесБруттоСертификат;
		ИтогиКоличествоПакетов = ИтогиКоличествоПакетов + ИтогиКоличествоПакетовСертификат;
		ИтогиКоличество = ИтогиКоличество + ИтогиКоличествоСертификат;
		ИтогиОбъем = ИтогиОбъем + ИтогиОбъемСертификат;
		ИтогиОбъемП = ИтогиОбъемП + ИтогиОбъемПСертификат;			
		
	КонецЦикла;   
	
	ОбластьИтогПоТаблице.Параметры.ВесНетто = ИтогиВесНетто;
	ОбластьИтогПоТаблице.Параметры.ВесБрутто = ИтогиВесБрутто;
	ОбластьИтогПоТаблице.Параметры.КоличествоПакетов = ИтогиКоличествоПакетов;
	ОбластьИтогПоТаблице.Параметры.Количество = ИтогиКоличество;
	ОбластьИтогПоТаблице.Параметры.Объем = ИтогиОбъем;
	ОбластьИтогПоТаблице.Параметры.ОбъемП = ИтогиОбъемП;
	
	ТабличныйДокумент.Вывести(ОбластьИтогПоТаблице);  		
	
	Если СРеквизитом тогда
		ТабличныйДокумент.Вывести(ОбластьРеквизитШапка);
		Пока ДанныеПоРеквизитам.Следующий()цикл
			ЗаполнитьЗначенияСвойств(ОбластьИтогиПоРеквизитам.Параметры,ДанныеПоРеквизитам);
			ДетальныеДанные = ДанныеПоРеквизитам.Выбрать();
			Пока ДетальныеДанные.Следующий() цикл
				СтрокаРеквизита = Макет.ПолучитьОбласть("СтрокаРеквизит");
				ЗаполнитьЗначенияСвойств(СтрокаРеквизита.Параметры,ДетальныеДанные);
				ТабличныйДокумент.Вывести(СтрокаРеквизита);
			КонецЦикла;
			ТабличныйДокумент.Вывести(ОбластьИтогиПоРеквизитам);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбластьПломбы.Параметры,ТекущийДокумент);
	ТабличныйДокумент.Вывести(ОбластьПломбы);
	
	//ОбщийВесБрутто = 0;
	//
	//Для каждого Стр Из ТЗ Цикл  		
	//	Если ЗначениеЗаполнено(Стр.Пакет) Тогда              				
	//		ОбщийВесБрутто = ОбщийВесБрутто + Стр.ВесБруттоП;			
	//	КонецЕсли;              		
	//КонецЦикла;                 		
	//
	//ТЗ.Очистить();
	
	// Кон мод [Пакушев И.С.] [30.07.2019]
	
	//
	//Шапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Шапка.Следующий();
	//
	//ВыборкаСтрокЗапасы = Шапка.Выбрать();
	//
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_ТранспортировкаЗапасовРеквизит.Ссылка,
	//|	алк_ТранспортировкаЗапасовРеквизит.НомерСтроки,
	//|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
	//|	ЕСТЬNULL(алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита, 0) КАК ВесРеквизита
	//|ИЗ
	//|	Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	//|ГДЕ
	//|	алк_ТранспортировкаЗапасовРеквизит.Ссылка = &ТекущийДокумент
	//|ИТОГИ
	//|	СУММА(ВесРеквизита)
	//|ПО
	//|	ОБЩИЕ";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	
	//	ВыборкаИтогРеквизит  = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	ВыборкаИтогРеквизит.Следующий();
	//	
	//	ВесРеквизита = ВыборкаИтогРеквизит.ВесРеквизита/1000;
	//	
	//Иначе
	//	
	//	ВесРеквизита = 0;
	//	
	//КонецЕсли;
	//
	//Номенклатура = "Пиломатериалы";
	//
	//ТаблицаПороды = Новый ТаблицаЗначений;
	//ТаблицаПороды.Колонки.Добавить("Порода");
	//Пока ВыборкаСтрокЗапасы.Следующий() Цикл
	//	НоваяСтрока = ТаблицаПороды.Добавить();
	//	НоваяСтрока.Порода = ВыборкаСтрокЗапасы.Порода;
	//КонецЦикла; 
	//ВыборкаСтрокЗапасы.Сбросить();
	//ТаблицаПороды.Свернуть("Порода");
	//Породы = "";
	//Для каждого стрПорода Из ТаблицаПороды Цикл
	//	Породы = Породы + ?(Породы = "", "", "; ") + стрПорода.Порода;	
	//КонецЦикла; 
	//
	//ТаблицаСорта = Новый ТаблицаЗначений;
	//ТаблицаСорта.Колонки.Добавить("Сорт");
	//Пока ВыборкаСтрокЗапасы.Следующий() Цикл
	//	НоваяСтрока = ТаблицаСорта.Добавить();
	//	НоваяСтрока.Сорт = ВыборкаСтрокЗапасы.Сорт;
	//КонецЦикла; 
	//ВыборкаСтрокЗапасы.Сбросить();
	//ТаблицаСорта.Свернуть("Сорт");
	//Сорта = "";
	//Для каждого стрСорт Из ТаблицаСорта Цикл
	//	Сорта = Сорта + ?(Сорта = "", "", "; ") + стрСорт.Сорт;	
	//КонецЦикла; 
	//
	//Влажность = "60%";
	//
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияПМ1");
	//НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(Шапка.ДатаДокумента, Шапка.Номер, Шапка.Префикс);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//ОбластьМакета.Параметры.ТекстЗаголовка = "Спецификация № "
	//+ НомерДокумента
	//+ " от "
	//+ Формат(Шапка.ДатаДокумента, "ДЛФ=DD");
	//
	//ОбластьМакета.Параметры.Заказ = Шапка.ЗаказПредставление;
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Грузоотправитель");
	//ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = Шапка.ГрузоотправительПредставление;
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Грузополучатель");
	//ОбластьМакета.Параметры.ПредставлениеГрузополучателя = Шапка.ГрузополучательПредставление;
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	//ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.ПродавецПредставление;
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	//ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.ПокупательПредставление;
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Сортимент");
	//ОбластьМакета.Параметры.Номенклатура = Номенклатура;
	//ОбластьМакета.Параметры.Породы       = Породы;
	//ОбластьМакета.Параметры.Сорта        = Сорта;
	////ОбластьМакета.Параметры.Влажность    = Влажность;
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Транспорт");
	//ОбластьМакета.Параметры.ИдентификаторТС  = Шапка.ИдентификаторТС;
	//ОбластьМакета.Параметры.ВидТранспорта    = Шапка.ВидТранспортаПредставление;
	//// ОбластьМакета.Параметры.Грузоподъемность = Шапка.Грузоподъемность;
	//
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//Если Шапка.СтрокаИДКонтейнеров <> "" Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("Контейнеры");
	//	ОбластьМакета.Параметры.СтрокаИДКонтейнеров = Шапка.СтрокаИДКонтейнеров;
	//	ТабличныйДокумент.Вывести(ОбластьМакета);			
	//КонецЕсли; 
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("Гост");
	//РФП Осипов (20.09.2018)+
	//Обращение 0000095820
	//Было:
	//ОбластьМакета.Параметры.ВесГруза = Шапка.ВесБруттоП + ВесРеквизита;
	//Стало
	
	//ОбластьМакета.Параметры.ВесГруза = ?(весПоДокументу.ВесБруттоПриВзвешиванииВПорту = 0, весПоДокументу.ВесБрутто +ВесРеквизита,весПоДокументу.ВесБруттоПриВзвешиванииВПорту +ВесРеквизита) ;
	////РФП Осипов (20.09.2018)-		
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//
	//ВыборкаСертификат = Шапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//КоличествоГруппСертификатов = ВыборкаСертификат.Количество();
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	//
	//ИтогиВесНетто = 0;
	//ИтогиВесБрутто = 0;
	//
	//ТД = Справочники.Контрагенты.НайтиПоКоду("ПБ-000006");   //ООО "ТД РФП"
	//
	//СертификатыТД = РфпСервер.ПолучитьСертификатыТД();   
	//// 	- ТД_PEFC
	//// 	- ТД_PEFCcont   
	//
	//й = 0;
	//КоличествоПакетов = 0;
	
	//Пока ВыборкаСертификат.Следующий() Цикл
	//	
	//	й = й + 1;
	//	
	//	ВыборкаСтрокЗапасы = ВыборкаСертификат.Выбрать();
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПрипуски");
	//				
	//	БруттоПорт = 0;
	//	ИтогиВесНеттоСертификат = 0;
	//	ИтогиВесБруттоСертификат = 0;
	//	
	//	Пока ВыборкаСтрокЗапасы.Следующий() Цикл 	
	//		
	//		НоваяСтр = ТЗ.Добавить();    				
	//		ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаСтрокЗапасы); 
	//		
	//		БруттоПорт = ВыборкаСтрокЗапасы.БруттоПорт;
	//		
	//	КонецЦикла;
	//	
	//	Если БруттоПорт > 0 Тогда  			
	//		
	//		ОбщийВесБрутто1 = ТЗ.Итог("ВесБруттоП"); // только по этому сертификату, для исправления округлений 			
	//		ОбщийВесБрутто2 = 0;                     // итоговый по сертификату после пересчета
	//		
	//		Для каждого Стр Из ТЗ Цикл
	//			
	//			Стр.ВесБруттоП = ?(ОбщийВесБрутто = 0 Или Стр.БруттоПорт = 0, Стр.ВесБруттоП, Стр.БруттоПорт * Стр.ВесБруттоП/ОбщийВесБрутто);
	//			Стр.ВесБруттоП = Окр(Стр.ВесБруттоП, 3);
	//			ОбщийВесБрутто2 = ОбщийВесБрутто2 + Стр.ВесБруттоП;	
	//			
	//		КонецЦикла; 
	//		
	//		ВесПортПоСертификату =  Окр(?(ОбщийВесБрутто = 0, 0, БруттоПорт * ОбщийВесБрутто1/ОбщийВесБрутто),3);
	//		
	//		Дельта = ВесПортПоСертификату - ОбщийВесБрутто2;
	//		
	//		Для каждого Стр Из ТЗ Цикл 				
	//			
	//			Если Дельта > 0 Тогда
	//				
	//				Стр.ВесБруттоП = Стр.ВесБруттоП + 0.001;
	//				Дельта = Дельта - 0.001;
	//				
	//			ИначеЕсли Дельта < 0 Тогда	
	//				
	//				Стр.ВесБруттоП = Стр.ВесБруттоП - 0.001;
	//				Дельта = Дельта + 0.001;
	//				
	//			КонецЕсли;
	//			
	//			Стр.ВесНеттоП = Стр.ВесБруттоП - 0.01;
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли; 
	//	
	//	ИтогиВесНеттоСертификат = ТЗ.Итог("ВесНеттоП");
	//	ИтогиВесБруттоСертификат = ТЗ.Итог("ВесБруттоП");
	//	
	//	ИтогиВесНетто = ИтогиВесНетто + ИтогиВесНеттоСертификат;
	//	ИтогиВесБрутто = ИтогиВесБрутто + ИтогиВесБруттоСертификат;
	//	
	//	Если й = КоличествоГруппСертификатов И ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту > 0 Тогда      // для исправления ошибки округления при разбиении по сертификатам
	//		
	//		Дельта = ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту - ИтогиВесБрутто;     
	//		
	//		Для каждого Стр Из ТЗ Цикл 				
	//			
	//			Если Дельта > 0 Тогда
	//				
	//				Стр.ВесБруттоП = Стр.ВесБруттоП + 0.001;
	//				Дельта = Дельта - 0.001;
	//				
	//			ИначеЕсли Дельта < 0 Тогда	
	//				
	//				Стр.ВесБруттоП = Стр.ВесБруттоП - 0.001;
	//				Дельта = Дельта + 0.001;
	//				
	//			КонецЕсли;
	//			
	//			Стр.ВесНеттоП = Стр.ВесБруттоП - 0.01;
	//			
	//		КонецЦикла;	
	//		
	//		ИтогиВесНеттоСертификат = ТЗ.Итог("ВесНеттоП");
	//		ИтогиВесБруттоСертификат = ТЗ.Итог("ВесБруттоП");
	//	
	//	КонецЕсли; 
	
	//	Для каждого Стр Из ТЗ Цикл 	
	//		
	//		ОбластьМакета.Параметры.Заполнить(Стр);
	//		ТабличныйДокумент.Вывести(ОбластьМакета); 	
	//		
	//		КоличествоПакетов = КоличествоПакетов + 1;
	//		
	//	КонецЦикла; 
	//	
	//	ТЗ.Очистить();
	//						
	//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
	//	ОбластьМакета.Параметры.Заполнить(ВыборкаСертификат);
	//	ОбластьМакета.Параметры.ВесНеттоП = ИтогиВесНеттоСертификат;
	//	ОбластьМакета.Параметры.ВесБруттоП = ИтогиВесБруттоСертификат;
	//	
	//	Если ВыборкаСертификат.Продавец = ТД Тогда
	//	
	//		Если СтрНайти(ВыборкаСертификат.СтрокаСертификат, "controlled") Тогда
	//			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFCcont") + ">:"; 			
	//		Иначе	
	//			ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + СертификатыТД.Получить("ТД_PEFC") + ">:";
	//		КонецЕсли;
	//		
	//	ИначеЕсли ЗначениеЗаполнено(ВыборкаСертификат.СтрокаСертификат) Тогда
	//		
	//		ОбластьМакета.Параметры.СтрокаСертификат  = "Сертифицированная продукция <" + ВыборкаСертификат.СтрокаСертификат + ">:";
	//	
	//	Иначе
	//		
	//		ОбластьМакета.Параметры.СтрокаСертификат  = "Не сертифицированная продукция:"
	//		
	//	КонецЕсли;
	//	
	//	ТабличныйДокумент.Вывести(ОбластьМакета);
	//	
	//КонецЦикла; 
	//
	//ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
	//ОбластьМакета.Параметры.Заполнить(Шапка);
	//ОбластьМакета.Параметры.ВесНеттоП = ?(ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту = 0, ИтогиВесНетто,ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту - 0.01 * КоличествоПакетов);
	//ОбластьМакета.Параметры.ВесБруттоП = ?(ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту = 0, ИтогиВесБрутто,ТекущийДокумент.ВесБруттоПриВзвешиванииВПорту); 
	//
	//ТабличныйДокумент.Вывести(ОбластьМакета);
	
	
КонецПроцедуры //СформироватьЖДСпецификациюПМ()	

Процедура СформироватьЖДСпецификациюШпон(ТабличныйДокумент, ТекущийДокумент,СРеквизитом)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировкаЗапасов.ПФ_ЖелезнодорожнаяСпецификацияШпон");
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьКонтейнера		= Макет.ПолучитьОбласть("Контейнер");
	ОбластьГОСТ 			= Макет.ПолучитьОбласть("Гост");
	ОбластьШапкаТабл		= Макет.ПолучитьОбласть("ШапкаТаблицыПрипуски");
	ОбластьИтогПоТаблице 	= Макет.ПолучитьОбласть("СтрокаИтоги");
	ОбластьПломбы 			= Макет.ПолучитьОбласть("Пломбы");
	
	
	Контейнер 	=  Ложь;
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",	ТекущийДокумент); 
	Запрос.УстановитьПараметр("ЭтоШпон",Истина);
	
	Запрос.Текст = ТекстЗапросаЖД_Шпон();
	
	ТЗ 				= Запрос.ВыполнитьПакет();
	Шапка 			= Тз[0].Выгрузить();
	ДанныеТЧ_Итог	= ТЗ[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);// ОБЩИЕ);
	Порода_Сорт 	= ТЗ[8].Выгрузить();
	
	Если СРеквизитом тогда
		ОбластьРеквизитШапка 		= Макет.ПолучитьОбласть("ШапкаРеквизит");
		ОбластьИтогиПоРеквизитам 	= Макет.ПолучитьОбласть("ИтогРеквизит");
		ДанныеПоРеквизитам 		= Тз[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ОБЩИЕ");
	КонецЕсли;
	
	Для  каждого СтрокаДанных из Шапка цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры,СтрокаДанных);
		ОбластьЗаголовок.Параметры.Дата = Формат(СтрокаДанных.Дата, "ДЛФ=DD");
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВесКонтейнера) Или  ЗначениеЗаполнено(СтрокаДанных.СтрокаИДКонтейнеров) тогда
			ЗаполнитьЗначенияСвойств(ОбластьКонтейнера.Параметры,СтрокаДанных);
			Контейнер = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Номенклатура = Порода_Сорт.ВыгрузитьКолонку("Номенклатура");
	Номенклатура = СвернутьМассив(Номенклатура);
	ОбластьЗаголовок.Параметры.Номенклатура = СтрСоединить(Номенклатура,",");
	
	Порода = Порода_Сорт.ВыгрузитьКолонку("Порода");
	Порода = СвернутьМассив(Порода);
	ОбластьЗаголовок.Параметры.Породы = СтрСоединить(Порода,",");
	
	Сорта = Порода_Сорт.ВыгрузитьКолонку("Сорт");
	Сорта = СвернутьМассив(Сорта); 
	ОбластьЗаголовок.Параметры.Сорта = СтрСоединить(Сорта,",");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Если Контейнер тогда
		ТабличныйДокумент.Вывести(ОбластьКонтейнера);
	КонецЕсли;		
	
	ДанныеТЧ_Итог.Следующий();		// Общий итог
	
	ВесБруттоПриВзвешиванииВПорту 			= ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту;
	ИтогиВесБруттоЗапрос 					= ДанныеТЧ_Итог.ВесБрутто;
	Дельта									= ВесБруттоПриВзвешиванииВПорту - ИтогиВесБруттоЗапрос;
	
	ДельтаОбъем = ДанныеТЧ_Итог.ОбъемП_2 - Окр(ДанныеТЧ_Итог.ОбъемП, 2);	
	
	ВесПриВзвешивании = ЗначениеЗаполнено(ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту);
	
	Если ЗначениеЗаполнено(ДанныеТЧ_Итог.ВесРеквизита) тогда 
		ОбластьГОСТ.Параметры.ВесГруза = ?(ВесПриВзвешивании,ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту+ДанныеТЧ_Итог.ВесРеквизита ,ДанныеТЧ_Итог.ВесБрутто + ДанныеТЧ_Итог.ВесРеквизита);
	Иначе 
		ОбластьГОСТ.Параметры.ВесГруза =  ?(ВесПриВзвешивании,ДанныеТЧ_Итог.ВесБруттоПриВзвешиванииВПорту,ДанныеТЧ_Итог.ВесБрутто); 
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьГОСТ);
	
	
	ДанныеТЧ = ДанныеТЧ_Итог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);//ПО Сертификату
	
	ИтогиВесНетто = 0;
	ИтогиВесБрутто = 0;
	ИтогиКоличествоПакетов = 0;
	ИтогиКоличество = 0;
	ИтогиОбъем = 0;
	ИтогиОбъемП = 0;
	
	Пока ДанныеТЧ.Следующий() цикл           //по сертификату
		
		ИтогиВесНеттоСертификат = 0;
		ИтогиВесБруттоСертификат = 0;
		ИтогиКоличествоПакетовСертификат = 0;
		ИтогиКоличествоСертификат = 0;
		ИтогиОбъемСертификат = 0;
		ИтогиОбъемПСертификат = 0;
		
		
		//	ВесПриВзвешивании = ЗначениеЗаполнено(ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту);
		//	
		//	Если ЗначениеЗаполнено(ДанныеТЧ.ВесРеквизита) тогда 
		//		ОбластьГОСТ.Параметры.ВесГруза = ?(ВесПриВзвешивании,ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту+ДанныеТЧ.ВесРеквизита ,ДанныеТЧ.ВесБрутто + ДанныеТЧ.ВесРеквизита);
		//	Иначе 
		//		ОбластьГОСТ.Параметры.ВесГруза =  ?(ВесПриВзвешивании,ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту,ДанныеТЧ.ВесБрутто); 
		//	КонецЕсли;
		//
		//	ТабличныйДокумент.Вывести(ОбластьГОСТ);
		ТабличныйДокумент.Вывести(ОбластьШапкаТабл);
		
		ОбластьИтогПоСертификату = Макет.ПолучитьОбласть("СтрокаИтогиСертификат");
		ЗаполнитьЗначенияСвойств(ОбластьИтогПоСертификату.Параметры,ДанныеТЧ);
		ДанныеСтрокиТЧ = ДанныеТЧ.Выбрать();
		
		//Дельта = ВесБруттоПриВзвешиванииВПорту - ИтогиВесБруттоЗапрос;
		
		Пока ДанныеСтрокиТЧ.Следующий() цикл  
			
			СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаПрипуски");
			ЗаполнитьЗначенияСвойств(СтрокаТЧ.Параметры,ДанныеСтрокиТЧ);
			Если не ДанныеСтрокиТЧ.РасчетныеДанные тогда 	
				Если ВесБруттоПриВзвешиванииВПорту > 0 Тогда
					
					Если Дельта > 0  и Дельта <> 0 Тогда
						
						СтрокаТЧ.Параметры.ВесБрутто = ДанныеСтрокиТЧ.ВесБрутто + 0.001;
						Дельта = Дельта - 0.001;
						
					ИначеЕсли Дельта < 0 И Дельта <> 0 Тогда	
						
						СтрокаТЧ.Параметры.ВесБрутто = ДанныеСтрокиТЧ.ВесБрутто - 0.001;
						Дельта = Дельта + 0.001;
						
					КонецЕсли;
					
					СтрокаТЧ.Параметры.ВесНетто = СтрокаТЧ.Параметры.ВесБрутто - 0.01;
					
				КонецЕсли; 	
			КонецЕсли;	
				//СтрокаТЧ.Параметры.ОбъемП = ДанныеСтрокиТЧ.ОбъемП_2;
				
				//Если ДельтаОбъем > 0  и ДельтаОбъем <> 0 Тогда
				//	
				//	СтрокаТЧ.Параметры.ОбъемП = ДанныеСтрокиТЧ.ОбъемП_2 - 0.01;
				//	ДельтаОбъем = ДельтаОбъем - 0.01;
				//	
				//ИначеЕсли ДельтаОбъем < 0 И ДельтаОбъем <> 0 Тогда	
				//	
				//	СтрокаТЧ.Параметры.ОбъемП = ДанныеСтрокиТЧ.ОбъемП_2 + 0.01;
				//	ДельтаОбъем = ДельтаОбъем + 0.01;
				//	
				//КонецЕсли;   						
				
				
				ИтогиВесНеттоСертификат 			= ИтогиВесНеттоСертификат + СтрокаТЧ.Параметры.ВесНетто;
				ИтогиВесБруттоСертификат 			= ИтогиВесБруттоСертификат + СтрокаТЧ.Параметры.ВесБрутто; 
				ИтогиКоличествоПакетовСертификат 	= ИтогиКоличествоПакетовСертификат + ДанныеСтрокиТЧ.КоличествоПакетов;
				ИтогиКоличествоСертификат 			= ИтогиКоличествоСертификат + СтрокаТЧ.Параметры.Количество;
				ИтогиОбъемСертификат 				= ИтогиОбъемСертификат + СтрокаТЧ.Параметры.Объем;
				//ИтогиОбъемПСертификат 				= ИтогиОбъемПСертификат + СтрокаТЧ.Параметры.ОбъемП;
						
			ТабличныйДокумент.Вывести(СтрокаТЧ);
			
		КонецЦикла;
		
		ОбластьИтогПоСертификату.Параметры.ВесНетто  = ИтогиВесНеттоСертификат;
		ОбластьИтогПоСертификату.Параметры.ВесБрутто = ИтогиВесБруттоСертификат;
		//ОбластьИтогПоСертификату.Параметры.ОбъемП    = ИтогиОбъемПСертификат;
		ОбластьИтогПоСертификату.Параметры.КоличествоПакетов = ТекущийДокумент.КоличествоПакетовДокумента;
		
		
		ТабличныйДокумент.Вывести(ОбластьИтогПоСертификату);
		//ЗаполнитьЗначенияСвойств(ОбластьИтогПоТаблице.Параметры,ДанныеТЧ);
		
		ИтогиВесНетто = ИтогиВесНетто + ИтогиВесНеттоСертификат;
		ИтогиВесБрутто = ИтогиВесБрутто + ИтогиВесБруттоСертификат;
		//ИтогиКоличествоПакетов = ИтогиКоличествоПакетов + ИтогиКоличествоПакетовСертификат;
		ИтогиКоличество = ИтогиКоличество + ИтогиКоличествоСертификат;
		ИтогиОбъем = ИтогиОбъем + ИтогиОбъемСертификат;
		//ИтогиОбъемП = ИтогиОбъемП + ИтогиОбъемПСертификат;			
		
	КонецЦикла;   
	
	ОбластьИтогПоТаблице.Параметры.ВесНетто = ИтогиВесНетто;
	ОбластьИтогПоТаблице.Параметры.ВесБрутто = ИтогиВесБрутто;
	ОбластьИтогПоТаблице.Параметры.КоличествоПакетов = ТекущийДокумент.КоличествоПакетовДокумента;
	ОбластьИтогПоТаблице.Параметры.Количество = ИтогиКоличество;             
	ОбластьИтогПоТаблице.Параметры.Объем = ИтогиОбъем;
	//ОбластьИтогПоТаблице.Параметры.ОбъемП = ИтогиОбъемП;
	
	ТабличныйДокумент.Вывести(ОбластьИтогПоТаблице);  		
	
	Если СРеквизитом тогда
		ТабличныйДокумент.Вывести(ОбластьРеквизитШапка);
		Пока ДанныеПоРеквизитам.Следующий()цикл
			ЗаполнитьЗначенияСвойств(ОбластьИтогиПоРеквизитам.Параметры,ДанныеПоРеквизитам);
			ДетальныеДанные = ДанныеПоРеквизитам.Выбрать();
			Пока ДетальныеДанные.Следующий() цикл
				СтрокаРеквизита = Макет.ПолучитьОбласть("СтрокаРеквизит");
				ЗаполнитьЗначенияСвойств(СтрокаРеквизита.Параметры,ДетальныеДанные);
				ТабличныйДокумент.Вывести(СтрокаРеквизита);
			КонецЦикла;
			ТабличныйДокумент.Вывести(ОбластьИтогиПоРеквизитам);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбластьПломбы.Параметры,ТекущийДокумент);
	ТабличныйДокумент.Вывести(ОбластьПломбы);	
	
КонецПроцедуры	

Функция СвернутьМассив(пМассив) Экспорт
	
	Если пМассив.Количество() > 1 Тогда
		ТЗ = Новый ТаблицаЗначений;
		ИмяКолонки = "Колонка1";
		ТЗ.Колонки.Добавить(ИмяКолонки);
		Для Индекс = 0 По пМассив.Количество()-1 Цикл
			ТЗ.Добавить();
		КонецЦикла;
		ТЗ.ЗагрузитьКолонку(пМассив, ИмяКолонки);
		ТЗ.Свернуть(ИмяКолонки, "");
		
		Возврат ТЗ.ВыгрузитьКолонку(ИмяКолонки);
	Иначе
		Результат = Новый Массив;
		Для Каждого Элемент Из пМассив Цикл
			Результат.Добавить(Элемент);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	
КонецФункции	

Функция ТекстЗапросаЖД_ПМ_Новый()
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Номер КАК Номер,
	|	алк_ТранспортировкаЗапасов.Дата КАК Дата,
	|	алк_ТранспортировкаЗапасов.Грузоотправитель КАК Грузоотправитель,
	|	алк_ТранспортировкаЗапасов.Грузополучатель КАК Грузополучатель,
	|	алк_ТранспортировкаЗапасов.Покупатель КАК Покупатель,
	|	алк_ТранспортировкаЗапасов.Заказ КАК Заказ,
	|	алк_ТранспортировкаЗапасов.ИдентификаторТС КАК ИдентификаторТС,
	|	алк_ТранспортировкаЗапасов.ВидТранспорта КАК ВидТранспорта,
	|	алк_ТранспортировкаЗапасов.ВесКонтейнера КАК ВесКонтейнера,
	|	алк_ТранспортировкаЗапасов.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	|	алк_ТранспортировкаЗапасов.Ссылка КАК Транспортировка,
	|	алк_ТранспортировкаЗапасов.Продавец КАК Поставщик
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБрутто,
	|	алк_ТранспортировкаЗапасовЗапасы.Заказ КАК Заказ,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита КАК ВесРеквизита,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Транспортировка,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня1,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит,
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка КАК Реквизит
	|ПОМЕСТИТЬ ВТ_ДанныеТЧ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасовРеквизит.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ДанныеТЧ.ВесНетто) КАК ВесНетто,
	|	СУММА(ВТ_ДанныеТЧ.ВесБрутто) КАК ВесБрутто,
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ДанныеТЧ.Транспортировка КАК Транспортировка
	|ПОМЕСТИТЬ ВТ_ИтогиВес
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ДанныеТЧ.Транспортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
	|	алк_ПараметрыХарактеристик.Порода КАК Порода,
	|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	|	алк_ПараметрыХарактеристик.Длина КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ
	|ПОМЕСТИТЬ ВТ_Характеристики
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеТЧ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине КАК ПрипускПрипускПоШирине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине КАК ПрипускПрипускПоДлине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск КАК Припуск,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Припуски
	|ИЗ
	|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	|ГДЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеТЧ.Заказ КАК Заказ
	|			ИЗ
	|				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЧ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_ДанныеТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеТЧ.Характеристика КАК Характеристика,
	|	ВТ_ДанныеТЧ.КоличествоСостав КАК КоличествоСостав,
	|	ВТ_ДанныеТЧ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ_ДанныеТЧ.Объем КАК Объем,
	|	ВТ_ДанныеТЧ.ОбъемТаможня КАК ОбъемП,
	|	ВТ_ДанныеТЧ.ВесНетто * ВложенныйЗапрос.Коэффициент КАК ВесНетто,
	|	ВТ_ДанныеТЧ.ВесБрутто * ВложенныйЗапрос.Коэффициент КАК ВесБрутто,
	|	ВТ_ДанныеТЧ.Заказ КАК Заказ,
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_Характеристики.Порода КАК Порода,
	|	ВТ_Характеристики.Сорт КАК Сорт,
	|	ВТ_Характеристики.Длина КАК Длина,
	|	ВТ_Характеристики.Сечение КАК Сечение,
	|	ВТ_Характеристики.Влажность КАК Влажность,
	|	(ВТ_Характеристики.ДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000 КАК ДлинаП,
	|	ВТ_Характеристики.ШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0) КАК ШиринаП,
	|	ВТ_Характеристики.ТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0) КАК ТолщинаП,
	|	ВТ_ДанныеТЧ.ВесРеквизита КАК ВесРеквизита,
	|	ВТ_Характеристики.ДлинаММ / 1000 КАК ДлинаММ,
	|	ВТ_Характеристики.ШиринаММ КАК ШиринаММ,
	|	ВТ_Характеристики.ТолщинаММ КАК ТолщинаММ,
	|	ВТ_ДанныеТЧ.Сертификат КАК Сертификат,
	|	ВТ_ДанныеТЧ.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ИтоговаяТЧ
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
	|		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Характеристики.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	|		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Припуски.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА ВТ_ИтогиВес.ВесБрутто > 0
	|						И ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту > 0
	|					ТОГДА ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту / ВТ_ИтогиВес.ВесБрутто
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК Коэффициент,
	|			ВТ_ИтогиВес.Транспортировка КАК Транспортировка
	|		ИЗ
	|			ВТ_ИтогиВес КАК ВТ_ИтогиВес) КАК ВложенныйЗапрос
	|		ПО ВТ_ДанныеТЧ.Транспортировка = ВложенныйЗапрос.Транспортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТЧ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_ИтоговаяТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ИтоговаяТЧ.Характеристика КАК Характеристика,
	|	ВТ_ИтоговаяТЧ.КоличествоСостав КАК Количество,
	|	ВТ_ИтоговаяТЧ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ_ИтоговаяТЧ.Объем КАК Объем,
	|	ВТ_ИтоговаяТЧ.ВесНетто КАК ВесНетто,
	|	ВТ_ИтоговаяТЧ.ВесБрутто КАК ВесБрутто,
	|	ВТ_ИтоговаяТЧ.Заказ КАК Заказ,
	|	ВТ_ИтоговаяТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	|	ВТ_ИтоговаяТЧ.Сорт КАК Сорт,
	|	ВТ_ИтоговаяТЧ.Длина КАК Длина,
	|	ВТ_ИтоговаяТЧ.Сечение КАК Сечение,
	|	ВТ_ИтоговаяТЧ.Влажность КАК Влажность,
	|	ВТ_ИтоговаяТЧ.ДлинаП КАК ДлинаП,
	|	ВТ_ИтоговаяТЧ.ШиринаП КАК ШиринаП,
	|	ВТ_ИтоговаяТЧ.ТолщинаП КАК ТолщинаП,
	|	ВТ_ИтоговаяТЧ.ОбъемП КАК ОбъемП,
	|	ВТ_ИтоговаяТЧ.ВесРеквизита / 1000 КАК ВесРеквизита,
	|	ВТ_ИтоговаяТЧ.ДлинаММ КАК ДлинаММ,
	|	ВТ_ИтоговаяТЧ.ШиринаММ КАК Ширина,
	|	ВТ_ИтоговаяТЧ.ТолщинаММ КАК Толщина,
	|	ВТ_ИтоговаяТЧ.Сертификат КАК Сертификат,
	|	ВТ_ИтоговаяТЧ.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_ИтоговаяТЧ КАК ВТ_ИтоговаяТЧ
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоПакетов),
	|	СУММА(Объем),
	|	СУММА(ВесНетто),
	|	СУММА(ВесБрутто),
	|	СУММА(ОбъемП),
	|	МАКСИМУМ(ВесРеквизита)
	|ПО
	|	Сертификат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	|	ВТ_ИтоговаяТЧ.Сорт КАК Сорт
	|ИЗ
	|	ВТ_ИтоговаяТЧ КАК ВТ_ИтоговаяТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИтоговаяТЧ.Порода,
	|	ВТ_ИтоговаяТЧ.Сорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЧ.Реквизит,
	|	ВТ_ДанныеТЧ.УпакРеквизит,
	|	СУММА(ВТ_ДанныеТЧ.ВесРеквизита) КАК ВесРеквизита
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТЧ.Реквизит,
	|	ВТ_ДанныеТЧ.УпакРеквизит
	|ИТОГИ
	|	СУММА(ВесРеквизита)
	|ПО
	|	ОБЩИЕ" ;
	//Текст =
	//"ВЫБРАТЬ
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	//|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	//|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	//|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	//|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	//|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	//|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	//|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	//|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	//|	алк_ТранспортировкаЗапасовЗапасы.Характеристика
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	//|ГДЕ
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине
	//|ПОМЕСТИТЬ ВТ_Припуски
	//|ИЗ
	//|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	//|ГДЕ
	//|	(алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Заказ
	//|			ИЛИ алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	//|				(ВЫБРАТЬ
	//|					алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование.Заказ
	//|				ИЗ
	//|					Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	//|				ГДЕ
	//|					алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = &ТекущийДокумент))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ПараметрыХарактеристик.Характеристика,
	//|	алк_ПараметрыХарактеристик.Порода,
	//|	алк_ПараметрыХарактеристик.Сорт,
	//|	алк_ПараметрыХарактеристик.Длина,
	//|	алк_ПараметрыХарактеристик.Сечение,
	//|	алк_ПараметрыХарактеристик.Влажность,
	//|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ
	//|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	//|ИЗ
	//|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//|ГДЕ
	//|	алк_ПараметрыХарактеристик.Характеристика В
	//|			(ВЫБРАТЬ
	//|				ВТ.Характеристика
	//|			ИЗ
	//|				ВТ КАК ВТ)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3
	//|ПОМЕСТИТЬ ВТ_Плотность
	//|ИЗ
	//|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	//|			&ДатаСреза,
	//|			Номенклатура В
	//|				(ВЫБРАТЬ
	//|					ВТ.Номенклатура
	//|				ИЗ
	//|					ВТ КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ.Ссылка.Номер КАК Номер,
	//|	ВТ.Ссылка.Дата КАК ДатаДокумента,
	//|	ВТ.Ссылка КАК Ссылка,
	//|	ВТ.СерийныйНомер КАК Пакет,
	//|	ВТ.НомерСтроки,
	//|	ВТ.Ссылка.Организация.Префикс КАК Префикс,
	//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ.Ссылка.Заказ) КАК ЗаказПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузоотправитель) КАК ГрузоотправительПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузополучатель) КАК ГрузополучательПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Покупатель) КАК ПокупательПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Продавец) КАК ПродавецПредставление,
	//|	ВТ.КоличествоСостав КАК Количество,
	//|	ВТ.Объем КАК Объем,
	//|	ВЫРАЗИТЬ(алк_ПараметрыПакетовСрезПоследних.КоличествоСостав * ((ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000) КАК ЧИСЛО(15, 2)) КАК ОбъемП,
	//|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ КАК Ширина,
	//|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ КАК Толщина,
	//|	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ / 1000 КАК Длина,
	//|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0) КАК ТолщинаП,
	//|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0) КАК ШиринаП,
	//|	(ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000 КАК ДлинаП,
	//|	ВТ.КоличествоПакетов КАК КоличествоПакетов,
	//|	ВТ.Номенклатура,
	//|	ВТ_ПараметрыХарактеристик.Порода,
	//|	ВТ_ПараметрыХарактеристик.Сорт КАК Сорт,
	//|	ВТ.Ссылка.ИдентификаторТС КАК ИдентификаторТС,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.ВидТранспорта) КАК ВидТранспортаПредставление,
	//|	ВТ.Ссылка.Грузоподъемность КАК Грузоподъемность,
	//|	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	//|	ВТ.Ссылка.Пломбы КАК Пломбы,
	//|	ВТ.Ссылка.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	//|	ВТ_ПараметрыХарактеристик.Влажность,
	//|	ВТ.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК БруттоПорт,
	//|	ВТ.Ссылка.ВесКонтейнера КАК ВесКонтейнера,
	//|	ВТ.Ссылка.Продавец КАК Продавец,
	//|	ВТ_Припуски.Припуск,
	//|	ВТ.КоличествоСостав,
	//|	ВТ.Характеристика КАК Характеристика,
	//|	ВТ_Припуски.ПрипускПрипускПоШирине,
	//|	ВТ_Припуски.ПрипускПрипускПоТолщине,
	//|	ВТ_Припуски.ПрипускПрипускПоДлине,
	//|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска
	//|ПОМЕСТИТЬ ВТ_Итог
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	//|				&ДатаСреза,
	//|				СерийныйНомер В
	//|					(ВЫБРАТЬ
	//|						ВТ.СерийныйНомер
	//|					ИЗ
	//|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
	//|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	//|		ПО ВТ.Характеристика = ВТ_Припуски.Характеристика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	//|		ПО ВТ.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика,
	//|	ВТ_Плотность КАК ВТ_Плотность
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Итог.Ссылка КАК Ссылка,
	//|	ВТ_Итог.СтрокаСертификат КАК СтрокаСертификат,
	//|	ВТ_Итог.Номер КАК Номер,
	//|	ВТ_Итог.ДатаДокумента КАК ДатаДокумента,
	//|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	//|	ВТ_Итог.Префикс,
	//|	ВТ_Итог.ЗаказПредставление КАК ЗаказПредставление,
	//|	ВТ_Итог.ГрузоотправительПредставление КАК ГрузоотправительПредставление,
	//|	ВТ_Итог.ГрузополучательПредставление КАК ГрузополучательПредставление,
	//|	ВТ_Итог.ПокупательПредставление КАК ПокупательПредставление,
	//|	ВТ_Итог.Продавец КАК Продавец,
	//|	ВТ_Итог.ПродавецПредставление КАК ПродавецПредставление,
	//|	ВТ_Итог.ИдентификаторТС КАК ИдентификаторТС,
	//|	ВТ_Итог.ВидТранспортаПредставление КАК ВидТранспортаПредставление,
	//|	ВТ_Итог.Грузоподъемность,
	//|	ВТ_Итог.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	//|	ВТ_Итог.БруттоПорт КАК БруттоПорт,
	//|	ВТ_Итог.Пломбы КАК Пломбы,
	//|	ВТ_Итог.ВесКонтейнера,
	//|	ВТ_Итог.Пакет,
	//|	ВТ_Итог.Номенклатура,
	//|	ВТ_Итог.Порода,
	//|	ВТ_Итог.Сорт,
	//|	ВТ_Итог.Влажность,
	//|	ВТ_Итог.Количество КАК Количество,
	//|	ВТ_Итог.КоличествоСостав,
	//|	ВТ_Итог.КоличествоПакетов КАК КоличествоПакетов,
	//|	ВТ_Итог.Объем КАК Объем,
	//|	ВТ_Итог.ОбъемП КАК ОбъемП,
	//|	ВТ_Итог.Ширина,
	//|	ВТ_Итог.ШиринаП,
	//|	ВТ_Итог.Толщина,
	//|	ВТ_Итог.ТолщинаП,
	//|	ВТ_Итог.Длина,
	//|	ВТ_Итог.ДлинаП,
	//|	ВЫРАЗИТЬ(ВТ_Итог.ОбъемП * ВТ_Плотность.ПлотностьКгМ3 / 1000 КАК ЧИСЛО(15, 3)) КАК ВесНеттоП,
	//|	ВЫРАЗИТЬ(0.01 + ВТ_Итог.ОбъемП * ВТ_Плотность.ПлотностьКгМ3 / 1000 КАК ЧИСЛО(15, 3)) КАК ВесБруттоП,
	//|	ВТ_Плотность.ПлотностьКгМ3,
	//|	ВТ_Итог.Припуск,
	//|	ВТ_Итог.ПрипускПрипускПоШирине,
	//|	ВТ_Итог.ПрипускПрипускПоТолщине,
	//|	ВТ_Итог.ПрипускПрипускПоДлине
	//|ИЗ
	//|	ВТ_Итог КАК ВТ_Итог
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Плотность КАК ВТ_Плотность
	//|		ПО ВТ_Итог.Номенклатура = ВТ_Плотность.Номенклатура
	//|			И ВТ_Итог.Порода = ВТ_Плотность.Порода
	//|			И ВТ_Итог.Влажность = ВТ_Плотность.Влажность
	//|			И ВТ_Итог.БоковаяДоска = ВТ_Плотность.БоковаяДоска
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки
	//|ИТОГИ
	//|	МАКСИМУМ(Номер),
	//|	МАКСИМУМ(ДатаДокумента),
	//|	МАКСИМУМ(ЗаказПредставление),
	//|	МАКСИМУМ(ГрузоотправительПредставление),
	//|	МАКСИМУМ(ГрузополучательПредставление),
	//|	МАКСИМУМ(ПокупательПредставление),
	//|	МАКСИМУМ(Продавец),
	//|	МАКСИМУМ(ПродавецПредставление),
	//|	МАКСИМУМ(ИдентификаторТС),
	//|	МАКСИМУМ(ВидТранспортаПредставление),
	//|	МАКСИМУМ(СтрокаИДКонтейнеров),
	//|	МАКСИМУМ(БруттоПорт),
	//|	МАКСИМУМ(Пломбы),
	//|	СУММА(Количество),
	//|	СУММА(КоличествоПакетов),
	//|	СУММА(Объем),
	//|	СУММА(ОбъемП),
	//|	СУММА(ВесНеттоП),
	//|	СУММА(ВесБруттоП)
	//|ПО
	//|	Ссылка,
	//|	СтрокаСертификат";
	//
	Возврат Текст;		
	
КонецФункции

Функция ТекстЗапросаЖД_ПМ_Новый_1()
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Номер КАК Номер,
	|	алк_ТранспортировкаЗапасов.Дата КАК Дата,
	|	алк_ТранспортировкаЗапасов.Грузоотправитель КАК Грузоотправитель,
	|	алк_ТранспортировкаЗапасов.Грузополучатель КАК Грузополучатель,
	|	алк_ТранспортировкаЗапасов.Покупатель КАК Покупатель,
	|	алк_ТранспортировкаЗапасов.Заказ КАК Заказ,
	|	алк_ТранспортировкаЗапасов.ИдентификаторТС КАК ИдентификаторТС,
	|	алк_ТранспортировкаЗапасов.ВидТранспорта КАК ВидТранспорта,
	|	алк_ТранспортировкаЗапасов.ВесКонтейнера КАК ВесКонтейнера,
	|	алк_ТранспортировкаЗапасов.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	|	алк_ТранспортировкаЗапасов.Ссылка КАК Транспортировка,
	|	алк_ТранспортировкаЗапасов.Продавец КАК Поставщик,
	|	алк_ТранспортировкаЗапасов.Пломбы КАК Пломбы
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	|	1 КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДокументОснование.Заказ ЕСТЬ NULL
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДокументОснование.Заказ
	|	КОНЕЦ КАК Заказ,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита КАК ВесРеквизита,
	|	алк_ТранспортировкаЗапасовЗапасы.Сертификат КАК Сертификат,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Транспортировка,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня1,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит КАК УпакРеквизит,
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка КАК Реквизит,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура1,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт КАК ВесНеттоПорт,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт КАК ВесБруттоПорт,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт ЕСТЬ NULL
	|				И алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетныеДанные
	|ПОМЕСТИТЬ ВТ_ДанныеТЧ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасовРеквизит.Ссылка
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ДанныеТЧ.ВесНетто) КАК ВесНетто,
	|	СУММА(ВТ_ДанныеТЧ.ВесБрутто) КАК ВесБрутто,
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ДанныеТЧ.Транспортировка КАК Транспортировка
	|ПОМЕСТИТЬ ВТ_ИтогиВес
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ДанныеТЧ.Транспортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
	|	алк_ПараметрыХарактеристик.Порода КАК Порода,
	|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	|	алк_ПараметрыХарактеристик.Длина КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ
	|ПОМЕСТИТЬ ВТ_Характеристики
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеТЧ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине КАК ПрипускПрипускПоШирине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине КАК ПрипускПрипускПоДлине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск КАК Припуск,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Припуски
	|ИЗ
	|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	|ГДЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеТЧ.Заказ КАК Заказ
	|			ИЗ
	|				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоШирине КАК ВариантПрипускаПрипускПоШирине,
	|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоТолщине КАК ВариантПрипускаПрипускПоТолщине,
	|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоДлине КАК ВариантПрипускаПрипускПоДлине,
	|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск КАК ВариантПрипуска,
	|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|ПОМЕСТИТЬ Вт_ПрипускиАддендума
	|ИЗ
	|	РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	|			,
	|			СерийныйНомер В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеТЧ.СерийныйНомер
	|				ИЗ
	|					ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЧ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_ДанныеТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеТЧ.Характеристика КАК Характеристика,
	|	ВТ_ДанныеТЧ.КоличествоСостав КАК КоличествоСостав,
	|	ВТ_ДанныеТЧ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ_ДанныеТЧ.Объем КАК Объем,
	|	ВТ_ДанныеТЧ.ОбъемТаможня КАК ОбъемП,
	|	ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ВесНетто * ВложенныйЗапрос.Коэффициент КАК ЧИСЛО(15, 3)) КАК ВесНетто,
	|	ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ВесБрутто * ВложенныйЗапрос.Коэффициент КАК ЧИСЛО(15, 3)) КАК ВесБрутто,
	|	ВТ_ДанныеТЧ.Заказ КАК Заказ,
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_Характеристики.Порода КАК Порода,
	|	ВТ_Характеристики.Сорт КАК Сорт,
	|	ВТ_Характеристики.Длина КАК Длина,
	|	ВТ_Характеристики.Сечение КАК Сечение,
	|	ВТ_Характеристики.Влажность КАК Влажность,
	|	ВЫБОР
	|		КОГДА ВТ_Припуски.ПрипускПрипускПоДлине <> 0
	|			ТОГДА (ВТ_Характеристики.ДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000
	|		ИНАЧЕ (ВТ_Характеристики.ДлинаММ + ЕСТЬNULL(ВложенныйЗапрос.ПрипускПоДлинеАддендум, 0)) / 1000
	|	КОНЕЦ КАК ДлинаП,
	|	ВЫБОР
	|		КОГДА ВТ_Припуски.ПрипускПрипускПоШирине <> 0
	|			ТОГДА ВТ_Характеристики.ШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)
	|		ИНАЧЕ ВТ_Характеристики.ШиринаММ + ЕСТЬNULL(ВложенныйЗапрос.ПрипускПоШиринеАддендум, 0)
	|	КОНЕЦ КАК ШиринаП,
	|	ВЫБОР
	|		КОГДА ВТ_Припуски.ПрипускПрипускПоТолщине <> 0
	|			ТОГДА ВТ_Характеристики.ТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)
	|		ИНАЧЕ ВТ_Характеристики.ТолщинаММ + ЕСТЬNULL(ВложенныйЗапрос.ПрипускПоТолщинеАддендум, 0)
	|	КОНЕЦ КАК ТолщинаП,
	|	ВТ_ДанныеТЧ.ВесРеквизита КАК ВесРеквизита,
	|	ВТ_Характеристики.ДлинаММ / 1000 КАК ДлинаММ,
	|	ВТ_Характеристики.ШиринаММ КАК ШиринаММ,
	|	ВТ_Характеристики.ТолщинаММ КАК ТолщинаММ,
	|	ВТ_ДанныеТЧ.Сертификат КАК Сертификат,
	|	ВТ_ДанныеТЧ.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ОбъемТаможня КАК ЧИСЛО(15, 2)) КАК ОбъемП_2,
	|	ВТ_Припуски.ПрипускПрипускПоШирине КАК ПрипускПрипускПоШирине,
	|	ВТ_Припуски.ПрипускПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
	|	ВТ_Припуски.ПрипускПрипускПоДлине КАК ПрипускПрипускПоДлине,
	|	ВложенныйЗапрос.ПрипускПоШиринеАддендум КАК ПрипускПоШиринеАддендум,
	|	ВложенныйЗапрос.ПрипускПоТолщинеАддендум КАК ПрипускПоТолщинеАддендум,
	|	ВложенныйЗапрос.ПрипускПоДлинеАддендум КАК ПрипускПоДлинеАддендум,
	|	ВТ_ДанныеТЧ.ВесНеттоПорт КАК ВесНеттоПорт,
	|	ВТ_ДанныеТЧ.ВесБруттоПорт КАК ВесБруттоПорт,
	|	ВТ_ДанныеТЧ.РасчетныеДанные
	|ПОМЕСТИТЬ ВТ_ИтоговаяТЧ
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
	|		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Характеристики.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	|		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Припуски.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА ВТ_ИтогиВес.ВесБрутто > 0
	|						И ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту > 0
	|					ТОГДА ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту / ВТ_ИтогиВес.ВесБрутто
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК Коэффициент,
	|			ВТ_ИтогиВес.Транспортировка КАК Транспортировка,
	|			ВТ_ДанныеТЧ.СерийныйНомер КАК СерийныйНомер,
	|			Вт_ПрипускиАддендума.ВариантПрипускаПрипускПоШирине КАК ПрипускПоШиринеАддендум,
	|			Вт_ПрипускиАддендума.ВариантПрипускаПрипускПоТолщине КАК ПрипускПоТолщинеАддендум,
	|			Вт_ПрипускиАддендума.ВариантПрипускаПрипускПоДлине КАК ПрипускПоДлинеАддендум
	|		ИЗ
	|			ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиВес КАК ВТ_ИтогиВес
	|				ПО ВТ_ДанныеТЧ.Транспортировка = ВТ_ИтогиВес.Транспортировка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Вт_ПрипускиАддендума КАК Вт_ПрипускиАддендума
	|				ПО ВТ_ДанныеТЧ.СерийныйНомер = Вт_ПрипускиАддендума.СерийныйНомер) КАК ВложенныйЗапрос
	|		ПО ВТ_ДанныеТЧ.СерийныйНомер = ВложенныйЗапрос.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТЧ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_ИтоговаяТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ИтоговаяТЧ.Характеристика КАК Характеристика,
	|	ВТ_ИтоговаяТЧ.КоличествоСостав КАК Количество,
	|	ВТ_ИтоговаяТЧ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ_ИтоговаяТЧ.Объем КАК Объем,
	|	ВЫБОР
	|		КОГДА ВТ_ИтоговаяТЧ.ВесНеттоПорт ЕСТЬ NULL
	|			ТОГДА ВТ_ИтоговаяТЧ.ВесНетто
	|		ИНАЧЕ ВТ_ИтоговаяТЧ.ВесНеттоПорт
	|	КОНЕЦ КАК ВесНетто,
	|	ВЫБОР
	|		КОГДА ВТ_ИтоговаяТЧ.ВесБруттоПорт ЕСТЬ NULL
	|			ТОГДА ВТ_ИтоговаяТЧ.ВесБрутто
	|		ИНАЧЕ ВТ_ИтоговаяТЧ.ВесБруттоПорт
	|	КОНЕЦ КАК ВесБрутто,
	|	ВТ_ИтоговаяТЧ.Заказ КАК Заказ,
	|	ВТ_ИтоговаяТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	|	ВТ_ИтоговаяТЧ.Сорт КАК Сорт,
	|	ВТ_ИтоговаяТЧ.Длина КАК Длина,
	|	ВТ_ИтоговаяТЧ.Сечение КАК Сечение,
	|	ВТ_ИтоговаяТЧ.Влажность КАК Влажность,
	|	ВТ_ИтоговаяТЧ.ДлинаП КАК ДлинаП,
	|	ВТ_ИтоговаяТЧ.ШиринаП КАК ШиринаП,
	|	ВТ_ИтоговаяТЧ.ТолщинаП КАК ТолщинаП,
	|	ВТ_ИтоговаяТЧ.ОбъемП КАК ОбъемП,
	|	ВТ_ИтоговаяТЧ.ВесРеквизита / 1000 КАК ВесРеквизита,
	|	ВТ_ИтоговаяТЧ.ДлинаММ КАК ДлинаММ,
	|	ВТ_ИтоговаяТЧ.ШиринаММ КАК Ширина,
	|	ВТ_ИтоговаяТЧ.ТолщинаММ КАК Толщина,
	|	ВТ_ИтоговаяТЧ.Сертификат КАК Сертификат,
	|	ВТ_ИтоговаяТЧ.НомерСтроки КАК НомерСтроки,
	|	ВТ_ИтоговаяТЧ.ОбъемП_2 КАК ОбъемП_2,
	|	ВТ_ИтоговаяТЧ.РасчетныеДанные
	|ИЗ
	|	ВТ_ИтоговаяТЧ КАК ВТ_ИтоговаяТЧ
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоПакетов),
	|	СУММА(Объем),
	|	СУММА(ВесНетто),
	|	СУММА(ВесБрутто),
	|	МАКСИМУМ(ВесБруттоПриВзвешиванииВПорту),
	|	СУММА(ОбъемП),
	|	МАКСИМУМ(ВесРеквизита),
	|	СУММА(ОбъемП_2)
	|ПО
	|	ОБЩИЕ,
	|	Сертификат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	|	ВТ_ИтоговаяТЧ.Сорт КАК Сорт
	|ИЗ
	|	ВТ_ИтоговаяТЧ КАК ВТ_ИтоговаяТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИтоговаяТЧ.Порода,
	|	ВТ_ИтоговаяТЧ.Сорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЧ.Реквизит,
	|	ВТ_ДанныеТЧ.УпакРеквизит,
	|	МАКСИМУМ(ВТ_ДанныеТЧ.ВесРеквизита) КАК ВесРеквизита
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТЧ.Реквизит,
	|	ВТ_ДанныеТЧ.УпакРеквизит
	|ИТОГИ
	|	МАКСИМУМ(ВесРеквизита)
	|ПО
	|	ОБЩИЕ" ;
	//Текст =
	//"ВЫБРАТЬ
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	//|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	//|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	//|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	//|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	//|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	//|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	//|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	//|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	//|	алк_ТранспортировкаЗапасовЗапасы.Характеристика
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	//|ГДЕ
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине
	//|ПОМЕСТИТЬ ВТ_Припуски
	//|ИЗ
	//|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	//|ГДЕ
	//|	(алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Заказ
	//|			ИЛИ алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	//|				(ВЫБРАТЬ
	//|					алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование.Заказ
	//|				ИЗ
	//|					Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	//|				ГДЕ
	//|					алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = &ТекущийДокумент))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ПараметрыХарактеристик.Характеристика,
	//|	алк_ПараметрыХарактеристик.Порода,
	//|	алк_ПараметрыХарактеристик.Сорт,
	//|	алк_ПараметрыХарактеристик.Длина,
	//|	алк_ПараметрыХарактеристик.Сечение,
	//|	алк_ПараметрыХарактеристик.Влажность,
	//|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ
	//|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	//|ИЗ
	//|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//|ГДЕ
	//|	алк_ПараметрыХарактеристик.Характеристика В
	//|			(ВЫБРАТЬ
	//|				ВТ.Характеристика
	//|			ИЗ
	//|				ВТ КАК ВТ)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3
	//|ПОМЕСТИТЬ ВТ_Плотность
	//|ИЗ
	//|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	//|			&ДатаСреза,
	//|			Номенклатура В
	//|				(ВЫБРАТЬ
	//|					ВТ.Номенклатура
	//|				ИЗ
	//|					ВТ КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ.Ссылка.Номер КАК Номер,
	//|	ВТ.Ссылка.Дата КАК ДатаДокумента,
	//|	ВТ.Ссылка КАК Ссылка,
	//|	ВТ.СерийныйНомер КАК Пакет,
	//|	ВТ.НомерСтроки,
	//|	ВТ.Ссылка.Организация.Префикс КАК Префикс,
	//|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ.Ссылка.Заказ) КАК ЗаказПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузоотправитель) КАК ГрузоотправительПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузополучатель) КАК ГрузополучательПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Покупатель) КАК ПокупательПредставление,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Продавец) КАК ПродавецПредставление,
	//|	ВТ.КоличествоСостав КАК Количество,
	//|	ВТ.Объем КАК Объем,
	//|	ВЫРАЗИТЬ(алк_ПараметрыПакетовСрезПоследних.КоличествоСостав * ((ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000) КАК ЧИСЛО(15, 2)) КАК ОбъемП,
	//|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ КАК Ширина,
	//|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ КАК Толщина,
	//|	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ / 1000 КАК Длина,
	//|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0) КАК ТолщинаП,
	//|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0) КАК ШиринаП,
	//|	(ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000 КАК ДлинаП,
	//|	ВТ.КоличествоПакетов КАК КоличествоПакетов,
	//|	ВТ.Номенклатура,
	//|	ВТ_ПараметрыХарактеристик.Порода,
	//|	ВТ_ПараметрыХарактеристик.Сорт КАК Сорт,
	//|	ВТ.Ссылка.ИдентификаторТС КАК ИдентификаторТС,
	//|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.ВидТранспорта) КАК ВидТранспортаПредставление,
	//|	ВТ.Ссылка.Грузоподъемность КАК Грузоподъемность,
	//|	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	//|	ВТ.Ссылка.Пломбы КАК Пломбы,
	//|	ВТ.Ссылка.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	//|	ВТ_ПараметрыХарактеристик.Влажность,
	//|	ВТ.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК БруттоПорт,
	//|	ВТ.Ссылка.ВесКонтейнера КАК ВесКонтейнера,
	//|	ВТ.Ссылка.Продавец КАК Продавец,
	//|	ВТ_Припуски.Припуск,
	//|	ВТ.КоличествоСостав,
	//|	ВТ.Характеристика КАК Характеристика,
	//|	ВТ_Припуски.ПрипускПрипускПоШирине,
	//|	ВТ_Припуски.ПрипускПрипускПоТолщине,
	//|	ВТ_Припуски.ПрипускПрипускПоДлине,
	//|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска
	//|ПОМЕСТИТЬ ВТ_Итог
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	//|				&ДатаСреза,
	//|				СерийныйНомер В
	//|					(ВЫБРАТЬ
	//|						ВТ.СерийныйНомер
	//|					ИЗ
	//|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
	//|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	//|		ПО ВТ.Характеристика = ВТ_Припуски.Характеристика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	//|		ПО ВТ.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика,
	//|	ВТ_Плотность КАК ВТ_Плотность
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Итог.Ссылка КАК Ссылка,
	//|	ВТ_Итог.СтрокаСертификат КАК СтрокаСертификат,
	//|	ВТ_Итог.Номер КАК Номер,
	//|	ВТ_Итог.ДатаДокумента КАК ДатаДокумента,
	//|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	//|	ВТ_Итог.Префикс,
	//|	ВТ_Итог.ЗаказПредставление КАК ЗаказПредставление,
	//|	ВТ_Итог.ГрузоотправительПредставление КАК ГрузоотправительПредставление,
	//|	ВТ_Итог.ГрузополучательПредставление КАК ГрузополучательПредставление,
	//|	ВТ_Итог.ПокупательПредставление КАК ПокупательПредставление,
	//|	ВТ_Итог.Продавец КАК Продавец,
	//|	ВТ_Итог.ПродавецПредставление КАК ПродавецПредставление,
	//|	ВТ_Итог.ИдентификаторТС КАК ИдентификаторТС,
	//|	ВТ_Итог.ВидТранспортаПредставление КАК ВидТранспортаПредставление,
	//|	ВТ_Итог.Грузоподъемность,
	//|	ВТ_Итог.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	//|	ВТ_Итог.БруттоПорт КАК БруттоПорт,
	//|	ВТ_Итог.Пломбы КАК Пломбы,
	//|	ВТ_Итог.ВесКонтейнера,
	//|	ВТ_Итог.Пакет,
	//|	ВТ_Итог.Номенклатура,
	//|	ВТ_Итог.Порода,
	//|	ВТ_Итог.Сорт,
	//|	ВТ_Итог.Влажность,
	//|	ВТ_Итог.Количество КАК Количество,
	//|	ВТ_Итог.КоличествоСостав,
	//|	ВТ_Итог.КоличествоПакетов КАК КоличествоПакетов,
	//|	ВТ_Итог.Объем КАК Объем,
	//|	ВТ_Итог.ОбъемП КАК ОбъемП,
	//|	ВТ_Итог.Ширина,
	//|	ВТ_Итог.ШиринаП,
	//|	ВТ_Итог.Толщина,
	//|	ВТ_Итог.ТолщинаП,
	//|	ВТ_Итог.Длина,
	//|	ВТ_Итог.ДлинаП,
	//|	ВЫРАЗИТЬ(ВТ_Итог.ОбъемП * ВТ_Плотность.ПлотностьКгМ3 / 1000 КАК ЧИСЛО(15, 3)) КАК ВесНеттоП,
	//|	ВЫРАЗИТЬ(0.01 + ВТ_Итог.ОбъемП * ВТ_Плотность.ПлотностьКгМ3 / 1000 КАК ЧИСЛО(15, 3)) КАК ВесБруттоП,
	//|	ВТ_Плотность.ПлотностьКгМ3,
	//|	ВТ_Итог.Припуск,
	//|	ВТ_Итог.ПрипускПрипускПоШирине,
	//|	ВТ_Итог.ПрипускПрипускПоТолщине,
	//|	ВТ_Итог.ПрипускПрипускПоДлине
	//|ИЗ
	//|	ВТ_Итог КАК ВТ_Итог
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Плотность КАК ВТ_Плотность
	//|		ПО ВТ_Итог.Номенклатура = ВТ_Плотность.Номенклатура
	//|			И ВТ_Итог.Порода = ВТ_Плотность.Порода
	//|			И ВТ_Итог.Влажность = ВТ_Плотность.Влажность
	//|			И ВТ_Итог.БоковаяДоска = ВТ_Плотность.БоковаяДоска
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки
	//|ИТОГИ
	//|	МАКСИМУМ(Номер),
	//|	МАКСИМУМ(ДатаДокумента),
	//|	МАКСИМУМ(ЗаказПредставление),
	//|	МАКСИМУМ(ГрузоотправительПредставление),
	//|	МАКСИМУМ(ГрузополучательПредставление),
	//|	МАКСИМУМ(ПокупательПредставление),
	//|	МАКСИМУМ(Продавец),
	//|	МАКСИМУМ(ПродавецПредставление),
	//|	МАКСИМУМ(ИдентификаторТС),
	//|	МАКСИМУМ(ВидТранспортаПредставление),
	//|	МАКСИМУМ(СтрокаИДКонтейнеров),
	//|	МАКСИМУМ(БруттоПорт),
	//|	МАКСИМУМ(Пломбы),
	//|	СУММА(Количество),
	//|	СУММА(КоличествоПакетов),
	//|	СУММА(Объем),
	//|	СУММА(ОбъемП),
	//|	СУММА(ВесНеттоП),
	//|	СУММА(ВесБруттоП)
	//|ПО
	//|	Ссылка,
	//|	СтрокаСертификат";
	//
	Возврат Текст;		
	
КонецФункции

Функция ТекстЗапросаЖД_Шпон()
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Номер КАК Номер,
	|	алк_ТранспортировкаЗапасов.Дата КАК Дата,
	|	алк_ТранспортировкаЗапасов.Грузоотправитель КАК Грузоотправитель,
	|	алк_ТранспортировкаЗапасов.Грузополучатель КАК Грузополучатель,
	|	алк_ТранспортировкаЗапасов.Покупатель КАК Покупатель,
	|	алк_ТранспортировкаЗапасов.Заказ.Наименование КАК Заказ,
	|	алк_ТранспортировкаЗапасов.ИдентификаторТС КАК ИдентификаторТС,
	|	алк_ТранспортировкаЗапасов.ВидТранспорта КАК ВидТранспорта,
	|	алк_ТранспортировкаЗапасов.ВесКонтейнера КАК ВесКонтейнера,
	|	алк_ТранспортировкаЗапасов.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	|	алк_ТранспортировкаЗапасов.Ссылка КАК Транспортировка,
	|	алк_ТранспортировкаЗапасов.Продавец КАК Поставщик,
	|	алк_ТранспортировкаЗапасов.Пломбы КАК Пломбы
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДокументОснование.Заказ ЕСТЬ NULL
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДокументОснование.Заказ
	|	КОНЕЦ КАК Заказ,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита КАК ВесРеквизита,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Транспортировка,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня1,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	алк_ТранспортировкаЗапасовРеквизит.УпакРеквизит КАК УпакРеквизит,
	|	алк_ТранспортировкаЗапасовРеквизит.Ссылка КАК Реквизит,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура1,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт КАК ВесНеттоПорт,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт КАК ВесБруттоПорт,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт ЕСТЬ NULL
	|				И алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК РасчетныеДанные
	|ПОМЕСТИТЬ ВТ_ДанныеТЧ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасовРеквизит.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ДанныеТЧ.ВесНетто) КАК ВесНетто,
	|	СУММА(ВТ_ДанныеТЧ.ВесБрутто) КАК ВесБрутто,
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ДанныеТЧ.Транспортировка КАК Транспортировка
	|ПОМЕСТИТЬ ВТ_ИтогиВес
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ДанныеТЧ.Транспортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
	|	алк_ПараметрыХарактеристик.Порода КАК Порода,
	|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	|	алк_ПараметрыХарактеристик.Длина КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ
	|ПОМЕСТИТЬ ВТ_Характеристики
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеТЧ.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине КАК ПрипускПрипускПоШирине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине КАК ПрипускПрипускПоДлине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск КАК Припуск,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Припуски
	|ИЗ
	|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	|ГДЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеТЧ.Заказ КАК Заказ
	|			ИЗ
	|				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_АддендумыСоставТоваров.ВариантПрипуска.ПрипускПоШирине КАК ВариантПрипускаПрипускПоШирине,
	|	алк_АддендумыСоставТоваров.ВариантПрипуска.ПрипускПоТолщине КАК ВариантПрипускаПрипускПоТолщине,
	|	алк_АддендумыСоставТоваров.ВариантПрипуска.ПрипускПоДлине КАК ВариантПрипускаПрипускПоДлине,
	|	алк_АддендумыСоставТоваров.ВариантПрипуска КАК ВариантПрипуска,
	|	алк_АддендумыТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Вт_ПрипускиАддендума
	|ИЗ
	|	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
	|		ПО алк_АддендумыТовары.Ссылка = алк_АддендумыСоставТоваров.Ссылка
	|ГДЕ
	|	алк_АддендумыСоставТоваров.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеТЧ.Заказ КАК Заказ
	|			ИЗ
	|				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_АддендумыТовары.Номенклатура,
	|	алк_АддендумыСоставТоваров.ВариантПрипуска,
	|	алк_АддендумыСоставТоваров.ВариантПрипуска.ПрипускПоШирине,
	|	алк_АддендумыСоставТоваров.ВариантПрипуска.ПрипускПоТолщине,
	|	алк_АддендумыСоставТоваров.ВариантПрипуска.ПрипускПоДлине
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЧ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_ДанныеТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеТЧ.Характеристика КАК Характеристика,
	|	ВТ_ДанныеТЧ.КоличествоСостав КАК КоличествоСостав,
	|	ВТ_ДанныеТЧ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ_ДанныеТЧ.Объем КАК Объем,
	|	ВТ_ДанныеТЧ.ОбъемТаможня КАК ОбъемП,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеТЧ.ВесНеттоПорт ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ВесНетто * ВложенныйЗапрос.Коэффициент КАК ЧИСЛО(15, 3))
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ВесНеттоПорт КАК ЧИСЛО(15, 3))
	|	КОНЕЦ КАК ВесНетто,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеТЧ.ВесБруттоПорт ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ВесБрутто * ВложенныйЗапрос.Коэффициент КАК ЧИСЛО(15, 3))
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ВесБруттоПорт КАК ЧИСЛО(15, 3))
	|	КОНЕЦ КАК ВесБрутто,
	|	ВТ_ДанныеТЧ.Заказ КАК Заказ,
	|	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_Характеристики.Порода КАК Порода,
	|	ВТ_Характеристики.Сорт КАК Сорт,
	|	ВТ_Характеристики.Длина КАК Длина,
	|	ВТ_Характеристики.Сечение КАК Сечение,
	|	ВТ_Характеристики.Влажность КАК Влажность,
	|	ВЫБОР
	|		КОГДА ВТ_Припуски.ПрипускПрипускПоДлине <> 0
	|			ТОГДА (ВТ_Характеристики.ДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000
	|		ИНАЧЕ (ВТ_Характеристики.ДлинаММ + ЕСТЬNULL(ВложенныйЗапрос.ПрипускПоДлинеАддендум, 0)) / 1000
	|	КОНЕЦ КАК ДлинаП,
	|	ВЫБОР
	|		КОГДА ВТ_Припуски.ПрипускПрипускПоШирине <> 0
	|			ТОГДА ВТ_Характеристики.ШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)
	|		ИНАЧЕ ВТ_Характеристики.ШиринаММ + ЕСТЬNULL(ВложенныйЗапрос.ПрипускПоШиринеАддендум, 0)
	|	КОНЕЦ КАК ШиринаП,
	|	ВЫБОР
	|		КОГДА ВТ_Припуски.ПрипускПрипускПоТолщине <> 0
	|			ТОГДА ВТ_Характеристики.ТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)
	|		ИНАЧЕ ВТ_Характеристики.ТолщинаММ + ЕСТЬNULL(ВложенныйЗапрос.ПрипускПоТолщинеАддендум, 0)
	|	КОНЕЦ КАК ТолщинаП,
	|	ВТ_ДанныеТЧ.ВесРеквизита КАК ВесРеквизита,
	|	ВТ_Характеристики.ДлинаММ / 1000 КАК ДлинаММ,
	|	ВТ_Характеристики.ШиринаММ КАК ШиринаММ,
	|	ВТ_Характеристики.ТолщинаММ КАК ТолщинаММ,
	|	ВТ_ДанныеТЧ.Сертификат КАК Сертификат,
	|	ВТ_ДанныеТЧ.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ВТ_ДанныеТЧ.ОбъемТаможня КАК ЧИСЛО(15, 2)) КАК ОбъемП_2,
	|	ВТ_Припуски.ПрипускПрипускПоШирине КАК ПрипускПрипускПоШирине,
	|	ВТ_Припуски.ПрипускПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
	|	ВТ_Припуски.ПрипускПрипускПоДлине КАК ПрипускПрипускПоДлине,
	|	ВложенныйЗапрос.ПрипускПоШиринеАддендум КАК ПрипускПоШиринеАддендум,
	|	ВложенныйЗапрос.ПрипускПоТолщинеАддендум КАК ПрипускПоТолщинеАддендум,
	|	ВложенныйЗапрос.ПрипускПоДлинеАддендум КАК ПрипускПоДлинеАддендум,
	|	ВТ_ДанныеТЧ.РасчетныеДанные КАК РасчетныеДанные
	|ПОМЕСТИТЬ ВТ_ИтоговааяТЧ
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
	|		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Характеристики.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	|		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Припуски.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВЫБОР
	|				КОГДА ВТ_ИтогиВес.ВесБрутто > 0
	|						И ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту > 0
	|					ТОГДА ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту / ВТ_ИтогиВес.ВесБрутто
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК Коэффициент,
	|			ВТ_ИтогиВес.Транспортировка КАК Транспортировка,
	|			ВТ_ДанныеТЧ.СерийныйНомер КАК СерийныйНомер,
	|			Вт_ПрипускиАддендума.ВариантПрипускаПрипускПоШирине КАК ПрипускПоШиринеАддендум,
	|			Вт_ПрипускиАддендума.ВариантПрипускаПрипускПоТолщине КАК ПрипускПоТолщинеАддендум,
	|			Вт_ПрипускиАддендума.ВариантПрипускаПрипускПоДлине КАК ПрипускПоДлинеАддендум
	|		ИЗ
	|			ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиВес КАК ВТ_ИтогиВес
	|				ПО ВТ_ДанныеТЧ.Транспортировка = ВТ_ИтогиВес.Транспортировка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Вт_ПрипускиАддендума КАК Вт_ПрипускиАддендума
	|				ПО ВТ_ДанныеТЧ.Номенклатура = Вт_ПрипускиАддендума.Номенклатура
	|		ГДЕ
	|			НЕ ВТ_ДанныеТЧ.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)) КАК ВложенныйЗапрос
	|		ПО ВТ_ДанныеТЧ.СерийныйНомер = ВложенныйЗапрос.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТЧ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_ИтоговаяТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ИтоговаяТЧ.Характеристика КАК Характеристика,
	|	ВТ_ИтоговаяТЧ.КоличествоСостав КАК Количество,
	|	ВТ_ИтоговаяТЧ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ_ИтоговаяТЧ.Объем КАК Объем,
	|	ВТ_ИтоговаяТЧ.ВесНетто КАК ВесНетто,
	|	ВТ_ИтоговаяТЧ.ВесБрутто КАК ВесБрутто,
	|	ВТ_ИтоговаяТЧ.Заказ КАК Заказ,
	|	ВТ_ИтоговаяТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	|	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	|	ВТ_ИтоговаяТЧ.Сорт КАК Сорт,
	|	ВТ_ИтоговаяТЧ.Длина КАК Длина,
	|	ВТ_ИтоговаяТЧ.Сечение КАК Сечение,
	|	ВТ_ИтоговаяТЧ.Влажность КАК Влажность,
	|	ВТ_ИтоговаяТЧ.ДлинаП КАК ДлинаП,
	|	ВТ_ИтоговаяТЧ.ШиринаП КАК ШиринаП,
	|	ВТ_ИтоговаяТЧ.ТолщинаП КАК ТолщинаП,
	|	ВЫБОР
	|		КОГДА НЕ &ЭтоШпон
	|			ТОГДА ВТ_ИтоговаяТЧ.ОбъемП
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемП,
	|	ВТ_ИтоговаяТЧ.ВесРеквизита / 1000 КАК ВесРеквизита,
	|	ВТ_ИтоговаяТЧ.ДлинаММ КАК ДлинаММ,
	|	ВТ_ИтоговаяТЧ.ШиринаММ КАК Ширина,
	|	ВТ_ИтоговаяТЧ.ТолщинаММ КАК Толщина,
	|	ВТ_ИтоговаяТЧ.Сертификат КАК Сертификат,
	|	ВТ_ИтоговаяТЧ.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА НЕ &ЭтоШпон
	|			ТОГДА ВТ_ИтоговаяТЧ.ОбъемП_2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемП_2,
	|	ВТ_ИтоговаяТЧ.РасчетныеДанные КАК РасчетныеДанные
	|ИЗ
	|	ВТ_ИтоговааяТЧ КАК ВТ_ИтоговаяТЧ
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоПакетов),
	|	СУММА(Объем),
	|	СУММА(ВесНетто),
	|	СУММА(ВесБрутто),
	|	МАКСИМУМ(ВесБруттоПриВзвешиванииВПорту),
	|	СУММА(ОбъемП),
	|	МАКСИМУМ(ВесРеквизита),
	|	СУММА(ОбъемП_2)
	|ПО
	|	ОБЩИЕ,
	|	Сертификат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	|	ВТ_ИтоговаяТЧ.Сорт КАК Сорт
	|ИЗ
	|	ВТ_ИтоговааяТЧ КАК ВТ_ИтоговаяТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИтоговаяТЧ.Порода,
	|	ВТ_ИтоговаяТЧ.Сорт,
	|	ВТ_ИтоговаяТЧ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеТЧ.Реквизит КАК Реквизит,
	|	ВТ_ДанныеТЧ.УпакРеквизит КАК УпакРеквизит,
	|	МАКСИМУМ(ВТ_ДанныеТЧ.ВесРеквизита) КАК ВесРеквизита
	|ИЗ
	|	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеТЧ.Реквизит,
	|	ВТ_ДанныеТЧ.УпакРеквизит
	|ИТОГИ
	|	МАКСИМУМ(ВесРеквизита)
	|ПО
	|	ОБЩИЕ" ;

	Возврат Текст;		
	
КонецФункции

Функция ТекстЗапросаЖД_ПМ()
	//Текст = 
	//         "ВЫБРАТЬ
	//         |	алк_ТранспортировкаЗапасов.Номер КАК Номер,
	//         |	алк_ТранспортировкаЗапасов.Дата КАК Дата,
	//         |	алк_ТранспортировкаЗапасов.Грузоотправитель КАК Грузоотправитель,
	//         |	алк_ТранспортировкаЗапасов.Грузополучатель КАК Грузополучатель,
	//         |	алк_ТранспортировкаЗапасов.Покупатель КАК Покупатель,
	//         |	алк_ТранспортировкаЗапасов.Заказ КАК Заказ,
	//         |	алк_ТранспортировкаЗапасов.ИдентификаторТС КАК ИдентификаторТС,
	//         |	алк_ТранспортировкаЗапасов.ВидТранспорта КАК ВидТранспорта,
	//         |	алк_ТранспортировкаЗапасов.ВесКонтейнера КАК ВесКонтейнера,
	//         |	алк_ТранспортировкаЗапасов.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	//         |	алк_ТранспортировкаЗапасов.Ссылка КАК Транспортировка,
	//         |	алк_ТранспортировкаЗапасов.Продавец КАК Поставщик
	//         |ИЗ
	//         |	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	//         |ГДЕ
	//         |	алк_ТранспортировкаЗапасов.Ссылка = &Ссылка
	//         |;
	//         |
	//         |////////////////////////////////////////////////////////////////////////////////
	//         |ВЫБРАТЬ
	//         |	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	//         |	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	//         |	алк_ТранспортировкаЗапасовЗапасы.Характеристика КАК Характеристика,
	//         |	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	//         |	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	//         |	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	//         |	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	//         |	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	//         |	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБрутто,
	//         |	алк_ТранспортировкаЗапасовЗапасы.Заказ КАК Заказ,
	//         |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	//         |	алк_ТранспортировкаЗапасовРеквизит.ВесРеквизита КАК ВесРеквизита,
	//         |	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
	//         |	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Транспортировка,
	//         |	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня1,
	//         |	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки КАК НомерСтроки
	//         |ПОМЕСТИТЬ ВТ_ДанныеТЧ
	//         |ИЗ
	//         |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	//         |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.Реквизит КАК алк_ТранспортировкаЗапасовРеквизит
	//         |		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасовРеквизит.Ссылка
	//         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
	//         |		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	//         |ГДЕ
	//         |	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	//         |;
	//         |
	//         |////////////////////////////////////////////////////////////////////////////////
	//         |ВЫБРАТЬ
	//         |	СУММА(ВТ_ДанныеТЧ.ВесНетто) КАК ВесНетто,
	//         |	СУММА(ВТ_ДанныеТЧ.ВесБрутто) КАК ВесБрутто,
	//         |	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	//         |	ВТ_ДанныеТЧ.Транспортировка КАК Транспортировка
	//         |ПОМЕСТИТЬ ВТ_ИтогиВес
	//         |ИЗ
	//         |	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	//         |
	//         |СГРУППИРОВАТЬ ПО
	//         |	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту,
	//         |	ВТ_ДанныеТЧ.Транспортировка
	//         |;
	//         |
	//         |////////////////////////////////////////////////////////////////////////////////
	//         |ВЫБРАТЬ
	//         |	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
	//         |	алк_ПараметрыХарактеристик.Порода КАК Порода,
	//         |	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	//         |	алк_ПараметрыХарактеристик.Длина КАК Длина,
	//         |	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	//         |	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
	//         |	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
	//         |	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
	//         |	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ
	//         |ПОМЕСТИТЬ ВТ_Характеристики
	//         |ИЗ
	//         |	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//         |ГДЕ
	//         |	алк_ПараметрыХарактеристик.Характеристика В
	//         |			(ВЫБРАТЬ
	//         |				ВТ_ДанныеТЧ.Характеристика КАК Характеристика
	//         |			ИЗ
	//         |				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	//         |;
	//         |
	//         |////////////////////////////////////////////////////////////////////////////////
	//         |ВЫБРАТЬ
	//         |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине КАК ПрипускПрипускПоШирине,
	//         |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
	//         |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине КАК ПрипускПрипускПоДлине,
	//         |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск КАК Припуск,
	//         |	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика КАК Характеристика
	//         |ПОМЕСТИТЬ ВТ_Припуски
	//         |ИЗ
	//         |	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	//         |ГДЕ
	//         |	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	//         |			(ВЫБРАТЬ
	//         |				ВТ_ДанныеТЧ.Заказ КАК Заказ
	//         |			ИЗ
	//         |				ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ)
	//         |;
	//         |
	//         |////////////////////////////////////////////////////////////////////////////////
	//         |ВЫБРАТЬ
	//         |	ВТ_ДанныеТЧ.СерийныйНомер КАК СерийныйНомер,
	//         |	ВТ_ДанныеТЧ.Номенклатура КАК Номенклатура,
	//         |	ВТ_ДанныеТЧ.Характеристика КАК Характеристика,
	//         |	ВТ_ДанныеТЧ.КоличествоСостав КАК КоличествоСостав,
	//         |	ВТ_ДанныеТЧ.КоличествоПакетов КАК КоличествоПакетов,
	//         |	ВТ_ДанныеТЧ.Объем КАК Объем,
	//         |	ВТ_ДанныеТЧ.ОбъемТаможня КАК ОбъемП,
	//         |	ВТ_ДанныеТЧ.ВесНетто * ВложенныйЗапрос.Коэффициент КАК ВесНетто,
	//         |	ВТ_ДанныеТЧ.ВесБрутто * ВложенныйЗапрос.Коэффициент КАК ВесБрутто,
	//         |	ВТ_ДанныеТЧ.Заказ КАК Заказ,
	//         |	ВТ_ДанныеТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	//         |	ВТ_Характеристики.Порода КАК Порода,
	//         |	ВТ_Характеристики.Сорт КАК Сорт,
	//         |	ВТ_Характеристики.Длина КАК Длина,
	//         |	ВТ_Характеристики.Сечение КАК Сечение,
	//         |	ВТ_Характеристики.Влажность КАК Влажность,
	//         |	(ВТ_Характеристики.ДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000 КАК ДлинаП,
	//         |	ВТ_Характеристики.ШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0) КАК ШиринаП,
	//         |	ВТ_Характеристики.ТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0) КАК ТолщинаП,
	//         |	ВТ_ДанныеТЧ.ВесРеквизита КАК ВесРеквизита,
	//         |	ВТ_Характеристики.ДлинаММ / 1000 КАК ДлинаММ,
	//         |	ВТ_Характеристики.ШиринаММ КАК ШиринаММ,
	//         |	ВТ_Характеристики.ТолщинаММ КАК ТолщинаММ,
	//         |	ВТ_ДанныеТЧ.Сертификат КАК Сертификат,
	//         |	ВТ_ДанныеТЧ.НомерСтроки КАК НомерСтроки
	//         |ПОМЕСТИТЬ ВТ_ИтоговаяТЧ
	//         |ИЗ
	//         |	ВТ_ДанныеТЧ КАК ВТ_ДанныеТЧ
	//         |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Характеристики КАК ВТ_Характеристики
	//         |		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Характеристики.Характеристика
	//         |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	//         |		ПО ВТ_ДанныеТЧ.Характеристика = ВТ_Припуски.Характеристика
	//         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//         |			ВЫБОР
	//         |				КОГДА ВТ_ИтогиВес.ВесБрутто > 0
	//         |						И ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту > 0
	//         |					ТОГДА ВТ_ИтогиВес.ВесБруттоПриВзвешиванииВПорту / ВТ_ИтогиВес.ВесБрутто
	//         |				ИНАЧЕ 1
	//         |			КОНЕЦ КАК Коэффициент,
	//         |			ВТ_ИтогиВес.Транспортировка КАК Транспортировка
	//         |		ИЗ
	//         |			ВТ_ИтогиВес КАК ВТ_ИтогиВес) КАК ВложенныйЗапрос
	//         |		ПО ВТ_ДанныеТЧ.Транспортировка = ВложенныйЗапрос.Транспортировка
	//         |;
	//         |
	//         |////////////////////////////////////////////////////////////////////////////////
	//         |ВЫБРАТЬ
	//         |	ВТ_ИтоговаяТЧ.СерийныйНомер КАК СерийныйНомер,
	//         |	ВТ_ИтоговаяТЧ.Номенклатура КАК Номенклатура,
	//         |	ВТ_ИтоговаяТЧ.Характеристика КАК Характеристика,
	//         |	ВТ_ИтоговаяТЧ.КоличествоСостав КАК Количество,
	//         |	ВТ_ИтоговаяТЧ.КоличествоПакетов КАК КоличествоПакетов,
	//         |	ВТ_ИтоговаяТЧ.Объем КАК Объем,
	//         |	ВТ_ИтоговаяТЧ.ВесНетто КАК ВесНетто,
	//         |	ВТ_ИтоговаяТЧ.ВесБрутто КАК ВесБрутто,
	//         |	ВТ_ИтоговаяТЧ.Заказ КАК Заказ,
	//         |	ВТ_ИтоговаяТЧ.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	//         |	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	//         |	ВТ_ИтоговаяТЧ.Сорт КАК Сорт,
	//         |	ВТ_ИтоговаяТЧ.Длина КАК Длина,
	//         |	ВТ_ИтоговаяТЧ.Сечение КАК Сечение,
	//         |	ВТ_ИтоговаяТЧ.Влажность КАК Влажность,
	//         |	ВТ_ИтоговаяТЧ.ДлинаП КАК ДлинаП,
	//         |	ВТ_ИтоговаяТЧ.ШиринаП КАК ШиринаП,
	//         |	ВТ_ИтоговаяТЧ.ТолщинаП КАК ТолщинаП,
	//         |	ВТ_ИтоговаяТЧ.ОбъемП КАК ОбъемП,
	//         |	ВТ_ИтоговаяТЧ.ВесРеквизита / 1000 КАК ВесРеквизита,
	//         |	ВТ_ИтоговаяТЧ.ДлинаММ КАК ДлинаММ,
	//         |	ВТ_ИтоговаяТЧ.ШиринаММ КАК Ширина,
	//         |	ВТ_ИтоговаяТЧ.ТолщинаММ КАК Толщина,
	//         |	ВТ_ИтоговаяТЧ.Сертификат КАК Сертификат,
	//         |	ВТ_ИтоговаяТЧ.НомерСтроки КАК НомерСтроки
	//         |ИЗ
	//         |	ВТ_ИтоговаяТЧ КАК ВТ_ИтоговаяТЧ
	//         |ИТОГИ
	//         |	СУММА(Количество),
	//         |	СУММА(КоличествоПакетов),
	//         |	СУММА(Объем),
	//         |	СУММА(ВесНетто),
	//         |	СУММА(ВесБрутто),
	//         |	СУММА(ОбъемП),
	//         |	МАКСИМУМ(ВесРеквизита)
	//         |ПО
	//         |	Сертификат
	//         |;
	//         |
	//         |////////////////////////////////////////////////////////////////////////////////
	//         |ВЫБРАТЬ
	//         |	ВТ_ИтоговаяТЧ.Порода КАК Порода,
	//         |	ВТ_ИтоговаяТЧ.Сорт КАК Сорт
	//         |ИЗ
	//         |	ВТ_ИтоговаяТЧ КАК ВТ_ИтоговаяТЧ
	//         |
	//         |СГРУППИРОВАТЬ ПО
	//         |	ВТ_ИтоговаяТЧ.Порода,
	//         |	ВТ_ИтоговаяТЧ.Сорт" ;
	Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине
	|ПОМЕСТИТЬ ВТ_Припуски
	|ИЗ
	|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	|ГДЕ
	|	(алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Заказ
	|			ИЛИ алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	|				(ВЫБРАТЬ
	|					алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование.Заказ
	|				ИЗ
	|					Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|				ГДЕ
	|					алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = &ТекущийДокумент))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ
	|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ.Характеристика
	|			ИЗ
	|				ВТ КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
	|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
	|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
	|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
	|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3
	|ПОМЕСТИТЬ ВТ_Плотность
	|ИЗ
	|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	|			&ДатаСреза,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ.Номенклатура
	|				ИЗ
	|					ВТ КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ.Ссылка.Номер КАК Номер,
	|	ВТ.Ссылка.Дата КАК ДатаДокумента,
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.СерийныйНомер КАК Пакет,
	|	ВТ.НомерСтроки,
	|	ВТ.Ссылка.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ.Ссылка.Заказ) КАК ЗаказПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузоотправитель) КАК ГрузоотправительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузополучатель) КАК ГрузополучательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Покупатель) КАК ПокупательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Продавец) КАК ПродавецПредставление,
	|	ВТ.КоличествоСостав КАК Количество,
	|	ВТ.Объем КАК Объем,
	|	ВЫРАЗИТЬ(алк_ПараметрыПакетовСрезПоследних.КоличествоСостав * ((ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000) КАК ЧИСЛО(15, 2)) КАК ОбъемП,
	|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ КАК Ширина,
	|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ КАК Толщина,
	|	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ / 1000 КАК Длина,
	|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0) КАК ТолщинаП,
	|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0) КАК ШиринаП,
	|	(ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000 КАК ДлинаП,
	|	ВТ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ.Номенклатура,
	|	ВТ_ПараметрыХарактеристик.Порода,
	|	ВТ_ПараметрыХарактеристик.Сорт КАК Сорт,
	|	ВТ.Ссылка.ИдентификаторТС КАК ИдентификаторТС,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.ВидТранспорта) КАК ВидТранспортаПредставление,
	|	ВТ.Ссылка.Грузоподъемность КАК Грузоподъемность,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	|	ВТ.Ссылка.Пломбы КАК Пломбы,
	|	ВТ.Ссылка.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	|	ВТ_ПараметрыХарактеристик.Влажность,
	|	ВТ.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК БруттоПорт,
	|	ВТ.Ссылка.ВесКонтейнера КАК ВесКонтейнера,
	|	ВТ.Ссылка.Продавец КАК Продавец,
	|	ВТ_Припуски.Припуск,
	|	ВТ.КоличествоСостав,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ_Припуски.ПрипускПрипускПоШирине,
	|	ВТ_Припуски.ПрипускПрипускПоТолщине,
	|	ВТ_Припуски.ПрипускПрипускПоДлине,
	|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				&ДатаСреза,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ.СерийныйНомер
	|					ИЗ
	|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	|		ПО ВТ.Характеристика = ВТ_Припуски.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	|		ПО ВТ.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика,
	|	ВТ_Плотность КАК ВТ_Плотность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Ссылка КАК Ссылка,
	|	ВТ_Итог.СтрокаСертификат КАК СтрокаСертификат,
	|	ВТ_Итог.Номер КАК Номер,
	|	ВТ_Итог.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_Итог.НомерСтроки КАК НомерСтроки,
	|	ВТ_Итог.Префикс,
	|	ВТ_Итог.ЗаказПредставление КАК ЗаказПредставление,
	|	ВТ_Итог.ГрузоотправительПредставление КАК ГрузоотправительПредставление,
	|	ВТ_Итог.ГрузополучательПредставление КАК ГрузополучательПредставление,
	|	ВТ_Итог.ПокупательПредставление КАК ПокупательПредставление,
	|	ВТ_Итог.Продавец КАК Продавец,
	|	ВТ_Итог.ПродавецПредставление КАК ПродавецПредставление,
	|	ВТ_Итог.ИдентификаторТС КАК ИдентификаторТС,
	|	ВТ_Итог.ВидТранспортаПредставление КАК ВидТранспортаПредставление,
	|	ВТ_Итог.Грузоподъемность,
	|	ВТ_Итог.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	|	ВТ_Итог.БруттоПорт КАК БруттоПорт,
	|	ВТ_Итог.Пломбы КАК Пломбы,
	|	ВТ_Итог.ВесКонтейнера,
	|	ВТ_Итог.Пакет,
	|	ВТ_Итог.Номенклатура,
	|	ВТ_Итог.Порода,
	|	ВТ_Итог.Сорт,
	|	ВТ_Итог.Влажность,
	|	ВТ_Итог.Количество КАК Количество,
	|	ВТ_Итог.КоличествоСостав,
	|	ВТ_Итог.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ_Итог.Объем КАК Объем,
	|	ВТ_Итог.ОбъемП КАК ОбъемП,
	|	ВТ_Итог.Ширина,
	|	ВТ_Итог.ШиринаП,
	|	ВТ_Итог.Толщина,
	|	ВТ_Итог.ТолщинаП,
	|	ВТ_Итог.Длина,
	|	ВТ_Итог.ДлинаП,
	|	ВЫРАЗИТЬ(ВТ_Итог.ОбъемП * ВТ_Плотность.ПлотностьКгМ3 / 1000 КАК ЧИСЛО(15, 3)) КАК ВесНеттоП,
	|	ВЫРАЗИТЬ(0.01 + ВТ_Итог.ОбъемП * ВТ_Плотность.ПлотностьКгМ3 / 1000 КАК ЧИСЛО(15, 3)) КАК ВесБруттоП,
	|	ВТ_Плотность.ПлотностьКгМ3,
	|	ВТ_Итог.Припуск,
	|	ВТ_Итог.ПрипускПрипускПоШирине,
	|	ВТ_Итог.ПрипускПрипускПоТолщине,
	|	ВТ_Итог.ПрипускПрипускПоДлине
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Плотность КАК ВТ_Плотность
	|		ПО ВТ_Итог.Номенклатура = ВТ_Плотность.Номенклатура
	|			И ВТ_Итог.Порода = ВТ_Плотность.Порода
	|			И ВТ_Итог.Влажность = ВТ_Плотность.Влажность
	|			И ВТ_Итог.БоковаяДоска = ВТ_Плотность.БоковаяДоска
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(ДатаДокумента),
	|	МАКСИМУМ(ЗаказПредставление),
	|	МАКСИМУМ(ГрузоотправительПредставление),
	|	МАКСИМУМ(ГрузополучательПредставление),
	|	МАКСИМУМ(ПокупательПредставление),
	|	МАКСИМУМ(Продавец),
	|	МАКСИМУМ(ПродавецПредставление),
	|	МАКСИМУМ(ИдентификаторТС),
	|	МАКСИМУМ(ВидТранспортаПредставление),
	|	МАКСИМУМ(СтрокаИДКонтейнеров),
	|	МАКСИМУМ(БруттоПорт),
	|	МАКСИМУМ(Пломбы),
	|	СУММА(Количество),
	|	СУММА(КоличествоПакетов),
	|	СУММА(Объем),
	|	СУММА(ОбъемП),
	|	СУММА(ВесНеттоП),
	|	СУММА(ВесБруттоП)
	|ПО
	|	Ссылка,
	|	СтрокаСертификат";
	//
	Возврат Текст;		
	
КонецФункции // ()

Функция ТекстЗапросаЖД_ПМ_старый()
	
	Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.НомерСтроки,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТекущийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Ссылка.Номер КАК Номер,
	|	ВТ.Ссылка.Дата КАК ДатаДокумента,
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.СерийныйНомер КАК Пакет,
	|	ВТ.НомерСтроки,
	|	ВТ.Ссылка.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ.Ссылка.Заказ) КАК ЗаказПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузоотправитель) КАК ГрузоотправительПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Грузополучатель) КАК ГрузополучательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Покупатель) КАК ПокупательПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.Продавец) КАК ПродавецПредставление,
	|	ВТ.КоличествоСостав КАК Количество,
	|	ВТ.Объем КАК Объем,
	|	ВЫРАЗИТЬ(ВТ.ОбъемТаможня КАК ЧИСЛО(15, 2)) КАК ОбъемП,
	|	ВТ.ВесНетто КАК ВесНеттоП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ + 2 КАК ТолщинаП,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ + 3 КАК ШиринаП,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Длина.ДлинаММ = 4000
	|			ТОГДА (алк_ПараметрыХарактеристик.Длина.ДлинаММ + 30) / 1000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА алк_ПараметрыХарактеристик.Длина.ДлинаММ = 3985
	|					ТОГДА (алк_ПараметрыХарактеристик.Длина.ДлинаММ + 5) / 1000
	|				ИНАЧЕ (алк_ПараметрыХарактеристик.Длина.ДлинаММ + 50) / 1000
	|			КОНЕЦ
	|	КОНЕЦ КАК ДлинаП,
	|	ВТ.КоличествоПакетов КАК КоличествоПакетов,
	|	ВТ.Номенклатура,
	|	алк_ПараметрыХарактеристик.Порода,
	|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
	|	ВТ.Ссылка.ИдентификаторТС КАК ИдентификаторТС,
	|	ПРЕДСТАВЛЕНИЕ(ВТ.Ссылка.ВидТранспорта) КАК ВидТранспортаПредставление,
	|	ВТ.Ссылка.Грузоподъемность КАК Грузоподъемность,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат.ПредставлениеНаПечать КАК СтрокаСертификат,
	|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоП,
	|	ВТ.Ссылка.Пломбы КАК Пломбы,
	|	ВТ.Ссылка.СтрокаИДКонтейнеров КАК СтрокаИДКонтейнеров,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	ВТ.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК БруттоПорт,
	|	ВТ.Ссылка.ВесКонтейнера КАК ВесКонтейнера,
	|	ВТ.Ссылка.Продавец КАК Продавец
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				&ДатаСреза,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ.СерийныйНомер
	|					ИЗ
	|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем),
	|	СУММА(ОбъемП),
	|	СУММА(ВесНеттоП),
	|	СУММА(КоличествоПакетов),
	|	СУММА(ВесБруттоП)
	|ПО
	|	Ссылка,
	|	СтрокаСертификат";
	
	Возврат Текст;		
	
КонецФункции // ()

Функция ВесТовараИзДокумента(Документ)
	
	ИтоговыеИзначения = новый Структура("ВесНетто,ВесБрутто,ВесБруттоПриВзвешиванииВПорту ");
	Запрос = Новый  Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Ссылка,
	               |	СУММА(алк_ТранспортировкаЗапасовЗапасы.ВесНетто) КАК ВесНетто,
	               |	СУММА(алк_ТранспортировкаЗапасовЗапасы.ВесБрутто) КАК ВесБрутто,
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту
	               |ИЗ
	               |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	               |ГДЕ
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту";
	
	Запрос.УстановитьПараметр("Ссылка",Документ);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() цикл 
		ЗаполнитьЗначенияСвойств(ИтоговыеИзначения,РезультатЗапроса);
	КонецЦикла;
	Возврат ИтоговыеИзначения;
	
КонецФункции

// Кон мод [Пакушев И.С.] [18.05.2018]


// Сформировать печатные формы объектов
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета, ПараметрыПечати = Неопределено)
	
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "ЖД_Пилмат" Тогда
			
			СформироватьЖДСпецификациюПМ_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент,Истина);
			
		КонецЕсли;
		
		Если ИмяМакета = "ЖД_Шпон" Тогда
			
			СформироватьЖДСпецификациюШпон(ТабличныйДокумент, ТекущийДокумент,Истина);
			
		КонецЕсли;
		
		Если ИмяМакета = "ЖД_Кусковой" Тогда
			
			СформироватьЖДСпецификациюКусковой(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;
		
		Если ИмяМакета = "ЖД_Карандаш" Тогда
			
			//СформироватьЖДСпецификациюКарандаш(ТабличныйДокумент, ТекущийДокумент);
			СформироватьЖДСпецификациюКарандаш_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент, Истина);
			
		КонецЕсли;
		
		Если ИмяМакета = "ЖД_Пилмат_Англ" Тогда
			
			СформироватьЖДСпецификациюПМ_Англ(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли; 
		
		Если ИмяМакета = "ЖД_Пилмат_Англ_ГД_ТД" Тогда
			
			СформироватьЖДСпецификациюПМ_Англ(ТабличныйДокумент, ТекущийДокумент,Ложь,Ложь," Bezrukov D. M.");
			
		КонецЕсли;

		
		Если ИмяМакета = "ЖД_Пилмат_Англ_ДЭЛ" Тогда
			
			СформироватьЖДСпецификациюПМ_Англ(ТабличныйДокумент, ТекущийДокумент,Истина);
			
		КонецЕсли; 
		
		Если ИмяМакета = "ЖД_Пилмат_Англ_ДЭЛ_ГД_ТД" Тогда
			
			СформироватьЖДСпецификациюПМ_Англ(ТабличныйДокумент, ТекущийДокумент,Истина,Ложь," Bezrukov D. M.");
			
		КонецЕсли;

		
		Если ИмяМакета = "ЖД_ШпонКитай_Англ" Тогда
						
			СформироватьЖДСпецификациюПМ_Англ(ТабличныйДокумент, ТекущийДокумент,Ложь,Истина);
			
		КонецЕсли;

		
		Если ИмяМакета = "М15" Тогда
			
			СформироватьМ15(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;
		
		Если ИмяМакета = "СправкаВес" Тогда
			
			СформироватьСправкаВес(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;
		
		
		// Нач мод [Пакушев И.С.] [18.05.2018] 
		// Обращение № [0000090454] [ТекстЗаявки]
		// Было
		// Стало
		Если ИмяМакета = "ЖД_ПилматБезРеквизитов" Тогда
			
			СформироватьЖДСпецификациюПМ_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент,Ложь);
			
		КонецЕсли;
		
		Если ИмяМакета = "ЖД_КусковойБезРеквизитов" Тогда
			
			СформироватьЖДСпецификациюКусковой_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;  
		
		Если ИмяМакета = "ЖД_ШпонБезРеквизитов" Тогда
			
			СформироватьЖДСпецификациюШпон(ТабличныйДокумент,ТекущийДокумент,Ложь);
			
		КонецЕсли;
		
		Если ИмяМакета = "ЖД_КарандашБезРеквизитов" Тогда
			
			СформироватьЖДСпецификациюКарандаш_БезРеквизитов(ТабличныйДокумент, ТекущийДокумент, Ложь);
			
		КонецЕсли;
		
		
		// Кон мод [Пакушев И.С.] [18.05.2018]
		
		// +РФП Чемезов
		Если ИмяМакета = "ТТН" Тогда
			ТабличныйДокумент = Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		КонецЕсли;
		// -РФП Чемезов
		
		Если ИмяМакета = "СертификатVGM" Тогда
			
			СформироватьСертификатVGM(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;  
		
		Если ИмяМакета = "ЖД_Пиловочник" Тогда
			
			Сформировать_ЖД_Пиловочник(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли; 
		
		Если ИмяМакета = "РапортСушки" Тогда
			
			СформироватьРапортСушки(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли; 
		
		
	КонецЦикла;
	
	// +РФП Чемезов
	ТабличныйДокумент.Автомасштаб = Истина;
	// -РФП Чемезов
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Пилмат";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для пиломатерила'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Шпон";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для шпона, фанеры'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Кусковой";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для кускового шпона'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Карандаш";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для карандашей, чураков, гранул'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;  
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Пиловочник";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для пиловочника'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
	// Нач мод [Пакушев И.С.] [18.05.2018] 
	// Обращение № [0000090454] [ТекстЗаявки]
	// Было
	// Стало  
	
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_ПилматБезРеквизитов";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для пиломатерила (без реквизитов)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 2;  
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_ШпонБезРеквизитов";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для шпона, фанеры (без реквизитов)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_КусковойБезРеквизитов";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для кускового шпона (без реквизитов)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_КарандашБезРеквизитов";
	КомандаПечати.Представление = НСтр("ru = 'Железнодорожная спецификация для карандашей, чураков (без реквизитов)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 2;
	
	// Кон мод [Пакушев И.С.] [18.05.2018]
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Пилмат_Англ";
	КомандаПечати.Представление = НСтр("ru = 'Packing list.'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;        
	
	//Дубинина + 09.02.26
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Пилмат_Англ_ГД_ТД";
	КомандаПечати.Представление = НСтр("ru = 'Packing list. (ГД ТД)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Пилмат_Англ_ДЭЛ_ГД_ТД";
	КомандаПечати.Представление = НСтр("ru = 'Packing list №ДЭЛ 2025/01 (ГД ТД)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	//Дубинина - 09.02.26
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_Пилмат_Англ_ДЭЛ";
	КомандаПечати.Представление = НСтр("ru = 'Packing list №ДЭЛ 2025/01'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖД_ШпонКитай_Англ";
	КомандаПечати.Представление = НСтр("ru = 'Packing list (CHINA).'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТТН";
	КомандаПечати.Представление = НСтр("ru = '1-Т (Товарно-транспортная накладная)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 20;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
	КомандаПечати.Идентификатор = "ТН";
	КомандаПечати.Представление = НСтр("ru = 'Приложение №4 (Товарная накладная)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 23;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
	КомандаПечати.Идентификатор = "ЭР";
	КомандаПечати.Представление = НСтр("ru = 'Экспедиторская расписка (ДГ)'");  
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 24;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СправкаВес";
	КомандаПечати.Представление = НСтр("ru = 'Справка расчета веса'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 30;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СертификатVGM";
	КомандаПечати.Представление = НСтр("ru = 'Сертификат VGM'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 30;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РапортСушки";
	КомандаПечати.Представление = НСтр("ru = 'Рапорт сушки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 30;
	
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ТТН", ПараметрыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Пилмат") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Пилмат", "Железнодорожная спецификация для пиломатерила", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Пилмат"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Шпон") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Шпон", "Железнодорожная спецификация для шпона", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Шпон"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Кусковой") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Кусковой", "Железнодорожная спецификация для кускового шпона", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Кусковой"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Карандаш") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Карандаш", "Железнодорожная спецификация для карандашей", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Карандаш"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ", "Packing list.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Пилмат_Англ"));
		
	КонецЕсли; 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ_ГД_ТД") Тогда   
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ_ГД_ТД", "Packing list.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Пилмат_Англ_ГД_ТД"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ_ДЭЛ") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ_ДЭЛ", "Packing list №ДЭЛ 2025/01.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Пилмат_Англ_ДЭЛ"));
		
	КонецЕсли;  
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ_ДЭЛ_ГД_ТД") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Пилмат_Англ_ДЭЛ_ГД_ТД", "Packing list №ДЭЛ 2025/01.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Пилмат_Англ_ДЭЛ_ГД_ТД"));
		
	КонецЕсли;  

	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_ШпонКитай_Англ") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_ШпонКитай_Англ", "Packing list (CHINA).", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_ШпонКитай_Англ"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаВес") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаВес", "Справка расчета веса", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СправкаВес"));
		
	КонецЕсли;
	
	
	// Нач мод [Пакушев И.С.] [18.05.2018] 
	// Обращение № [0000090454] [ТекстЗаявки]
	// Было
	// Стало
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_ПилматБезРеквизитов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_ПилматБезРеквизитов", "Железнодорожная спецификация для пиломатерила (без реквизитов)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_ПилматБезРеквизитов"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_ШпонБезРеквизитов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_ШпонБезРеквизитов", "Железнодорожная спецификация для шпона (без реквизитов)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_ШпонБезРеквизитов"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_КусковойБезРеквизитов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_КусковойБезРеквизитов", "Железнодорожная спецификация для кускового шпона (без реквизитов)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_КусковойБезРеквизитов"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_КарандашБезРеквизитов") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_КарандашБезРеквизитов", "Железнодорожная спецификация для карандашей (без реквизитов)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_КарандашБезРеквизитов"));
		
	КонецЕсли;
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СертификатVGM") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СертификатVGM", "Сертификат VGM", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СертификатVGM"));
		
	КонецЕсли;   
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖД_Пиловочник") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖД_Пиловочник", "Железнодорожная спецификация для пиловочника", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ЖД_Пиловочник"));
		
	КонецЕсли;

	
	//Кон мод [Пакушев И.С.] [18.05.2018]  
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РапортСушки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РапортСушки", "Рапорт сушки", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РапортСушки"));
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатиТН(ДокументСсылка) Экспорт
	
	
	ДанныеДляПечати = Новый Структура("КоличествоМест, Объем, ВесБрутто", 0, 0, 0); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК КоличествоСостав,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесНетто КАК ВесНетто,
	|	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто КАК ВесБрутто
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ДокументСсылка
	|ИТОГИ
	|	СУММА(КоличествоПакетов),
	|	СУММА(Объем),
	|	СУММА(ОбъемТаможня),
	|	СУММА(КоличествоСостав),
	|	СУММА(ВесНетто),
	|	СУММА(ВесБрутто)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	// Вставить обработку выборки ВыборкаОбщийИтог
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	ДанныеДляПечати.КоличествоМест = ВыборкаОбщийИтог.КоличествоПакетов;
	ДанныеДляПечати.Объем          = ВыборкаОбщийИтог.Объем;
	ДанныеДляПечати.ВесБрутто      = ВыборкаОбщийИтог.ВесБрутто;
	
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ОформитьДанныеВСтроку(ТЗ_Данных,НаимКолонки)
	Для каждого Строка из ТЗ_Данных цикл
		СтрокаИтог = СтрокаИтог + Строка[НаимКолонки];
	КонецЦикла;
КонецФункции

#КонецОбласти


#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыКПоступлениюНаСкладыСерии(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ЯчейкаПолучатель КАК Ячейка,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	1 КАК КоличествоПакетов,
	|	&ВидДвиженияНакопления КАК ВидДвижения,
	|	&Период
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировкаЗапасов);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаТранспортировкаЗапасов.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Приход);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыКПоступлениюНаСкладыСерии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыполнениеЗаказовЭтапыСерии(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	1 КАК КоличествоПакетов,
	|	&Период,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.Мультизаказ
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.Заказ
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	&ЭтапВыполнения КАК ЭтапВыполненияЗаказа,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировкаЗапасов);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаТранспортировкаЗапасов.Дата);
	Запрос.УстановитьПараметр("ЭтапВыполнения", Перечисления.алк_ЭтапыВыполненияЗаказов.Отгрузка);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеЗаказовЭтапыСерии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВыполнениеЗаказовЭтапыСерии

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОтгрузкаРасходников(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.ДокументОснование КАК ДокументРН,
	|	алк_ТранспортировкаЗапасов.ДокументыОснования.(
	|		ДокументОснование КАК ДокументОснованиеМультизаказ
	|	),
	|	алк_ТранспортировкаЗапасов.Ссылка КАК ДокументОтгрузки,
	|	&Период
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировкаЗапасов);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаТранспортировкаЗапасов.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если ДокументСсылкаТранспортировкаЗапасов.Мультизаказ Тогда
			
			тзРезультат = Новый ТаблицаЗначений;
			тзРезультат.Колонки.Добавить("ДокументРН");
			тзРезультат.Колонки.Добавить("ДокументОтгрузки");
			тзРезультат.Колонки.Добавить("Период");
			
			ВыборкаДокументы = ВыборкаШапка.ДокументыОснования.Выбрать();
			
			Пока ВыборкаДокументы.Следующий() Цикл
				
				НоваяСтрока = тзРезультат.Добавить();
				НоваяСтрока.ДокументРН = ВыборкаДокументы.ДокументОснованиеМультизаказ;
				НоваяСтрока.ДокументОтгрузки = ВыборкаШапка.ДокументОтгрузки;
				НоваяСтрока.Период = ВыборкаШапка.Период;
				
			КонецЦикла; 
			
		Иначе
			
			тзРезультат = РезультатЗапроса.Выгрузить();
			
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	тзРезультат.Свернуть("ДокументРН, ДокументОтгрузки, Период");
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтгрузкаРасходников", тзРезультат);
	
КонецПроцедуры

Процедура СформироватьТаблицуПроизводствоОборот(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПереданоВОтгрузку) КАК Операция,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Участок КАК Участок,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация КАК Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Сертификат КАК Сертификат,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ЖДТупик) КАК Склад,
	|	алк_ГрафикСмен.Бригада КАК Бригада,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаСмены КАК ДатаСмены,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Смена КАК Смена,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано) КАК ВидДвиженияПроизводства
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрафикСмен КАК алк_ГрафикСмен
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаСмены = алк_ГрафикСмен.ДатаСмены
	|			И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Смена = алк_ГрафикСмен.Смена
	|			И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Участок = алк_ГрафикСмен.Участок
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Отгрузка),
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Участок,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Сертификат,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ЖДТупик),
	|	алк_ГрафикСмен.Бригада,
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Смена,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрафикСмен КАК алк_ГрафикСмен
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаСмены = алк_ГрафикСмен.ДатаСмены
	|			И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Смена = алк_ГрафикСмен.Смена
	|			И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Участок = алк_ГрафикСмен.Участок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасов.Ссылка
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасов.Ссылка = &ДокументСсылка
	|	И НЕ алк_ТранспортировкаЗапасов.ДатаКУчету_ТД = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасов.ПриемкаВПортуДата,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПриемкаВПорту),
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Участок,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Сертификат,
	|	алк_ТранспортировкаЗапасов.СтруктурнаяЕдиницаПолучатель,
	|	алк_ГрафикСмен.Бригада,
	|	алк_ТранспортировкаЗапасов.ПриемкаВПортуДата,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Смена,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрафикСмен КАК алк_ГрафикСмен
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаСмены = алк_ГрафикСмен.ДатаСмены
	|			И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Смена = алк_ГрафикСмен.Смена
	|			И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Участок = алк_ГрафикСмен.Участок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасов.Ссылка
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ПриемкаВПорту
	|	И алк_ТранспортировкаЗапасов.Ссылка = &ДокументСсылка
	|	И НЕ алк_ТранспортировкаЗапасов.ПриемкаВПортуДата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)");
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылкаТранспортировкаЗапасов);
	Запрос.УстановитьПараметр("ЗаписыватьПилматДГ", РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДокументСсылкаТранспортировкаЗапасов.Дата)); 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", Результат);
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыТупикЖДиПорт(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	// для ЖД отгрузок - расход из ЖДтупик привязан к дате учета ТД и галочке выгружать
	// для всех остальных - расход оформляется в момент прихода (для формирования общих оборотов отгрузок) 
	
	// тогда получаем что приход в ЖДтупик за период - это отгружено,
	// а расход за период - это реализовано (выгружать - установлено, значит учет по бухгалтерии прошел)
	
	
	Запрос = Новый Запрос;
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация КАК Организация,
	|	&ЖДтупик КАК СтруктурнаяЕдиница,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Сертификат КАК Сертификат,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаНачалаУчетаТоваровВПортах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = &ТранспортировкаЖД
	|			ТОГДА ВЫБОР
	|					КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД = НАЧАЛОПЕРИОДА(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата, ДЕНЬ)
	|							ИЛИ алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА КОНЕЦПЕРИОДА(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата, ДЕНЬ)
	|					ИНАЧЕ КОНЕЦПЕРИОДА(алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД, ДЕНЬ)
	|				КОНЕЦ
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата
	|	КОНЕЦ,
	|	&ВидДвиженияНакопленияРасход,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	&ЖДтупик,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Сертификат,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = &ТранспортировкаЖД
	|				ТОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД
	|						И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаНачалаУчетаТоваровВПортах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПортуДата,
	|	&ВидДвиженияНакопленияПриход,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Сертификат,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.Код = ""ПБ-00000018""
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПорту
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1)
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.алк_УчетТоваровВПорту
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаНачалаУчетаТоваровВПортах";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировкаЗапасов);
	Запрос.УстановитьПараметр("ТранспортировкаЖД", Перечисления.алк_ВидыТранспортировки.Железнодорожная);
	Запрос.УстановитьПараметр("ЖДтупик", Справочники.СтруктурныеЕдиницы.ЖДтупик);  
	Запрос.УстановитьПараметр("ДатаНачалаУчетаТоваровВПортах", Константы.алк_ДатаНачалаУчетаТоваровВПортах.Получить());    //20220901
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);  
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", РезультатЗапроса.Выгрузить());  
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыТоварыВПути(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	|ПОМЕСТИТЬ ВТ_пакеты
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.алк_УчетТоваровВПути
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаНачалаУчетаТоваровВПути
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1)
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД КАК Период,
	|	&ВидДвиженияНакопленияПриход КАК ВидДвижения,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_пакеты.СерийныйНомер
	|					ИЗ
	|						ВТ_пакеты КАК ВТ_пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаНачалаУчетаТоваровВПути
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.алк_УчетТоваровВПути
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1)
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПортуДата,
	|	&ВидДвиженияНакопленияРасход,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_пакеты.СерийныйНомер
	|					ИЗ
	|						ВТ_пакеты КАК ВТ_пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПорту
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаНачалаУчетаТоваровВПути
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.алк_УчетТоваровВПути
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1)
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировкаЗапасов);
	Запрос.УстановитьПараметр("ДатаНачалаУчетаТоваровВПути", Константы.алк_ДатаНачалаУчетаТоваровВПути.Получить());    //20220901
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);  
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиТоварыВПути", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти


#Область ИнициализацияДаных

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	ИспользоватьНовоеПроведение = Ложь;
		
	Если СтруктураДополнительныеСвойства.Свойство("ИспользоватьАддендумы") И Не ИспользоватьНовоеПроведение тогда
	  	ИспользоватьНовоеПроведение = СтруктураДополнительныеСвойства.ИспользоватьАддендумы;
	КонецЕсли;
	
	Если ИспользоватьНовоеПроведение тогда
		НовыйМеханизмПроведения(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);
	Иначе
		СтарыйМеханизмПроведения(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);	
	КонецЕсли;
	
	МассивНоменклатуры = ДокументСсылкаТранспортировкаЗапасов.Запасы.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНоменклатуры);

	// 26.07.2023 Дубоделов Э.А Новое условие для записи в алк_ПроизводствоОборот +++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(СтруктураДополнительныеСвойства.ДляПроведения.Дата)
		И (МассивНоменклатуры.Найти(Справочники.Номенклатура.Шпон) = Неопределено
			ИЛИ МассивНоменклатуры.Найти(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002")) = Неопределено) Тогда //Пиловочник пишется всегда
		
		СформироватьТаблицуПроизводствоОборот(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства); 
		
	КонецЕсли;
	// 26.07.2023 Дубоделов Э.А Новое условие для записи в алк_ПроизводствоОборот ---
	
	СформироватьТаблицаЗапасыТупикЖДиПорт(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасыТоварыВПути(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);
	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура НовыйМеханизмПроведения(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	СформироватьТаблицаОтгрузкаРасходников(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицуПроизводствоОборот(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);	
		
КонецПроцедуры

Процедура СтарыйМеханизмПроведения(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	СформироватьТаблицаЗапасыКПоступлениюНаСкладыСерии(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВыполнениеЗаказовЭтапыСерии(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Дата,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫРАЗИТЬ(алк_РасходнаяНакладнаяЗапасы.Ссылка.Заказ КАК Документ.алк_ЗаказПокупателя) КАК Заказ,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав
	|ПОМЕСТИТЬ ВТ_Отгрузка
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_РасходнаяНакладнаяЗапасы.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И алк_РасходнаяНакладнаяЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование
	|			ИЗ
	|				Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|			ГДЕ
	|				алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = &Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК ДатаСобытия,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Отгрузка) КАК Операция,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				&ДатаСреза,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_Отгрузка.СерийныйНомер
	|					ИЗ
	|						ВТ_Отгрузка КАК ВТ_Отгрузка)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Отгрузка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_Отгрузка.Заказ КАК алк_ЗаказПокупателя,
	|	ВТ_Отгрузка.Характеристика КАК Характеристика,
	|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО КАК алк_КатегорияНоменклатурыПЭО,
	|	ВТ_Отгрузка.Объем КАК ОбъемОтгружено
	|ИЗ
	|	ВТ_Отгрузка КАК ВТ_Отгрузка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				&ДатаСреза,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_Отгрузка.СерийныйНомер
	|					ИЗ
	|						ВТ_Отгрузка КАК ВТ_Отгрузка)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО ВТ_Отгрузка.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Отгрузка) КАК Операция,
	|	алк_ТранспортировкаЗапасовЗапасы.Объем,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспорта.ФитинговаяПлатформа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ВидыОтгрузки.Контейнерами)
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспорта.Автофура)
	|				ИЛИ алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспорта = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспорта.Автоплатформа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ВидыОтгрузки.Машинами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ВидыОтгрузки.Вагонами)
	|	КОНЕЦ КАК ВидОтгрузки,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация,
	|	алк_ТранспортировкаЗапасовЗапасы.Характеристика
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
	|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика КАК Характеристика,
	|	СУММА(алк_ТранспортировкаЗапасовЗапасы.Объем) КАК Объем,
	|	СУММА(алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав) КАК Количество,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПорту,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПортуДата
	|ПОМЕСТИТЬ ВТ_ВПути
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				&ДатаСреза,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_Отгрузка.СерийныйНомер
	|					ИЗ
	|						ВТ_Отгрузка КАК ВТ_Отгрузка)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|	И НЕ алк_ТранспортировкаЗапасовЗапасы.Ссылка.Заказ = ЗНАЧЕНИЕ(Документ.алк_ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПортуДата,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПорту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВПути.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_ВПути.Номенклатура,
	|	ВТ_ВПути.СтруктурнаяЕдиницаПолучатель,
	|	ВТ_ВПути.КатегорияНоменклатурыПЭО,
	|	ВТ_ВПути.Характеристика,
	|	ВТ_ВПути.Объем,
	|	ВТ_ВПути.Количество
	|ИЗ
	|	ВТ_ВПути КАК ВТ_ВПути";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировкаЗапасов);
	Запрос.УстановитьПараметр("ДатаСреза", ДокументСсылкаТранспортировкаЗапасов.Дата);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПокупателейОстатки", МассивРезультатов[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиТоварыВПути", МассивРезультатов[5].Выгрузить());
	
	
	СформироватьТаблицаОтгрузкаРасходников(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства);
		
КонецПроцедуры
#КонецОбласти


Функция ПолучитьДанныеЗаполненияТабличнойЧастиЗапасы(ДокументыОснования, ДатаДокумент = Неопределено) Экспорт
	Если ДатаДокумент = Неопределено или Не ЗначениеЗаполнено(ДатаДокумент) тогда
		ДатаДокумент = ТекущаяДата();
	КонецЕсли;
	Запрос = новый запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
	|	алк_РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	алк_РасходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	|	алк_РасходнаяНакладнаяЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_РасходнаяНакладнаяЗапасы.Количество КАК Количество,
	|	алк_РасходнаяНакладнаяЗапасы.КоличествоСостав КАК КоличествоСостав,
	|	алк_РасходнаяНакладнаяЗапасы.Сертификат КАК Сертификат,
	|	алк_РасходнаяНакладнаяЗапасы.ИдентификаторТовара КАК ИдентификаторТовара,
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка.Заказ КАК Заказ,
	|	алк_ПараметрыХарактеристик.Порода КАК Порода,
	|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	|	алк_ПараметрыХарактеристик.Длина КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
	|	алк_ПараметрыХарактеристик.Объем КАК Объем
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_РасходнаяНакладнаяЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка В(&ДокументыОснования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3 КАК ПлотностьКгМ3,
	|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг КАК ВесТарыКг,
	|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПлотностиПриоритет
	|ИЗ
	|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	|			&Период,
	|			(Номенклатура, Характеристика) В
	|				(ВЫБРАТЬ
	|					ВТ.Номенклатура,
	|					ВТ.Характеристика
	|				ИЗ
	|					ВТ_Товары КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
	|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
	|	ВТ_Товары.Характеристика,
	|	ВТ_Товары.Номенклатура,
	|	2
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	|				&Период,
	|				(Номенклатура, Порода, Сорт) В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура,
	|						ВТ.Порода,
	|						ВТ.Сорт
	|					ИЗ
	|						ВТ_Товары КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	|		ПО (алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура = ВТ_Товары.Номенклатура)
	|			И (алк_ПлотностьНоменклатурыСрезПоследних.Порода = ВТ_Товары.Порода)
	|			И (алк_ПлотностьНоменклатурыСрезПоследних.Сорт = ВТ_Товары.Сорт)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
	|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
	|	ВТ_Товары.Характеристика,
	|	ВТ_Товары.Номенклатура,
	|	3
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	|				&Период,
	|				(Номенклатура, Порода) В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура,
	|						ВТ.Порода
	|					ИЗ
	|						ВТ_Товары КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	|		ПО ВТ_Товары.Номенклатура = алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура
	|			И (алк_ПлотностьНоменклатурыСрезПоследних.Порода = ВТ_Товары.Порода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.СерийныйНомер КАК СерийныйНомер,
	|	ЕСТЬNULL(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ВТ_Товары.Количество / ВТ_Товары.Объем КАК ЧИСЛО(15, 3))) * ((ВТ_Товары.Длина.ДлинаММ + алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоДлине) * (ВТ_Товары.Сечение.ТолщинаММ + алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоТолщине) * (ВТ_Товары.Сечение.ШиринаММ + алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоШирине) / 10000000) КАК ЧИСЛО(15, 2)), ВТ_Товары.Количество) КАК ОбъемСПрипуском
	|ПОМЕСТИТЬ ВТ_Припуск
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ.СерийныйНомер
	|					ИЗ
	|						ВТ_Товары КАК ВТ)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|		ПО ВТ_Товары.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	НЕ ВТ_Товары.Ссылка.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	|	И НЕ ВТ_Товары.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика,
	|	ВТ_Товары.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА ОКР(ВТ_Товары.Количество * 1000 / ЕСТЬNULL(ВЗ_Плотность.ПлотностьКгМ3, 0), 3)
	|		ИНАЧЕ ВТ_Товары.Количество
	|	КОНЕЦ КАК Объем,
	|	ВТ_Товары.КоличествоСостав КАК КоличествоСостав,
	|	ВТ_Товары.Сертификат КАК Сертификат,
	|	ВТ_Товары.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ВТ_Товары.Заказ КАК Заказ,
	|	ЕСТЬNULL(ВЗ_Плотность.ПлотностьКгМ3, 0) КАК Плотность,
	|	ЕСТЬNULL(ВЗ_Плотность.ВесТарыКг, 0) КАК ВесТары,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА ВТ_Товары.Количество
	|		ИНАЧЕ ОКР(ВТ_Товары.Количество * ЕСТЬNULL(ВЗ_Плотность.ПлотностьКгМ3, 0) / 1000, 3)
	|	КОНЕЦ КАК ВесНетто,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА ВТ_Товары.Количество + ЕСТЬNULL(ВЗ_Плотность.ВесТарыКг, 0) / 1000
	|		ИНАЧЕ ОКР((ВТ_Товары.Количество * ЕСТЬNULL(ВЗ_Плотность.ПлотностьКгМ3, 0) + ЕСТЬNULL(ВЗ_Плотность.ВесТарыКг, 0)) / 1000, 3)
	|	КОНЕЦ КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА ОКР(ВТ_Товары.Количество * 1000 / ЕСТЬNULL(ВЗ_Плотность.ПлотностьКгМ3, 0), 3)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Припуск.ОбъемСПрипуском, ВТ_Товары.Количество)
	|	КОНЕЦ КАК ОбъемТаможня
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуск КАК ВТ_Припуск
	|		ПО ВТ_Товары.СерийныйНомер = ВТ_Припуск.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ВТ_ПлотностиПриоритет.ПлотностьКгМ3) КАК ПлотностьКгМ3,
	|			МАКСИМУМ(ВТ_ПлотностиПриоритет.ВесТарыКг) КАК ВесТарыКг,
	|			ВТ_ПлотностиПриоритет.Характеристика КАК Характеристика,
	|			ВТ_ПлотностиПриоритет.Номенклатура КАК Номенклатура
	|		ИЗ
	|			ВТ_ПлотностиПриоритет КАК ВТ_ПлотностиПриоритет
	|		ГДЕ
	|			(ВТ_ПлотностиПриоритет.Номенклатура, ВТ_ПлотностиПриоритет.Характеристика, ВТ_ПлотностиПриоритет.Приоритет) В
	|					(ВЫБРАТЬ
	|						ВТ_ПлотностиПриоритет.Номенклатура,
	|						ВТ_ПлотностиПриоритет.Характеристика,
	|						МИНИМУМ(ВТ_ПлотностиПриоритет.Приоритет) КАК Приоритет
	|					ИЗ
	|						ВТ_ПлотностиПриоритет КАК ВТ_ПлотностиПриоритет
	|					СГРУППИРОВАТЬ ПО
	|						ВТ_ПлотностиПриоритет.Номенклатура,
	|						ВТ_ПлотностиПриоритет.Характеристика)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ПлотностиПриоритет.Номенклатура,
	|			ВТ_ПлотностиПриоритет.Характеристика) КАК ВЗ_Плотность
	|		ПО ВТ_Товары.Номенклатура = ВЗ_Плотность.Номенклатура
	|			И ВТ_Товары.Характеристика = ВЗ_Плотность.Характеристика");
	
	Запрос.УстановитьПараметр("Период", ДатаДокумент);
	Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Процедура КонтрольСоответствияЗапасовОснованиям(ТранспортировкаЗапасов, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.ДокументОснование КАК РасходнаяНакладная
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.Ссылка = &ТранспортировкаЗапасов
	|	И НЕ алк_ТранспортировкаЗапасов.Мультизаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|ГДЕ
	|	алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = &ТранспортировкаЗапасов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	СУММА(ВЫБОР
	|			КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура = &Пеллеты
	|				ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	|			ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|		КОНЕЦ) КАК Объем,
	|	алк_ТранспортировкаЗапасовЗапасы.Заказ
	|ПОМЕСТИТЬ ВТ_ЗапасыТЗ
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &ТранспортировкаЗапасов
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_РасходнаяНакладнаяЗапасы.СерийныйНомер,
	|	СУММА(алк_РасходнаяНакладнаяЗапасы.Количество) КАК Количество,
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка.Заказ
	|ПОМЕСТИТЬ ВТ_ЗапасыРН
	|ИЗ
	|	Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.РасходнаяНакладная
	|			ИЗ
	|				ВТ_Документы КАК ВТ)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_РасходнаяНакладнаяЗапасы.СерийныйНомер,
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ЗапасыРН.СерийныйНомер КАК СерийныйНомерРН,
	|	ВТ_ЗапасыРН.Количество КАК КоличествоРН,
	|	ВТ_ЗапасыТЗ.СерийныйНомер КАК СерийныйНомерТЗ,
	|	ВТ_ЗапасыТЗ.Объем КАК КоличествоТЗ
	|ИЗ
	|	ВТ_ЗапасыТЗ КАК ВТ_ЗапасыТЗ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ЗапасыРН КАК ВТ_ЗапасыРН
	|		ПО ВТ_ЗапасыТЗ.СерийныйНомер = ВТ_ЗапасыРН.СерийныйНомер
	|			И ВТ_ЗапасыТЗ.Заказ = ВТ_ЗапасыРН.Заказ
	|ГДЕ
	|	(ВТ_ЗапасыРН.СерийныйНомер ЕСТЬ NULL
	|			ИЛИ ВТ_ЗапасыТЗ.СерийныйНомер ЕСТЬ NULL
	|			ИЛИ ВТ_ЗапасыРН.Количество <> ВТ_ЗапасыТЗ.Объем)";
	
	Запрос.УстановитьПараметр("ТранспортировкаЗапасов", ТранспортировкаЗапасов); 
	Запрос.УстановитьПараметр("Пеллеты", УстановитьНоменПеллеты());
	
	Выборка = Запрос.Выполнить().Выбрать();  //  РезультатЗапроса.Выгрузить()
	
	Если Выборка.Количество() > 0 тогда
		ТекстОшибки = СтрШаблон("Состав номенклатуры документа %1 не соответствует документу основанию! Перезаполните по основанию.", ТранспортировкаЗапасов);
		Пока Выборка.Следующий() Цикл
			ТекстСтроки = "";
			Если Не Выборка.СерийныйНомерРН = NULL И Не Выборка.СерийныйНомерТЗ = NULL тогда
				ТекстСтроки = СтрШаблон("*По пакету №%1 не соответствует объем, в документе основания составляет %2, а в текущем документе %3;"
					, Выборка.СерийныйНомерРН, Выборка.КоличествоРН, Выборка.КоличествоТЗ);
			ИначеЕсли Не Выборка.СерийныйНомерРН = NULL тогда
				ТекстСтроки = СтрШаблон("*В текущем документе отсустует пакет №%1, который есть в документе основания;"
					, Выборка.СерийныйНомерРН);	
			ИначеЕсли Не Выборка.СерийныйНомерТЗ = NULL тогда 
				ТекстСтроки = СтрШаблон("*В текущем документе есть пакет №%1, который отсуствует в документе основания;"
					, Выборка.СерийныйНомерТЗ);
			КонецЕсли;
			ТекстОшибки = ТекстОшибки + Символы.ПС + ТекстСтроки;
			
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ТранспортировкаЗапасов,,, Отказ);
	КонецЕсли;
КонецПроцедуры  

Функция УстановитьНоменПеллеты()
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	Номенклатура.Ссылка
	              |ИЗ
	              |	Справочник.Номенклатура КАК Номенклатура
	              |ГДЕ
	              |	Номенклатура.Код = &Код";
	Запрос.УстановитьПараметр("Код", "ПБ-00000018"); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции

Функция УстановитьУчастокШпон()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Участки.Ссылка
	               |ИЗ
	               |	Справочник.алк_Участки КАК алк_Участки
	               |ГДЕ
	               |	алк_Участки.Код = ""000000038""";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Ссылка;
	КонецЦикла;
КонецФункции
Функция ПолучитьАнглНаимКонтрагента(Ссылка) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрагентыДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	               |ГДЕ
	               |	КонтрагентыДополнительныеРеквизиты.Ссылка = &Ссылка
	               |	И КонтрагентыДополнительныеРеквизиты.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Наименование английское")); 
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Справочники.Контрагенты.ПустаяСсылка(); 
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл  
		Возврат Выборка.Значение;
	КонецЦикла;

КонецФункции