
#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		Заказ = ДанныеЗаполнения.Заказ;	
	КонецЕсли; 
	
	Если ДанныеЗаполнения.Свойство("ВидТранспортировки") Тогда
		ВидТранспортировки = ДанныеЗаполнения.ВидТранспортировки;	
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик заполнения документа на основании Приходной накладной.
//
// Параметры:
//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
//
Процедура ЗаполнитьПоРасходнойНакладной(ДанныеЗаполнения, Операция = "") Экспорт
	
	Комментарий  = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Комментарий), "#" + ДанныеЗаполнения.Комментарий + ";", "");
	
	//ИспользоватьАддедндумы = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Участок, "ИспользуютсяАддендумы") = Истина);
	//Если ИспользоватьАддедндумы тогда
	Мультизаказ = Истина;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,СтрокаИДКонтейнеров,ДопАналитика,Участок,Заказ");
	
	ДокументыОснования.Очистить();
	СтрокаДокОснования = ДокументыОснования.Добавить();
	СтрокаДокОснования.ДокументОснование = ДанныеЗаполнения.Ссылка;
	
	ТоварыДляЗаполнения = Документы.алк_ТранспортировкаЗапасов.ПолучитьДанныеЗаполненияТабличнойЧастиЗапасы(
	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗаполнения.Ссылка));
	Запасы.Загрузить(ТоварыДляЗаполнения);
	//Иначе
	//	// Заполнение шапки документа.
	//	ДокументОснование = ДанныеЗаполнения.Ссылка;
	//	Организация = ДанныеЗаполнения.Организация;
	//	Заказ = ДанныеЗаполнения.Заказ;
	//	Направление = ДанныеЗаполнения.Направление; 
	//	Участок = ДанныеЗаполнения.Участок;
	//	СтрокаИДКонтейнеров = ДанныеЗаполнения.СтрокаИДКонтейнеров;
	//	ДопАналитика = ДанныеЗаполнения.ДопАналитика;
	//	
	//	
	//	Для Каждого ТекСтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл
	//		
	//		НоваяСтрока = Запасы.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаЗапасы, "КоличествоПакетов,Номенклатура,СерийныйНомер");
	//		НоваяСтрока.КоличествоПакетов = ТекСтрокаЗапасы.КоличествоПакетов;
	//		НоваяСтрока.Номенклатура = ТекСтрокаЗапасы.Номенклатура;
	//		НоваяСтрока.СерийныйНомер = ТекСтрокаЗапасы.СерийныйНомер;
	//		
	//		ПараметрыП = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(ТекСтрокаЗапасы.СерийныйНомер);
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыП);
	//		
	//		НоваяСтрока.ОбъемТаможня = Окр(НоваяСтрока.ОбъемТаможня, 2);
	//		
	//		НоваяСтрока.НомерСерии = ПараметрыП.НомерПакета;
	//		НоваяСтрока.ВесНетто   = ПараметрыП.ВесНеттоТаможня;
	//		НоваяСтрока.ВесБрутто  = ПараметрыП.ВесБруттоТаможня;
	//		
	//		НоваяСтрока.Заказ      = Заказ;
	//		
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

// Обработчик заполнения на основании данных заполнения.
//
// Параметры:
//  ДанныеЗаполнения - Структура.
//
Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ОнЖе = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьЗапасыПоТЧДокументыОснования();
	
КонецПроцедуры

Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	Запасы.Очистить();
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_РасходнаяНакладная") Тогда
		
		ЗаполнитьПоРасходнойНакладной(ДокументОснование);
		
	КонецЕсли
	
	
КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()


#КонецОбласти


#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
		
		Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
			
			Если Не ЭтотОбъект.ДокументОснование.Проведен  Тогда
				Сообщить("Вы не можете создавать документ на основании не проведенного документа. Проведите Расходную накладную!");
				Возврат;
			КонецЕсли;	
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_РасходнаяНакладная") тогда			
		Если ДанныеЗаполнения.Проведен  Тогда
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
		Иначе
			Сообщить("Вы не можете создавать документ на основании не проведенного документа. Проведите Расходную накладную!");
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_РасходнаяНакладная") Тогда
		
		СписокПодчиненных = ПолучитьПодчиненныеОснованию();
		
		Сообщение = Новый СообщениеПользователю;
		
		СсылкиСообщение = "";
		Для каждого СсылкаПодч Из СписокПодчиненных Цикл
			
			Если ТипЗнч(СсылкаПодч.Значение) = Тип("ДокументСсылка.алк_ТранспортировкаЗапасов") Тогда
				СсылкиСообщение = СсылкиСообщение + ?(СсылкиСообщение = "", "", Символы.ВК) + СсылкаПодч.Значение;
				Отказ = Истина;
			КонецЕсли; 
			
			Если Отказ Тогда
				Сообщение.Текст = "В базе есть документы ""Транспортировка запасов"", подчененные РН: "
				+ ДокументОснование + Символы.ВК 
				+ "   - " + СсылкиСообщение + Символы.ВК + "Запись документа невозможна!";
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ИзмененияЗапрещены = РегистрыСведений.РФП_ИзмененияЗапрещены.ПолучитьСостояниеИзмененияЗапрещены(Ссылка);
	
	Если ИзмененияЗапрещены Тогда
		Отказ = Истина; 
		Сообщить("Ошибка! Включите возможность изменения документа.");
		Возврат;
	КонецЕсли;
	
	//Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		//ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена);
		
		ПараметрыСмены = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Смена,ДатаСмены);		
		
		Дата = ПараметрыСмены.ДатаВремяКонцаСмены - 10; //РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
		
	//КонецЕсли; 
	
	ОбъемДокумента = Запасы.Итог("Объем");
	ОбъемТаможняДокумента = Запасы.Итог("ОбъемТаможня");
	
	СерийныеНомера = Запасы.Выгрузить(,"СерийныйНомер").ВыгрузитьКолонку("СерийныйНомер");
	СерийныеНомера = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СерийныеНомера);
	КоличествоПакетовДокумента = СерийныеНомера.Количество();
	
	//Если ВыгружатьВ_ТД И Не ЗначениеЗаполнено(ДатаКУчету_ТД) Тогда
	//	ДатаКУчету_ТД = Дата;		
	//КонецЕсли; 
	
	Если Дата > ДатаКУчету_ТД И ЗначениеЗаполнено(ДатаКУчету_ТД) Тогда 
		
		Сообщить("Дата к учету ТД меньше даты документа! Проверьте заполнение!");	
	
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ДокументыОснования.Количество() > 0 тогда
		Заказ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументыОснования[0].ДокументОснование, "Заказ" );
		ДополнительныеСвойства.Вставить("ИспользоватьАддендумы", ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы"));
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Соберем массив для контроля остатков  
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|  алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		РезультатЗапроса = Запрос.Выполнить();  
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
		
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель
			|ИЗ
			|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|	И алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
			
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		ДополнительныеСвойства.Вставить("КонтролироватьОстаткиНаДатуДокумента",Ложь);
		
	КонецЕсли;
	
	Если НЕ Мультизаказ Тогда
		ДокументыОснования.Очистить();
		СтрокаТЧОснования = ДокументыОснования.Добавить();
		СтрокаТЧОснования.ДокументОснование = ДокументОснование;  
	КонецЕсли;
	
	//Проверка, что у транспортировки запасов совпадает дата смены и смена с расходной  
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДокументыОснования.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	Для Каждого эл ИЗ ДокументыОснования Цикл
		Расходная = эл.ДокументОснование;
		Если Расходная.ДатаСмены <> ДатаСмены ИЛИ Расходная.Смена <> Смена Тогда 
			
			Если Расходная.ДатаСмены <> ДатаСмены И Расходная.Смена <> Смена Тогда 
				Сообщить(СтрШаблон("В документе %1 и транспортировке не совпадают даты смен и смены!",Строка(Расходная)));
			Иначе  
				Если ДатаСмены <> Расходная.ДатаСмены Тогда  
					Сообщить(СтрШаблон("В документе %1 и транспортировке не совпадают даты смен!",Строка(Расходная))); 
				КонецЕсли;
				
				Если Смена <> Расходная.Смена  Тогда
					Сообщить(СтрШаблон("В документе %1 и транспортировке не совпадают смены!",Строка(Расходная))); 
				КонецЕсли;	
			КонецЕсли;
			
			Отказ = Истина;
			
		КонецЕсли;
	КонецЦикла; 
	
	//Проверка, что заказы в документах основания и запасах совпадают
	Таб = Запасы.Выгрузить();
	Таб.Свернуть("Заказ",);  
	
	Если Таб.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	КолЗаказ = 0;
	Соответсвие = 0;
	Если ЗначениеЗаполнено(Таб[0].Заказ) Тогда  
		Для Каждого Строка Из Таб Цикл    
			КолЗаказ = КолЗаказ + 1;
			Для Каждого Док ИЗ ДокументыОснования Цикл 
				Если Строка.Заказ = Док.ДокументОснование.Заказ Тогда
					Соответсвие = Соответсвие + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если КолЗаказ <> Соответсвие И  КолЗаказ > 0 Тогда  
		Сообщить("Заказы в таблицах Расходные накладные и Продукция не совпадают!");	
		Отказ = Истина;
	    КонецЕсли;	
	КонецЕсли;

	//\\
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 
	
	// Отражение в разделах учета
	НовыйМеханизмПроведения = Ложь;
	
	МассивНоменклатуры = Запасы.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНоменклатуры);
	
	Если ДополнительныеСвойства.Свойство("ИспользоватьАддендумы") Тогда
		НовыйМеханизмПроведения = ДополнительныеСвойства.ИспользоватьАддендумы;
	КонецЕсли;

	Если НовыйМеханизмПроведения Тогда
		Документы.алк_ТранспортировкаЗапасов.КонтрольСоответствияЗапасовОснованиям(Ссылка, Отказ);  	
	КонецЕсли; 
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.алк_ТранспортировкаЗапасов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	//ДополнительныеСвойства.ДляПроведения.Вставить("Номенклатура", МассивНоменклатуры);
	
	Если Не НовыйМеханизмПроведения тогда
		//РфпСервер.ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьВыполнениеЗаказовЭтапыСерии(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьДвиженияПоОсткамПоЗаказам(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. Оборотный регистр ++
		РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ); 
		//Сергеева Г.О. Оборотный регистр --
			
		РфпСервер.ОтразитьОстаткиТоварыВПути(ДополнительныеСвойства, Движения, Отказ); 
		
		// СерийныеНомера
		УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	РфпСервер.ОтразитьОтгрузкуРН(ДополнительныеСвойства, Движения, Отказ);
	
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда  
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);  // товары не переданные на ТД (в ЖД тупике) и в порту   
	КонецЕсли;
	
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВРегистрТоварыВПуи(Дата) Тогда  
		РфпСервер.ОтразитьОстаткиТоварыВПути(ДополнительныеСвойства, Движения, Отказ);  
	КонецЕсли;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 
	
	//ПРОВЕРКА
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение); 
	//\\
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)   
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства); 
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);  
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  
	
КонецПроцедуры

#КонецОбласти


#Область Служебные

Функция ПолучитьПодчиненныеОснованию()
	
	СписокСсылок = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДокументОснование = &ДокументОснование
	|	И алк_ТранспортировкаЗапасов.Ссылка <> &Ссылка
	|	И алк_ТранспортировкаЗапасов.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписокСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);	
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат СписокСсылок;
	
КонецФункции	



#КонецОбласти 


#Область КонтрольПроведения

Функция КонтрольПоДокументуОснования()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_РасходнаяНакладнаяЗапасы.СерийныйНомер,
	|	1 КАК КоличествоОснование,
	|	0 КАК Количество
	|ПОМЕСТИТЬ втДокументОснование
	|ИЗ
	|	Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	алк_РасходнаяНакладнаяЗапасы.Ссылка = &ДокументОснование
	|	И алк_РасходнаяНакладнаяЗапасы.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	|	0 КАК КоличесвтоОснование,
	|	1 КАК Количество
	|ПОМЕСТИТЬ втТранспортировка
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокументОснование.СерийныйНомер,
	|	втДокументОснование.КоличествоОснование КАК КоличествоОснование,
	|	втДокументОснование.Количество КАК Количество
	|ПОМЕСТИТЬ втОбъединение
	|ИЗ
	|	втДокументОснование КАК втДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТранспортировка.СерийныйНомер,
	|	втТранспортировка.КоличесвтоОснование,
	|	втТранспортировка.Количество
	|ИЗ
	|	втТранспортировка КАК втТранспортировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатОбъединения.СерийныйНомер,
	|	РезультатОбъединения.КоличествоОснование,
	|	РезультатОбъединения.Количество,
	|	РезультатОбъединения.КоличествоОснование - РезультатОбъединения.Количество КАК КонтрольнаяСумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		втОбъединение.СерийныйНомер КАК СерийныйНомер,
	|		СУММА(втОбъединение.КоличествоОснование) КАК КоличествоОснование,
	|		СУММА(втОбъединение.Количество) КАК Количество
	|	ИЗ
	|		втОбъединение КАК втОбъединение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втОбъединение.СерийныйНомер) КАК РезультатОбъединения
	|ГДЕ
	|	РезультатОбъединения.КоличествоОснование - РезультатОбъединения.Количество <> 0";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Состав номенклатуры документа не соответствует документу основанию! Перезаполните по основанию.";
		Сообщение.Сообщить(); 
		Отказ = Истина;
	Иначе
		Отказ = Ложь;
	КонецЕсли;
	
	Возврат  Отказ;
	
КонецФункции

#КонецОбласти 




