
Функция ПолучитьОбъемПоХарактеристике(ХарактеристикаПоиска) Экспорт	
	Если ЗначениеЗаполнено(ХарактеристикаПоиска) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	алк_ПараметрыХарактеристик.Объем
			|ИЗ
			|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
			|ГДЕ
			|	алк_ПараметрыХарактеристик.Характеристика = &ХарактеристикаПоиска";
		
		Запрос.УстановитьПараметр("ХарактеристикаПоиска", ХарактеристикаПоиска);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выгрузить();
		
		Если Выборка.Количество() > 0 Тогда
			Возврат Выборка[0].Объем; 
		Иначе
			КомментарийОшибки = СтрШаблон("Для характеристики %1 не расчитан объем", Строка(ХарактеристикаПоиска)); 
			ЗаписьЖурналаРегистрации("ПолучениеОбъемаПоХарактеристике", УровеньЖурналаРегистрации.Ошибка, , ,КомментарийОшибки);
			Возврат 0;
		КонецЕсли;
	Иначе
		Возврат 1;	
	КонецЕсли;
КонецФункции