
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись из ЭтотОбъект Цикл
		Сч = 0;
		//Запись = ЭтотОбъект[0];
		ВозможенРасчетОбъема = Истина;
		Если ЗначениеЗаполнено(Запись["Порода"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись["Сорт"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		Если ЗначениеЗаполнено(Запись["Длина"]) Тогда
			Сч = Сч + 1;
		Иначе
			ВозможенРасчетОбъема = Ложь;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Запись["Сечение"]) Тогда
			Сч = Сч + 1;
		Иначе
			ВозможенРасчетОбъема = Ложь;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Запись["Влажность"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Запись["Поверхность"]) Тогда
			Сч = Сч + 1;	
		КонецЕсли;

		Запись.КоличествоРеквизитов = Сч;
		
		Если ВозможенРасчетОбъема тогда 
			
			Если Запись.Характеристика.Владелец.Код = "ПБ-00000022" Тогда    // для поддонов объем приравнимаем к 1				
				Запись.Объем = 1;
			Иначе 	
				РеквизитыСечения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись["Сечение"], "ВидСечения,ШиринаММ,ТолщинаММ,ДиаметрММ");
				ДлинаММ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись["Длина"], "ДлинаММ"); 
				
				Если Запись.Характеристика.Владелец.Код = "ПБ-00000006" Тогда  //Карандаш
					Запись.Объем = 3.14 * ДлинаММ / 1000 * Pow((РеквизитыСечения.ДиаметрММ / 2000),2);				
				Иначе 
					Если РеквизитыСечения.ВидСечения = Перечисления.ВидыСечений.Квадратное тогда	
						Запись.Объем = РеквизитыСечения.ТолщинаММ * РеквизитыСечения.ШиринаММ * ДлинаММ / 1000000000;
					Иначе //если сечение круглое
						Запись.Объем = РегистрыСведений.алк_КубатурникКруглогоЛеса.ПолучитьЗначениеОбъема(ДлинаММ / 1000, РеквизитыСечения.ДиаметрММ / 1000, Перечисления.алк_ТипыКубатурников.ГОСТ_270875);
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
