


&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ТолькоОтрицательные)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПиломатериалыПереданныеНаСушку.СерийныйНомер
		|ПОМЕСТИТЬ ВТ_Сухие
		|ИЗ
		|	РегистрНакопления.алк_ПиломатериалыПереданныеНаСушку КАК алк_ПиломатериалыПереданныеНаСушку
		|ГДЕ
		|	алк_ПиломатериалыПереданныеНаСушку.Период <= &ДатаСреза
		|	И алк_ПиломатериалыПереданныеНаСушку.Сухой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗапасыНаСкладахСерииОстатки.Номенклатура,
		|	алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер КАК СерийныйНомер,
		|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток КАК КоличествоУчет,
		|	ВЫБОР
		|		КОГДА алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток < 0
		|			ТОГДА -алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоИзлишки,
		|	ВЫБОР
		|		КОГДА алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток > 0
		|			ТОГДА алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоНедостача,
		|	ВЫБОР
		|		КОГДА алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер = ВТ_Сухие.СерийныйНомер
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Сухой
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(
		|			&ДатаСреза,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Ячейка = &Ячейка
		|				И 2 = 2) КАК алк_ЗапасыНаСкладахСерииОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сухие КАК ВТ_Сухие
		|		ПО алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер = ВТ_Сухие.СерийныйНомер
		|ГДЕ
		|	1 = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура,
		|	ВТ.СерийныйНомер,
		|	ВТ.КоличествоУчет,
		|	ВТ.КоличествоИзлишки,
		|	ВТ.КоличествоНедостача,
		|	ВТ.Сухой
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Сухой = &Сухой";
	
	Запрос.УстановитьПараметр("Сухой", 				Сухой);
	Запрос.УстановитьПараметр("ДатаСреза", 			Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);   	
	Запрос.УстановитьПараметр("Ячейка", 			Объект.Ячейка);
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Номенклатура = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	КонецЕсли; 
	
	Если ТолькоОтрицательные Тогда           		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток < 0");	
	КонецЕсли; 
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.Проведен Тогда
		Сообщить("Перед заполнение требуется отменить проведение документа!");
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность Тогда
		Сообщить("Перед заполнение требуется записать изменения документа!");
		Возврат;                                                         	
	КонецЕсли;   
	
	ЗаполнитьПоОстаткамНаСервере(Ложь);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтрицательными(Команда)
	
	Если Объект.Проведен Тогда
		Сообщить("Перед заполнение требуется отменить проведение документа!");
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность Тогда
		Сообщить("Перед заполнение требуется записать изменения документа!");
		Возврат;                                                         	
	КонецЕсли;   
	
	ЗаполнитьПоОстаткамНаСервере(Истина);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЗапасыСерийныйПолучитьНоменклатуру(СерийныйНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец КАК Номенклатура
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(&ДатаСреза, СерийныйНомер = &СерийныйНомер) КАК алк_ПараметрыПакетовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		Объект.Дата);
	Запрос.УстановитьПараметр("СерийныйНомер", 	СерийныйНомер);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат    ВыборкаДетальныеЗаписи.Номенклатура;
	КонецЦикла;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ЗапасыСерийныйНомерПриИзменении(Элемент)
	
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;    	
	
	ТекДанные.Номенклатура =  ЗапасыСерийныйПолучитьНоменклатуру(ТекДанные.СерийныйНомер);

	Если ТекДанные.КоличествоФакт  >= ТекДанные.КоличествоУчет Тогда
		
		ТекДанные.КоличествоИзлишки 	= ТекДанные.КоличествоФакт  - ТекДанные.КоличествоУчет;	
		ТекДанные.КоличествоНедостача 	= 0;
		
	Иначе
		
		ТекДанные.КоличествоНедостача 	= ТекДанные.КоличествоУчет - ТекДанные.КоличествоФакт;
	    ТекДанные.КоличествоИзлишки		= 0;
		
	КонецЕсли; 
	
	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать  
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыРеальныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
			
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Сообщить("Для подбора пакетов требуется указать номенклатуру!");
		Возврат;	
	КонецЕсли; 
	
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(ТекДанные.НомерПакета) Тогда
		Возврат;	
	КонецЕсли; 
	
	Если ТекДанные.Год = "2018" Тогда		
		ПериодПакета = Дата("20180101"); 	
	ИначеЕсли ТекДанные.Год = "2019" Тогда		
		ПериодПакета = Дата("20190101");
	Иначе
		ПериодПакета = ТекущаяДата();	
	КонецЕсли; 
	
	
	ТекДанные.СерийныйНомер =  РфпПолучениеДанныхСервер.ПолучитьСерийныйНомер(Объект.Номенклатура, ТекДанные.НомерПакета, ПериодПакета);

	ТекДанные.КоличествоФакт = 1;
	  	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактНаСервере()
	
	Для каждого СтрФакт Из  Объект.ЗапасыРеальные Цикл 
		
		ПакетНайден = Ложь;
		
		Для каждого СтрУчет Из Объект.Запасы Цикл
			
			Если СтрФакт.СерийныйНомер = СтрУчет.СерийныйНомер Тогда
				
				СтрУчет.КоличествоФакт = СтрФакт.КоличествоФакт;
				
				Если СтрУчет.КоличествоФакт  >= СтрУчет.КоличествоУчет Тогда					
					СтрУчет.КоличествоИзлишки 	= СтрУчет.КоличествоФакт  - СтрУчет.КоличествоУчет;	
					СтрУчет.КоличествоНедостача 	= 0;           					
				Иначе                                           					
					СтрУчет.КоличествоНедостача 	= СтрУчет.КоличествоУчет - СтрУчет.КоличествоФакт;
					СтрУчет.КоличествоИзлишки		= 0;       					
				КонецЕсли; 
				
				ПакетНайден = Истина;		
			
			КонецЕсли; 		
		
		КонецЦикла; 
		
		Если Не ПакетНайден Тогда
			
			НоваяСтр = Объект.Запасы.Добавить();
			
			НоваяСтр.СерийныйНомер 			= СтрФакт.СерийныйНомер;
			НоваяСтр.КоличествоФакт 		= 1;
			НоваяСтр.КоличествоУчет 		= 0;
			НоваяСтр.КоличествоИзлишки 		= 1; 
			НоваяСтр.КоличествоНедостача 	= 0; 			
			
		КонецЕсли;	
	    		
	КонецЦикла;
	
КонецПроцедуры
 



&НаКлиенте
Процедура ЗаполнитьФакт(Команда)
	
	ЗаполнитьФактНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры


// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
		
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры



// Конец СтандартныеПодсистемы.Печать










