
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ТранспортировкиЖелезнодорожные");
	ПараметрыФормы.Вставить("ОтборПоВидТранспортировки_ЖД");
	ПараметрыФормы.Вставить("КлючПользовательскихНастроек", Новый УникальныйИдентификатор);
	
	ОткрытьФорму("Документ.алк_ТранспортировкаЗапасов.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

