
&НаСервере
Функция ПолучитьТекстЗапроса()

	МассивВТ = Объект.ИспользуемыеВТ.Выгрузить().ВыгрузитьКолонку("ВТ");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВТ_ДляРасчетаПоказателейПроизводства.ТекстЗапроса,
		|	алк_ВТ_ДляРасчетаПоказателейПроизводства.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.алк_ВТ_ДляРасчетаПоказателейПроизводства КАК алк_ВТ_ДляРасчетаПоказателейПроизводства
		|ГДЕ
		|	алк_ВТ_ДляРасчетаПоказателейПроизводства.Ссылка В(&МассивВТ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("МассивВТ", МассивВТ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивТекстовЗапросаВТ = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТекстЗапроса");
	
	СтрЗапрос = СтрСоединить(МассивТекстовЗапросаВТ, ";" + Символы.ПС + Символы.ПС) + ?(МассивТекстовЗапросаВТ.Количество() > 0, ";", "") 
		+ Символы.ПС + Символы.ПС + Объект.ЗапросПолученияФакта;
	
	Возврат СтрЗапрос;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьЗапрос(Команда)
	ОчиститьСообщения();
	Сообщить(ПолучитьТекстЗапроса());
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗапросНаСервере()
	
	ТекущаяДата = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата);
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата);
	
	Попытка	
		РезультатЗапроса = Запрос.Выполнить();
		Сообщить("Все ОК");
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапрос(Команда)
	ОчиститьСообщения();
	ПроверитьЗапросНаСервере();
КонецПроцедуры
