

&НаКлиенте
Процедура Распределить(Команда) 
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Сообщить("Заполните организацию!"); 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда 		
		Сообщить("Заполните склад!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда 		
		Сообщить("Заполните дату!");
		Возврат;
	КонецЕсли; 
	
	РаспределитьНаСервере();
КонецПроцедуры   

&НаСервере
Процедура РаспределитьНаСервере()  
	
	Если Объект.Запасы.Количество() = 0 Тогда
		
		Сообщить("Заполните в табличной части строку с Номеклатурой и Количеством для распределения!");
		Возврат;
		
	Иначе
		
		Номенклатура 		= Объект.Запасы[0].Номенклатура;		
		КоличествоКСписанию = Объект.Запасы[0].Количество;		
		СтруктурнаяЕдиница 	= Объект.СтруктурнаяЕдиница;
		Организация 		= Объект.Организация; 
		ДатаОстатков 		= Объект.Дата;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&ДатаОстатков,
		|			Номенклатура = &Номенклатура
		|				И Организация = &Организация) КАК алк_ОстаткиЗапасовОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.Характеристика.Код";
		
		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если РезультатЗапроса.Пустой() Тогда 
			
			Сообщить("Нет остатков к распределению!");
			Возврат;
		
		КонецЕсли; 
		
		Объект.Запасы.Очистить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
			
			ОстатокПоХарактеристике = ВыборкаДетальныеЗаписи.КоличествоОстаток;  
			
			Если ОстатокПоХарактеристике <= 0 Тогда
				Продолжить;		
			КонецЕсли;
			
			Списание = Мин(ОстатокПоХарактеристике, КоличествоКСписанию);
			
			КоличествоКСписанию = КоличествоКСписанию - Списание; 
			
			НоваяСтр = Объект.Запасы.Добавить();
			НоваяСтр.Номенклатура 	= Номенклатура;
			НоваяСтр.Характеристика	= ВыборкаДетальныеЗаписи.Характеристика;
			НоваяСтр.Количество	 	= Списание; 
			
			Если КоличествоКСписанию = 0 Тогда				
				Прервать;		
			КонецЕсли;		
			
		КонецЦикла;
		
		Если Не КоличествоКСписанию = 0 Тогда
			
			НоваяСтр = Объект.Запасы.Добавить();
			НоваяСтр.Номенклатура 	= Номенклатура;			
			НоваяСтр.Количество		= КоличествоКСписанию; 
			
			Сообщить("Не хватило остатков для списания: "  + КоличествоКСписанию); 
			
		КонецЕсли;	
		
	КонецЕсли; 
	
КонецПроцедуры



