
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		Документы.алк_РучноеИзменениеДополнительныхПараметровПакета.ВыполнитьКонтрольИспользованияПакетаВАддендуме(СерийныйНомер,Дата,Отказ);  
		
		Документы.алк_РучноеИзменениеДополнительныхПараметровПакета.ВыполнитьКонтрольОстатков(СерийныйНомер,Дата,Отказ); 
		
		Если Отказ Тогда 
			Возврат;
		КонецЕсли; 
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.алк_РучноеИзменениеДополнительныхПараметровПакета.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);  
		
		РегистрыСведений.алк_ДополнительныеПараметрыПакетов.УдалитьЗаписьВРегистре(СерийныйНомер,Ссылка); //если документ уже есть запись, убираем ее
		
		РфпСервер.ОтразитьДополнительныеПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();				
		//\\
		
	КонецПроцедуры
	
	Процедура ОбработкаУдаленияПроведения(Отказ)	
		РегистрыСведений.алк_ДополнительныеПараметрыПакетов.УдалитьЗаписьВРегистре(СерийныйНомер,Ссылка);	
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
		Если НЕ ЗначениеЗаполнено(ДокументПосле) Тогда 
			ДокументПосле = Ссылка;
		КонецЕсли;
	КонецПроцедуры
	
	#КонецОбласти 
	
#КонецЕсли
