
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументВТД, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Номенклатура,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Характеристика,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.ОбъемТаможня,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.ВесНетто,
		|	&Период,
		|	&ВидДвиженияПриход,
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Ссылка КАК ВТД
		|ИЗ
		|	Документ.алк_ВременныеТаможенныеДекларации.Запасы КАК алк_ВременныеТаможенныеДекларацииЗапасы
		|ГДЕ
		|	алк_ВременныеТаможенныеДекларацииЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументВТД);
		Запрос.УстановитьПараметр("Период", ДокументВТД.Дата);

		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетВременныхДеклараций", МассивРезультатов[0].Выгрузить());
			
	КонецПроцедуры

	Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
		
		Поля.Добавить("НомерДекларации");
		Поля.Добавить("Дата");
		
		СтандартнаяОбработка = Ложь;
		
	КонецПроцедуры

	Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		Представление = "ВТД: " + Данные.НомерДекларации + " от " + Формат(Данные.Дата, "ДЛФ=D");
		
	КонецПроцедуры
	
	#КонецОбласти
	

	
	#КонецЕсли
