  
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СтрочкиСерийныйНомер.Видимость = Объект.ПоПакетам; 
	ПоПакетамВидимость();	
КонецПроцедуры  
  
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ПроверятьКоличество И Объект.Строки.НайтиСтроки(Новый Структура("ОбщееКоличество", Истина)).Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строчки с общим количеством");
		Отказ = Истина;	
	КонецЕсли;
	
	Если Объект.ПроверятьКоличество Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Колонка", "Значение");
		ПараметрыОтбора.Вставить("ТипСсылочногоЗначения", "");		
		КолонкаЗначение = Объект.Колонки.НайтиСтроки(ПараметрыОтбора);
		
		Если КолонкаЗначение.Количество() = 0 Тогда
			Сообщить("Для проверки общего количества долна быть колонка ""Значение"" с типом Число");
			Отказ = Истина;		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ДобалениеСтрокВТаблицеАкта И Объект.Строки.Количество() <> 1 Тогда 
		Сообщить("Если разрешено добавлять строки в таблицу акта, то в таблице строк должна быть только одна запись(она же и будет дублироваться)");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоПакетамПриИзменении(Элемент)
	ПоПакетамВидимость();
КонецПроцедуры  

 &НаКлиенте
 Процедура ПоПакетамВидимость()    
	Элементы.Сорт.Видимость = НЕ Объект.ПоПакетам;
	Элементы.СтрочкиВидСоответствияСорту.Видимость = НЕ Объект.ПоПакетам;
	Элементы.СтрочкиСерийныйНомер.Видимость = Объект.ПоПакетам; 
    Элементы.ПроверкаКоличества.Видимость = НЕ Объект.ПоПакетам;
КонецПроцедуры

//&НаКлиенте
//Процедура ПоПакетамВидимость()
//	Элементы.грРеквизиты.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.Колонки.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.Сорт.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.СтрочкиВидСоответствияСорту.Видимость = НЕ Объект.ПоПакетам;
//	Элементы.ПроверкаКоличества.Видимость = НЕ Объект.ПоПакетам;
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ПоПакетам Тогда
		
	КонецЕсли;
	
		Для Каждого ТипЗначения Из Метаданные.РегистрыНакопления.алк_ДанныеАктаОТК.Реквизиты.СсылочноеЗначение.Тип.Типы() Цикл
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
			Элементы.КолонкиТипСсылочногоЗначения.СписокВыбора.Добавить("СправочникСсылка." + ОбъектМетаданных.Имя, ОбъектМетаданных.Представление());	
		КонецЦикла;
	

КонецПроцедуры
