
&НаСервере
Процедура ПрочитатьФайлНаСервере()
	
	// чтение файла
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	
	Попытка
		ЗагружаемыйФайл.Прочитать(ИмяФайлаЗагрузки);
	Исключение
		Ош = ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
	
	Таблица = Новый ТаблицаЗначений;
	
	Шапка = ЗагружаемыйФайл.ПолучитьСтроку(1);
	
	//раскладываем строку в массив
	МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Шапка, ";");
	
	//генерируем колонки
	НомерКолонкиЧисло = 0;
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		
		//ИмяБезПробелов = СтрЗаменить(ИмяКолонки, " ",""); 
		//ИмяБезПробелов = СтрЗаменить(ИмяБезПробелов, ".","_"); 		
		//ИмяБезПробелов = СокрЛП(ИмяБезПробелов);
		НомерКолонкиЧисло = НомерКолонкиЧисло + 1;
		ИмяБезПробелов = "Колонка_" + Строка(НомерКолонкиЧисло);
		
		МассивТипов = Новый Массив;
		//МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
		МассивТипов.Добавить(Тип("Строка"));
		ПараметрыСтроки = Новый КвалификаторыСтроки(100);
		
		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , ПараметрыСтроки);
		
		Таблица.Колонки.Добавить(ИмяБезПробелов, ДопустимыеТипы, ИмяКолонки);
		
	КонецЦикла;
	
	Для НомерСтроки = 2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
		//ОбработкаПрерыванияПользователя();
		
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка, ";");
		НоваяСтрока = Таблица.Добавить();
		
		Если МассивКолонок.Количество() <> Таблица.Колонки.Количество() Тогда
			// Сообщить("Ошибка со строкой " + Строка);
			Продолжить; // скорее всего в тексте содержит разделитель
		КонецЕсли;
		
		Для НомерКолонки = 1 по МассивКолонок.Количество() Цикл
			//заполняем строку значениями
			ТекущееЗначение = МассивКолонок[НомерКолонки-1];
			ИмяКолонки = Таблица.Колонки[НомерКолонки-1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;
		
		
	КонецЦикла;
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "РезультатЗагрузкиФайла"));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов, МассивРеквизитов);
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.РезультатЗагрузкиФайла);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "РезультатЗагрузкиФайла." + Колонка.Имя;
		НовыйЭлемент.Ширина = 10;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Таблица, РезультатЗагрузкиФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ПрочитатьФайлНаСервере();
КонецПроцедуры



#Область ОбработчикиСобытийЭлементовФормы


&НаКлиенте
Процедура ИмяФайлаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//РежимДиалога = ?(РежимВыгрузки, РежимДиалогаВыбораФайла.Сохранение, РежимДиалогаВыбораФайла.Открытие);
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Выберите файл с данными сортировки'");
	//ДиалогВыбораФайла.ПолноеИмяФайла = ?(РежимВыгрузки, ИмяФайлаВыгрузки, ИмяФайлаЗагрузки);	
	ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайлаЗагрузки;
	ДиалогВыбораФайла.Фильтр = "Формат загрузки(*.csv)|*.csv|Все файлы (*.*)|*.*";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ИмяФайлаЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти 