

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыгрузкаИзКамерыПропарки, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыгрузкаИзКамерыПропарки);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		         		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиВКамерахПропарки", МассивРезультатовЗапроса[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатусыПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетВремениПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		
	КонецПроцедуры
   	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ОкончаниеВыгрузки КАК Период,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.Организация,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.КамераПропарки КАК Ячейка,
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Объем
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки.Номенклатура КАК алк_ВыгрузкаИзКамерыПропаркиНоменклатура
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка = &Ссылка
		|	И НЕ алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ИдётРазгрузка
		|	И алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ВремяОстановкиКамеры < алк_ВыгрузкаИзКамерыПропаркиНоменклатура.Ссылка.ОкончаниеВыгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры КАК Период,
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка КАК Регистратор,
		|	алк_ВыгрузкаИзКамерыПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Простой) КАК Статус,
		|	алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры КАК ВремяНачала,
		|	алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры КАК ВремяОкончанияПлан
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки КАК алк_ВыгрузкаИзКамерыПропарки
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка = &Ссылка
		|	И (алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры < алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки
		|			ИЛИ алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры = алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки)
		|			И НЕ(алк_ВыгрузкаИзКамерыПропарки.ИдётРазгрузка
		|					И алк_ВыгрузкаИзКамерыПропарки.ВремяОстановкиКамеры = алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка,
		|	алк_ВыгрузкаИзКамерыПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Выгрузка),
		|	алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки КАК алк_ВыгрузкаИзКамерыПропарки
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка = &Ссылка
		|	И (алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки < алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки
		|			ИЛИ алк_ВыгрузкаИзКамерыПропарки.ИдётРазгрузка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка,
		|	алк_ВыгрузкаИзКамерыПропарки.КамераПропарки,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПропарки.Простой),
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки,
		|	алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыПропарки КАК алк_ВыгрузкаИзКамерыПропарки
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыПропарки.Ссылка = &Ссылка
		|	И НЕ алк_ВыгрузкаИзКамерыПропарки.ИдётРазгрузка
		|	И алк_ВыгрузкаИзКамерыПропарки.НачалоВыгрузки < алк_ВыгрузкаИзКамерыПропарки.ОкончаниеВыгрузки";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	
		
	#Область СервисныеПроцедурыИФункции 
	
	
	#КонецОбласти

	
	
#КонецЕсли
