

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Если Параметры.Свойство("ОтборПоВидТранспортировки_Авто") Тогда
		
		Заголовок = "Документы транспортировки: Автомобильные";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоВидуТранспортировкиНаСервере(Перечисления.алк_ВидыТранспортировки.Автомобильная);	
		
	ИначеЕсли Параметры.Свойство("ОтборПоВидТранспортировки_ЖД") Тогда 
		
		Заголовок = "Документы транспортировки: Железнодорожные";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоВидуТранспортировкиНаСервере(Перечисления.алк_ВидыТранспортировки.Железнодорожная);	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры



#КонецОбласти 


#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытий

&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Лесопиление);
	КонецЕсли;
	
	Если ОтборНаправлениеОтходы Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Отходы);
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Направление", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры //УстановитьОтборПоНаправлению()

#КонецОбласти


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область СлужебныеПиФ

&НаСервере
Процедура ОтобратьПоВидуТранспортировкиНаСервере(ВидТранспортировки)
	
	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор;
	
	ОтборВПользовательскихНастройках = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	Отбор.ИдентификаторПользовательскойНастройки);
	
	РаботаемСНастройками = Истина;																		
	Если ОтборВПользовательскихНастройках <> Неопределено Тогда
		
		РаботаемСНастройками = Ложь;
		Отбор = ОтборВПользовательскихНастройках;		
		
	КонецЕсли;																		
	
	ОтборПоВидуТранспортировки = Неопределено;
	ПолеВидТранспортировки = Новый ПолеКомпоновкиДанных("ВидТранспортировки");
	
	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			и ЭлементОтбора.ЛевоеЗначение = ПолеВидТранспортировки Тогда
			
			ОтборПоВидуТранспортировки = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ОтборПоВидуТранспортировки = Неопределено Тогда
		
		ОтборПоВидуТранспортировки = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВидуТранспортировки.ЛевоеЗначение = ПолеВидТранспортировки;
		ОтборПоВидуТранспортировки.Использование = Ложь;
		//ОтборПоВидуТранспортировки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ОтборПоВидуТранспортировки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		Элементы.Список.СоздатьЭлементыФормыПользовательскихНастроек();
		
	КонецЕсли;
	
	Если РаботаемСНастройками Тогда
		
		ОтборПоВидуТранспортировки = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки);
		
	КонецЕсли;
	ОтборПоВидуТранспортировки.Использование = Не ОтборПоВидуТранспортировки.Использование;
	
	ОтборПоВидуТранспортировки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоВидуТранспортировки.ПравоеЗначение = ВидТранспортировки;
	
КонецПроцедуры


#КонецОбласти 

Процедура Конец()		
КонецПроцедуры




