

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.алк_СеансПортовогоАгента Тогда
		Отказ = Истина;	
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Если Параметры.Свойство("ОтборПоВидТранспортировки_Авто") Тогда
		
		Заголовок = "Документы транспортировки: Автомобильные";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоВидуТранспортировкиНаСервере(Перечисления.алк_ВидыТранспортировки.Автомобильная);	
		
	ИначеЕсли Параметры.Свойство("ОтборПоВидТранспортировки_ЖД") Тогда 
		
		Заголовок = "Документы транспортировки: Железнодорожные";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоВидуТранспортировкиНаСервере(Перечисления.алк_ВидыТранспортировки.Железнодорожная);	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//УстановитьОтборПоНаправлению();
	
	Для Каждого участок ИЗ ВернутьУчастки() Цикл
		Элементы.ОтборУчасток.СписокВыбора.Добавить(участок.Ссылка);
	КонецЦикла; 
	
	ОтборУчастокУстановлен = (ОтборУчасток.Количество() <> 0); 
	
	Если ОтборУчастокУстановлен Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", ОтборУчасток, ОтборУчастокУстановлен);
	КонецЕсли;
	
	ОтборВидТранспортировкиУстановлен = (ОтборПоВидуТранспортировки.Количество() <> 0); 
	
	Если ОтборВидТранспортировкиУстановлен Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ВидТранспортировки", ОтборПоВидуТранспортировки, ОтборВидТранспортировкиУстановлен);
	КонецЕсли;
	
	ОтборИдТСУстановлен = ЗначениеЗаполнено(ОтборИдентификаторТС); 
	
	Если ОтборИдТСУстановлен Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ИдентификаторТС", ОтборИдентификаторТС, ОтборИдТСУстановлен);
	КонецЕсли;
	
	ОтборНоменклатураУстановлен = (ОтборНоменклатура.Количество() <> 0);
	
	Если НЕ ОтборНоменклатураУстановлен Тогда 
		Возврат;
	КонецЕсли; 
			
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", ОтборНоменклатура, ОтборНоменклатураУстановлен);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокПриИзменении(Элемент)
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", ОтборУчасток, ОтборУчасток.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборУчасток Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", ОтборНоменклатура, ОтборНоменклатура.Количество() <> 0);	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИдентификаторТСПриИзменении(Элемент)
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ИдентификаторТС", ОтборИдентификаторТС, ЗначениеЗаполнено(ОтборИдентификаторТС));
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка) 
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборНоменклатура Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);  
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуТранспортировкиПриИзменении(Элемент) 
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ВидТранспортировки", ОтборПоВидуТранспортировки, ОтборПоВидуТранспортировки.Количество() <> 0);	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуТранспортировкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборПоВидуТранспортировки Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ВидТранспортировки", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытий

//так как направления больше не заполняются, меняем на участки 20240916
&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000040")); //СГП ПМ
	КонецЕсли;
	
	//Если ОтборНаправлениеОтходы Тогда
	//	МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду(""));
	//КонецЕсли;
	
	Если ОтборНаправлениеГранулы Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000039")); //СГП ДГ
	КонецЕсли;
	
	Если ОтборНаправлениеШпон Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000038")); //СГП Шпон
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000043")); //СГП Шпон (Сборка/разборка)
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры //УстановитьОтборПоНаправлению()

#КонецОбласти


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область СлужебныеПиФ

&НаСервере
Процедура ОтобратьПоВидуТранспортировкиНаСервере(ВидТранспортировки)
	
	ОтборПоВидуТранспортировки = Список.КомпоновщикНастроек.Настройки.Отбор;
	
	ОтборВПользовательскихНастройках = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки);
	
	РаботаемСНастройками = Истина;																		
	Если ОтборВПользовательскихНастройках <> Неопределено Тогда
		
		РаботаемСНастройками = Ложь;
		ОтборПоВидуТранспортировки = ОтборВПользовательскихНастройках;		
		
	КонецЕсли;																		
	
	ОтборПоВидуТранспортировки = Неопределено;
	ПолеВидТранспортировки = Новый ПолеКомпоновкиДанных("ВидТранспортировки");
	
	Для каждого ЭлементОтбора Из ОтборПоВидуТранспортировки.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			и ЭлементОтбора.ЛевоеЗначение = ПолеВидТранспортировки Тогда
			
			ОтборПоВидуТранспортировки = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ОтборПоВидуТранспортировки = Неопределено Тогда
		
		ОтборПоВидуТранспортировки = ОтборПоВидуТранспортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВидуТранспортировки.ЛевоеЗначение = ПолеВидТранспортировки;
		ОтборПоВидуТранспортировки.Использование = Ложь;
		//ОтборПоВидуТранспортировки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ОтборПоВидуТранспортировки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		Элементы.Список.СоздатьЭлементыФормыПользовательскихНастроек();
		
	КонецЕсли;
	
	Если РаботаемСНастройками Тогда
		
		ОтборПоВидуТранспортировки = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ОтборПоВидуТранспортировки.ИдентификаторПользовательскойНастройки);
		
	КонецЕсли;
	ОтборПоВидуТранспортировки.Использование = Не ОтборПоВидуТранспортировки.Использование;
	
	ОтборПоВидуТранспортировки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоВидуТранспортировки.ПравоеЗначение = ВидТранспортировки;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеФ 

&НаСервереБезКонтекста
Функция ВернутьУчастки()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Участки.Ссылка
	               |ИЗ
	               |	Справочник.алк_Участки КАК алк_Участки
	               |ГДЕ
	               |	алк_Участки.Цех.Код В (""000000005"", ""000000004"")
	               |	И НЕ алк_Участки.ЭтоГруппа";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
КонецФункции

#КонецОбласти


Процедура Конец()		
КонецПроцедуры








