
&НаКлиенте
Процедура Подобрать(Команда)
	
	ТекстПоиска = "ДГ-"+Прав(Год,2)+"-" + ФОРМАТ(НомерПоиска,"ЧЦ=6; ЧВН=; ЧГ=0");
	
	Номер = ПолучитьСерийныйНомер(ТекстПоиска);		
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Номер) Тогда		
		Сообщить("Пакет не найден!");	
		Возврат;
	КонецЕсли;  
	
	СерийныйНомер = Номер; 
	
	МассивВозврата = Новый Массив;
	
	МассивВозврата.Добавить(Новый структура("Номенклатура, Характеристика, Сертификат, СерийныйНомер, КоличествоШтук, Количество, Склад", 
		Номенклатура, 
		Характеристика, 
		"",
		СерийныйНомер,
		Вес, 
		Вес/1000,
	    Склад)); 
	
	НомерПоиска = "";
	
	ОповеститьОВыборе(МассивВозврата);  
	
	ЭтаФорма.ТекущийЭлемент = Элементы.НомерПоиска;
	
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСерийныйНомер(ТекстПоиска)	
	
	Результат = Справочники.СерийныеНомера.ПустаяСсылка();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ТекстПоиска);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда 		
		Номенклатура = Параметры.Номенклатура; 		
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда 		
		Склад = Параметры.Склад; 		
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда 			
		Дата = Параметры.Дата;		
		Год = Формат(Дата, "ДФ=yyyy");	
	КонецЕсли;  
	
КонецПроцедуры
