#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСписанияПорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АктИнвентаризацииПортЗапасы.СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Оприходование = 0
		|			ТОГДА &ВидДвиженияНакопленияРасход
		|		ИНАЧЕ &ВидДвиженияНакопленияПриход
		|	КОНЕЦ КАК ВидДвижения,
		|	&Период,
		|	алк_АктИнвентаризацииПортЗапасы.Номенклатура,
		|	алк_АктИнвентаризацииПортЗапасы.КоличествоПакетов,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.Организация,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_АктИнвентаризацииПорт.Запасы КАК алк_АктИнвентаризацииПортЗапасы
		|ГДЕ
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Оприходование = 0
		|			ТОГДА &ВидДвиженияНакопленияРасход
		|		ИНАЧЕ &ВидДвиженияНакопленияПриход
		|	КОНЕЦ КАК ВидДвижения,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.Организация,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_АктИнвентаризацииПортЗапасы.Номенклатура,
		|	алк_АктИнвентаризацииПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_АктИнвентаризацииПортЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_АктИнвентаризацииПортЗапасы.Оприходование = 0
		|			ТОГДА алк_АктИнвентаризацииПортЗапасы.Списание
		|		ИНАЧЕ алк_АктИнвентаризацииПортЗапасы.Оприходование
		|	КОНЕЦ КАК Количество,
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_АктИнвентаризацииПорт.Запасы КАК алк_АктИнвентаризацииПортЗапасы
		|ГДЕ
		|	алк_АктИнвентаризацииПортЗапасы.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСписанияПорт);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаАктСписанияПорт.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[1].Выгрузить());
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли