
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("НаДату");
		
		Для каждого стрПараметр Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			
			Если стрПараметр.Параметр = ПараметрКомпоновки Тогда
				
				Если Не ЗначениеЗаполнено(стрПараметр.Значение) Тогда
					
					УстановитьПараметрПользовательскойНастройки(КомпоновщикНастроек.ПользовательскиеНастройки, "НаДату", ТекущаяДата());	
					
				КонецЕсли; 
				
			КонецЕсли; 	
			
		КонецЦикла; 
			
		НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
		
		ДопНастройкиПользователя = РфпПолучениеДанныхСервер.ПолучитьДополнительныеНастройкиПользователя(Пользователи.ТекущийПользователь());
		
		//СписокНоменклатуры = Новый СписокЗначений;
		//СписокНоменклатуры.Добавить(РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой));
		//СписокНоменклатуры.Добавить(РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши));
		//
		//УстановитьОтбор(НастройкиКомпоновки, "П1", СписокНоменклатуры);

		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		НастройкиКомпоновки,
		ДанныеРасшифровки);
		
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПолучитьСтруктуруЗаголовковПолей(), МакетКомпоновки);
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураДинамическихЗаголовков(), МакетКомпоновки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		,
		ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2);

		//КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СлужебныеПиФ
	
	Процедура УстановитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, ИмяНастройки, Значение)
		
		ПолеКомпоновкиПараметр = Новый ПараметрКомпоновкиДанных(ИмяНастройки);
		ЭлементОтбора = Неопределено;
		
		Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
			Если Элемент.Параметр = ПолеКомпоновкиПараметр Тогда
				Элемент.Значение = Значение;
				Элемент.Использование = Истина; 
				Прервать;	
			КонецЕсли;			
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	
	#КонецОбласти 
	
	ЭтоОтчетУНФ = Ложь;
	
#КонецЕсли
