	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаОстаткиНесортированного, СтруктураДополнительныеСвойства) Экспорт
		
		СформироватьТаблицуОборотыПроизводства(ДокументСсылкаОстаткиНесортированного, СтруктураДополнительныеСвойства);
				
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	//Формирует таблицу значений, для отражения оборотов производства Сергеева Г.О.
	Процедура СформироватьТаблицуОборотыПроизводства(ДокументСсылкаОстаткиНесортированного, СтруктураДополнительныеСвойства)
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	алк_ОстаткиНесортированногоТаблицаОстатки.Объем,
			|	алк_ПараметрыХарактеристик.Характеристика,
			|	&Номенклатура,
			|	алк_ОстаткиНесортированногоТаблицаОстатки.Ссылка.Организация,
			|	алк_ОстаткиНесортированногоТаблицаОстатки.Ссылка.Дата КАК Период,
			|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Остатки) КАК Операция
			|ИЗ
			|	Документ.алк_ОстаткиНесортированного.ТаблицаОстатки КАК алк_ОстаткиНесортированногоТаблицаОстатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
			|		ПО алк_ОстаткиНесортированногоТаблицаОстатки.Порода = алк_ПараметрыХарактеристик.Порода
			|ГДЕ
			|	алк_ПараметрыХарактеристик.Характеристика.Владелец = &Номенклатура
			|	И алк_ОстаткиНесортированногоТаблицаОстатки.Ссылка = &ДокументСсылкаОстаткиНесортированного
			|	И алк_ОстаткиНесортированногоТаблицаОстатки.Объем <> 0";
		
		Запрос.УстановитьПараметр("ДокументСсылкаОстаткиНесортированного", ДокументСсылкаОстаткиНесортированного);
		Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.Несортированный);			
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", ТЗ);

	КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	//Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
КонецПроцедуры
// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	//Реквизиты.Добавить("ИмяРеквизита"); // реквизит объекта
	//Реквизиты.Добавить("ИмяТабличнойЧасти.*"); // табличная часть объекта
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
