
&НаКлиенте
Процедура ЗаполнитьКомментарийПоДокладной(Команда)
	ТекущиеДанные = ТекущиеДанные();  
	Если НЕ ТекущиеДанные = Неопределено  Тогда 
		
		Если  ПроверитьГруппыДоступа() Тогда
			
			Документ = ТекущиеДанные.Ссылка;  
			
			Параметры1 = Новый Структура;
			Параметры1.Вставить("СсылкаНаОбъект", Документ);
			ОткрытьФорму("Обработка.Алк_ДобавлениеКомментарияВДокладнуюОТК.Форма.Комментарий",Параметры1,ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормы",ЭтаФорма),РежимОткрытияОкнаФормы.Независимый);
		Иначе
			Сообщить("У вас недостаточно прав для заполнения комментария.");
		КонецЕсли;
	Иначе
		Сообщить("Выберите документ для которого необходимо заполнить комментарий");
	КонецЕсли;
КонецПроцедуры    


&НаКлиенте
Процедура ПослеЗакрытияФормы(ПараметрЗакрытия, ДополнительныеПараметры) Экспорт 
	Если ПараметрЗакрытия = Неопределено Тогда
		Возврат;
	Иначе
		ОповеститьОбИзменении(ПараметрЗакрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ТекущиеДанные()
	Если Не СтандартныеПодсистемыКлиент.ЭтоЭлементДинамическогоСписка(Элементы.СписокДокладныхОТК) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Элементы.СписокДокладныхОТК.ТекущиеДанные;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ПроверитьГруппыДоступа() Тогда
		Элементы.ЗаполнитьКомментарийПоДокладной.Доступность = Истина;
	Иначе 
		Элементы.ЗаполнитьКомментарийПоДокладной.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПроверитьГруппыДоступа()        
		
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь(); 
	ПолныеПрава = Пользователи.ЭтоПолноправныйПользователь(Пользователь); 
		
	Если РольДоступна("алк_ДобавлениеКомментарияДокладнаяОТК") ИЛИ  ПолныеПрава Тогда 
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли; 
 	
КонецФункции
