
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Организация 			= Справочники.Организации.НайтиПоКоду("00-000001");
		//Объект.СтруктурнаяЕдиница 	= Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000034"); // Участок ГТО
		
		Объект.Мастер = Пользователи.ТекущийПользователь(); 
		                                
		Объект.ДатаСмены = ТекущаяДата(); 
				
	КонецЕсли; 
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
	ИзменяемаяСтрока = Элемент.ТекущиеДанные;
	
	//когда удаляют строку
	Если ИзменяемаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	//\\
	
	Если Не ЗначениеЗаполнено(ИзменяемаяСтрока.Номенклатура) Тогда    		
		ИзменяемаяСтрока.Номенклатура = ПолучитьНоменклатуру();
	КонецЕсли; 
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуру()
	
	Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002");
	
КонецФункции //ПолучитьНоменклатуру()


&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПодобратьДокументПеремещения()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЛесопродукции.Ссылка
		|ИЗ
		|	Документ.алк_ПеремещениеЛесопродукции КАК алк_ПеремещениеЛесопродукции
		|ГДЕ
		|	алк_ПеремещениеЛесопродукции.Проведен
		|	И алк_ПеремещениеЛесопродукции.ДатаСмены = &ДатаСмены
		|	И алк_ПеремещениеЛесопродукции.Смена = &Смена
		|	И алк_ПеремещениеЛесопродукции.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ)";
	
	Запрос.УстановитьПараметр("ДатаСмены", 	Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", 		Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат "";
		
	Иначе 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
	
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
	КонецЕсли; 
	

КонецФункции // ПодобратьДокументПеремещения()
 

&НаСервере
Процедура ЗаполнитьНаСервере()  
		
	Объект.Запасы.Загрузить(ДокументПеремещения.Запасы.Выгрузить());  
	
	
	Если Объект.Участок.Код = "000000005" Тогда   //ЛИНИЯ ОКОРКИ №1 		
		ЛинияОкорки = Перечисления.алк_ЛинияОкоркки.ЛинияОкорки1;		
	ИначеЕсли Объект.Участок.Код = "000000006" Тогда   //ЛИНИЯ ОКОРКИ №2 	
		ЛинияОкорки = Перечисления.алк_ЛинияОкоркки.ЛинияОкорки2;   
	Иначе                                                           	
		ЛинияОкорки = Перечисления.алк_ЛинияОкоркки.Металлодетектор;
	КонецЕсли;
	
	
	Для каждого Стр Из Объект.Запасы Цикл		
		Стр.ЛинияОкорки = ЛинияОкорки;		
	КонецЦикла;  	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)   
	
	Если Не ЗначениеЗаполнено(ДокументПеремещения) Тогда 
		
		Если Не ЗначениеЗаполнено(Объект.Смена) Тогда  			
			Сообщить("Укажите смену!");			
			Возврат;  	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаСмены) Тогда  			
			Сообщить("Укажите дату смены!");		
			Возврат; 	
		КонецЕсли; 
		
		ДокументПеремещения = ПодобратьДокументПеремещения();	
		
		Если Не ЗначениеЗаполнено(ДокументПеремещения) Тогда 
			
			Сообщить("Документ перемещения не найден!");		
			Возврат;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры























