
#Область ИнициализацияДаных

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства) Экспорт
	
	Если Не СтруктураДополнительныеСвойства.ИспользоватьАддендумы тогда
		СформироватьТаблицаВыполнениеЗаказовЭтапыСерии(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
		|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
		|	алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка КАК ПартияОтгрузки,
		|	алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов,
		|	&Период
		|ИЗ
		|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировочныеПартии.ДокументыТранспортировки КАК алк_ТранспортировочныеПартииДокументыТранспортировки
		|		ПО алк_ТранспортировочныеПартииЗапасы.КлючСвязи = алк_ТранспортировочныеПартииДокументыТранспортировки.КлючСвязи
		|ГДЕ
		|	алк_ТранспортировочныеПартииДокументыТранспортировки.Ссылка = &Ссылка
		|	И алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка";
		
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировочныеПартии);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаТранспортировочныеПартии.Дата);
		
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПредварительныеПартииСерии", МассивРезультатов[0].Выгрузить());
		
		СформироватьТаблицаПартииТранспортировок(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства);
		СформироватьТаблицаТранспортировочныеПартииПакетов(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства);
		СформироватьТаблицаОборотыПроизводства(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства);
	Иначе
		СформироватьТаблицуПроизводствоОборот(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства);
	КонецЕсли;   
	
	
	СформироватьТаблицаСписанияИзПорта(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства);
	
	
КонецПроцедуры

#КонецОбласти


#Область Проведение

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСписанияИзПорта(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПериодыСерийныхНомеров.Дата КАК Дата,
	|	ПериодыСерийныхНомеров.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ПериодыСерийныхНомеров КАК ПериодыСерийныхНомеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ ВТ_КонтрольДатыУчетаТранспортировок
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.алк_УчетТоваровВПорту
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаНачалаУчетаТоваровВПортах
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка.Ссылка
	|			ИЗ
	|				Документ.алк_ТранспортировочныеПартии.ДокументыТранспортировки КАК алк_ТранспортировочныеПартииДокументыТранспортировки
	|			ГДЕ
	|				алк_ТранспортировочныеПартииДокументыТранспортировки.Ссылка = &Ссылка)
	|	И НЕ алк_ТранспортировкаЗапасовЗапасы.Номенклатура.Код = ""ПБ-00000018""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ОрганизацияПрихода
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка
	|			ИЗ
	|				Документ.алк_ТранспортировочныеПартии.ДокументыТранспортировки КАК алк_ТранспортировочныеПартииДокументыТранспортировки
	|			ГДЕ
	|				алк_ТранспортировочныеПартииДокументыТранспортировки.Ссылка = &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(вт.Дата, алк_ТранспортировочныеПартииЗапасы.Ссылка.Дата) КАК Период,
	|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
	|	ВТ_ОрганизацияПрихода.Организация КАК Организация,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
	|	алк_ТранспортировочныеПартииЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировочныеПартииЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировочныеПартииЗапасы.Сертификат КАК Сертификат,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировочныеПартииЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировочныеПартииЗапасы.ВесНетто
	|		ИНАЧЕ алк_ТранспортировочныеПартииЗапасы.Объем
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОрганизацияПрихода КАК ВТ_ОрганизацияПрихода
	|		ПО алк_ТранспортировочныеПартииЗапасы.СерийныйНомер = ВТ_ОрганизацияПрихода.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО алк_ТранспортировочныеПартииЗапасы.СерийныйНомер = вт.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка
	|	И алк_ТранспортировочныеПартииЗапасы.СерийныйНомер В
	|			(ВЫБРАТЬ
	|				ВТ_КонтрольДатыУчетаТранспортировок.СерийныйНомер
	|			ИЗ
	|				ВТ_КонтрольДатыУчетаТранспортировок КАК ВТ_КонтрольДатыУчетаТранспортировок)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировочныеПартии); 
	Запрос.УстановитьПараметр("ДатаНачалаУчетаТоваровВПортах",  Константы.алк_ДатаНачалаУчетаТоваровВПортах.Получить());    //20220901
	Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход); 
	Запрос.УстановитьПараметр("ПериодыСерийныхНомеров", РфпСервер.ПолучитьПоследнийПериодПакета(ДокументСсылкаТранспортировочныеПартии
		,ДокументСсылкаТранспортировочныеПартии.Дата,ДокументСсылкаТранспортировочныеПартии.ДатаСмены,ДокументСсылкаТранспортировочныеПартии.Смена
		,ДокументСсылкаТранспортировочныеПартии.СтруктурнаяЕдиницаПолучатель,Справочники.алк_Штабели.ПустаяСсылка()
		,ДокументСсылкаТранспортировочныеПартии.Запасы,ДокументСсылкаТранспортировочныеПартии.Участок));
		
	//НЕ алк_ТранспортировкаЗапасовЗапасы.Номенклатура.Код = "ПБ-00000018"   -  исключаем пеллеты, они списываются документом "Погрузка судовых партий"
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПартииТранспортировок(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировочныеПартииДокументыТранспортировки.Ссылка КАК ДокументПартии,
	|	алк_ТранспортировочныеПартииДокументыТранспортировки.Ссылка.Дата КАК Период,
	|	алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка КАК ДокументТранспортировка
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.ДокументыТранспортировки КАК алк_ТранспортировочныеПартииДокументыТранспортировки
	|ГДЕ
	|	алк_ТранспортировочныеПартииДокументыТранспортировки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировочныеПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТранспортировок", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаТранспортировочныеПартииПакетов(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Дата КАК Период,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка КАК ДокументТранспортировочнаяПартия,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировочныеПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТранспортировочныеПартииПакетов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыполнениеЗаказовЭтапыСерии(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Организация,
	|	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
	|	1 КАК КоличествоПакетов,
	|	&Период,
	|	алк_ТранспортировочныеПартииЗапасы.Заказ КАК ЗаказПокупателя,
	|	&ЭтапВыполнения КАК ЭтапВыполненияЗаказа
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировочныеПартии);
	Запрос.УстановитьПараметр("Период", ДокументСсылкаТранспортировочныеПартии.Дата);
	Запрос.УстановитьПараметр("ЭтапВыполнения", Перечисления.алк_ЭтапыВыполненияЗаказов.ФормированиеТранспортировочнойПартии);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыполнениеЗаказовЭтапыСерии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВыполнениеЗаказовЭтапыСерии

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОборотыПроизводства(ДокументСсылкаТранспортировочныеПартии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Дата КАК Период,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.Объем) КАК Объем,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Реализация) КАК Операция
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Дата,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Организация";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТранспортировочныеПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицуПроизводствоОборот(ДокументСсылкаТранспортировкаЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = новый запрос(
	"ВЫБРАТЬ
	|	ПериодыСерийныхНомеров.Дата КАК Дата,
	|	ПериодыСерийныхНомеров.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&ПериодыСерийныхНомеров КАК ПериодыСерийныхНомеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(вт.Дата, алк_ТранспортировочныеПартииЗапасы.Ссылка.Дата) КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ОтгрузкаСудна) КАК Операция,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Участок КАК Участок,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Организация КАК Организация,
	|	алк_ТранспортировочныеПартииЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировочныеПартииЗапасы.Характеристика КАК Характеристика,
	|	алк_ТранспортировочныеПартииЗапасы.Сертификат КАК Сертификат,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК Склад,
	|	алк_ГрафикСмен.Бригада КАК Бригада,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.ДатаСмены КАК ДатаСмены,
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка.Смена КАК Смена,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ТранспортировочныеПартииЗапасы.Объем КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрафикСмен КАК алк_ГрафикСмен
	|		ПО алк_ТранспортировочныеПартииЗапасы.Ссылка.ДатаСмены = алк_ГрафикСмен.ДатаСмены
	|			И алк_ТранспортировочныеПартииЗапасы.Ссылка.Смена = алк_ГрафикСмен.Смена
	|			И алк_ТранспортировочныеПартииЗапасы.Ссылка.Участок = алк_ГрафикСмен.Участок
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	|		ПО алк_ТранспортировочныеПартииЗапасы.СерийныйНомер = вт.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &ДокументСсылка");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылкаТранспортировкаЗапасов); 
	Запрос.УстановитьПараметр("ПериодыСерийныхНомеров", РфпСервер.ПолучитьПоследнийПериодПакета(ДокументСсылкаТранспортировкаЗапасов
		,ДокументСсылкаТранспортировкаЗапасов.Дата,ДокументСсылкаТранспортировкаЗапасов.ДатаСмены,ДокументСсылкаТранспортировкаЗапасов.Смена
		,ДокументСсылкаТранспортировкаЗапасов.СтруктурнаяЕдиницаПолучатель,Справочники.алк_Штабели.ПустаяСсылка()
		,ДокументСсылкаТранспортировкаЗапасов.Запасы,ДокументСсылкаТранспортировкаЗапасов.Участок));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", Результат);
	
КонецПроцедуры

#КонецОбласти 


#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//УДАЛИТЬ после 28.02.2025 
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СпецификацияПредварительнойПартии";
	//КомандаПечати.Представление = НСтр("ru = 'Спецификация транспортировочной партии.'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 1;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СпецификацияПредварительнойПартииФакт";
	//КомандаПечати.Представление = НСтр("ru = 'Спецификация транспортировочной партии факт.'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 1;
	//
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СпецификацияПредварительнойПартииБезСечений";
	//КомандаПечати.Представление = НСтр("ru = 'Спецификация транспортировочной партии без сечений'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 1; 
	
	//\\
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
	//КомандаПечати.Идентификатор = "ТН";
	//КомандаПечати.Представление = НСтр("ru = 'Приложение №4 (Товарная накладная)'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 23;
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
	// 
	// УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	// 
	//КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияПредварительнойПартии") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СпецификацияПредварительнойПартии", "Спецификация транспортировочной партии.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СпецификацияПредварительнойПартии"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияПредварительнойПартииФакт") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СпецификацияПредварительнойПартииФакт", "Спецификация транспортировочной партии факт.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СпецификацияПредварительнойПартииФакт"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СпецификацияПредварительнойПартииБезСечений") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СпецификацияПредварительнойПартииБезСечений", "Спецификация транспортировочной партии  без сечений.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "СпецификацияПредварительнойПартииБезСечений"));
		
	КонецЕсли;
	
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Сформировать_СпецификациюТрПартии(ТабличныйДокумент, ТекущийДокумент,ИмяМакета);
		
		//Если ИмяМакета = "СпецификацияПредварительнойПартии" Тогда
		//	
		//	Сформировать_СпецификациюТрПартии(ТабличныйДокумент, ТекущийДокумент,ИмяМакета);
		//	
		//КонецЕсли;
		//
		//Если ИмяМакета = "СпецификацияПредварительнойПартииФакт" Тогда
		//	
		//	Сформировать_СпецификациюТрПартии_Факт(ТабличныйДокумент, ТекущийДокумент);
		//	
		//КонецЕсли;
		//
		//Если ИмяМакета = "СпецификацияПредварительнойПартииБезСечений" Тогда
		//	
		//	Сформировать_СпецификациюТрПартии_БезСечений(ТабличныйДокумент, ТекущийДокумент);
		//	
		//КонецЕсли;     
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

Функция ТекстЗапросаСпецификацияТрПартия()
	
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка КАК Ссылка,
	        |	алк_ТранспортировочныеПартииЗапасы.НомерСтроки КАК НомерСтроки,
	        |	алк_ТранспортировочныеПартииЗапасы.Номенклатура КАК Номенклатура,
	        |	алк_ТранспортировочныеПартииЗапасы.Характеристика КАК Характеристика,
	        |	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер КАК СерийныйНомер,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов КАК КоличествоПакетов,
	        |	алк_ТранспортировочныеПартииЗапасы.Объем КАК Объем,
	        |	алк_ТранспортировочныеПартииЗапасы.ОбъемТаможня КАК ОбъемТаможня,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоСостав КАК КоличествоСостав,
	        |	ВЫБОР
	        |		КОГДА &ЭтоКарандаш
	        |			ТОГДА алк_ТранспортировочныеПартииЗапасы.ВесНетто - 0.028
	        |		ИНАЧЕ алк_ТранспортировочныеПартииЗапасы.ВесНетто
	        |	КОНЕЦ КАК ВесНетто,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБрутто КАК ВесБрутто,
	        |	алк_ТранспортировочныеПартииЗапасы.КлючСвязи КАК КлючСвязи,
	        |	ВЫБОР
	        |		КОГДА алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка.ДокументОснование.Заказ ЕСТЬ NULL
	        |			ТОГДА алк_ТранспортировочныеПартииЗапасы.Заказ
	        |		ИНАЧЕ алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка.ДокументОснование.Заказ
	        |	КОНЕЦ КАК Заказ,
	        |	алк_ТранспортировочныеПартииЗапасы.Исключен КАК Исключен,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесНеттоФакт КАК ВесНеттоФакт,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБруттоФакт КАК ВесБруттоФакт
	        |ПОМЕСТИТЬ ВТ_Пакеты
	        |ИЗ
	        |	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировочныеПартии.ДокументыТранспортировки КАК алк_ТранспортировочныеПартииДокументыТранспортировки
	        |		ПО алк_ТранспортировочныеПартииЗапасы.Ссылка = алк_ТранспортировочныеПартииДокументыТранспортировки.Ссылка
	        |ГДЕ
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка
	        |	И НЕ ТИПЗНАЧЕНИЯ(алк_ТранспортировочныеПартииЗапасы.Ссылка.Заказ) = ТИП(Документ.алк_Аддендумы)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка,
	        |	алк_ТранспортировочныеПартииЗапасы.НомерСтроки,
	        |	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
	        |	алк_ТранспортировочныеПартииЗапасы.Характеристика,
	        |	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов,
	        |	алк_ТранспортировочныеПартииЗапасы.Объем,
	        |	алк_ТранспортировочныеПартииЗапасы.ОбъемТаможня,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоСостав,
	        |	ВЫБОР
	        |		КОГДА &ЭтоКарандаш
	        |			ТОГДА алк_ТранспортировочныеПартииЗапасы.ВесНетто - 0.028
	        |		ИНАЧЕ алк_ТранспортировочныеПартииЗапасы.ВесНетто
	        |	КОНЕЦ,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБрутто,
	        |	алк_ТранспортировочныеПартииЗапасы.КлючСвязи,
	        |	ВЫБОР
	        |		КОГДА алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка.ДокументОснование.Заказ ЕСТЬ NULL
	        |			ТОГДА алк_ТранспортировочныеПартииЗапасы.Заказ
	        |		ИНАЧЕ алк_ТранспортировочныеПартииДокументыТранспортировки.Транспортировка.ДокументОснование.Заказ
	        |	КОНЕЦ,
	        |	алк_ТранспортировочныеПартииЗапасы.Исключен,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесНеттоФакт,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБруттоФакт
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка,
	        |	алк_ТранспортировочныеПартииЗапасы.НомерСтроки,
	        |	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
	        |	алк_ТранспортировочныеПартииЗапасы.Характеристика,
	        |	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов,
	        |	алк_ТранспортировочныеПартииЗапасы.Объем,
	        |	алк_ТранспортировочныеПартииЗапасы.ОбъемТаможня,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоСостав,
	        |	ВЫБОР
	        |		КОГДА &ЭтоКарандаш
	        |			ТОГДА алк_ТранспортировочныеПартииЗапасы.ВесНетто - 0.028
	        |		ИНАЧЕ алк_ТранспортировочныеПартииЗапасы.ВесНетто
	        |	КОНЕЦ,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБрутто,
	        |	алк_ТранспортировочныеПартииЗапасы.КлючСвязи,
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка.Заказ,
	        |	алк_ТранспортировочныеПартииЗапасы.Исключен,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесНеттоФакт,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБруттоФакт
	        |ИЗ
	        |	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	        |ГДЕ
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка
	        |	И ТИПЗНАЧЕНИЯ(алк_ТранспортировочныеПартииЗапасы.Ссылка.Заказ) = ТИП(Документ.алк_Аддендумы)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка,
	        |	алк_ТранспортировочныеПартииЗапасы.НомерСтроки,
	        |	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
	        |	алк_ТранспортировочныеПартииЗапасы.Характеристика,
	        |	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов,
	        |	алк_ТранспортировочныеПартииЗапасы.Объем,
	        |	алк_ТранспортировочныеПартииЗапасы.ОбъемТаможня,
	        |	алк_ТранспортировочныеПартииЗапасы.КоличествоСостав,
	        |	ВЫБОР
	        |		КОГДА &ЭтоКарандаш
	        |			ТОГДА алк_ТранспортировочныеПартииЗапасы.ВесНетто - 0.028
	        |		ИНАЧЕ алк_ТранспортировочныеПартииЗапасы.ВесНетто
	        |	КОНЕЦ,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБрутто,
	        |	алк_ТранспортировочныеПартииЗапасы.КлючСвязи,
	        |	алк_ТранспортировочныеПартииЗапасы.Исключен,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесНеттоФакт,
	        |	алк_ТранспортировочныеПартииЗапасы.ВесБруттоФакт,
	        |	алк_ТранспортировочныеПартииЗапасы.Ссылка.Заказ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика КАК Характеристика,
	        |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск КАК Припуск,
	        |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине КАК ПрипускПрипускПоШирине,
	        |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
	        |	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине КАК ПрипускПрипускПоДлине,
	        |	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка КАК Заказ,
	        |	алк_ПараметрыХарактеристик.Порода КАК Порода,
	        |	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	        |	алк_ПараметрыХарактеристик.Длина КАК Длина,
	        |	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	        |	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
	        |	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
	        |	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК СечениеШиринаММ,
	        |	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК СечениеТолщинаММ
	        |ПОМЕСТИТЬ ВТ_Припуски
	        |ИЗ
	        |	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	        |		ПО алк_ЗаказПокупателяЗапасыАссортимент.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
	        |	алк_ПараметрыХарактеристик.Порода КАК Порода,
	        |	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	        |	алк_ПараметрыХарактеристик.Длина КАК Длина,
	        |	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	        |	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
	        |	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
	        |	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК СечениеШиринаММ,
	        |	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК СечениеТолщинаММ
	        |ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	        |ИЗ
	        |	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	        |ГДЕ
	        |	алк_ПараметрыХарактеристик.Характеристика В
	        |			(ВЫБРАТЬ
	        |				ВТ_Пакеты.Характеристика
	        |			ИЗ
	        |				ВТ_Пакеты КАК ВТ_Пакеты)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
	        |	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
	        |	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
	        |	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
	        |	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
	        |	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг
	        |ПОМЕСТИТЬ ВТ_Плотность
	        |ИЗ
	        |	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних КАК алк_ПлотностьНоменклатурыСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ВЫБОР
	        |		КОГДА ВТ_Пакеты.Исключен
	        |			ТОГДА ""ИТОГО ИСКЛЮЧЕНО:""
	        |		ИНАЧЕ ""ИТОГО ПОГРУЖЕНО:""
	        |	КОНЕЦ КАК СтрокаИтога,
	        |	ВТ_ПараметрыХарактеристик.Характеристика КАК Характеристика,
	        |	ВТ_Пакеты.Номенклатура КАК Номенклатура,
	        |	ВТ_ПараметрыХарактеристик.Порода КАК ПородаИсх,
	        |	ВТ_ПараметрыХарактеристик.Порода.Наименование + ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	        |				И ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 25
	        |			ТОГДА "" 10-25""
	        |		ИНАЧЕ """"
	        |	КОНЕЦ КАК Порода,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	        |				И ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 25
	        |			ТОГДА 1
	        |		ИНАЧЕ 2
	        |	КОНЕЦ КАК ПородаПорядокТолщины,
	        |	ВТ_ПараметрыХарактеристик.Сорт КАК Сорт,
	        |	ВТ_ПараметрыХарактеристик.Длина КАК Длина,
	        |	ВТ_ПараметрыХарактеристик.Сечение КАК Сечение,
	        |	ВТ_Пакеты.СерийныйНомер КАК СерийныйНомер,
	        |	ВТ_Пакеты.КоличествоПакетов КАК КоличествоПакетов,
	        |	ВТ_Пакеты.КоличествоСостав КАК КоличествоСостав,
	        |	ВТ_Пакеты.Объем КАК Объем,
	        |	ВЫБОР
	        |		КОГДА &СпецификацияОбычная
	        |			ТОГДА ВЫРАЗИТЬ(ВТ_Пакеты.КоличествоСостав * ((ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000) КАК ЧИСЛО(15, 2))
	        |		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Пакеты.ОбъемТаможня КАК ЧИСЛО(15, 3))
	        |	КОНЕЦ КАК ОбъемТаможня,
	        |	ЕСТЬNULL(ВТ_Пакеты.ВесНеттоФакт, ВТ_Пакеты.ВесНетто) КАК ВесНетто,
	        |	ЕСТЬNULL(ВТ_Пакеты.ВесБруттоФакт, ВТ_Пакеты.ВесБрутто) КАК ВесБрутто,
	        |	ВТ_ПараметрыХарактеристик.Сорт.Порядок КАК СортПорядок,
	        |	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ КАК СечениеТолщинаММ,
	        |	ВТ_ПараметрыХарактеристик.СечениеШиринаММ КАК СечениеШиринаММ,
	        |	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ КАК ДлинаДлинаММ,
	        |	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска КАК БоковаяДоска,
	        |	ВТ_ПараметрыХарактеристик.Влажность КАК Влажность,
	        |	ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0) КАК СечениеШиринаММ_СПрипуском,
	        |	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0) КАК СечениеТолщинаММ_СПрипуском,
	        |	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0) КАК ДлинаДлинаММ_СПрипуском
	        |ПОМЕСТИТЬ ВТ_Итог
	        |ИЗ
	        |	ВТ_Пакеты КАК ВТ_Пакеты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	        |				&ДатаСреза,
	        |				СерийныйНомер В
	        |					(ВЫБРАТЬ
	        |						ВТ_Пакеты.СерийныйНомер
	        |					ИЗ
	        |						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
	        |		ПО ВТ_Пакеты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	        |		ПО ВТ_Пакеты.Характеристика = ВТ_Припуски.Характеристика
	        |			И ВТ_Пакеты.Заказ = ВТ_Припуски.Заказ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	        |		ПО ВТ_Пакеты.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА ВТ_Пакеты.Исключен
	        |			ТОГДА ""ИТОГО ИСКЛЮЧЕНО:""
	        |		ИНАЧЕ ""ИТОГО ПОГРУЖЕНО:""
	        |	КОНЕЦ,
	        |	ВТ_ПараметрыХарактеристик.Характеристика,
	        |	ВТ_Пакеты.Номенклатура,
	        |	ВТ_ПараметрыХарактеристик.Порода,
	        |	ВТ_ПараметрыХарактеристик.Порода.Наименование + ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	        |				И ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 25
	        |			ТОГДА "" 10-25""
	        |		ИНАЧЕ """"
	        |	КОНЕЦ,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	        |				И ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 25
	        |			ТОГДА 1
	        |		ИНАЧЕ 2
	        |	КОНЕЦ,
	        |	ВТ_ПараметрыХарактеристик.Сорт,
	        |	ВТ_ПараметрыХарактеристик.Длина,
	        |	ВТ_ПараметрыХарактеристик.Сечение,
	        |	ВТ_Пакеты.СерийныйНомер,
	        |	ВТ_Пакеты.КоличествоПакетов,
	        |	ВТ_Пакеты.КоличествоСостав,
	        |	ВТ_Пакеты.Объем,
	        |	ВЫБОР
	        |		КОГДА &СпецификацияОбычная
	        |			ТОГДА ВЫРАЗИТЬ(ВТ_Пакеты.КоличествоСостав * ((ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000) КАК ЧИСЛО(15, 2))
	        |		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Пакеты.ОбъемТаможня КАК ЧИСЛО(15, 3))
	        |	КОНЕЦ,
	        |	ЕСТЬNULL(ВТ_Пакеты.ВесНеттоФакт, ВТ_Пакеты.ВесНетто),
	        |	ЕСТЬNULL(ВТ_Пакеты.ВесБруттоФакт, ВТ_Пакеты.ВесБрутто),
	        |	ВТ_ПараметрыХарактеристик.Сорт.Порядок,
	        |	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ,
	        |	ВТ_ПараметрыХарактеристик.СечениеШиринаММ,
	        |	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ,
	        |	NULL,
	        |	ВТ_ПараметрыХарактеристик.Влажность,
	        |	ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0),
	        |	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0),
	        |	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)
	        |ИЗ
	        |	ВТ_Пакеты КАК ВТ_Пакеты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	        |		ПО ВТ_Пакеты.Характеристика = ВТ_Припуски.Характеристика
	        |			И ВТ_Пакеты.Заказ = ВТ_Припуски.Заказ
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	        |		ПО ВТ_Пакеты.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Итог.СтрокаИтога КАК СтрокаИтога,
	        |	ВТ_Итог.Характеристика КАК Характеристика,
	        |	ВТ_Итог.Номенклатура КАК Номенклатура,
	        |	ВТ_Итог.ПородаИсх КАК ПородаИсх,
	        |	ВТ_Итог.Порода КАК Порода,
	        |	ВТ_Итог.ПородаПорядокТолщины КАК ПородаПорядокТолщины,
	        |	ВТ_Итог.Сорт КАК Сорт,
	        |	ВТ_Итог.Длина КАК Длина,
	        |	ВТ_Итог.Сечение КАК Сечение,
	        |	ВТ_Итог.СерийныйНомер КАК СерийныйНомер,
	        |	ВТ_Итог.КоличествоПакетов КАК КоличествоПакетов,
	        |	ВТ_Итог.КоличествоСостав КАК КоличествоСостав,
	        |	ВТ_Итог.Объем КАК Объем,
	        |	ВТ_Итог.ОбъемТаможня КАК ОбъемТаможня,
	        |	ВЫРАЗИТЬ(ВТ_Итог.ВесНетто КАК ЧИСЛО(15, 3)) КАК ВесНетто,
	        |	ВЫРАЗИТЬ(ВТ_Итог.ВесБрутто КАК ЧИСЛО(15, 3)) КАК ВесБрутто,
	        |	ВТ_Итог.СортПорядок КАК СортПорядок,
	        |	ВТ_Итог.СечениеТолщинаММ КАК СечениеТолщинаММ,
	        |	ВТ_Итог.СечениеШиринаММ КАК СечениеШиринаММ,
	        |	ВТ_Итог.ДлинаДлинаММ КАК ДлинаДлинаММ,
	        |	ВТ_Итог.БоковаяДоска КАК БоковаяДоска,
	        |	ВТ_Итог.СечениеШиринаММ_СПрипуском КАК СечениеШиринаММ_СПрипуском,
	        |	ВТ_Итог.СечениеТолщинаММ_СПрипуском КАК СечениеТолщинаММ_СПрипуском,
	        |	ВТ_Итог.ДлинаДлинаММ_СПрипуском КАК ДлинаДлинаММ_СПрипуском
	        |ИЗ
	        |	ВТ_Итог КАК ВТ_Итог
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Плотность КАК ВТ_Плотность
	        |		ПО ВТ_Итог.Номенклатура = ВТ_Плотность.Номенклатура
	        |			И ВТ_Итог.ПородаИсх = ВТ_Плотность.Порода
	        |			И ВТ_Итог.Влажность = ВТ_Плотность.Влажность
	        |			И ВТ_Итог.БоковаяДоска = ВТ_Плотность.БоковаяДоска
	        |ИТОГИ
	        |	МАКСИМУМ(ПородаИсх),
	        |	МИНИМУМ(ПородаПорядокТолщины),
	        |	СУММА(КоличествоПакетов),
	        |	СУММА(КоличествоСостав),
	        |	СУММА(Объем),
	        |	СУММА(ОбъемТаможня),
	        |	СУММА(ВесНетто),
	        |	СУММА(ВесБрутто),
	        |	МАКСИМУМ(СортПорядок),
	        |	МИНИМУМ(СечениеТолщинаММ),
	        |	МИНИМУМ(СечениеШиринаММ)
	        |ПО
	        |	СтрокаИтога,
	        |	Номенклатура,
	        |	Порода,
	        |	Сорт,
	        |	Длина,
	        |	Сечение" ;
	//"ВЫБРАТЬ
	//|	алк_ТранспортировочныеПартииЗапасы.Ссылка,
	//|	алк_ТранспортировочныеПартииЗапасы.НомерСтроки,
	//|	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
	//|	алк_ТранспортировочныеПартииЗапасы.Характеристика,
	//|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
	//|	алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов,
	//|	алк_ТранспортировочныеПартииЗапасы.Объем,
	//|	алк_ТранспортировочныеПартииЗапасы.ОбъемТаможня,
	//|	алк_ТранспортировочныеПартииЗапасы.КоличествоСостав,
	//|	алк_ТранспортировочныеПартииЗапасы.ВесНетто,
	//|	алк_ТранспортировочныеПартииЗапасы.ВесБрутто,
	//|	алк_ТранспортировочныеПартииЗапасы.КлючСвязи,
	//|	алк_ТранспортировочныеПартииЗапасы.Заказ,
	//|	алк_ТранспортировочныеПартииЗапасы.Исключен,
	//|	алк_ТранспортировочныеПартииЗапасы.ВесНеттоФакт,
	//|	алк_ТранспортировочныеПартииЗапасы.ВесБруттоФакт
	//|ПОМЕСТИТЬ ВТ_Пакеты
	//|ИЗ
	//|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	//|ГДЕ
	//|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка КАК Заказ
	//|ПОМЕСТИТЬ ВТ_Припуски
	//|ИЗ
	//|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	//|ГДЕ
	//|	(алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Ссылка
	//|			ИЛИ алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
	//|				(ВЫБРАТЬ
	//|					ВТ_Пакеты.Заказ
	//|				ИЗ
	//|					ВТ_Пакеты КАК ВТ_Пакеты))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ПараметрыХарактеристик.Характеристика,
	//|	алк_ПараметрыХарактеристик.Порода,
	//|	алк_ПараметрыХарактеристик.Сорт,
	//|	алк_ПараметрыХарактеристик.Длина,
	//|	алк_ПараметрыХарактеристик.Сечение,
	//|	алк_ПараметрыХарактеристик.Влажность,
	//|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ
	//|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	//|ИЗ
	//|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//|ГДЕ
	//|	алк_ПараметрыХарактеристик.Характеристика В
	//|			(ВЫБРАТЬ
	//|				ВТ_Пакеты.Характеристика
	//|			ИЗ
	//|				ВТ_Пакеты КАК ВТ_Пакеты)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
	//|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг
	//|ПОМЕСТИТЬ ВТ_Плотность
	//|ИЗ
	//|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних КАК алк_ПлотностьНоменклатурыСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ВТ_Пакеты.Исключен
	//|			ТОГДА ""ИТОГО ИСКЛЮЧЕНО:""
	//|		ИНАЧЕ ""ИТОГО ПОГРУЖЕНО:""
	//|	КОНЕЦ КАК СтрокаИтога,
	//|	ВТ_ПараметрыХарактеристик.Характеристика,
	//|	ВТ_Пакеты.Номенклатура,
	//|	ВТ_ПараметрыХарактеристик.Порода КАК ПородаИсх,
	//|	ВТ_ПараметрыХарактеристик.Порода.Наименование + ВЫБОР
	//|		КОГДА ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	//|				И ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 25
	//|			ТОГДА "" 10-25""
	//|		ИНАЧЕ """"
	//|	КОНЕЦ КАК Порода,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	//|				И ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 25
	//|			ТОГДА 1
	//|		ИНАЧЕ 2
	//|	КОНЕЦ КАК ПородаПорядокТолщины,
	//|	ВТ_ПараметрыХарактеристик.Сорт,
	//|	ВТ_ПараметрыХарактеристик.Длина,
	//|	ВТ_ПараметрыХарактеристик.Сечение,
	//|	ВТ_Пакеты.СерийныйНомер,
	//|	ВТ_Пакеты.КоличествоПакетов,
	//|	ВТ_Пакеты.КоличествоСостав,
	//|	ВТ_Пакеты.Объем,
	//|	ВЫРАЗИТЬ(ВТ_Пакеты.КоличествоСостав * ((ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0)) / 1000) * ((ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0)) / 1000) КАК ЧИСЛО(15, 2)) КАК ОбъемТаможня,
	//|	ЕСТЬNULL(ВТ_Пакеты.ВесНеттоФакт, ВТ_Пакеты.ВесНетто) КАК ВесНетто,
	//|	ЕСТЬNULL(ВТ_Пакеты.ВесБруттоФакт, ВТ_Пакеты.ВесБрутто) КАК ВесБрутто,
	//|	ВТ_ПараметрыХарактеристик.Сорт.Порядок,
	//|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ,
	//|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ,
	//|	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ,
	//|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска,
	//|	ВТ_ПараметрыХарактеристик.Влажность,
	//|	ВТ_ПараметрыХарактеристик.СечениеШиринаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоШирине, 0) КАК СечениеШиринаММ_СПрипуском,
	//|	ВТ_ПараметрыХарактеристик.СечениеТолщинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоТолщине, 0) КАК СечениеТолщинаММ_СПрипуском,
	//|	ВТ_ПараметрыХарактеристик.ДлинаДлинаММ + ЕСТЬNULL(ВТ_Припуски.ПрипускПрипускПоДлине, 0) КАК ДлинаДлинаММ_СПрипуском
	//|ПОМЕСТИТЬ ВТ_Итог
	//|ИЗ
	//|	ВТ_Пакеты КАК ВТ_Пакеты
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	//|				&ДатаСреза,
	//|				СерийныйНомер В
	//|					(ВЫБРАТЬ
	//|						ВТ_Пакеты.СерийныйНомер
	//|					ИЗ
	//|						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
	//|		ПО ВТ_Пакеты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Припуски КАК ВТ_Припуски
	//|		ПО ВТ_Пакеты.Характеристика = ВТ_Припуски.Характеристика
	//|			И ВТ_Пакеты.Заказ = ВТ_Припуски.Заказ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	//|		ПО ВТ_Пакеты.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Итог.СтрокаИтога КАК СтрокаИтога,
	//|	ВТ_Итог.Характеристика,
	//|	ВТ_Итог.Номенклатура КАК Номенклатура,
	//|	ВТ_Итог.ПородаИсх КАК ПородаИсх,
	//|	ВТ_Итог.Порода КАК Порода,
	//|	ВТ_Итог.ПородаПорядокТолщины КАК ПородаПорядокТолщины,
	//|	ВТ_Итог.Сорт КАК Сорт,
	//|	ВТ_Итог.Длина КАК Длина,
	//|	ВТ_Итог.Сечение КАК Сечение,
	//|	ВТ_Итог.СерийныйНомер,
	//|	ВТ_Итог.КоличествоПакетов КАК КоличествоПакетов,
	//|	ВТ_Итог.КоличествоСостав КАК КоличествоСостав,
	//|	ВТ_Итог.Объем КАК Объем,
	//|	ВТ_Итог.ОбъемТаможня КАК ОбъемТаможня,
	//|	ВЫРАЗИТЬ(ВТ_Итог.ВесНетто КАК ЧИСЛО(15, 3)) КАК ВесНетто,
	//|	ВЫРАЗИТЬ(ВТ_Итог.ВесБрутто КАК ЧИСЛО(15, 3)) КАК ВесБрутто,
	//|	ВТ_Итог.СортПорядок КАК СортПорядок,
	//|	ВТ_Итог.СечениеТолщинаММ КАК СечениеТолщинаММ,
	//|	ВТ_Итог.СечениеШиринаММ КАК СечениеШиринаММ,
	//|	ВТ_Итог.ДлинаДлинаММ,
	//|	ВТ_Итог.БоковаяДоска,
	//|	ВТ_Итог.СечениеШиринаММ_СПрипуском,
	//|	ВТ_Итог.СечениеТолщинаММ_СПрипуском,
	//|	ВТ_Итог.ДлинаДлинаММ_СПрипуском
	//|ИЗ
	//|	ВТ_Итог КАК ВТ_Итог
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Плотность КАК ВТ_Плотность
	//|		ПО ВТ_Итог.Номенклатура = ВТ_Плотность.Номенклатура
	//|			И ВТ_Итог.ПородаИсх = ВТ_Плотность.Порода
	//|			И ВТ_Итог.Влажность = ВТ_Плотность.Влажность
	//|			И ВТ_Итог.БоковаяДоска = ВТ_Плотность.БоковаяДоска
	//|ИТОГИ
	//|	МАКСИМУМ(ПородаИсх),
	//|	МИНИМУМ(ПородаПорядокТолщины),
	//|	СУММА(КоличествоПакетов),
	//|	СУММА(КоличествоСостав),
	//|	СУММА(Объем),
	//|	СУММА(ОбъемТаможня),
	//|	СУММА(ВесНетто),
	//|	СУММА(ВесБрутто),
	//|	МАКСИМУМ(СортПорядок),
	//|	МИНИМУМ(СечениеТолщинаММ),
	//|	МИНИМУМ(СечениеШиринаММ)
	//|ПО
	//|	СтрокаИтога,
	//|	Номенклатура,
	//|	Порода,
	//|	Сорт,
	//|	Длина,
	//|	Сечение";
	
	Возврат Текст;	
	
КонецФункции // ТекстЗапросаСпецификацияТрПартия()


// Процедура формирования "Спецификации на транспортировочную партию"
//
Процедура Сформировать_СпецификациюТрПартии(ТабличныйДокумент, ТекущийДокумент,ИмяМакета)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировочныеПартии.Спецификация_1");
	
	ЭтоКарандаши = Номенклатура_Карандаши(ТекущийДокумент);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаСпецификацияТрПартия();
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущийДокумент.Дата);
	Запрос.УстановитьПараметр("ЭтоКарандаш",ЭтоКарандаши);
	
	Если  ИмяМакета = "СпецификацияПредварительнойПартии" Тогда
		Запрос.УстановитьПараметр("СпецификацияОбычная", Ложь);
	Иначе
		Запрос.УстановитьПараметр("СпецификацияОбычная",Истина);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ЗаказДокумента = ТекущийДокумент.Заказ;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьИсключен = Макет.ПолучитьОбласть("Исключен");
	
	Если ЭтоКарандаши тогда
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Карандаш");
		ОбластьИсключен = Макет.ПолучитьОбласть("ИсключенТаможня_Карандаш");
		
		ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура_Карандаш");
		ОбластьПорода = Макет.ПолучитьОбласть("Порода_Карандаш");
		ОбластьСорт = Макет.ПолучитьОбласть("Сорт_Карандаш");
		ОбластьСечение = Макет.ПолучитьОбласть("Сечение_Карандаш");
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали_Карандаш");
		
	иначе
		
		ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
		ОбластьПорода = Макет.ПолучитьОбласть("Порода");
		ОбластьСорт = Макет.ПолучитьОбласть("Сорт");
		ОбластьСечение = Макет.ПолучитьОбласть("Сечение");
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	КонецЕсли;
	
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Очистить();
	
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Спецификация(предварительная) на партию №" + ТекущийДокумент.Номер + " от " + Формат(ТекущийДокумент.Дата, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.Заказ = ЗаказДокумента;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("ЛЦ_Загрузка");
	ОбластьТаблицы.Параметры.ЛЦ_Загрузка = ТекущийДокумент.ЛЦ_Загрузка.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("ЛЦ_Назначение");
	ОбластьТаблицы.Параметры.ЛЦ_Назначение = ТекущийДокумент.ЛЦ_Назначение.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("Экспедитор");
	ОбластьТаблицы.Параметры.Экспедитор = ТекущийДокумент.КонтрагентЭкспедитор.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("Теплоход");
	ОбластьТаблицы.Параметры.Теплоход = ТекущийДокумент.Теплоход.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	СтрокаИтога = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока СтрокаИтога.Следующий() Цикл
		ВыборкаНоменклатура = СтрокаИтога.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
			ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
			ВыборкаПорода = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПорода.Следующий() Цикл
				ОбластьПорода.Параметры.Заполнить(ВыборкаПорода);
				ТабДок.Вывести(ОбластьПорода, ВыборкаПорода.Уровень());
				ВыборкаСорт = ВыборкаПорода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСорт.Следующий() Цикл
					ОбластьСорт.Параметры.Заполнить(ВыборкаСорт);
					ТабДок.Вывести(ОбластьСорт, ВыборкаСорт.Уровень());
					ВыборкаДлина = ВыборкаСорт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДлина.Следующий() Цикл
						ВыборкаСечение = ВыборкаДлина.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаСечение.Следующий() Цикл
							ОбластьСечение.Параметры.Заполнить(ВыборкаСечение);
							ТабДок.Вывести(ОбластьСечение, ВыборкаСечение.Уровень());
							ВыборкаДетальныеЗаписи = ВыборкаСечение.Выбрать();
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
								ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ОбластьИсключен.Параметры.Заполнить(СтрокаИтога);
		ТабДок.Вывести(ОбластьИсключен, СтрокаИтога.Уровень());
		
	КонецЦикла; 
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ПоказатьУровеньГруппировокСтрок(ВыборкаСечение.Уровень()-1);
	
	ТабличныйДокумент = ТабДок;
	
КонецПроцедуры //Сформировать_СпецификациюТрПартии()	


//Убрать

// Процедура формирования "Спецификации на транспортировочную партию"
//
Процедура Сформировать_СпецификациюТрПартии_Факт(ТабличныйДокумент, ТекущийДокумент)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировочныеПартии.Спецификация_2");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА алк_ТранспортировочныеПартииЗапасы.Исключен
	|			ТОГДА ""ИТОГО ИСКЛЮЧЕНО:""
	|		ИНАЧЕ ""ИТОГО ПОГРУЖЕНО:""
	|	КОНЕЦ КАК СтрокаИтога,
	|	алк_ТранспортировочныеПартииЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ПараметрыХарактеристик.Порода КАК ПородаИсх,
	|	алк_ПараметрыХарактеристик.Порода.Наименование + ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	|				И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 24
	|			ТОГДА "" 10-24""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 25
	|						И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 31
	|					ТОГДА "" 25-31""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 32
	|								И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 60
	|							ТОГДА "" 32-60""
	|						ИНАЧЕ """"
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Порода,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	|				И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 24
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 25
	|						И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 31
	|					ТОГДА 3
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 32
	|								И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 60
	|							ТОГДА 4
	|						ИНАЧЕ 2
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ПородаПорядокТолщины,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование + "", "" + алк_ПараметрыХарактеристик.Влажность.Наименование, """") КАК Сорт,
	|	алк_ПараметрыХарактеристик.Длина КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов) КАК КоличествоПакетов,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.КоличествоСостав) КАК КоличествоСостав,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.Объем) КАК Объем,
	|	СУММА(ВЫРАЗИТЬ(алк_ТранспортировочныеПартииЗапасы.ОбъемТаможня КАК ЧИСЛО(15, 2))) КАК ОбъемТаможня,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.ВесНетто) КАК ВесНетто,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.ВесБрутто) КАК ВесБрутто,
	|	алк_ПараметрыХарактеристик.Сорт.Порядок КАК СортПорядок
	|ПОМЕСТИТЬ Свод
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ТранспортировочныеПартииЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Длина,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование + "", "" + алк_ПараметрыХарактеристик.Влажность.Наименование, """"),
	|	ВЫБОР
	|		КОГДА алк_ТранспортировочныеПартииЗапасы.Исключен
	|			ТОГДА ""ИТОГО ИСКЛЮЧЕНО:""
	|		ИНАЧЕ ""ИТОГО ПОГРУЖЕНО:""
	|	КОНЕЦ,
	|	алк_ПараметрыХарактеристик.Сорт.Порядок,
	|	алк_ПараметрыХарактеристик.Порода,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	|				И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 24
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 25
	|						И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 31
	|					ТОГДА 3
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 32
	|								И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 60
	|							ТОГДА 4
	|						ИНАЧЕ 2
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	алк_ПараметрыХарактеристик.Порода.Наименование + ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 10
	|				И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 24
	|			ТОГДА "" 10-24""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 25
	|						И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 31
	|					ТОГДА "" 25-31""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) >= 32
	|								И ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) <= 60
	|							ТОГДА "" 32-60""
	|						ИНАЧЕ """"
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свод.СтрокаИтога КАК СтрокаИтога,
	|	Свод.Номенклатура КАК Номенклатура,
	|	Свод.ПородаИсх КАК ПородаИсх,
	|	Свод.Порода КАК Порода,
	|	Свод.ПородаПорядокТолщины КАК ПородаПорядокТолщины,
	|	Свод.Сорт КАК Сорт,
	|	Свод.Длина КАК Длина,
	|	Свод.Сечение КАК Сечение,
	|	Свод.СерийныйНомер КАК СерийныйНомер,
	|	Свод.КоличествоПакетов КАК КоличествоПакетов,
	|	Свод.КоличествоСостав КАК КоличествоСостав,
	|	Свод.Объем КАК Объем,
	|	Свод.ОбъемТаможня КАК ОбъемТаможня,
	|	Свод.ВесНетто КАК ВесНетто,
	|	Свод.ВесБрутто КАК ВесБрутто,
	|	Свод.СортПорядок КАК СортПорядок,
	|	Свод.Сечение.ТолщинаММ КАК СечениеТолщинаММ,
	|	Свод.Сечение.ШиринаММ КАК СечениеШиринаММ
	|ИЗ
	|	Свод КАК Свод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ПородаИсх,
	|	ПородаПорядокТолщины,
	|	СортПорядок,
	|	Длина,
	|	СечениеТолщинаММ,
	|	СечениеШиринаММ,
	|	СерийныйНомер
	|ИТОГИ
	|	МАКСИМУМ(ПородаИсх),
	|	МИНИМУМ(ПородаПорядокТолщины),
	|	СУММА(КоличествоПакетов),
	|	СУММА(КоличествоСостав),
	|	СУММА(Объем),
	|	СУММА(ОбъемТаможня),
	|	СУММА(ВесНетто),
	|	СУММА(ВесБрутто),
	|	МАКСИМУМ(СортПорядок),
	|	МИНИМУМ(СечениеТолщинаММ),
	|	МИНИМУМ(СечениеШиринаММ)
	|ПО
	|	СтрокаИтога,
	|	Номенклатура,
	|	Порода,
	|	Сорт,
	|	Длина,
	|	Сечение
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ЗаказДокумента = ТекущийДокумент.Заказ;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьИсключен = Макет.ПолучитьОбласть("Исключен");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	ОбластьПорода = Макет.ПолучитьОбласть("Порода");
	ОбластьСорт = Макет.ПолучитьОбласть("Сорт");
	ОбластьСечение = Макет.ПолучитьОбласть("Сечение");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Очистить();
	
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Спецификация(предварительная) на партию №" + ТекущийДокумент.Номер + " от " + Формат(ТекущийДокумент.Дата, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.Заказ = ЗаказДокумента;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("ЛЦ_Загрузка");
	ОбластьТаблицы.Параметры.ЛЦ_Загрузка = ТекущийДокумент.ЛЦ_Загрузка.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("ЛЦ_Назначение");
	ОбластьТаблицы.Параметры.ЛЦ_Назначение = ТекущийДокумент.ЛЦ_Назначение.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("Экспедитор");
	ОбластьТаблицы.Параметры.Экспедитор = ТекущийДокумент.КонтрагентЭкспедитор.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("Теплоход");
	ОбластьТаблицы.Параметры.Теплоход = ТекущийДокумент.Теплоход.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	СтрокаИтога = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока СтрокаИтога.Следующий() Цикл
		ВыборкаНоменклатура = СтрокаИтога.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
			ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
			ВыборкаПорода = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПорода.Следующий() Цикл
				ОбластьПорода.Параметры.Заполнить(ВыборкаПорода);
				ТабДок.Вывести(ОбластьПорода, ВыборкаПорода.Уровень());
				ВыборкаСорт = ВыборкаПорода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСорт.Следующий() Цикл
					ОбластьСорт.Параметры.Заполнить(ВыборкаСорт);
					ТабДок.Вывести(ОбластьСорт, ВыборкаСорт.Уровень());
					ВыборкаДлина = ВыборкаСорт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДлина.Следующий() Цикл
						ВыборкаСечение = ВыборкаДлина.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаСечение.Следующий() Цикл
							ОбластьСечение.Параметры.Заполнить(ВыборкаСечение);
							ТабДок.Вывести(ОбластьСечение, ВыборкаСечение.Уровень());
							ВыборкаДетальныеЗаписи = ВыборкаСечение.Выбрать();
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
								ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ОбластьИсключен.Параметры.Заполнить(СтрокаИтога);
		ТабДок.Вывести(ОбластьИсключен, СтрокаИтога.Уровень());
		
	КонецЦикла; 
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ПоказатьУровеньГруппировокСтрок(ВыборкаСечение.Уровень()-1);
	
	ТабличныйДокумент = ТабДок;
	
	
КонецПроцедуры //Сформировать_СпецификациюТрПартии_Факт()	

// Процедура формирования "Спецификации на транспортировочную партию"
//
Процедура Сформировать_СпецификациюТрПартии_БезСечений(ТабличныйДокумент, ТекущийДокумент)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_ТранспортировочныеПартии.Спецификация_2");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА алк_ТранспортировочныеПартииЗапасы.Исключен
	|			ТОГДА ""ИТОГО ИСКЛЮЧЕНО:""
	|		ИНАЧЕ ""ИТОГО ПОГРУЖЕНО:""
	|	КОНЕЦ КАК СтрокаИтога,
	|	алк_ТранспортировочныеПартииЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ПараметрыХарактеристик.Порода КАК ПородаИсх,
	|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
	|	1 КАК ПородаПорядокТолщины,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование + "", "" + алк_ПараметрыХарактеристик.Влажность.Наименование, """") КАК Сорт,
	|	алк_ПараметрыХарактеристик.Длина КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.КоличествоПакетов) КАК КоличествоПакетов,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.КоличествоСостав) КАК КоличествоСостав,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.Объем) КАК Объем,
	|	СУММА(ВЫРАЗИТЬ(алк_ТранспортировочныеПартииЗапасы.ОбъемТаможня КАК ЧИСЛО(15, 2))) КАК ОбъемТаможня,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.ВесНетто) КАК ВесНетто,
	|	СУММА(алк_ТранспортировочныеПартииЗапасы.ВесБрутто) КАК ВесБрутто,
	|	алк_ПараметрыХарактеристик.Сорт.Порядок КАК СортПорядок
	|ПОМЕСТИТЬ Свод
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ТранспортировочныеПартииЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ТранспортировочныеПартииЗапасы.Номенклатура,
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Длина,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование + "", "" + алк_ПараметрыХарактеристик.Влажность.Наименование, """"),
	|	ВЫБОР
	|		КОГДА алк_ТранспортировочныеПартииЗапасы.Исключен
	|			ТОГДА ""ИТОГО ИСКЛЮЧЕНО:""
	|		ИНАЧЕ ""ИТОГО ПОГРУЖЕНО:""
	|	КОНЕЦ,
	|	алк_ПараметрыХарактеристик.Сорт.Порядок,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Порода.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Свод.СтрокаИтога КАК СтрокаИтога,
	|	Свод.Номенклатура КАК Номенклатура,
	|	Свод.ПородаИсх КАК ПородаИсх,
	|	Свод.Порода КАК Порода,
	|	Свод.ПородаПорядокТолщины КАК ПородаПорядокТолщины,
	|	Свод.Сорт КАК Сорт,
	|	Свод.Длина КАК Длина,
	|	Свод.Сечение КАК Сечение,
	|	Свод.СерийныйНомер КАК СерийныйНомер,
	|	Свод.КоличествоПакетов КАК КоличествоПакетов,
	|	Свод.КоличествоСостав КАК КоличествоСостав,
	|	Свод.Объем КАК Объем,
	|	Свод.ОбъемТаможня КАК ОбъемТаможня,
	|	Свод.ВесНетто КАК ВесНетто,
	|	Свод.ВесБрутто КАК ВесБрутто,
	|	Свод.СортПорядок КАК СортПорядок,
	|	Свод.Сечение.ТолщинаММ КАК СечениеТолщинаММ,
	|	Свод.Сечение.ШиринаММ КАК СечениеШиринаММ
	|ИЗ
	|	Свод КАК Свод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ПородаИсх,
	|	ПородаПорядокТолщины,
	|	СортПорядок,
	|	Длина,
	|	СечениеТолщинаММ,
	|	СечениеШиринаММ,
	|	СерийныйНомер
	|ИТОГИ
	|	МАКСИМУМ(ПородаИсх),
	|	МИНИМУМ(ПородаПорядокТолщины),
	|	СУММА(КоличествоПакетов),
	|	СУММА(КоличествоСостав),
	|	СУММА(Объем),
	|	СУММА(ОбъемТаможня),
	|	СУММА(ВесНетто),
	|	СУММА(ВесБрутто),
	|	МАКСИМУМ(СортПорядок),
	|	МИНИМУМ(СечениеТолщинаММ),
	|	МИНИМУМ(СечениеШиринаММ)
	|ПО
	|	СтрокаИтога,
	|	Номенклатура,
	|	Порода,
	|	Сорт,
	|	Длина,
	|	Сечение
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент.Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ЗаказДокумента = ТекущийДокумент.Заказ;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьИсключен = Макет.ПолучитьОбласть("Исключен");
	ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
	ОбластьПорода = Макет.ПолучитьОбласть("Порода");
	ОбластьСорт = Макет.ПолучитьОбласть("Сорт");
	ОбластьСечение = Макет.ПолучитьОбласть("Сечение");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Очистить();
	
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Спецификация(предварительная) на партию №" + ТекущийДокумент.Номер + " от " + Формат(ТекущийДокумент.Дата, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.Заказ = ЗаказДокумента;
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("ЛЦ_Загрузка");
	ОбластьТаблицы.Параметры.ЛЦ_Загрузка = ТекущийДокумент.ЛЦ_Загрузка.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("ЛЦ_Назначение");
	ОбластьТаблицы.Параметры.ЛЦ_Назначение = ТекущийДокумент.ЛЦ_Назначение.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("Экспедитор");
	ОбластьТаблицы.Параметры.Экспедитор = ТекущийДокумент.КонтрагентЭкспедитор.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	ОбластьТаблицы = Макет.ПолучитьОбласть("Теплоход");
	ОбластьТаблицы.Параметры.Теплоход = ТекущийДокумент.Теплоход.Наименование;
	ТабДок.Вывести(ОбластьТаблицы);
	
	
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	СтрокаИтога = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока СтрокаИтога.Следующий() Цикл
		ВыборкаНоменклатура = СтрокаИтога.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНоменклатура.Следующий() Цикл
			ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
			ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
			ВыборкаПорода = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПорода.Следующий() Цикл
				ОбластьПорода.Параметры.Заполнить(ВыборкаПорода);
				ТабДок.Вывести(ОбластьПорода, ВыборкаПорода.Уровень());
				ВыборкаСорт = ВыборкаПорода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСорт.Следующий() Цикл
					ОбластьСорт.Параметры.Заполнить(ВыборкаСорт);
					ТабДок.Вывести(ОбластьСорт, ВыборкаСорт.Уровень());
					ВыборкаДлина = ВыборкаСорт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДлина.Следующий() Цикл
						ВыборкаСечение = ВыборкаДлина.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаСечение.Следующий() Цикл
							ОбластьСечение.Параметры.Заполнить(ВыборкаСечение);
							ТабДок.Вывести(ОбластьСечение, ВыборкаСечение.Уровень());
							ВыборкаДетальныеЗаписи = ВыборкаСечение.Выбрать();
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
								ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ОбластьИсключен.Параметры.Заполнить(СтрокаИтога);
		ТабДок.Вывести(ОбластьИсключен, СтрокаИтога.Уровень());
		
	КонецЦикла; 
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ПоказатьУровеньГруппировокСтрок(ВыборкаСечение.Уровень()-1);
	
	ТабличныйДокумент = ТабДок;
	
	
КонецПроцедуры //Сформировать_СпецификациюТрПартии_Факт()	

//убрать конец

#КонецОбласти


#Область ФактКорректировки

Функция ОбработатьАналитикуЗапасовПоФакту(ДокументСсылкаТранспортировочныеПартии, ДокументСсылкаФакт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировочныеПартииЗапасы.СерийныйНомер
	|ПОМЕСТИТЬ втТрПартииЗапасы
	|ИЗ
	|	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	|ГДЕ
	|	алк_ТранспортировочныеПартииЗапасы.Ссылка = &СсылкаТрПартии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер
	|ПОМЕСТИТЬ втПогрузкаЗапасы
	|ИЗ
	|	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
	|ГДЕ
	|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка = &СсылкаФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТрПартииЗапасы.СерийныйНомер,
	|	втПогрузкаЗапасы.СерийныйНомер КАК СерийныйНомер1
	|ИЗ
	|	втТрПартииЗапасы КАК втТрПартииЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПогрузкаЗапасы КАК втПогрузкаЗапасы
	|		ПО втТрПартииЗапасы.СерийныйНомер = втПогрузкаЗапасы.СерийныйНомер
	|ГДЕ
	|	ЕСТЬNULL(втПогрузкаЗапасы.СерийныйНомер, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("СсылкаТрПартии", ДокументСсылкаТранспортировочныеПартии);
	Запрос.УстановитьПараметр("СсылкаФакт", ДокументСсылкаФакт);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Попытка
		
		ТрОбъект = ДокументСсылкаТранспортировочныеПартии.ПолучитьОбъект();
		ТрОбъект.Факт   = Истина;
		ТрОбъект.ДокументПогрузки = ДокументСсылкаФакт;
		
		тчЗапасы = ТрОбъект.Запасы;
		
		Для каждого стрЗапас Из тчЗапасы Цикл
			стрЗапас.Исключен = Ложь;	
		КонецЦикла; 
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ВДЗ = РезультатЗапроса.Выбрать();
			Пока ВДЗ.Следующий() Цикл
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("СерийныйНомер", ВДЗ.СерийныйНомер);
				НайденныеСтроки = тчЗапасы.НайтиСтроки(ПараметрыОтбора); 
				
				Для каждого стрМассива Из НайденныеСтроки Цикл
					стрМассива.Исключен = Истина;	
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		ТрОбъект.Записать();
		
		Возврат Истина;
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка записи документа " + ТрОбъект.Ссылка + " " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
		//ОписаниеОшибки()
	КонецПопытки; 
	
КонецФункции


#КонецОбласти 	


&НаСервере
Функция Номенклатура_Карандаши(ТекДокумент)Экспорт  
	
	ТЧ_Запасы = ТекДокумент.Запасы.Выгрузить(,"Номенклатура");
	
	Для каждого Элемент из ТЧ_Запасы цикл
		
		Возврат  Элемент.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000006");
		
	КонецЦикла;
	
КонецФункции
