	  
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина); 
	СписокОпераций = ЭтотОбъект.Выгрузить(,"Показатель").ВыгрузитьКолонку("Показатель");

	#Если НаКлиенте и Не НаКлиенте тогда
	СписокОпераций = новый Соответствие;	
	#КонецЕсли
	Для каждого ЗаписьНабора из ЭтотОбъект Цикл
		Если ЗаписьНабора.Период = НачалоМесяца(ЗаписьНабора.Период) тогда
			НоваяЗапись = РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.СоздатьМенеджерЗаписи();
	    	НоваяЗапись.ПериодРасчета = ЗаписьНабора.Период; 
			НоваяЗапись.ВидЗначения = Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт;
	   		НоваяЗапись.ОперацияПроизводства = ЗаписьНабора.Показатель;
			НоваяЗапись.ВременнаяМетка = ТекущаяДата();
			НоваяЗапись.Записать(Истина); 
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры       


Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	МассивПоказателейДоЗаписи = новый массив;
	ОтборРегистратор = ЭтотОбъект.Отбор.Найти("Регистратор");
	Если ОтборРегистратор <> Неопределено тогда
		УстановитьПривилегированныйРежим(Истина);
		Запрос = новый Запрос(
		"ВЫБРАТЬ
		|	МИНИМУМ(алк_ФактическиеПоказателиПроизводства.Период) КАК ПериодРасчета,
		|	алк_ФактическиеПоказателиПроизводства.Показатель КАК ОперацияПроизводства,
		|	&ТекущаяДата КАК ВременнаяМетка
		|ИЗ
		|	РегистрСведений.алк_ФактическиеПоказателиПроизводства КАК алк_ФактическиеПоказателиПроизводства
		|ГДЕ
		|	алк_ФактическиеПоказателиПроизводства.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ФактическиеПоказателиПроизводства.Показатель");
		Запрос.УстановитьПараметр("Регистратор", 	ОтборРегистратор.Значение);
		Запрос.УстановитьПараметр("ТекущаяДата", 	ТекущаяДата()); 
		РезультатЗапрос = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапрос.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.СоздатьМенеджерЗаписи();  
			ЗаполнитьЗначенияСвойств(НоваяЗапись, РезультатЗапрос); 
			НоваяЗапись.ВидЗначения = Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт; 
			НоваяЗапись.Записать(Истина);	
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры 


