
#Область ОбрабокаКомманд

&НаСервере
Процедура ЗаполнитьПоОтгрузкеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рфп_ОтгрузкаВагона.Ссылка.НомерВагона КАК НомерВагона,
	|	рфп_ОтгрузкаВагона.Ссылка.НомерНакладной КАК НомерНакладной,
	|	рфп_ОтгрузкаВагона.Пиловочник.(
	|		Ссылка,
	|		НомерСтроки,
	|		Номенклатура,
	|		Порода,
	|		_Порода,
	|		Сорт,
	|		_Сорт,
	|		Длина,
	|		_Длина,
	|		Сечение,
	|		Количество,
	|		Объем
	|	),
	|	рфп_ОтгрузкаВагона.Производитель,
	|	рфп_ОтгрузкаВагона.Сертификат,
	|	рфп_ОтгрузкаВагона.Статус
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона КАК рфп_ОтгрузкаВагона
	|ГДЕ
	|	рфп_ОтгрузкаВагона.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Партия);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  ВыборкаДетальныеЗаписи.Следующий();
		
		//ЗаполнитьЗначенияСвойств(Объект, ВыборкаДетальныеЗаписи);
		Объект.НомерНакладной = ВыборкаДетальныеЗаписи.НомерНакладной;
		Объект.НомерВагона = ВыборкаДетальныеЗаписи.НомерВагона;
		Объект.Производитель  = ВыборкаДетальныеЗаписи.Производитель;
		
		Объект.СертификатПроизводителя = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат),
												Справочники.СертификатыНаПродукцию.НайтиПоНаименованию(),
												Справочники.СертификатыНаПродукцию.ПустаяСсылка());
		
		Объект.Пиловочник.Загрузить(ВыборкаДетальныеЗаписи.Пиловочник.Выгрузить());
		
	Иначе
		
		ОчиститьДанныеОтгрузки();
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтгрузке(Команда)
	Если ЗначениеЗаполнено(Объект.Партия) тогда
		ЗаполнитьПоОтгрузкеНаСервере();            
	Иначе
	    ОчиститьДанныеОтгрузки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСортировкуНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_СортировкаЛесопродукцииПиловочник.Ссылка.НомерНакладной,
	//|	алк_СортировкаЛесопродукцииПиловочник.Номенклатура,
	//|	алк_СортировкаЛесопродукцииПиловочник.КатегорияНоменклатуры,
	//|	алк_СортировкаЛесопродукцииПиловочник.Порода,
	//|	алк_СортировкаЛесопродукцииПиловочник.Сорт,
	//|	алк_СортировкаЛесопродукцииПиловочник.Длина,
	//|	алк_СортировкаЛесопродукцииПиловочник.Сечение,
	//|	алк_СортировкаЛесопродукцииПиловочник.Количество,
	//|	алк_СортировкаЛесопродукцииПиловочник.Объем,
	//|	алк_СортировкаЛесопродукцииПиловочник.ДиаметрВершиныФакт,
	//|	алк_СортировкаЛесопродукцииПиловочник.ДлинаФакт,
	//|	алк_СортировкаЛесопродукцииПиловочник.ВычетНаКору
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.алк_СортировкаЛесопродукции.Пиловочник КАК алк_СортировкаЛесопродукцииПиловочник
	//|ГДЕ
	//|	алк_СортировкаЛесопродукцииПиловочник.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.НомерНакладной,
	//|	ВТ.Номенклатура,
	//|	ВТ.КатегорияНоменклатуры,
	//|	ВТ.Порода,
	//|	ВТ.Сорт,
	//|	ВТ.Длина,
	//|	ВТ.Сечение,
	//|	ВТ.Количество,
	//|	ВТ.Объем,
	//|	ВТ.ДиаметрВершиныФакт,
	//|	ВТ.ДлинаФакт,
	//|	ВТ.ВычетНаКору,
	//|	алк_ПодборШтабеляСрезПоследних.Штабель
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПодборШтабеля.СрезПоследних(&ДатаДок, ) КАК алк_ПодборШтабеляСрезПоследних
	//|		ПО ВТ.КатегорияНоменклатуры = алк_ПодборШтабеляСрезПоследних.КатегорияНоменклатуры
	//|			И ВТ.Сорт = алк_ПодборШтабеляСрезПоследних.Сорт
	//|			И ВТ.ДлинаФакт >= алк_ПодборШтабеляСрезПоследних.ДлинаФактОт
	//|			И ВТ.ДлинаФакт <= алк_ПодборШтабеляСрезПоследних.ДлинаФактДо
	//|			И ВТ.Порода = алк_ПодборШтабеляСрезПоследних.Порода";
	//
	//Запрос.УстановитьПараметр("Ссылка", Объект.ДокументСортировки);   
	//Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
	//
	//РезультатЗапроса = Запрос.Выполнить();  	
	//Если Не РезультатЗапроса.Пустой() Тогда
	//					
	//	Объект.ПиловочникСортировка.Загрузить(РезультатЗапроса.Выгрузить());
	//	
	//Иначе
	//	
	//	ОчиститьДанныеСортировки();
	//	
	//КонецЕсли;
	
	// 20241202 Данько ТА 
	ДанныеПоСортировке = ПолучитьДанныеПоСортировке(Объект.ДокументСортировки,Объект.Дата,Истина,Ложь);
		 	
	Если НЕ ДанныеПоСортировке.Количество() = 0 Тогда				
		Объект.ПиловочникСортировка.Загрузить(ДанныеПоСортировке);
	Иначе
		ОчиститьДанныеСортировки();	
	КонецЕсли;
	//\\

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСортировку(Команда)
	ЗаполнитьСортировкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПиловочникОУ(Команда)
	
	Объект.ПиловочникОУ.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПиловочникГОСТ(Команда)
	
	Объект.ПиловочникГОСТ.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПиловочникОУ_ПоСортировке(Команда)
	
	//ЗаполнитьПиловочникНаСервере(Истина);
	//
	//УстановитьОтборТаблицы(Элементы.ПиловочникОУ2);
	//
	//ДФК = Объект.ПиловочникОУ;
	//ПоказателиГруппыСервер(ДФК);
	//
	//ДФК = Объект.ПиловочникОУ;
	//УстановитьПоказателиГруппКлиент(ДФК);
	//
	//Элементы.ПиловочникОУ1.Обновить();
	//
	//Модифицированность = Истина; 
	
	ЗаполнитьПиловочниеНаСервере2(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПиловочникГОСТ_ПоСортировке(Команда)
	
	//ЗаполнитьПиловочникНаСервере(Ложь);
	//
	//УстановитьОтборТаблицыГОСТ(Элементы.ПиловочникГОСТ2);
	//
	//ДФК = Объект.ПиловочникГОСТ;
	//ПоказателиГруппыСервер(ДФК);
	//
	//ДФК = Объект.ПиловочникГОСТ;
	//УстановитьПоказателиГруппКлиент(ДФК);
	//
	//Элементы.ПиловочникГОСТ1.Обновить();
	//
	//Модифицированность = Истина; 
	
	ЗаполнитьПиловочниеНаСервере2(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоСортировке(СортировкаСсылка,Дата,ВернутьОбщиеДанные,ВернутьДанныеПоБУ) 
	
	// 20241202 Данько ТА //последняя заявка №23309 от 20250917 
	// важные условия:  
	// диаметр больше 6, так как это палки, не ставим в учет 
	// для 3 (до 3,5) длины всегда штабель Дрова 
	// Этапы сортировки разделены на ВТ:
	// ВТ Сортировка0 - вся пихта идет в штабель Пихта (диаметр больше 6)
	// ВТ Сортировка - вся 3 (до 3,5) длина - штабель Дрова (исключаем пихту, диаметр больше 6) 
	// ВТ Сортировка1 - Полное соединение данных сортировки (диаметр больше 6, исключаем пихту и длину 3) с рс Параметры сортировки ОУ БУ
	                   // соединяем по породе, сорту, длине, диаметру
	// ВТ Сортировка2 - Сооединение данных сортировки (то что осталось пустым при сортировки 1) с рс Параметры сортировки ОУ БУ
	                   // соединяем по породе, сорту, длине
	// ВТ Сортировка3 - Сооединение данных сортировки (то что осталось пустым при сортировки 2) с рс Параметры сортировки ОУ БУ
	                   // соединяем по сорту, диаметру				  
	// ВТ Сортировка4 - Сооединение данных сортировки (то что осталось пустым при сортировки 3) с рс Параметры сортировки ОУ БУ
	                   // соединяем по сорту
    //20241226 добавилось еще условие все, кроме сорта дрова с диаметром от 6 до 13 идет, как сорт баланс
	//поэтому в конце добавила выбор когда: когда диаметр от 6 до 13 и сорт не дрова, то ставим сорт учета Баланс 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СортировкаЛесопродукцииПиловочник.Номенклатура КАК Номенклатура,
	|	алк_СортировкаЛесопродукцииПиловочник.Порода КАК Порода,
	|	алк_СортировкаЛесопродукцииПиловочник.Сорт КАК Сорт,
	|	алк_СортировкаЛесопродукцииПиловочник.Длина КАК Длина,
	|	алк_СортировкаЛесопродукцииПиловочник.Сечение КАК Сечение,
	|	СУММА(алк_СортировкаЛесопродукцииПиловочник.Количество) КАК Количество,
	|	СУММА(алк_СортировкаЛесопродукцииПиловочник.Объем) КАК Объем,
	|	алк_СортировкаЛесопродукцииПиловочник.Длина.ДлинаММ КАК ДлинаФакт,
	|	алк_СортировкаЛесопродукцииПиловочник.Сечение.ДиаметрММ КАК ДиаметрВершиныФакт,
	|	алк_СортировкаЛесопродукцииПиловочник.ДлинаФакт КАК ДлинаФактИзмер,
	|	алк_СортировкаЛесопродукцииПиловочник.ДиаметрВершиныФакт КАК ДиаметрВершиныФактИзмер,
	|	алк_СортировкаЛесопродукцииПиловочник.ВычетНаКору КАК ВычетНаКору
	|ПОМЕСТИТЬ ВТ_СоВсемиДанными
	|ИЗ
	|	Документ.алк_СортировкаЛесопродукции.Пиловочник КАК алк_СортировкаЛесопродукцииПиловочник
	|ГДЕ
	|	алк_СортировкаЛесопродукцииПиловочник.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_СортировкаЛесопродукцииПиловочник.Номенклатура,
	|	алк_СортировкаЛесопродукцииПиловочник.Порода,
	|	алк_СортировкаЛесопродукцииПиловочник.Сорт,
	|	алк_СортировкаЛесопродукцииПиловочник.Длина,
	|	алк_СортировкаЛесопродукцииПиловочник.Сечение,
	|	алк_СортировкаЛесопродукцииПиловочник.Длина.ДлинаММ,
	|	алк_СортировкаЛесопродукцииПиловочник.Сечение.ДиаметрММ,
	|	алк_СортировкаЛесопродукцииПиловочник.ДлинаФакт,
	|	алк_СортировкаЛесопродукцииПиловочник.ДиаметрВершиныФакт,
	|	алк_СортировкаЛесопродукцииПиловочник.ВычетНаКору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоВсемиДанными.Номенклатура КАК Номенклатура,
	|	ВТ_СоВсемиДанными.Порода КАК Порода,
	|	ВТ_СоВсемиДанными.Сорт КАК Сорт,
	|	ВТ_СоВсемиДанными.Длина КАК Длина,
	|	ВТ_СоВсемиДанными.Сечение КАК Сечение,
	|	СУММА(ВТ_СоВсемиДанными.Количество) КАК Количество,
	|	СУММА(ВТ_СоВсемиДанными.Объем) КАК Объем,
	|	ВТ_СоВсемиДанными.ДлинаФакт КАК ДлинаФакт,
	|	ВТ_СоВсемиДанными.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	ВТ_СоВсемиДанными.ДлинаФактИзмер КАК ДлинаФактИзмер
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_СоВсемиДанными КАК ВТ_СоВсемиДанными
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СоВсемиДанными.Номенклатура,
	|	ВТ_СоВсемиДанными.Порода,
	|	ВТ_СоВсемиДанными.Сорт,
	|	ВТ_СоВсемиДанными.Длина,
	|	ВТ_СоВсемиДанными.Сечение,
	|	ВТ_СоВсемиДанными.ДлинаФакт,
	|	ВТ_СоВсемиДанными.ДиаметрВершиныФакт,
	|	ВТ_СоВсемиДанными.ДлинаФактИзмер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.Период КАК Период,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.Порода КАК Порода,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.Сорт КАК Сорт,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ДиаметрОт КАК ДиаметрОт,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ДиаметрДо КАК ДиаметрДо,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ДлинаОт КАК ДлинаОт,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ДлинаДо КАК ДлинаДо,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.СортУ КАК СортУ,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ПоГосту КАК ПоГосту,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.Штабель КАК Штабель,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_ХарактеристикиДляШтабеля
	|ИЗ
	|	РегистрСведений.алк_ПараметрыСортировкиОУБУ.СрезПоследних(&ДатаСортировки, ) КАК алк_ПараметрыСортировкиОУБУСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Порода КАК Порода,
	|	ВТ.Сорт КАК Сорт,
	|	ВТ.Длина КАК Длина,
	|	ВТ.Сечение КАК Сечение,
	|	СУММА(ВТ.Количество) КАК Количество,
	|	СУММА(ВТ.Объем) КАК Объем,
	|	ВЫБОР
	|		КОГДА ВТ.Сорт = &Сорт12
	|				ИЛИ ВТ.Сорт = &Сорт13
	|				ИЛИ ВТ.Сорт = &Сорт3
	|			ТОГДА &Сорт13
	|		ИНАЧЕ ВТ.Сорт
	|	КОНЕЦ КАК СортУ,
	|	ИСТИНА КАК ПоГосту,
	|	&ШтабельПихта КАК Штабель,
	|	ВТ.ДлинаФакт КАК ДлинаФакт,
	|	ВТ.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	ВТ.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	&ДлинаУПихта КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_Сортировка0
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Порода.Код = ""000000003""
	|	И ВТ.ДиаметрВершиныФакт > 60
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Номенклатура,
	|	ВТ.Порода,
	|	ВТ.Сорт,
	|	ВТ.Длина,
	|	ВТ.Сечение,
	|	ВТ.ДлинаФакт,
	|	ВТ.ДиаметрВершиныФакт,
	|	ВТ.ДлинаФактИзмер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.Номенклатура,
	|	ВТ.Порода,
	|	ВТ.Сорт,
	|	ВТ.Длина,
	|	ВТ.Сечение,
	|	СУММА(ВТ.Количество),
	|	СУММА(ВТ.Объем),
	|	ВТ.Сорт,
	|	ЛОЖЬ,
	|	&ШтабельПихта,
	|	ВТ.ДлинаФакт,
	|	ВТ.ДиаметрВершиныФакт,
	|	ВТ.ДлинаФактИзмер,
	|	&ДлинаУПихта
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Порода.Код = ""000000003""
	|	И ВТ.ДиаметрВершиныФакт > 60
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Номенклатура,
	|	ВТ.Порода,
	|	ВТ.Сорт,
	|	ВТ.Длина,
	|	ВТ.Сечение,
	|	ВТ.ДлинаФакт,
	|	ВТ.ДиаметрВершиныФакт,
	|	ВТ.ДлинаФактИзмер,
	|	ВТ.Сорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.Номенклатура КАК Номенклатура,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.Порода КАК Порода,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.Сорт КАК Сорт,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.Длина КАК Длина,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.Сечение КАК Сечение,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.Количество КАК Количество,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.Объем КАК Объем,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.СортУ КАК СортУ,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ПоГосту КАК ПоГосту,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.Штабель КАК Штабель,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.ДлинаФакт КАК ДлинаФакт,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	алк_ПараметрыСортировкиОУБУСрезПоследних.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_Сортировка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.Номенклатура КАК Номенклатура,
	|		ВТ.Порода КАК Порода,
	|		ВТ.Сорт КАК Сорт,
	|		ВТ.Длина КАК Длина,
	|		ВТ.Сечение КАК Сечение,
	|		ВТ.Количество КАК Количество,
	|		ВТ.Объем КАК Объем,
	|		ВТ.ДлинаФакт КАК ДлинаФакт,
	|		ВТ.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|		ВТ.ДлинаФактИзмер КАК ДлинаФактИзмер
	|	ИЗ
	|		ВТ КАК ВТ
	|	ГДЕ
	|		ВТ.ДиаметрВершиныФакт > 60
	|		И ВТ.ДлинаФактИзмер <= 350
	|		И НЕ ВТ.Порода.Код = ""000000003"") КАК ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыСортировкиОУБУ.СрезПоследних(&ДатаСортировки, Штабель.Код = ""000000005"") КАК алк_ПараметрыСортировкиОУБУСрезПоследних
	|		ПО (алк_ПараметрыСортировкиОУБУСрезПоследних.Порода = ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка))
	|			И (алк_ПараметрыСортировкиОУБУСрезПоследних.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка))
	|			И ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.ДлинаФактИзмер >= алк_ПараметрыСортировкиОУБУСрезПоследних.ДлинаОт
	|			И ХарактеристикиСортировкиПо3ДлинеСДиаметромБольше6.ДлинаФактИзмер <= алк_ПараметрыСортировкиОУБУСрезПоследних.ДлинаДо
	|			И (алк_ПараметрыСортировкиОУБУСрезПоследних.ДиаметрДо = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Номенклатура КАК Номенклатура,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Порода КАК Порода,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Сорт КАК Сорт,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Длина КАК Длина,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Сечение КАК Сечение,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Количество КАК Количество,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Объем КАК Объем,
	|	ВТ_ХарактеристикиДляШтабеля.СортУ КАК СортУ,
	|	ВТ_ХарактеристикиДляШтабеля.ПоГосту КАК ПоГосту,
	|	ВТ_ХарактеристикиДляШтабеля.Штабель КАК Штабель,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.ДлинаФакт КАК ДлинаФакт,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	ВТ_ХарактеристикиДляШтабеля.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_Сортировка1
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.Номенклатура КАК Номенклатура,
	|		ВТ.Порода КАК Порода,
	|		ВТ.Сорт КАК Сорт,
	|		ВТ.Длина КАК Длина,
	|		ВТ.Сечение КАК Сечение,
	|		ВТ.Количество КАК Количество,
	|		ВТ.Объем КАК Объем,
	|		ВТ.ДлинаФакт КАК ДлинаФакт,
	|		ВТ.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|		ВТ.ДлинаФактИзмер КАК ДлинаФактИзмер
	|	ИЗ
	|		ВТ КАК ВТ
	|	ГДЕ
	|		ВТ.ДиаметрВершиныФакт > 60
	|		И ВТ.ДлинаФактИзмер > 350
	|		И НЕ ВТ.Порода.Код = ""000000003"") КАК ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиДляШтабеля КАК ВТ_ХарактеристикиДляШтабеля
	|		ПО ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Порода = ВТ_ХарактеристикиДляШтабеля.Порода
	|			И ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.Сорт = ВТ_ХарактеристикиДляШтабеля.Сорт
	|			И ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.ДлинаФактИзмер >= ВТ_ХарактеристикиДляШтабеля.ДлинаОт
	|			И ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.ДлинаФактИзмер <= ВТ_ХарактеристикиДляШтабеля.ДлинаДо
	|			И ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.ДиаметрВершиныФакт >= ВТ_ХарактеристикиДляШтабеля.ДиаметрОт
	|			И ХарактеристикиСортировкиНеПо3ДлинеСДиаметромБольше6.ДиаметрВершиныФакт <= ВТ_ХарактеристикиДляШтабеля.ДиаметрДо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сортировка1.Номенклатура КАК Номенклатура,
	|	ВТ_Сортировка1.Порода КАК Порода,
	|	ВТ_Сортировка1.Сорт КАК Сорт,
	|	ВТ_Сортировка1.Длина КАК Длина,
	|	ВТ_Сортировка1.Сечение КАК Сечение,
	|	ВТ_Сортировка1.Количество КАК Количество,
	|	ВТ_Сортировка1.Объем КАК Объем,
	|	ВТ_ХарактеристикиДляШтабеля.СортУ КАК СортУ,
	|	ВТ_ХарактеристикиДляШтабеля.ПоГосту КАК ПоГосту,
	|	ВТ_ХарактеристикиДляШтабеля.Штабель КАК Штабель,
	|	ВТ_Сортировка1.ДлинаФакт КАК ДлинаФакт,
	|	ВТ_Сортировка1.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	ВТ_Сортировка1.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	ВТ_ХарактеристикиДляШтабеля.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_Сортировка2
	|ИЗ
	|	ВТ_Сортировка1 КАК ВТ_Сортировка1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиДляШтабеля КАК ВТ_ХарактеристикиДляШтабеля
	|		ПО (ВТ_ХарактеристикиДляШтабеля.Порода = ВТ_Сортировка1.Порода)
	|			И (ВТ_ХарактеристикиДляШтабеля.Сорт = ВТ_Сортировка1.Сорт)
	|			И ВТ_Сортировка1.ДлинаФактИзмер >= ВТ_ХарактеристикиДляШтабеля.ДлинаОт
	|			И ВТ_Сортировка1.ДлинаФактИзмер <= ВТ_ХарактеристикиДляШтабеля.ДлинаДо
	|			И ВТ_Сортировка1.ДиаметрВершиныФакт >= ВТ_ХарактеристикиДляШтабеля.ДиаметрОт
	|			И (ВТ_ХарактеристикиДляШтабеля.ДиаметрДо = 0)
	|ГДЕ
	|	ВТ_Сортировка1.Штабель ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сортировка2.Номенклатура КАК Номенклатура,
	|	ВТ_Сортировка2.Порода КАК Порода,
	|	ВТ_Сортировка2.Сорт КАК Сорт,
	|	ВТ_Сортировка2.Длина КАК Длина,
	|	ВТ_Сортировка2.Сечение КАК Сечение,
	|	ВТ_Сортировка2.Количество КАК Количество,
	|	ВТ_Сортировка2.Объем КАК Объем,
	|	ВТ_Сортировка2.ДлинаФакт КАК ДлинаФакт,
	|	ВТ_Сортировка2.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	ВТ_ХарактеристикиДляШтабеля.СортУ КАК СортУ,
	|	ВТ_ХарактеристикиДляШтабеля.ПоГосту КАК ПоГосту,
	|	ВТ_ХарактеристикиДляШтабеля.Штабель КАК Штабель,
	|	ВТ_Сортировка2.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	ВТ_ХарактеристикиДляШтабеля.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_Сортировка3
	|ИЗ
	|	ВТ_Сортировка2 КАК ВТ_Сортировка2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиДляШтабеля КАК ВТ_ХарактеристикиДляШтабеля
	|		ПО (ВТ_ХарактеристикиДляШтабеля.Порода = ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка))
	|			И ВТ_Сортировка2.Сорт = ВТ_ХарактеристикиДляШтабеля.Сорт
	|			И (ВТ_ХарактеристикиДляШтабеля.ДлинаДо = 0)
	|			И ВТ_Сортировка2.ДиаметрВершиныФакт >= ВТ_ХарактеристикиДляШтабеля.ДиаметрОт
	|			И ВТ_Сортировка2.ДиаметрВершиныФакт <= ВТ_ХарактеристикиДляШтабеля.ДиаметрДо
	|ГДЕ
	|	ВТ_Сортировка2.Штабель ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сортировка3.Номенклатура КАК Номенклатура,
	|	ВТ_Сортировка3.Порода КАК Порода,
	|	ВТ_Сортировка3.Сорт КАК Сорт,
	|	ВТ_Сортировка3.Длина КАК Длина,
	|	ВТ_Сортировка3.Сечение КАК Сечение,
	|	ВТ_Сортировка3.Количество КАК Количество,
	|	ВТ_Сортировка3.Объем КАК Объем,
	|	ВТ_Сортировка3.ДлинаФакт КАК ДлинаФакт,
	|	ВТ_Сортировка3.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	ВТ_ХарактеристикиДляШтабеля.СортУ КАК СортУ,
	|	ВТ_ХарактеристикиДляШтабеля.ПоГосту КАК ПоГосту,
	|	ВТ_ХарактеристикиДляШтабеля.Штабель КАК Штабель,
	|	ВТ_Сортировка3.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	ВТ_ХарактеристикиДляШтабеля.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_Сортировка4
	|ИЗ
	|	ВТ_Сортировка3 КАК ВТ_Сортировка3
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиДляШтабеля КАК ВТ_ХарактеристикиДляШтабеля
	|		ПО (ВТ_ХарактеристикиДляШтабеля.Порода = ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка))
	|			И ВТ_Сортировка3.Сорт = ВТ_ХарактеристикиДляШтабеля.Сорт
	|			И (ВТ_ХарактеристикиДляШтабеля.ДлинаДо = 0)
	|			И (ВТ_ХарактеристикиДляШтабеля.ДиаметрДо = 0)
	|ГДЕ
	|	ВТ_Сортировка3.Штабель ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сортировка0.Номенклатура КАК Номенклатура,
	|	ВТ_Сортировка0.Порода КАК Порода,
	|	ВТ_Сортировка0.Сорт КАК Сорт,
	|	ВТ_Сортировка0.Длина КАК Длина,
	|	ВТ_Сортировка0.Сечение КАК Сечение,
	|	ВТ_Сортировка0.Количество КАК Количество,
	|	ВТ_Сортировка0.Объем КАК Объем,
	|	ВТ_Сортировка0.СортУ КАК СортУ,
	|	ВТ_Сортировка0.Штабель КАК Штабель,
	|	ВТ_Сортировка0.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	ВТ_Сортировка0.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_ПоГосту
	|ИЗ
	|	ВТ_Сортировка0 КАК ВТ_Сортировка0
	|ГДЕ
	|	ВТ_Сортировка0.ПоГосту
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка.Номенклатура,
	|	ВТ_Сортировка.Порода,
	|	ВТ_Сортировка.Сорт,
	|	ВТ_Сортировка.Длина,
	|	ВТ_Сортировка.Сечение,
	|	ВТ_Сортировка.Количество,
	|	ВТ_Сортировка.Объем,
	|	ВТ_Сортировка.СортУ,
	|	ВТ_Сортировка.Штабель,
	|	ВТ_Сортировка.ДлинаФактИзмер,
	|	ВТ_Сортировка.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка КАК ВТ_Сортировка
	|ГДЕ
	|	ВТ_Сортировка.ПоГосту
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка1.Номенклатура,
	|	ВТ_Сортировка1.Порода,
	|	ВТ_Сортировка1.Сорт,
	|	ВТ_Сортировка1.Длина,
	|	ВТ_Сортировка1.Сечение,
	|	ВТ_Сортировка1.Количество,
	|	ВТ_Сортировка1.Объем,
	|	ВТ_Сортировка1.СортУ,
	|	ВТ_Сортировка1.Штабель,
	|	ВТ_Сортировка1.ДлинаФактИзмер,
	|	ВТ_Сортировка1.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка1 КАК ВТ_Сортировка1
	|ГДЕ
	|	НЕ ВТ_Сортировка1.Штабель ЕСТЬ NULL
	|	И ВТ_Сортировка1.ПоГосту
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка2.Номенклатура,
	|	ВТ_Сортировка2.Порода,
	|	ВТ_Сортировка2.Сорт,
	|	ВТ_Сортировка2.Длина,
	|	ВТ_Сортировка2.Сечение,
	|	ВТ_Сортировка2.Количество,
	|	ВТ_Сортировка2.Объем,
	|	ВТ_Сортировка2.СортУ,
	|	ВТ_Сортировка2.Штабель,
	|	ВТ_Сортировка2.ДлинаФактИзмер,
	|	ВТ_Сортировка2.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка2 КАК ВТ_Сортировка2
	|ГДЕ
	|	ВТ_Сортировка2.ПоГосту
	|	И НЕ ВТ_Сортировка2.Штабель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка3.Номенклатура,
	|	ВТ_Сортировка3.Порода,
	|	ВТ_Сортировка3.Сорт,
	|	ВТ_Сортировка3.Длина,
	|	ВТ_Сортировка3.Сечение,
	|	ВТ_Сортировка3.Количество,
	|	ВТ_Сортировка3.Объем,
	|	ВТ_Сортировка3.СортУ,
	|	ВТ_Сортировка3.Штабель,
	|	ВТ_Сортировка3.ДлинаФактИзмер,
	|	ВТ_Сортировка3.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка3 КАК ВТ_Сортировка3
	|ГДЕ
	|	ВТ_Сортировка3.ПоГосту
	|	И НЕ ВТ_Сортировка3.Штабель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка4.Номенклатура,
	|	ВТ_Сортировка4.Порода,
	|	ВТ_Сортировка4.Сорт,
	|	ВТ_Сортировка4.Длина,
	|	ВТ_Сортировка4.Сечение,
	|	ВТ_Сортировка4.Количество,
	|	ВТ_Сортировка4.Объем,
	|	ВТ_Сортировка4.СортУ,
	|	ВТ_Сортировка4.Штабель,
	|	ВТ_Сортировка4.ДлинаФактИзмер,
	|	ВТ_Сортировка4.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка4 КАК ВТ_Сортировка4
	|ГДЕ
	|	ВТ_Сортировка4.ПоГосту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сортировка0.Номенклатура КАК Номенклатура,
	|	ВТ_Сортировка0.Порода КАК Порода,
	|	ВТ_Сортировка0.Сорт КАК Сорт,
	|	ВТ_Сортировка0.Длина КАК Длина,
	|	ВТ_Сортировка0.Сечение КАК Сечение,
	|	ВТ_Сортировка0.Количество КАК Количество,
	|	ВТ_Сортировка0.Объем КАК Объем,
	|	ВТ_Сортировка0.СортУ КАК СортУ,
	|	ВТ_Сортировка0.Штабель КАК Штабель,
	|	ВТ_Сортировка0.ДлинаФактИзмер КАК ДлинаФактИзмер,
	|	ВТ_Сортировка0.ДлинаУ КАК ДлинаУ
	|ПОМЕСТИТЬ ВТ_ПоОУ
	|ИЗ
	|	ВТ_Сортировка0 КАК ВТ_Сортировка0
	|ГДЕ
	|	НЕ ВТ_Сортировка0.ПоГосту
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка.Номенклатура,
	|	ВТ_Сортировка.Порода,
	|	ВТ_Сортировка.Сорт,
	|	ВТ_Сортировка.Длина,
	|	ВТ_Сортировка.Сечение,
	|	ВТ_Сортировка.Количество,
	|	ВТ_Сортировка.Объем,
	|	ВТ_Сортировка.СортУ,
	|	ВТ_Сортировка.Штабель,
	|	ВТ_Сортировка.ДлинаФактИзмер,
	|	ВТ_Сортировка.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка КАК ВТ_Сортировка
	|ГДЕ
	|	НЕ ВТ_Сортировка.ПоГосту
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка1.Номенклатура,
	|	ВТ_Сортировка1.Порода,
	|	ВТ_Сортировка1.Сорт,
	|	ВТ_Сортировка1.Длина,
	|	ВТ_Сортировка1.Сечение,
	|	ВТ_Сортировка1.Количество,
	|	ВТ_Сортировка1.Объем,
	|	ВТ_Сортировка1.СортУ,
	|	ВТ_Сортировка1.Штабель,
	|	ВТ_Сортировка1.ДлинаФактИзмер,
	|	ВТ_Сортировка1.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка1 КАК ВТ_Сортировка1
	|ГДЕ
	|	НЕ ВТ_Сортировка1.ПоГосту
	|	И НЕ ВТ_Сортировка1.Штабель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка2.Номенклатура,
	|	ВТ_Сортировка2.Порода,
	|	ВТ_Сортировка2.Сорт,
	|	ВТ_Сортировка2.Длина,
	|	ВТ_Сортировка2.Сечение,
	|	ВТ_Сортировка2.Количество,
	|	ВТ_Сортировка2.Объем,
	|	ВТ_Сортировка2.СортУ,
	|	ВТ_Сортировка2.Штабель,
	|	ВТ_Сортировка2.ДлинаФактИзмер,
	|	ВТ_Сортировка2.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка2 КАК ВТ_Сортировка2
	|ГДЕ
	|	НЕ ВТ_Сортировка2.ПоГосту
	|	И НЕ ВТ_Сортировка2.Штабель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка3.Номенклатура,
	|	ВТ_Сортировка3.Порода,
	|	ВТ_Сортировка3.Сорт,
	|	ВТ_Сортировка3.Длина,
	|	ВТ_Сортировка3.Сечение,
	|	ВТ_Сортировка3.Количество,
	|	ВТ_Сортировка3.Объем,
	|	ВТ_Сортировка3.СортУ,
	|	ВТ_Сортировка3.Штабель,
	|	ВТ_Сортировка3.ДлинаФактИзмер,
	|	ВТ_Сортировка3.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка3 КАК ВТ_Сортировка3
	|ГДЕ
	|	НЕ ВТ_Сортировка3.ПоГосту
	|	И НЕ ВТ_Сортировка3.Штабель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Сортировка4.Номенклатура,
	|	ВТ_Сортировка4.Порода,
	|	ВТ_Сортировка4.Сорт,
	|	ВТ_Сортировка4.Длина,
	|	ВТ_Сортировка4.Сечение,
	|	ВТ_Сортировка4.Количество,
	|	ВТ_Сортировка4.Объем,
	|	ВТ_Сортировка4.СортУ,
	|	ВТ_Сортировка4.Штабель,
	|	ВТ_Сортировка4.ДлинаФактИзмер,
	|	ВТ_Сортировка4.ДлинаУ
	|ИЗ
	|	ВТ_Сортировка4 КАК ВТ_Сортировка4
	|ГДЕ
	|	НЕ ВТ_Сортировка4.ПоГосту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоВсемиДанными.Номенклатура КАК Номенклатура,
	|	ВТ_СоВсемиДанными.Порода КАК Порода,
	|	ВТ_СоВсемиДанными.Сорт КАК Сорт,
	|	ВТ_СоВсемиДанными.Длина КАК Длина,
	|	ВТ_СоВсемиДанными.Сечение КАК Сечение,
	|	СУММА(ВТ_СоВсемиДанными.Количество) КАК Количество,
	|	СУММА(ВТ_СоВсемиДанными.Объем) КАК Объем,
	|	ВЫБОР
	|		КОГДА ДанныеПоОУБУ.КолШтабелей > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(ДанныеПоОУБУ.Штабель, ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка))
	|	КОНЕЦ КАК Штабель,
	|	ВТ_СоВсемиДанными.ВычетНаКору КАК ВычетНаКору,
	|	ВТ_СоВсемиДанными.ДлинаФактИзмер КАК ДлинаФакт,
	|	ВТ_СоВсемиДанными.ДиаметрВершиныФактИзмер КАК ДиаметрВершиныФакт
	|ИЗ
	|	ВТ_СоВсемиДанными КАК ВТ_СоВсемиДанными
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоОУБУ.Номенклатура КАК Номенклатура,
	|			ПоОУБУ.Порода КАК Порода,
	|			ПоОУБУ.Сорт КАК Сорт,
	|			ПоОУБУ.Длина КАК Длина,
	|			ПоОУБУ.Сечение КАК Сечение,
	|			ПоОУБУ.Количество КАК Количество,
	|			ПоОУБУ.Объем КАК Объем,
	|			ПоОУБУ.Штабель КАК Штабель,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоОУБУ.Штабель) КАК КолШтабелей,
	|			ПоОУБУ.ДлинаФактИзмер КАК ДлинаФактИзмер
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВТ_ПоГосту.Номенклатура КАК Номенклатура,
	|				ВТ_ПоГосту.Порода КАК Порода,
	|				ВТ_ПоГосту.Сорт КАК Сорт,
	|				ВТ_ПоГосту.Длина КАК Длина,
	|				ВТ_ПоГосту.Сечение КАК Сечение,
	|				ВТ_ПоГосту.Количество КАК Количество,
	|				ВТ_ПоГосту.Объем КАК Объем,
	|				ВТ_ПоГосту.Штабель КАК Штабель,
	|				ВТ_ПоГосту.ДлинаФактИзмер КАК ДлинаФактИзмер
	|			ИЗ
	|				ВТ_ПоГосту КАК ВТ_ПоГосту
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВТ_ПоОУ.Номенклатура,
	|				ВТ_ПоОУ.Порода,
	|				ВТ_ПоОУ.Сорт,
	|				ВТ_ПоОУ.Длина,
	|				ВТ_ПоОУ.Сечение,
	|				ВТ_ПоОУ.Количество,
	|				ВТ_ПоОУ.Объем,
	|				ВТ_ПоОУ.Штабель,
	|				ВТ_ПоОУ.ДлинаФактИзмер
	|			ИЗ
	|				ВТ_ПоОУ КАК ВТ_ПоОУ) КАК ПоОУБУ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоОУБУ.Номенклатура,
	|			ПоОУБУ.Порода,
	|			ПоОУБУ.Сорт,
	|			ПоОУБУ.Длина,
	|			ПоОУБУ.Сечение,
	|			ПоОУБУ.Количество,
	|			ПоОУБУ.Объем,
	|			ПоОУБУ.Штабель,
	|			ПоОУБУ.ДлинаФактИзмер) КАК ДанныеПоОУБУ
	|		ПО ВТ_СоВсемиДанными.Порода = ДанныеПоОУБУ.Порода
	|			И ВТ_СоВсемиДанными.Сорт = ДанныеПоОУБУ.Сорт
	|			И ВТ_СоВсемиДанными.Длина = ДанныеПоОУБУ.Длина
	|			И ВТ_СоВсемиДанными.Сечение = ДанныеПоОУБУ.Сечение
	|			И ВТ_СоВсемиДанными.ДлинаФактИзмер = ДанныеПоОУБУ.ДлинаФактИзмер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СоВсемиДанными.Номенклатура,
	|	ВТ_СоВсемиДанными.Порода,
	|	ВТ_СоВсемиДанными.Сорт,
	|	ВТ_СоВсемиДанными.Длина,
	|	ВТ_СоВсемиДанными.Сечение,
	|	ВТ_СоВсемиДанными.ВычетНаКору,
	|	ВТ_СоВсемиДанными.ДлинаФактИзмер,
	|	ВТ_СоВсемиДанными.ДиаметрВершиныФактИзмер,
	|	ВЫБОР
	|		КОГДА ДанныеПоОУБУ.КолШтабелей > 1
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(ДанныеПоОУБУ.Штабель, ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка))
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штабель,
	|	ВТ_СоВсемиДанными.Порода.Код,
	|	ВТ_СоВсемиДанными.Сорт.Код,
	|	ВТ_СоВсемиДанными.Длина.ДлинаММ,
	|	ВТ_СоВсемиДанными.Сечение.ДиаметрММ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОУ.Номенклатура КАК Номенклатура,
	|	ОУ.Порода КАК Порода,
	|	ОУ.Длина КАК Длина,
	|	ОУ.Сечение КАК Сечение,
	|	ОУ.Количество КАК Количество,
	|	ОКР(ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) * ОУ.Количество, 3) КАК Объем,
	|	ОУ.СортУ КАК СортУ,
	|	ОУ.Штабель КАК Штабель
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ПоОУ.Номенклатура КАК Номенклатура,
	|		ВТ_ПоОУ.Порода КАК Порода,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_ПоОУ.ДлинаУ, ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|				ТОГДА ВТ_ПоОУ.Длина
	|			ИНАЧЕ ВТ_ПоОУ.ДлинаУ
	|		КОНЕЦ КАК Длина,
	|		ВТ_ПоОУ.Сечение КАК Сечение,
	|		СУММА(ВТ_ПоОУ.Количество) КАК Количество,
	|		СУММА(ВТ_ПоОУ.Объем) КАК Объем,
	|		ВЫБОР
	|			КОГДА ВТ_ПоОУ.Сечение.ДиаметрММ > 60
	|					И ВТ_ПоОУ.Сечение.ДиаметрММ <= 130
	|					И НЕ ВТ_ПоОУ.СортУ.Код = ""000000012""
	|				ТОГДА &СортБаланс
	|			ИНАЧЕ ВТ_ПоОУ.СортУ
	|		КОНЕЦ КАК СортУ,
	|		ВТ_ПоОУ.Штабель КАК Штабель
	|	ИЗ
	|		ВТ_ПоОУ КАК ВТ_ПоОУ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ПоОУ.Номенклатура,
	|		ВТ_ПоОУ.Порода,
	|		ВТ_ПоОУ.Сечение,
	|		ВТ_ПоОУ.Штабель,
	|		ВЫБОР
	|			КОГДА ВТ_ПоОУ.Сечение.ДиаметрММ > 60
	|					И ВТ_ПоОУ.Сечение.ДиаметрММ <= 130
	|					И НЕ ВТ_ПоОУ.СортУ.Код = ""000000012""
	|				ТОГДА &СортБаланс
	|			ИНАЧЕ ВТ_ПоОУ.СортУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_ПоОУ.ДлинаУ, ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|				ТОГДА ВТ_ПоОУ.Длина
	|			ИНАЧЕ ВТ_ПоОУ.ДлинаУ
	|		КОНЕЦ) КАК ОУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО ОУ.Порода = алк_ПараметрыХарактеристик.Порода
	|			И ОУ.Длина = алк_ПараметрыХарактеристик.Длина
	|			И ОУ.Сечение = алк_ПараметрыХарактеристик.Сечение
	|			И ОУ.СортУ = алк_ПараметрыХарактеристик.Сорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГОСТ.Номенклатура КАК Номенклатура,
	|	ГОСТ.Порода КАК Порода,
	|	ГОСТ.Длина КАК Длина,
	|	ГОСТ.Сечение КАК Сечение,
	|	ГОСТ.Количество КАК Количество,
	|	ОКР(ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) * ГОСТ.Количество, 3) КАК Объем,
	|	ГОСТ.СортУ КАК СортУ,
	|	ГОСТ.Штабель КАК Штабель
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ПоГосту.Номенклатура КАК Номенклатура,
	|		ВТ_ПоГосту.Порода КАК Порода,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_ПоГосту.ДлинаУ, ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|				ТОГДА ВТ_ПоГосту.Длина
	|			ИНАЧЕ ВТ_ПоГосту.ДлинаУ
	|		КОНЕЦ КАК Длина,
	|		ВТ_ПоГосту.Сечение КАК Сечение,
	|		СУММА(ВТ_ПоГосту.Количество) КАК Количество,
	|		СУММА(ВТ_ПоГосту.Объем) КАК Объем,
	|		ВЫБОР
	|			КОГДА ВТ_ПоГосту.Сечение.ДиаметрММ > 60
	|					И ВТ_ПоГосту.Сечение.ДиаметрММ <= 130
	|					И НЕ ВТ_ПоГосту.СортУ.Код = ""000000012""
	|				ТОГДА &СортБаланс
	|			ИНАЧЕ ВТ_ПоГосту.СортУ
	|		КОНЕЦ КАК СортУ,
	|		ВТ_ПоГосту.Штабель КАК Штабель
	|	ИЗ
	|		ВТ_ПоГосту КАК ВТ_ПоГосту
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ПоГосту.Номенклатура,
	|		ВТ_ПоГосту.Порода,
	|		ВТ_ПоГосту.Сечение,
	|		ВТ_ПоГосту.Штабель,
	|		ВЫБОР
	|			КОГДА ВТ_ПоГосту.Сечение.ДиаметрММ > 60
	|					И ВТ_ПоГосту.Сечение.ДиаметрММ <= 130
	|					И НЕ ВТ_ПоГосту.СортУ.Код = ""000000012""
	|				ТОГДА &СортБаланс
	|			ИНАЧЕ ВТ_ПоГосту.СортУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_ПоГосту.ДлинаУ, ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|				ТОГДА ВТ_ПоГосту.Длина
	|			ИНАЧЕ ВТ_ПоГосту.ДлинаУ
	|		КОНЕЦ) КАК ГОСТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО ГОСТ.Порода = алк_ПараметрыХарактеристик.Порода
	|			И ГОСТ.Длина = алк_ПараметрыХарактеристик.Длина
	|			И ГОСТ.Сечение = алк_ПараметрыХарактеристик.Сечение
	|			И ГОСТ.СортУ = алк_ПараметрыХарактеристик.Сорт";
	
	Запрос.УстановитьПараметр("Ссылка", СортировкаСсылка);   
	Запрос.УстановитьПараметр("Сорт13", Справочники.Сорта.НайтиПоКоду("000000007"));
	Запрос.УстановитьПараметр("Сорт12", Справочники.Сорта.НайтиПоКоду("000000003"));
	Запрос.УстановитьПараметр("Сорт3", Справочники.Сорта.НайтиПоКоду("000000008"));
	Запрос.УстановитьПараметр("ДатаСортировки", Дата); 
	Запрос.УстановитьПараметр("ШтабельПихта", Справочники.алк_Штабели.НайтиПоКоду("000000009"));
	Запрос.УстановитьПараметр("СортБаланс", Справочники.Сорта.НайтиПоКоду("000000011"));
	Запрос.УстановитьПараметр("ДлинаУПихта", Справочники.Длины.НайтиПоКоду("000000008")); // 4 длина по всей Пихте
	
	Результат = Запрос.ВыполнитьПакет();  
	
	Если ВернутьОбщиеДанные Тогда 
		Возврат Результат[11].Выгрузить();   
	ИначеЕсли ВернутьДанныеПоБУ Тогда
		Возврат Результат[13].Выгрузить();
	Иначе
		Возврат Результат[12].Выгрузить();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПиловочниеНаСервере2(ЗаполнитьПоБУ)
	ТЧ = ПолучитьДанныеПоСортировке(Объект.ДокументСортировки,Объект.Дата,Ложь,ЗаполнитьПоБУ); 
	Если ЗаполнитьПоБУ Тогда
		Объект.ПиловочникГОСТ.Очистить();
	Иначе
		Объект.ПиловочникОУ.Очистить();
	КонецЕсли;
	Если ТЧ.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
    //сворачиваем 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Номенклатура,
	               |	ТЧ.Порода,
	               |	ТЧ.СортУ,
	               |	ТЧ.Длина,
	               |	ТЧ.Количество,
	               |	ТЧ.Объем,
	               |	ТЧ.Штабель
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Номенклатура,
	               |	ВТ.Порода КАК Порода,
	               |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	               |	ВТ.СортУ КАК Сорт,
	               |	ВТ.Длина КАК Длина,
	               |	СУММА(ВТ.Количество) КАК КоличествоГруппы,
	               |	СУММА(ВТ.Объем) КАК ОбъемГруппы,
	               |	ВТ.Штабель КАК Штабель,
	               |	ИСТИНА КАК Основная,
	               |	0 КАК КлючСвязи
	               |ПОМЕСТИТЬ ВТ_ПоПорядку
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Номенклатура,
	               |	ВТ.Порода,
	               |	ВТ.СортУ,
	               |	ВТ.Длина,
	               |	ВТ.Штабель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПоПорядку.Номенклатура,
	               |	ВТ_ПоПорядку.Порода КАК Порода,
	               |	ВТ_ПоПорядку.Характеристика,
	               |	ВТ_ПоПорядку.Сорт КАК Сорт,
	               |	ВТ_ПоПорядку.Длина КАК Длина,
	               |	СУММА(ВТ_ПоПорядку.КоличествоГруппы) КАК КоличествоГруппы,
	               |	СУММА(ВТ_ПоПорядку.ОбъемГруппы) КАК ОбъемГруппы,
	               |	ВТ_ПоПорядку.Штабель КАК Штабель,
	               |	ВТ_ПоПорядку.Основная,
	               |	ВТ_ПоПорядку.КлючСвязи
	               |ИЗ
	               |	ВТ_ПоПорядку КАК ВТ_ПоПорядку
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПоПорядку.Номенклатура,
	               |	ВТ_ПоПорядку.Порода,
	               |	ВТ_ПоПорядку.Характеристика,
	               |	ВТ_ПоПорядку.Сорт,
	               |	ВТ_ПоПорядку.Длина,
	               |	ВТ_ПоПорядку.Штабель,
	               |	ВТ_ПоПорядку.Основная,
	               |	ВТ_ПоПорядку.КлючСвязи
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Штабель,
	               |	ВТ_ПоПорядку.Порода.Код,
	               |	ВТ_ПоПорядку.Сорт.Код,
	               |	ВТ_ПоПорядку.Длина.ДлинаММ";
	
	Запрос.УстановитьПараметр("ТЧ",ТЧ);
	ТЧПоГруппе = Запрос.Выполнить().Выгрузить(); 
	КлючСвязи = 0;
	Для Каждого стр ИЗ ТЧПоГруппе Цикл 
		КлючСвязи = КлючСвязи + 1;
		стр.КлючСвязи = КлючСвязи; 
	КонецЦикла; 
	//строим общую для вкладки Админ + по сечениям
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧПоГруппе.КлючСвязи,
	               |	ТЧПоГруппе.Сорт,
	               |	ТЧПоГруппе.Порода,
	               |	ТЧПоГруппе.Характеристика,
	               |	ТЧПоГруппе.Длина,
	               |	ТЧПоГруппе.КоличествоГруппы,
	               |	ТЧПоГруппе.ОбъемГруппы,
	               |	ТЧПоГруппе.Штабель,
	               |	ТЧПоГруппе.Основная,
	               |	ТЧПоГруппе.Номенклатура
	               |ПОМЕСТИТЬ ВТ_ПоГруппе
	               |ИЗ
	               |	&ТЧПоГруппе КАК ТЧПоГруппе
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.Порода,
	               |	ТЧ.Номенклатура,
	               |	ТЧ.СортУ,
	               |	ТЧ.Сечение,
	               |	ТЧ.Длина,
	               |	ТЧ.Количество,
	               |	ТЧ.Объем,
	               |	ТЧ.Штабель
	               |ПОМЕСТИТЬ ВТ_ПоСечениям
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПоСечениям.Номенклатура,
	               |	ВТ_ПоГруппе.КлючСвязи,
	               |	ВТ_ПоСечениям.СортУ КАК СортУ,
	               |	ВТ_ПоСечениям.Порода,
	               |	алк_ПараметрыХарактеристик.Характеристика,
	               |	ВТ_ПоСечениям.Длина,
	               |	ВТ_ПоСечениям.Штабель,
	               |	ВТ_ПоСечениям.Сечение КАК Сечение,
	               |	ВТ_ПоСечениям.Количество КАК Количество,
	               |	ВТ_ПоСечениям.Объем КАК Объем
	               |ПОМЕСТИТЬ ВТ_ИтогПоСечениям
	               |ИЗ
	               |	ВТ_ПоГруппе КАК ВТ_ПоГруппе
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоСечениям КАК ВТ_ПоСечениям
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |			ПО ВТ_ПоСечениям.Порода = алк_ПараметрыХарактеристик.Порода
	               |				И ВТ_ПоСечениям.СортУ = алк_ПараметрыХарактеристик.Сорт
	               |				И ВТ_ПоСечениям.Длина = алк_ПараметрыХарактеристик.Длина
	               |				И ВТ_ПоСечениям.Сечение = алк_ПараметрыХарактеристик.Сечение
	               |		ПО ВТ_ПоГруппе.Порода = ВТ_ПоСечениям.Порода
	               |			И ВТ_ПоГруппе.Сорт = ВТ_ПоСечениям.СортУ
	               |			И ВТ_ПоГруппе.Длина = ВТ_ПоСечениям.Длина
	               |			И ВТ_ПоГруппе.Штабель = ВТ_ПоСечениям.Штабель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПоГруппе.Номенклатура,
	               |	ВТ_ПоГруппе.КлючСвязи,
	               |	ВТ_ПоГруппе.Сорт,
	               |	ВТ_ПоГруппе.Порода,
	               |	ВТ_ПоГруппе.Характеристика,
	               |	ВТ_ПоГруппе.Длина,
	               |	ВТ_ПоГруппе.КоличествоГруппы,
	               |	ВТ_ПоГруппе.ОбъемГруппы,
	               |	ВТ_ПоГруппе.Штабель,
	               |	ВТ_ПоГруппе.Основная,
	               |	ЗНАЧЕНИЕ(Справочник.РазмерСечения.ПустаяСсылка) КАК Сечение,
	               |	0 КАК Количество,
	               |	0 КАК Объем,
	               |	1 КАК ПорядокРаздел
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	ВТ_ПоГруппе КАК ВТ_ПоГруппе
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ИтогПоСечениям.Номенклатура,
	               |	ВТ_ИтогПоСечениям.КлючСвязи,
	               |	ВТ_ИтогПоСечениям.СортУ,
	               |	ВТ_ИтогПоСечениям.Порода,
	               |	ВТ_ИтогПоСечениям.Характеристика,
	               |	ВТ_ИтогПоСечениям.Длина,
	               |	0,
	               |	0,
	               |	ВТ_ИтогПоСечениям.Штабель,
	               |	ЛОЖЬ,
	               |	ВТ_ИтогПоСечениям.Сечение,
	               |	ВТ_ИтогПоСечениям.Количество,
	               |	ВТ_ИтогПоСечениям.Объем,
	               |	2
	               |ИЗ
	               |	ВТ_ИтогПоСечениям КАК ВТ_ИтогПоСечениям
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.КлючСвязи КАК КлючСвязи,
	               |	Итог.Сорт КАК Сорт,
	               |	Итог.Порода,
	               |	Итог.Характеристика,
	               |	Итог.Длина КАК Длина,
	               |	Итог.КоличествоГруппы,
	               |	Итог.ОбъемГруппы,
	               |	Итог.Штабель,
	               |	Итог.Основная,
	               |	СУММА(Итог.Количество) КАК Количество,
	               |	СУММА(Итог.Объем) КАК Объем,
	               |	Итог.Номенклатура,
	               |	Итог.ПорядокРаздел КАК ПорядокРаздел,
	               |	Итог.Сечение
	               |ИЗ
	               |	Итог КАК Итог
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Итог.КлючСвязи,
	               |	Итог.Сорт,
	               |	Итог.Порода,
	               |	Итог.Характеристика,
	               |	Итог.Длина,
	               |	Итог.КоличествоГруппы,
	               |	Итог.ОбъемГруппы,
	               |	Итог.Штабель,
	               |	Итог.Основная,
	               |	Итог.Номенклатура,
	               |	Итог.ПорядокРаздел,
	               |	Итог.Сечение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КлючСвязи,
	               |	ПорядокРаздел,
	               |	Итог.Сечение.ДиаметрММ"; 
	
	Запрос.УстановитьПараметр("ТЧПоГруппе",ТЧПоГруппе);
	Запрос.УстановитьПараметр("ТЧ",ТЧ);
	
	ТЧОбщая = Запрос.Выполнить().Выгрузить();  
	
	Если ЗаполнитьПоБУ Тогда
		Объект.ПиловочникГОСТ.Загрузить(ТЧОбщая);
	Иначе
		Объект.ПиловочникОУ.Загрузить(ТЧОбщая);
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти 


#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтруктураОтбора = Новый ФиксированнаяСтруктура("Основная", Истина);
	
	Элементы.ПиловочникОУ1.ОтборСтрок = СтруктураОтбора;	
	Элементы.ПиловочникГОСТ1.ОтборСтрок = СтруктураОтбора;
	
	ОбъектФормы = Объект;
	
	//Если Не ТолькоПросмотр Тогда
	//	
	//	ТолькоПросмотр = РфпПолучениеДанныхСервер.ЗапретРедактированияБиржа(ОбъектФормы);	
	//	
	//КонецЕсли;                                                                           
	
	РазрядОкругления = ?(Объект.Дата >= РфпКлиент.ДатаПереходаНаТриЗнака(), 3, 2);

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("алк_Администратор") Тогда
		
		Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Ложь;
		
	КонецЕсли; 
	
	Если РольДоступна("алк_РедактированиеОбработанныхАктовПриемки") Или РольДоступна("ПолныеПрава") Тогда 		
		Элементы.ОбработанВЕРП.ТолькоПросмотр = Ложь;        		
	КонецЕсли; 

	
	КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиловочник;
	
	Номенклатура =  РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(КатегорияНоменклатуры);
	
	пвхПорода  = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
	пвхСорт    = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
	пвхДлина   = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
	пвхСечение = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// 2026.01.02 - при копировании перезаполнялся склад, добавил проверку на буфер
	Если Параметры.Ключ.Пустая() И Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда 
		
		БуферПриИзмененииНаСервере();
		
		//Объект.СтруктурнаяЕдиница = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ);	
		
		//Объект.СертификатFSC = Истина;
		
	КонецЕсли;
	
	// настройки пользователя по умолчанию
	//Если Параметры.Ключ.Пустая() Тогда  		
	//	
	//	СертификатПиловочникП = РфпПолучениеДанныхСервер.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "Сертификат производителя");
	//	
	//	Если ЗначениеЗаполнено(СертификатПиловочникП) Тогда		 
	//		Объект.СертификатПроизводителя = СертификатПиловочникП;
	//	КонецЕсли;
	//	
	//	СертификатПиловочник = РфпПолучениеДанныхСервер.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "Сертификат пиловочник");
	//	
	//	Если ЗначениеЗаполнено(СертификатПиловочник) Тогда		 
	//		Объект.Сертификат = СертификатПиловочник;
	//	КонецЕсли;
	//	
	//КонецЕсли;

	 
	// получить допустимые сертификаты
	
	// производитель     
	//СертифПроизводителя = Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000009");
	//Элементы.СертификатПроизводителя.СписокВыбора.Добавить(СертифПроизводителя, СертифПроизводителя.Наименование);
	Элементы.СертификатПроизводителя.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.ПустаяСсылка(), "Без сертификата");
	
	// торговый дом
	
	//СертифТД = Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000007");
	//СертифТД_конт = Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000013");
	//Элементы.Сертификат.СписокВыбора.Добавить(СертифТД, СертифТД.Наименование);
	//Элементы.Сертификат.СписокВыбора.Добавить(СертифТД_конт, СертифТД_конт.Наименование);
	
	Элементы.Сертификат.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.ПустаяСсылка(), "Без сертификата");

	
	
	// контроль изменений при подчиненных документах
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	алк_ОценкаСырьяПродукция.Ссылка
	//	|ИЗ
	//	|	Документ.алк_ОценкаСырья.Продукция КАК алк_ОценкаСырьяПродукция
	//	|ГДЕ
	//	|	алк_ОценкаСырьяПродукция.Партия = &Партия
	//	|	И алк_ОценкаСырьяПродукция.Ссылка.Проведен
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	алк_ОценкаСырьяПродукция.Ссылка";
	//
	//Запрос.УстановитьПараметр("Партия", ЭтотОбъект.Объект.Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Сообщить("Изменения документа запрещены! Требуется отменить проведение документа: " + ВыборкаДетальныеЗаписи.Ссылка);		
	//	ЭтаФорма.ТолькоПросмотр = Истина;
	//	
	//КонецЦикла; 
	
	УчастокПриИзмененииНаСервере();
	 		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	
		
КонецПроцедуры

#КонецОбласти 


#Область ОбработкаСобытийЭлементовФормы

&НаСервере
Процедура ПартияПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПартияПриИзменении(Элемент)
	
	ЗаполнитьПоОтгрузкеНаСервере();
	//ПартияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартияОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьДанныеОтгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	РазрядОкругления = ?(Объект.Дата >= РфпКлиент.ДатаПереходаНаТриЗнака(), 3, 2);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

 //////////////////////////////////////////// ПиловочникОУ ///////////////////////////////////////

&НаКлиенте
Процедура ПиловочникОУ1ПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборТаблицы(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		Если Копирование Тогда
		Отказ = Истина;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	//Если НоваяСтрока Тогда
	//	
	//	ДанныеТаблицы = Объект.ПиловочникОУ;
	//	
	//	КлючСвязиНаСервере(ДанныеТаблицы);	
	//	
	//	Элемент.ТекущиеДанные.КлючСвязи = КлючСвязи;
	//	КлючСвязи = 0;
	//	Элемент.ТекущиеДанные.Основная  = Истина;
	//	
	//КонецЕсли; 
	
	Если НоваяСтрока Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрП Из Объект.ПиловочникОУ Цикл
			Если Не стрП.Основная Тогда
				Продолжить;	
			КонецЕсли; 
			МассивКлючей.Добавить(стрП.КлючСвязи);
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.КлючСвязи = МаксЭлемент.Значение + 1;
			
		Иначе
			
			Элемент.ТекущиеДанные.КлючСвязи = 1;
			
		КонецЕсли; 
		
		Элемент.ТекущиеДанные.Основная  = Истина;
		
	Иначе
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ1ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Основная Тогда
			
			ДФК = Объект.ПиловочникОУ;
			
			ИзменитьПодчиненныеСтроки(ДФК, ТекДанные);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ПоказателиГруппыСервер(ДФК); //Вызов сервера 
	
	ДФК = Объект.ПиловочникОУ;
	УстановитьПоказателиГруппКлиент(ДФК);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ2ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.ПиловочникОУ1.ТекущиеДанные = Неопределено Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ2ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элементы.ПиловочникОУ1.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.ПиловочникОУ2.ТекущиеДанные.Номенклатура = Номенклатура;
		Элементы.ПиловочникОУ2.ТекущиеДанные.Порода       = Элементы.ПиловочникОУ1.ТекущиеДанные.Порода;
		Элементы.ПиловочникОУ2.ТекущиеДанные.Сорт         = Элементы.ПиловочникОУ1.ТекущиеДанные.Сорт;
		Элементы.ПиловочникОУ2.ТекущиеДанные.Длина        = Элементы.ПиловочникОУ1.ТекущиеДанные.Длина;
		Элементы.ПиловочникОУ2.ТекущиеДанные.Штабель      = Элементы.ПиловочникОУ1.ТекущиеДанные.Штабель;
		
		Элементы.ПиловочникОУ2.ТекущиеДанные.КлючСвязи    = Элементы.ПиловочникОУ1.ТекущиеДанные.КлючСвязи;
		
		УстановитьОтборТаблицы(Элемент);
		
	Иначе
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ2ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда
		
		ТекДанныеОсновная = Элементы.ПиловочникОУ1.ТекущиеДанные;
		
		Если ТекДанныеОсновная <> Неопределено Тогда
			
			//Элемент.ТекущиеДанные.КлючСвязи       = ТекДанныеОсновная.КлючСвязи;
			//Элемент.ТекущиеДанные.Сорт            = ТекДанныеОсновная.Сорт;
			//Элемент.ТекущиеДанные.Порода          = ТекДанныеОсновная.Порода;
			//Элемент.ТекущиеДанные.Длина           = ТекДанныеОсновная.Длина;
			
		Иначе
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		УстановитьОтборТаблицы(Элемент);
		
	Иначе
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ2ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ДФК = Объект.ПиловочникОУ;
	ПоказателиГруппыСервер(ДФК); //Вызов сервера 
	
	ДФК = Объект.ПиловочникОУ;
	УстановитьПоказателиГруппКлиент(ДФК);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ2КоличествоПриИзменении(Элемент)
	
	ПересчитатьОбъемСтроки(Элементы.ПиловочникОУ2.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ2СечениеПриИзменении(Элемент)
	
	ПересчитатьОбъемСтроки(Элементы.ПиловочникОУ2.ТекущиеДанные);
	
	//ТекДанные = Элементы.ПиловочникОУ2.ТекущиеДанные;
	//СтруктураДанных = Новый Структура("Порода, Сорт, Длина, Сечение"); 
	//
	//ТекДанные.Свойство("Порода", СтруктураДанных.Порода);
	//ТекДанные.Свойство("Сорт", СтруктураДанных.Сорт);
	//ТекДанные.Свойство("Длина", СтруктураДанных.Длина);
	//ТекДанные.Свойство("Сечение", СтруктураДанных.Сечение);
	//
	//Характеристика = ПолучитьХарактеристикуНаСервере(СтруктураДанных);
	//ТекДанные.Характеристика = Характеристика;
	//
	//Если Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка") Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не найдена характеристика: Порода - " + СтруктураДанных.Порода + " Сорт - " + СтруктураДанных.Сорт +
	//	" Длина - " + СтруктураДанных.Длина + " Сечение - " + СтруктураДанных.Сечение;
	//	Сообщение.Сообщить();
	//	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ2ПослеУдаления(Элемент)
	
	ДФК = Объект.ПиловочникОУ;
	ПоказателиГруппыСервер(ДФК); //Вызов сервера 
	
	ДФК = Объект.ПиловочникОУ;
	УстановитьПоказателиГруппКлиент(ДФК);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ1ПередУдалением(Элемент, Отказ)
	
	КлючКУдалению = Элемент.ТекущиеДанные.КлючСвязи;
	
	Индекс = Объект.ПиловочникОУ.Количество() - 1; 
	
	Пока Индекс >= 0 Цикл 
		
		Если Объект.ПиловочникОУ[Индекс].КлючСвязи = КлючКУдалению И Не Объект.ПиловочникОУ[Индекс].Основная Тогда 
			Объект.ПиловочникОУ.Удалить(Индекс); 
		КонецЕсли; 
		
		Индекс = Индекс - 1; 
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникОУ1ПослеУдаления(Элемент)
	
	Элементы.ПиловочникОУ.Обновить();
	
КонецПроцедуры

//////////////////////////////////////////// ПиловочникГОСТ /////////////////////////////////////////

&НаКлиенте
Процедура ПиловочникГОСТ1ПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборТаблицыГОСТ(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ1ПередУдалением(Элемент, Отказ)
	
	КлючКУдалению = Элемент.ТекущиеДанные.КлючСвязи;
	
	Индекс = Объект.ПиловочникГОСТ.Количество() - 1; 
	
	Пока Индекс >= 0 Цикл 
		
		Если Объект.ПиловочникГОСТ[Индекс].КлючСвязи = КлючКУдалению И Не Объект.ПиловочникГОСТ[Индекс].Основная Тогда 
			Объект.ПиловочникГОСТ.Удалить(Индекс); 
		КонецЕсли; 
		
		Индекс = Индекс - 1; 
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ДанныеТаблицы = Объект.ПиловочникГОСТ;
		
		КлючСвязиНаСервере(ДанныеТаблицы);	
		
		Элемент.ТекущиеДанные.КлючСвязи = КлючСвязи;
		КлючСвязи = 0;
		Элемент.ТекущиеДанные.Основная  = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ1ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Основная Тогда
			
			ИзменитьПодчиненныеСтроки(Объект.ПиловочникГОСТ, ТекДанные);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ДФК = Объект.ПиловочникГОСТ;
	ПоказателиГруппыСервер(ДФК); //Вызов сервера 
	
	ДФК = Объект.ПиловочникГОСТ;
	УстановитьПоказателиГруппКлиент(ДФК);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ1ПослеУдаления(Элемент)
	
	Элементы.ПиловочникГОСТ.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ2ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.ПиловочникГОСТ1.ТекущиеДанные = Неопределено Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ2ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элементы.ПиловочникГОСТ1.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.ПиловочникГОСТ2.ТекущиеДанные.Номенклатура = Номенклатура;
		Элементы.ПиловочникГОСТ2.ТекущиеДанные.Порода       = Элементы.ПиловочникГОСТ1.ТекущиеДанные.Порода;
		Элементы.ПиловочникГОСТ2.ТекущиеДанные.Сорт         = Элементы.ПиловочникГОСТ1.ТекущиеДанные.Сорт;
		Элементы.ПиловочникГОСТ2.ТекущиеДанные.Длина        = Элементы.ПиловочникГОСТ1.ТекущиеДанные.Длина;
		Элементы.ПиловочникГОСТ2.ТекущиеДанные.Штабель      = Элементы.ПиловочникГОСТ1.ТекущиеДанные.Штабель;
		
		Элементы.ПиловочникГОСТ2.ТекущиеДанные.КлючСвязи    = Элементы.ПиловочникГОСТ1.ТекущиеДанные.КлючСвязи;
		
		УстановитьОтборТаблицыГОСТ(Элемент);
		
	Иначе
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ2ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока Тогда
		
		ТекДанныеОсновная = Элементы.ПиловочникГОСТ1.ТекущиеДанные;
		
		Если ТекДанныеОсновная <> Неопределено Тогда
			
			//Элемент.ТекущиеДанные.КлючСвязи       = ТекДанныеОсновная.КлючСвязи;
			//Элемент.ТекущиеДанные.Сорт            = ТекДанныеОсновная.Сорт;
			//Элемент.ТекущиеДанные.Порода          = ТекДанныеОсновная.Порода;
			//Элемент.ТекущиеДанные.Длина           = ТекДанныеОсновная.Длина;
			
		Иначе
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		УстановитьОтборТаблицыГОСТ(Элемент);
		
	Иначе
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ2ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ДФК = Объект.ПиловочникГОСТ;
	ПоказателиГруппыСервер(ДФК); //Вызов сервера 
	
	ДФК = Объект.ПиловочникГОСТ;
	УстановитьПоказателиГруппКлиент(ДФК);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТ2ПослеУдаления(Элемент)
	
	ДФК = Объект.ПиловочникГОСТ;
	ПоказателиГруппыСервер(ДФК); //Вызов сервера 
	
	ДФК = Объект.ПиловочникГОСТ;
	УстановитьПоказателиГруппКлиент(ДФК);
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТСечение2ПриИзменении(Элемент)
	
	ПересчитатьОбъемСтроки(Элементы.ПиловочникГОСТ2.ТекущиеДанные);
	
	//ТекДанные = Элементы.ПиловочникГОСТ2.ТекущиеДанные;
	//СтруктураДанных = Новый Структура("Порода, Сорт, Длина, Сечение"); 
	//
	//ТекДанные.Свойство("Порода", СтруктураДанных.Порода);
	//ТекДанные.Свойство("Сорт", СтруктураДанных.Сорт);
	//ТекДанные.Свойство("Длина", СтруктураДанных.Длина);
	//ТекДанные.Свойство("Сечение", СтруктураДанных.Сечение);
	//
	//Характеристика = ПолучитьХарактеристикуНаСервере(СтруктураДанных);
	//ТекДанные.Характеристика = Характеристика;
	//
	//Если Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка") Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не найдена характеристика: Порода - " + СтруктураДанных.Порода + " Сорт - " + СтруктураДанных.Сорт +
	//	" Длина - " + СтруктураДанных.Длина + " Сечение - " + СтруктураДанных.Сечение;
	//	Сообщение.Сообщить();
	//	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникГОСТКоличество2ПриИзменении(Элемент)
	
	ПересчитатьОбъемСтроки(Элементы.ПиловочникГОСТ2.ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура БуферПриИзмененииНаСервере()
	
	Если Объект.Буфер Тогда		
		Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000124");		
	Иначе	
		Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000001");	
	КонецЕсли;
	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура БуферПриИзменении(Элемент)
	БуферПриИзмененииНаСервере();
КонецПроцедуры





#КонецОбласти 


#Область СлужебныеПроцедуры

&НаСервере
Процедура ОчиститьДанныеОтгрузки()
	
	Объект.НомерНакладной = "";
	Объект.Пиловочник.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеСортировки()
	Объект.ПиловочникСортировка.Очистить();	
КонецПроцедуры

&НаСервере
Процедура КлючСвязиНаСервере(ДанныеФормыОсновная)
	
	КлючСвязи = РфпСервер.СгенерироватьКлючСвязиНаСервере(ДанныеФормыОсновная.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбъемСтроки(ТекДанные)
	
	ТекДанные.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурникуПоСвойствам(ТекДанные.Длина, ТекДанные.Сечение) * ТекДанные.Количество;
	
	// Нач мод [Пакушев И.С.] [15.01.2019] 
	// Обращение № [0000000000] [ТекстЗаявки]
	// Было 
	// ТекДанные.Объем = ?(Объект.ОбъемДоСотых, Окр(ТекДанные.Объем, 2, РежимОкругления.Окр15как20), ТекДанные.Объем);
    // Стало  
	ТекДанные.Объем = Окр(ТекДанные.Объем, РазрядОкругления, РежимОкругления.Окр15как20);
	// Кон мод [Пакушев И.С.] [15.01.2019]
	
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТаблицы(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("КлючСвязи, Основная", Элемент.ТекущиеДанные.КлючСвязи, Ложь);
		
		Элементы.ПиловочникОУ2.ОтборСтрок = СтруктураОтбора;
		
	Иначе
		
		Элементы.ПиловочникОУ2.ОтборСтрок = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьОтборТаблицы

&НаКлиенте
Процедура УстановитьОтборТаблицыГОСТ(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("КлючСвязи, Основная", Элемент.ТекущиеДанные.КлючСвязи, Ложь);
		
		Элементы.ПиловочникГОСТ2.ОтборСтрок = СтруктураОтбора;
		
	Иначе
		
		Элементы.ПиловочникГОСТ2.ОтборСтрок = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьОтборТаблицы

&НаКлиенте
Процедура ИзменитьПодчиненныеСтроки(ДанныеКоллекция, ТекДанные)
	
	Если Истина Тогда
		
		ПараметрыОтбора = Новый Структура("Основная, КлючСвязи", Ложь, ТекДанные.КлючСвязи);
		
		НайденныеСтроки = ДанныеКоллекция.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого стр Из НайденныеСтроки Цикл
			
			стр.Сорт    = ТекДанные.Сорт;
			стр.Порода  = ТекДанные.Порода;
			стр.Длина   = ТекДанные.Длина;
			стр.Штабель = ТекДанные.Штабель;
			
			стр.Объем  = стр.Количество * РфпПолучениеДанныхСервер.ОбъемПоКубатурникуПоСвойствам(стр.Длина, стр.Сечение);
			//стр.Объем = ?(Объект.ОбъемДоСотых, Окр(стр.Объем, 2, РежимОкругления.Окр15как20), стр.Объем);
			
			ТекДанные = стр;
			СтруктураДанных = Новый Структура("Порода, Сорт, Длина, Сечение"); 
			
			//ТекДанные.Свойство("Порода", СтруктураДанных.Порода);
			//ТекДанные.Свойство("Сорт", СтруктураДанных.Сорт);
			//ТекДанные.Свойство("Длина", СтруктураДанных.Длина);
			//ТекДанные.Свойство("Сечение", СтруктураДанных.Сечение);
			//
			//Характеристика = ПолучитьХарактеристикуНаСервере(СтруктураДанных);
			//ТекДанные.Характеристика = Характеристика;
			//
			//Если Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка") Тогда
			//	
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Текст = "Не найдена характеристика: Порода - " + СтруктураДанных.Порода + " Сорт - " + СтруктураДанных.Сорт +
			//	" Длина - " + СтруктураДанных.Длина + " Сечение - " + СтруктураДанных.Сечение;
			//	Сообщение.Сообщить();
			//	
			//КонецЕсли; 
			
		КонецЦикла;		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоказателиГруппКлиент(ДФК)
	
	Для каждого Показатель Из ПоказателиДляГрупп Цикл 
		
		ОтборСтрок = Новый Структура("Основная, КлючСвязи", Истина, Показатель.КлючСвязи); 
		НайденныеСтроки = ДФК.НайтиСтроки(ОтборСтрок);
		
		Для каждого стр Из НайденныеСтроки Цикл
			стр.ОбъемГруппы      = Показатель.ОбъемГруппы;
			стр.КоличествоГруппы = Показатель.КоличествоГруппы;
		КонецЦикла; 
		
	КонецЦикла; 
	
	СуммовыеПоказатели = ПолучитьИтоговыеЗначения(ДФК);  //ВызовСервера
	
	КоличествоКУчету = СуммовыеПоказатели.КоличествоКУчету;
	ОбъемКУчету      = СуммовыеПоказатели.ОбъемКУчету; 
	
КонецПроцедуры

&НаСервере
Процедура ПоказателиГруппыСервер(ДФК)
	
	Таблица = ДФК.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.КлючСвязи,
	|	ТабличнаяЧасть.Основная,
	|	ТабличнаяЧасть.Объем,
	|	ТабличнаяЧасть.Количество
	|ПОМЕСТИТЬ втТЧ
	|ИЗ
	|	&Таблица КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТЧ.КлючСвязи
	|ПОМЕСТИТЬ Ключи
	|ИЗ
	|	втТЧ КАК втТЧ
	|ГДЕ
	|	втТЧ.Основная = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	втТЧ.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТЧ.КлючСвязи КАК КлючСвязи,
	|	втТЧ.Основная КАК Основная,
	|	СУММА(втТЧ.Объем) КАК Объем,
	|	СУММА(втТЧ.Количество) КАК Количество
	|ПОМЕСТИТЬ Показатели
	|ИЗ
	|	втТЧ КАК втТЧ
	|ГДЕ
	|	втТЧ.Основная = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	втТЧ.КлючСвязи,
	|	втТЧ.Основная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ключи.КлючСвязи,
	|	ЕСТЬNULL(Показатели.Объем, 0) КАК ОбъемГруппы,
	|	ЕСТЬNULL(Показатели.Количество, 0) КАК КоличествоГруппы
	|ИЗ
	|	Ключи КАК Ключи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Показатели КАК Показатели
	|		ПО Ключи.КлючСвязи = Показатели.КлючСвязи";
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	
	РезультатЗапроса = Запрос.Выполнить();	//  РезультатЗапроса.Выгрузить()
	
	ЗначениеВРеквизитФормы(РезультатЗапроса.Выгрузить(), "ПоказателиДляГрупп");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИтоговыеЗначения(ДФК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Объем,
	|	ТЧ.Количество,
	|	ТЧ.Основная
	|ПОМЕСТИТЬ втТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТЧ.Объем КАК Объем,
	|	втТЧ.Количество КАК Количество
	|ИЗ
	|	втТЧ КАК втТЧ
	|ГДЕ
	|	втТЧ.Основная = ЛОЖЬ
	|ИТОГИ
	|	СУММА(Объем),
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ТЧ", ДФК.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаОбщийИтог.Следующий();		// Общий итог
		
		КоличествоКУчету = ВыборкаОбщийИтог.Количество;
		ОбъемКУчету      = ВыборкаОбщийИтог.объем;	
	Иначе
		КоличествоКУчету = 0;
		ОбъемКУчету      = 0;	
	КонецЕсли; 
	
	Возврат Новый Структура("КоличествоКУчету, ОбъемКУчету", КоличествоКУчету, ОбъемКУчету); 
	
КонецФункции

&НаСервере
Процедура ОтложитьДляТолстомера(ПараметрыСтроки)
	
	НоваяСтрока = Толстомеры.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыСтроки);
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаДопШтабалей(ОперативныйУчет, НомерКлюча, Штабель)

	Если ОперативныйУчет Тогда
		ТаблицаДокумента = Объект.ПиловочникОУ;				
	Иначе
		ТаблицаДокумента = Объект.ПиловочникГОСТ;
	КонецЕсли; 	
	
	СтруктураДляПоиска = Новый Структура("Штабель", Штабель); 
	
	МассивСтрокТолстомер = ТаблицаДокумента.НайтиСтроки(СтруктураДляПоиска); 	
	
	тзТолстомеры = ТаблицаДокумента.Выгрузить(МассивСтрокТолстомер);
	
	Для каждого Строка Из МассивСтрокТолстомер Цикл 
		ТаблицаДокумента.Удалить(Строка); 
	КонецЦикла; 
	
	тзТолстомеры.Свернуть("Номенклатура, Порода, Сорт, Длина, Сечение", "Количество, Объем");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзТолстомеры.Номенклатура КАК Номенклатура,
	|	тзТолстомеры.Порода КАК Порода,
	|	тзТолстомеры.Сорт КАК Сорт,
	|	тзТолстомеры.Длина КАК Длина,
	|	тзТолстомеры.Сечение,
	|	тзТолстомеры.Количество КАК Количество,
	|	тзТолстомеры.Объем
	|ПОМЕСТИТЬ втТолстомеры
	|ИЗ
	|	&тзТолстомеры КАК тзТолстомеры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТолстомеры.Номенклатура КАК Номенклатура,
	|	втТолстомеры.Порода КАК Порода,
	|	втТолстомеры.Сорт КАК Сорт,
	|	втТолстомеры.Длина КАК Длина,
	|	втТолстомеры.Сечение,
	|	втТолстомеры.Количество КАК Количество,
	|	втТолстомеры.Объем КАК Объем
	|ИЗ
	|	втТолстомеры КАК втТолстомеры
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем)
	|ПО
	|	Номенклатура,
	|	Порода,
	|	Сорт,
	|	Длина";
	
	Запрос.УстановитьПараметр("тзТолстомеры", тзТолстомеры);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		// Вставить обработку выборки ВыборкаНоменклатура
		
		ВыборкаПорода = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПорода.Следующий() Цикл
			// Вставить обработку выборки ВыборкаПорода
			
			ВыборкаСорт = ВыборкаПорода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСорт.Следующий() Цикл
				// Вставить обработку выборки ВыборкаСорт
				
				ВыборкаДлина = ВыборкаСорт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаДлина.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДлина
					
					Порода = ВыборкаДлина.Порода;
					Сорт   = ВыборкаДлина.Сорт;
					Длина  = ВыборкаДлина.Длина;
					
					НоваяСтрока = ТаблицаДокумента.Добавить();				
										
					НомерКлюча = НомерКлюча + 1;
					НоваяСтрока.Основная = Истина;
					НоваяСтрока.КлючСвязи = НомерКлюча;
					НоваяСтрока.Номенклатура = Номенклатура;
					НоваяСтрока.Порода    = Порода;
					НоваяСтрока.Сорт      = Сорт;
					НоваяСтрока.Длина     = Длина;
					
					НоваяСтрока.Штабель = Штабель;
					
					ВыборкаДетальныеЗаписи = ВыборкаДлина.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						НоваяСостав = ТаблицаДокумента.Добавить();
						
						НоваяСостав.Основная 		= Ложь;
						НоваяСостав.КлючСвязи 		= НомерКлюча;
						НоваяСостав.Номенклатура 	= Номенклатура;
						
						НоваяСостав.Порода    	= Порода;
						НоваяСостав.Сорт      	= Сорт;
						НоваяСостав.Длина     	= Длина;
						
						НоваяСостав.Штабель   	= НоваяСтрока.Штабель; 						
						НоваяСостав.Сечение   	= ВыборкаДетальныеЗаписи.Сечение;						
						НоваяСостав.Количество 	= ВыборкаДетальныеЗаписи.Количество;						
						НоваяСостав.Объем 		= ВыборкаДетальныеЗаписи.Объем;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
	
КонецПроцедуры
      
&НаСервере
Процедура ЗаполнитьПиловочникНаСервере(ОперативныйУчет)
	
	Сорт_12	= Справочники.Сорта.НайтиПоКоду("000000003", Истина, , );
	Сорт_3 	= Справочники.Сорта.НайтиПоКоду("000000008", Истина, , );
	Сорт_13 = Справочники.Сорта.НайтиПоКоду("000000007", Истина, , );

	БалансСорт = Справочники.Сорта.НайтиПоКоду("000000011", Истина, , );
	ДроваСорт  = Справочники.Сорта.НайтиПоКоду("000000012", Истина, , );
	
	ТолстомерШтабель 		= Справочники.алк_Штабели.НайтиПоКоду("000000004"); // "Толстомер"
	ТонкомерШтабель 		= Справочники.алк_Штабели.НайтиПоКоду("000000010"); // "Тонкомер" 
	НесоотвПоДлинеШтабель 	= Справочники.алк_Штабели.НайтиПоКоду("000000002"); // "Несоответствие по длине"	
	ПихтаШтабель 			= Справочники.алк_Штабели.НайтиПоКоду("000000009"); // "Пихта"
	ПихтаПорода 			= Справочники.Породы.НайтиПоКоду("000000003"); // "Пихта"

	Листвиница = Справочники.Породы.НайтиПоКоду("000000004");
	Длина_400 = Справочники.Длины.НайтиПоКоду("000000008");
	Длина_430 = Справочники.Длины.НайтиПоКоду("000000010");
	Длина_520 = Справочники.Длины.НайтиПоКоду("000000032");

	
	Если ОперативныйУчет Тогда
		Объект.ПиловочникОУ.Очистить();				
	Иначе
		Объект.ПиловочникГОСТ.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Номенклатура,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Порода КАК Порода,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Сорт КАК Сорт,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Длина КАК Длина,
	|	СУММА(алк_ПриемкаЛесопродукцииПиловочникСортировка.Количество) КАК Количество,
	|	СУММА(алк_ПриемкаЛесопродукцииПиловочникСортировка.Объем) КАК Объем,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.ДиаметрВершиныФакт КАК ДиаметрВершиныФакт,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Ссылка.Дата,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.ВычетНаКору,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Сечение,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Штабель КАК Штабель
	|ИЗ
	|	Документ.алк_ПриемкаЛесопродукции.ПиловочникСортировка КАК алк_ПриемкаЛесопродукцииПиловочникСортировка
	|ГДЕ
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Номенклатура,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Порода,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Длина,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Сорт,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.ДиаметрВершиныФакт,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Ссылка.Дата,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.ВычетНаКору,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Сечение,
	|	алк_ПриемкаЛесопродукцииПиловочникСортировка.Штабель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДиаметрВершиныФакт
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Объем)
	|ПО
	|	Порода,
	|	Сорт,
	|	Штабель,
	|	Длина";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	НомерКлюча = 0;
	
	ВыборкаПорода = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПорода.Следующий() Цикл
		
		ВыборкаСорт = ВыборкаПорода.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСорт.Следующий() Цикл
			
			ВыборкаШтабель = ВыборкаСорт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаШтабель.Следующий() Цикл 				
				
				ВыборкаДлина = ВыборкаШтабель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаДлина.Следующий() Цикл
					
					Порода 	= ВыборкаДлина.Порода;
					Сорт  	= ВыборкаДлина.Сорт;
					Длина  	= ВыборкаДлина.Длина; 
					Штабель	= ВыборкаДлина.Штабель;
					
					Если ОперативныйУчет Тогда
						НоваяСтрока 	 = Объект.ПиловочникОУ.Добавить();
						НоваяСтрока.Сорт = Сорт;
					Иначе
						НоваяСтрока	= Объект.ПиловочникГОСТ.Добавить();
						
						Если Сорт = Сорт_12 Или Сорт = Сорт_3 Тогда
							НоваяСтрока.Сорт	= Сорт_13;				
						Иначе
							НоваяСтрока.Сорт	= Сорт;					
						КонецЕсли; 
						
					КонецЕсли; 
					
					НомерКлюча = НомерКлюча + 1;
					НоваяСтрока.Основная 		= Истина;
					НоваяСтрока.КлючСвязи 		= НомерКлюча;
					НоваяСтрока.Номенклатура 	= Номенклатура;
					НоваяСтрока.Порода    		= Порода;
					НоваяСтрока.Длина     		= Длина;
					НоваяСтрока.Штабель		    = Штабель;
											
					ВДЗ = ВыборкаДлина.Выбрать();
					
					Пока ВДЗ.Следующий() Цикл
						
						Если ОперативныйУчет Тогда
							НоваяСостав = Объект.ПиловочникОУ.Добавить();
							НоваяСостав.Сорт      = Сорт;
						Иначе
							НоваяСостав = Объект.ПиловочникГОСТ.Добавить();
							Если Сорт = Сорт_12 Или Сорт = Сорт_3 Тогда
								НоваяСостав.Сорт	= Сорт_13;				
							Иначе
								НоваяСостав.Сорт	= Сорт;					
							КонецЕсли; 
						КонецЕсли;
						
						НоваяСостав.Основная = Ложь;
						НоваяСостав.КлючСвязи = НомерКлюча;
						НоваяСостав.Номенклатура = Номенклатура;
						
						НоваяСостав.Порода    = Порода;
						НоваяСостав.Длина     = Длина;
						
						НоваяСостав.Штабель = НоваяСтрока.Штабель;
						
						Если ВДЗ.ВычетНаКору = 0 И ВДЗ.Дата > '20190827' Тогда	// на сортировке бревно было уже без коры.					
							БезВычетаНаКору = Истина;
						Иначе
							БезВычетаНаКору = Ложь;				
						КонецЕсли; 
						
						// Внимание!
						// диаметр считается без вычета на кору, вычет на кору принимается с линии. 
						
						// Лиственница 4,0; 5,2; Ель 5,2 м – диаметры от 42 до 58 принимаются в основной штабель.
						
						Если Сорт = БалансСорт ИЛИ Сорт = ДроваСорт Или НоваяСостав.Штабель = НесоотвПоДлинеШтабель Тогда						
							НоваяСостав.Сечение = РфпПолучениеДанныхСервер.ПривестиСечениеКГост(ВДЗ.ДиаметрВершиныФакт - ВДЗ.ВычетНаКору, ВДЗ.Дата, Истина);
						Иначе
							// Приведем к ГОСТу и проверим не толстомер ли это  						
							НоваяСостав.Сечение = РфпПолучениеДанныхСервер.ПривестиСечениеКГост(ВДЗ.ДиаметрВершиныФакт - ВДЗ.ВычетНаКору, ВДЗ.Дата, Истина);
							
							Если НоваяСостав.Сечение.ДиаметрММ >= 410  Тогда
								
								Если Порода = Листвиница Тогда
									
									Если Длина = Длина_400 Или Длина = Длина_430 Или Длина = Длина_520  Тогда
										Если НоваяСостав.Сечение.ДиаметрММ > 580  Тогда   
											НоваяСостав.Штабель = ТолстомерШтабель;
										КонецЕсли; 
									Иначе
										НоваяСостав.Штабель = ТолстомерШтабель;
									КонецЕсли; 
									
								Иначе
									
									Если Длина = Длина_520  Тогда
										Если НоваяСостав.Сечение.ДиаметрММ > 580  Тогда   
											НоваяСостав.Штабель = ТолстомерШтабель;
										КонецЕсли;  
									Иначе
										НоваяСостав.Штабель = ТолстомерШтабель;
									КонецЕсли; 							
								
								КонецЕсли; 
								
							ИначеЕсли НоваяСостав.Сечение.ДиаметрММ >= 140 И НоваяСостав.Сечение.ДиаметрММ <= 160 Тогда 
								НоваяСостав.Штабель = ТонкомерШтабель;
							ИначеЕсли Порода = ПихтаПорода Тогда 
								НоваяСостав.Штабель = ПихтаШтабель;
							ИначеЕсли ОперативныйУчет Тогда
								// диаметр считается без вычета на кору, вычет на кору принимается с линии.
								
								// Нач мод [Пакушев И.С.] [29.04.2020] 
								// Обращение № [0000125074] [ТекстЗаявки: В программе АЛогистик- оперативный учёт -  прошу сделать приёмку лесопродукции в основной штабель, согласно ГОСТу с градацией 2 см.]
								// Было  НоваяСостав.Сечение  = РфпПолучениеДанныхСервер.ПривестиСечениеКОУ(ВДЗ.ДиаметрВершиныФакт - ВДЗ.ВычетНаКору, ВДЗ.Дата, Истина);
								// Стало
								// Кон мод [Пакушев И.С.] [29.04.2020]
								
							КонецЕсли; 
							
						КонецЕсли; 
						
						НоваяСостав.Количество = ВДЗ.Количество;
						
						НоваяСостав.Объем = НоваяСостав.Количество * РфпПолучениеДанныхСервер.ОбъемПоКубатурникуПоСвойствам(Длина, НоваяСостав.Сечение);
						НоваяСостав.Объем = ?(Объект.ОбъемДоСотых, Окр(НоваяСостав.Объем, 2, РежимОкругления.Окр15как20), НоваяСостав.Объем);
						
					КонецЦикла;
				КонецЦикла;	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	//Обработка толстомера	
	ОбработкаДопШтабалей(ОперативныйУчет, НомерКлюча, ТолстомерШтабель); 
	
	//Обработка тонкомера	
	ОбработкаДопШтабалей(ОперативныйУчет, НомерКлюча, ТонкомерШтабель); 

	
	//Обработка пихты 	
	ОбработкаДопШтабалей(ОперативныйУчет, НомерКлюча, ПихтаШтабель);
	
	//// 

	Если ОперативныйУчет Тогда		
		тзПиловочник = Объект.ПиловочникОУ.Выгрузить();
		тзПиловочник.Свернуть("Номенклатура, Характеристика, Порода, Сорт, Длина, Сечение, Штабель, КлючСвязи, Основная", " Количество, Объем, ОбъемГруппы, КоличествоГруппы");	
		Объект.ПиловочникОУ.Загрузить(тзПиловочник);
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("Основная", Истина);		
		Элементы.ПиловочникОУ1.ОтборСтрок = СтруктураОтбора; 
	Иначе
		тзПиловочник = Объект.ПиловочникГОСТ.Выгрузить();
		тзПиловочник.Свернуть("Номенклатура, Характеристика, Порода, Сорт, Длина, Сечение, Штабель, КлючСвязи, Основная", " Количество, Объем, ОбъемГруппы, КоличествоГруппы");	
		Объект.ПиловочникГОСТ.Загрузить(тзПиловочник);
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("Основная", Истина);		
		Элементы.ПиловочникГОСТ1.ОтборСтрок = СтруктураОтбора;
		
		Элементы.ПиловочникГОСТ1.Обновить();
		Элементы.ПиловочникГОСТ2.Обновить(); 
	КонецЕсли;    	
		
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 















