Процедура СформироватьЗаписьРегистраСведений(НомерЭтикетки)Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.РФП_ПечатьЭтикеток.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Пользователь  = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Компьютер     = ПолучитьСеансПользователя();
	МенеджерЗаписи.НомерЭтикетки = НомерЭтикетки;
	МенеджерЗаписи.Период		 = ТекущаяДата();	
	
	МенеджерЗаписи.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьСеансПользователя()
	
	ТекНомерСеанса = НомерСеансаИнформационнойБазы();
    Массив = ПолучитьСеансыИнформационнойБазы();
    Для каждого Сеанс Из Массив Цикл
        Если Сеанс.НомерСеанса = ТекНомерСеанса Тогда
            Возврат Сеанс.ИмяКомпьютера;
            Прервать;
        КонецЕсли;
	КонецЦикла;
	
КонецФункции
Функция ПолучитьЧислоКопийЭтикетки(НомерЭтикетки)Экспорт 
	
	НаборЗаписей = РегистрыСведений.РФП_ПечатьЭтикеток.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.НомерЭтикетки.Установить(НомерЭтикетки); 
	НаборЗаписей.Прочитать();
	Если  НаборЗаписей.Количество()<=1 Тогда 
		Возврат Неопределено;
	Иначе 
		Структура = Новый Структура("ЧислоКопий,ДатаКопии");
		Структура.ЧислоКопий = НаборЗаписей.Количество();
		Для Каждого Запись из НаборЗаписей цикл
			ДатаКопии = Запись.Период;
		КонецЦикла;
		
		Структура.ДатаКопии = ДатаКопии;
		Возврат Структура;
	КонецЕсли;
	
КонецФункции
