
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
	КонецЕсли;
		
	ДополнительныеСвойства.Вставить("ИспользоватьАддендумы", ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы"));
	
	Если Не ДополнительныеСвойства.ИспользоватьАддендумы тогда
		//Если Не ЗначениеЗаполнено(ВидОперации) тогда
		//	ВидОперации = Перечисления.алк_ВидыДокументаРН.РеализацияЭкспортТД;
		//КонецЕсли;
		
		 
	Иначе 
		//Если Не СтруктурнаяЕдиница.алк_ТипСклада = Перечисления.алк_ТипСклада.Биржа Тогда   // Для биржи пока не применяем
		//Если Не Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
			Документы.алк_РасходнаяНакладная.УстановитьИдентификаторыТоваровАддендумов(ЭтотОбъект, Отказ);
		//КонецЕсли;		
		//КонецЕсли;
		
	КонецЕсли;  
	
	
	//Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		//ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена);  
				
		//Дата = //РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
				
	//КонецЕсли;  
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда   
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|  алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		РезультатЗапроса = Запрос.Выполнить();  
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
		
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	И алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
			
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		ДополнительныеСвойства.Вставить("КонтролироватьОстаткиНаДатуДокумента",Ложь);

	КонецЕсли;
	
	ОбъемДокумента = Запасы.Итог("Количество");
	КоличествоДокумента = Запасы.Итог("КоличествоПакетов");
	
	//Проверка совпадения даты смены и смены у транспортировки и расходной накладной 
	
	//если отменяют проведение тогда пусть осуществляется проверка при обработке удаления проведения
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Возврат;
	КонецЕсли; 
	//\\
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	ТранспортировкаНаОсновании = Документы.алк_РасходнаяНакладная.ДочернийТранспортировка(Ссылка);
	
	Если ЗначениеЗаполнено(ТранспортировкаНаОсновании) Тогда  
		
		Если ДатаСмены <> ТранспортировкаНаОсновании.ДатаСмены ИЛИ Смена <> ТранспортировкаНаОсновании.Смена  Тогда  
			
			Если ТранспортировкаНаОсновании.ДатаСмены <> ДатаСмены И ТранспортировкаНаОсновании.Смена <> Смена Тогда 
				Сообщить(СтрШаблон("В расходной накладной и документе %1 не совпадают даты смен и смены!",Строка(ТранспортировкаНаОсновании)));
			Иначе 			
				Если ДатаСмены <> ТранспортировкаНаОсновании.ДатаСмены Тогда  
					Сообщить(СтрШаблон("В расходной накладной и документе %1 не совпадают даты смен!",Строка(ТранспортировкаНаОсновании))); 
				КонецЕсли;
				
				Если Смена <> ТранспортировкаНаОсновании.Смена  Тогда
					Сообщить(СтрШаблон("В расходной накладной и документе %1 не совпадают смены!",Строка(ТранспортировкаНаОсновании))); 
				КонецЕсли;
			КонецЕсли;
			
			Отказ = Истина;  
			
		КонецЕсли;
		
	КонецЕсли;	
	//\\
	
КонецПроцедуры 

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
	КонецЕсли;
		
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.алк_РасходнаяНакладная.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	Если ДополнительныеСвойства.ИспользоватьАддендумы тогда
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ);
		
		// Отражение по "Последовательностям"
		РфпСервер.ОтразитьДокументыПоследовательностиПродукция(ДополнительныеСвойства, Движения, Отказ);
		
		// СерийныеНомера	
		РфпСервер.ОтразитьПакетыИсторияЗаказов(ДополнительныеСвойства, Движения, Отказ);
	
		//Сергеева Г.О. Оборотный регистр ++  
		РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. Оборотный регистр --
	КонецЕсли;
	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	//РФП Закомментили 31.10.2023	
	//РфпСервер.ОтразитьПередачиСобственныеСерии(ДополнительныеСвойства, Движения, Отказ);	
	//\\
	
	Если ДополнительныеСвойства.ИспользоватьАддендумы И Не Сток тогда
		//РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);  
		РфпСервер.ОтразитьАддендумы(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьПакетыПоАддендумам(ДополнительныеСвойства, Движения, Отказ);
		//РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		//// Контроль
		//Документы.алк_РасходнаяНакладная.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
		//Если Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда
		//	Отказ = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии");
		//	Если Отказ И ЭтотОбъект.Дата > Дата("20220404") тогда
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли; 
		//// Контроль (временно)
		//ОтказПоКонтролю = Контроль(РежимПроведения, ДополнительныеСвойства);
		//
		//Если ОтказПоКонтролю И Не ПропускатьМинус Тогда
		//	
		//	Отказ = Истина;
		//	
		//КонецЕсли; 
	КонецЕсли;   
	
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);

	
	// Пакушев И.С. Для списания пиловочника по старым регистрам  (временно) 
	// регистр "Запасы организации" 
	Если СтруктурнаяЕдиница.алк_ТипСклада = Перечисления.алк_ТипСклада.Биржа Тогда
		РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры
	
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ТранспортировкаДочка = Документы.алк_РасходнаяНакладная.ДочернийТранспортировка(Ссылка);
	
	Если ЗначениеЗаполнено(ТранспортировкаДочка) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо отменить проведение зависимого документа: " + ТранспортировкаДочка;
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
		
	Иначе 
		
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("Направление") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.Направление) = Тип("Массив") И ДанныеЗаполнения.Направление.Количество() = 1 Тогда
			
			ЭтотОбъект.Направление = ДанныеЗаполнения.Направление[0];
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область КонтрольОтрицательныхОстатков

Функция Контроль(РежимПроведения, ДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ЗапасыНаСкладахСерииОстатки.Организация,
	|	алк_ЗапасыНаСкладахСерииОстатки.СтруктурнаяЕдиница,
	|	алк_ЗапасыНаСкладахСерииОстатки.Ячейка,
	|	алк_ЗапасыНаСкладахСерииОстатки.Номенклатура,
	|	алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер,
	|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(&МоментИтогов, СерийныйНомер В (&СерийныеНомера)) КАК алк_ЗапасыНаСкладахСерииОстатки
	|ГДЕ
	|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток < 0";
	
	Запрос.УстановитьПараметр("СерийныеНомера", ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии.ВыгрузитьКолонку("СерийныйНомер"));
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		МоментИтогов = '00010101';
	Иначе
		МоментИтогов = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
	
	РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
	
	Если НЕ РезультатПоОстаткам.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает запасов: " 
			+ ВыборкаДетальныеЗаписи.СерийныйНомер 
			+ " Организация: " + ВыборкаДетальныеЗаписи.Организация
			+ " Склад: " + ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
			Сообщение.Сообщить(); 	
			
		КонецЦикла;
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	
КонецФункции // Контроль()

	

#КонецОбласти 





