#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводОстатковОтходы, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка.Организация,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Номенклатура,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Характеристика,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Объем,
		|	&ВидДвиженияНакопления КАК ВидДвижения,
		|	&Период,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка.ДатаСмены,
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка.Смена
		|ИЗ
		|	Документ.алк_ВводНачальныхОстатковОтходы.Запасы КАК алк_ВводНачальныхОстатковОтходыЗапасы
		|ГДЕ
		|	алк_ВводНачальныхОстатковОтходыЗапасы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопления", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаВводОстатковОтходы.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводОстатковОтходы);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
#КонецЕсли
