
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ДатаСмены,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Смена,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель КАК Ячейка,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Партия,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.ПартияТД,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Контрагент
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.ДатаСмены,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Смена,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Объем,
		|	&ВидДвиженияРасход,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Партия,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.ПартияТД,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Контрагент
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыРасход КАК алк_ПересортицаНоменклатурыЗапасыРасход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Поступление) КАК операция,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель,
		|	ВЫБОР
		|		КОГДА алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидырегистровИнвентаризации.ЗапасыОрганизации)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Ответхранение
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|	И алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидыРегистровИнвентаризации.ЗапасыОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель КАК Ячейка,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель,
		|	ВЫБОР
		|		КОГДА алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииНаОтветхранении)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Ответхранение
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Количество,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Объем,
		|	&ВидДвиженияРасход,
		|	&Период,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель,
		|	ВЫБОР
		|		КОГДА алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.ВидРегистра = ЗНАЧЕНИЕ(Перечисление.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииНаОтветхранении)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыРасход КАК алк_ПересортицаНоменклатурыЗапасыРасход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПересортицаНоменклатуры.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПересортицаНоменклатуры);			
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетОтветхранения", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", МассивРезультатов[2].Выгрузить());
		
		СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства);
		
		СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства);
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаДокументыПослБиржа(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		
		Пользователь = Пользователи.ТекущийПользователь();
		
		ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
		ОсновнойОтветственный = ?(ЗначениеЗаполнено(ЗначениеНастройки), ЗначениеНастройки, Справочники.Сотрудники.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("Сотрудник", ОсновнойОтветственный);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПересортицаНоменклатуры.Ссылка.Организация КАК Организация,
		|	&Период,
		|	алк_ПересортицаНоменклатуры.Ссылка.ДатаСмены КАК ДатаСмены,
		|	алк_ПересортицаНоменклатуры.Ссылка.Смена КАК Смена,
		|	0 КАК МоментПроведения,
		|	&Сотрудник
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры КАК алк_ПересортицаНоменклатуры
		|ГДЕ
		|	алк_ПересортицаНоменклатуры.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПересортицаНоменклатуры.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПересортицаНоменклатуры);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		тРезультат = МассивРезультатов[0].Выгрузить();
		
		Для каждого стр Из тРезультат Цикл
			
			стр.МоментПроведения = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
		КонецЦикла; 
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДокументыПослБиржа", тРезультат);
		
		
	КонецПроцедуры // СформироватьТаблицаДокументыПослБиржа
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
	Процедура СформироватьТаблицаОстаткиЗапасов(ДокументСсылкаПересортицаНоменклатуры, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Объем КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Дата КАК Период,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Штабель КАК Штабель
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыПриход КАК алк_ПересортицаНоменклатурыЗапасыПриход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка = &Ссылка
		|	И алк_ПересортицаНоменклатурыЗапасыПриход.Номенклатура.Код = ""ПБ-00000002""
		|	И &ДатаНачалаУчетаЗаполнена
		|	И алк_ПересортицаНоменклатурыЗапасыПриход.Ссылка.Дата > &ДатаНачалаУчетаШпона
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Организация,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Характеристика,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Объем,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Дата,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Сертификат,
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Штабель
		|ИЗ
		|	Документ.алк_ПересортицаНоменклатуры.ЗапасыРасход КАК алк_ПересортицаНоменклатурыЗапасыРасход
		|ГДЕ
		|	алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка = &Ссылка
		|	И алк_ПересортицаНоменклатурыЗапасыРасход.Номенклатура.Код = ""ПБ-00000002""
		|	И &ДатаНачалаУчетаЗаполнена
		|	И алк_ПересортицаНоменклатурыЗапасыРасход.Ссылка.Дата > &ДатаНачалаУчетаШпона";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПересортицаНоменклатуры);
		Запрос.УстановитьПараметр("ДатаНачалаУчетаЗаполнена", ЗначениеЗаполнено(Константы.алк_ДатаНачалаУчетаШпона.Получить()));
		Запрос.УстановитьПараметр("ДатаНачалаУчетаШпона", Константы.алк_ДатаНачалаУчетаШпона.Получить());
		
		МассивРезультатов = Запрос.Выполнить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов.Выгрузить());
		
	КонецПроцедуры // СформироватьТаблицаОстаткиЗапасов

	#КонецОбласти 
	
#КонецЕсли
