
&НаСервере 
Процедура ПередЗаписью(Отказ)
		
	ДанныеГруппы = НайтиКорень(ЭтотОбъект, 0);
	
	Если ДанныеГруппы["Родитель"]= Справочники.алк_Простой.СтруктураПоГруппам Тогда  	
		Возврат;	
	КонецЕсли; 
	
	
	Если ЭтоГруппа Тогда 
		
		УровеньГруппы = ДанныеГруппы["УровеньГруппы"];
		
		Если УровеньГруппы = 3 Тогда 			
			Цех = Родитель.Цех; 	
		КонецЕсли;
		
		Если УровеньГруппы = 4 Тогда			
			Участок = Родитель.Участок;
			Цех 	= Родитель.Родитель.Цех;		
		КонецЕсли; 
		
		Если УровеньГруппы > 4 Тогда  			    
			МашинныйЦентр 	= Родитель.МашинныйЦентр;
			Участок 		= Родитель.Участок;
			Цех 			= Родитель.Цех;			 		
		КонецЕсли;   		
		
		
	КонецЕсли;    	
	
КонецПроцедуры


&НаСервере
Функция НайтиКорень(Элем, УровеньГруппы)
	
	УровеньГруппы = УровеньГруппы + 1; 
	
	ДанныеГруппы = Новый Соответствие;
		
	Если НЕ ЗначениеЗаполнено(Элем.Родитель) Тогда 	
		
		ДанныеГруппы.Вставить("Родитель", Элем);
		ДанныеГруппы.Вставить("УровеньГруппы", УровеньГруппы);
		
        Возврат ДанныеГруппы;
		
	Иначе
		
		Возврат НайтиКорень(Элем.Родитель, УровеньГруппы);
		
	КонецЕсли; 
	
КонецФункции

