
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ТекТЧ) Тогда 
		Возврат;
	КонецЕсли;  
		
	ПроверяемыеРеквизиты.Очистить();
	
	Если ТекТЧ = "Продукция" ИЛИ ТекТЧ = "Материалы" ИЛИ ТекТЧ = "Отходы" ИЛИ ТекТЧ = "ДополнительныеМатериалы"  Тогда  
		
		ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".Номенклатура");
		ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".Период");
		
		Если ТекТЧ = "Продукция" ИЛИ ТекТЧ = "Материалы" Тогда  
			ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".КоличествоШтук");
		КонецЕсли;
		
		Если Не ТекТЧ = "Отходы" Тогда  
			ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".Количество");
		КонецЕсли;
		
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
