
#Область СобытияЭлементов

&НаКлиенте
Процедура НомерСерииПриИзменении(Элемент)
	
	СерийныйНомер = РфпПолучениеДанныхСервер.ПолучитьСерийныйНомер(Номенклатура, НомерСерии, ?(ПрошлыйПериод, ПериодСерии, ТекущаяДата()));
	
	НомерСерииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НомерСерииПриИзмененииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	СерийныйНомер = РфпПолучениеДанныхСервер.ПолучитьСерийныйНомер(Номенклатура, НомерСерии, ?(ПрошлыйПериод, ПериодСерии, ТекущаяДата()));
	
КонецПроцедуры


&НаКлиенте
Процедура ТекущийПериодПриИзменении(Элемент)
	
	Элементы.ПериодСерии.Видимость = ПрошлыйПериод;	
	
КонецПроцедуры
	
#КонецОбласти 


#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КомандыПечати);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановтьВидимостьЭлементов();	
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиКоманд

&НаСервере
Функция СформироватьЭтикеткиНаСервере()
	
	МассивСерийныхНомеров = Новый Массив;
	МассивСерийныхНомеров.Добавить(СерийныйНомер);
	
	Этикетки = Обработки.алк_ПечатьЭтикеток.СформироватьПечатнуюФормуЭтикетки(МассивСерийныхНомеров);		
	
	Возврат Этикетки;
	
КонецФункции

&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
	
	Этикетки = СформироватьЭтикеткиНаСервере();
	
	//Этикетки = Новый ТабличныйДокумент;
	Если Номенклатура_ПиломатериалСП() Тогда 
		Этикетки.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 	
	Иначе 
		Этикетки.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	КонецЕсли;
	Этикетки.КоличествоЭкземпляров = 2;
	Этикетки.Напечатать();
	
КонецПроцедуры
 
	
#КонецОбласти

Функция Номенклатура_ПиломатериалСП() 
	Возврат Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012");
КонецФункции


#Область СлужебныеПроцедуры


	
#КонецОбласти 
 

#Область ИнтерфейсныеПроцедуры

Процедура УстановтьВидимостьЭлементов()
	
	Элементы.ПериодСерии.Видимость = ПрошлыйПериод;
	
КонецПроцедуры //УстановтьВидимостьЭлементов()

#КонецОбласти 


#Область Печать

 
	
#КонецОбласти 