

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Лесопиление);
	КонецЕсли;
	
	Если ОтборНаправлениеОтходы Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Отходы);
	КонецЕсли;
	
	Если ОтборНаправлениеГранулы Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы);
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Направление", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры //УстановитьОтборПоНаправлению()
