
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) И НЕ Параметры.Свойство("ПрограммноеСозданиеНаОсновании") Тогда  
		Сообщить("Ошибка! Документ можно создать только на основании загрузки в камеру ГТО.");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		УстановитьСмену(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 
	УстановитьСмену();
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УстановитьСмену();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВыгрузкиПриИзменении(Элемент)
	ЗаполнитьНормативРагрузкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыВыгрузки(Элемент.Имя); 
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыВыгрузки(Элемент.Имя);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры 

&НаСервере
Процедура УстановитьСмену() 
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, Объект.Дата);
		Если ПараметрыСменыПоТекущейДате = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;    	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьНормативРагрузкиНаСервере()
	
	Документы.алк_ВыгрузкаИзКамерыГТО.ЗаполнитьНормативРагрузки(Объект.Состав,Объект.ДатаНачалаВыгрузки,Объект.ДатаОкончанияВыгрузкиНорматив);
	
	//Если Объект.Состав.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаНачалаВыгрузки) Тогда   
	//	Объект.ДатаОкончанияВыгрузкиНорматив = "";   
	//	Возврат;
	//КонецЕсли;
	//
	//ГрадацияДокумента = Объект.Состав[0].Градация;
	//
	//Если НЕ ЗначениеЗаполнено(ГрадацияДокумента) Тогда  
	//	Объект.ДатаОкончанияВыгрузкиНорматив = "";
	//	Возврат;
	//КонецЕсли;
	//   	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
	//	|ПОМЕСТИТЬ ВТ_Сезон
	//	|ИЗ
	//	|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	алк_НормативыПропаркиСрезПоследних.Градация,
	//	|	алк_НормативыПропаркиСрезПоследних.Сезон,
	//	|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
	//	|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
	//	|ИЗ
	//	|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
	//	|			&ДатаСреза,
	//	|			Градация В (&ГрадацииДокумента)
	//	|				И Сезон В
	//	|					(ВЫБРАТЬ
	//	|						ВТ_Сезон.Сезон
	//	|					ИЗ
	//	|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
	//
	//Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацияДокумента);
	//Запрос.УстановитьПараметр("ДатаСреза", Объект.ДатаНачалаВыгрузки);
	//	
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл  
	//	Объект.ДатаОкончанияВыгрузкиНорматив = Объект.ДатаНачалаВыгрузки + Выборка.НормативЗагрузки * 3600;  
	//КонецЦикла;
	//	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьВыгрузкуПоЗагрузкеНаСервере()
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередПерезаполнениемПоДокументуОснованию", ЭтотОбъект), НСтр("ru = 'Документ будет перезаполнен! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);	
КонецПроцедуры 

&НаКлиенте
Процедура ПередПерезаполнениемПоДокументуОснованию(Результат,ДопПараметры) Экспорт 
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;   
	Объект.Состав.Очистить();
	ПерезаполнитьДокументПоОснованию(Объект.ДокументОснование);
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДокументПоОснованию(ДокументОснование) 
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Заполнить(ДокументОснование);
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеДатыВыгрузки(ИмяЭлемента)   
	
	ПараметрыВремени = Новый Структура; 
	ПараметрыВремени.Вставить("ДатаВремя", ТекущаяДата()); 
	ПараметрыВремени.Вставить("ИмяЭлемента", ИмяЭлемента);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводВремениЗавершено", ЭтотОбъект, ПараметрыВремени);

	ОткрытьФорму("Документ.алк_РапортПропарка.Форма.ФормаВводаВремени",ПараметрыВремени,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВводВремениЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	ЭтаФорма.Объект[ДополнительныеПараметры.ИмяЭлемента] = РезультатЗакрытия; 
	
	ЗаполнитьНормативРагрузкиНаСервере();
		
КонецПроцедуры

#КонецОбласти

#Область Команды  

&НаКлиенте
Процедура ПерезаполнитьВыгрузкуПоЗагрузке(Команда)
	ПерезаполнитьВыгрузкуПоЗагрузкеНаСервере();
КонецПроцедуры 

#КонецОбласти
