
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПоляВвода") И ТипЗнч(Параметры.ПоляВвода) = Тип("Массив") Тогда
		Для Каждого ТекущийРеквизит Из Параметры.ПоляВвода Цикл			
			ДобавитьПолеВводаНаФорму(ТекущийРеквизит);			
		КонецЦикла;
	КонецЕсли;
	
	Параметры.Свойство("ЗаголовокФормы", Заголовок);
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеВводаНаФорму(ТекущееПолеВвода)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ТекущееПолеВвода.Имя, ТекущееПолеВвода.Тип,, ТекущееПолеВвода.Заголовок));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Элемент = Элементы.Добавить(ТекущееПолеВвода.Имя, Тип("ПолеФормы"), Элементы.ГруппаПоляВвода);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = ТекущееПолеВвода.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	
	Для Каждого ТекущийЭлемент Из Элементы.Группаполяввода.ПодчиненныеЭлементы Цикл
		
		ПараметрыЗакрытия.Вставить(ТекущийЭлемент.Имя, ЭтаФорма[ТекущийЭлемент.Имя]);
		
	КонецЦикла;
		
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти
