
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ПМ") Тогда //СГП ПМ (сборка/разборка)
		Элементы.ТаблицаПодбораПрипуск.Видимость = Истина;
		Элементы.ТаблицаПодбораКатегорияПЭО.Видимость = Истина;
		Элементы.ТаблицаПодбораГабарит.Видимость = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресХранилицаТЗПодбора") Тогда
		ТЗИзХранилища = ПолучитьИзВременногоХранилища(Параметры.АдресХранилицаТЗПодбора);
		ТаблицаПодбора.Загрузить(ТЗИзХранилища);
		УдалитьИзВременногоХранилища(Параметры.АдресХранилицаТЗПодбора);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ОповеститьОВыборе(ТаблицаПодбора);	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Стр Из ТаблицаПодбора Цикл
		Стр.КоличествоДоступно = Стр.Количество;
		Стр.КоличествоСоставДоступно = Стр.КоличествоСостав;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораКоличествоРезультатПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаПодбора.ТекущиеДанные;
	Если ТекДанные.Количество > ТекДанные.КоличествоДоступно Тогда 
		ТекДанные.Количество = ТекДанные.КоличествоДоступно;
		ТекДанные.КоличествоСостав = ТекДанные.КоличествоСоставДоступно;
		Сообщить("Объем подобранного не может быть больше доступного");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораКоличествоСоставПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаПодбора.ТекущиеДанные;
	ТекДанные.Количество = РасчитатьОбъем(ТекДанные.Характеристика, ТекДанные.КоличествоСостав);
	ТаблицаПодбораКоличествоРезультатПриИзменении(Ложь);
	ОбновитьИтоги();
КонецПроцедуры

Функция РасчитатьОбъем(ХарактеристикаПоиска, КоличествоШтук)
	Возврат КоличествоШтук * РегистрыСведений.алк_ПараметрыХарактеристик.ПолучитьОбъемПоХарактеристике(ХарактеристикаПоиска); 
КонецФункции

&НаКлиенте
Процедура ОбновитьИтоги()
	ИтогоКоличество = 0;
	ИтогоКоличествоСостав = 0;
	Для Каждого Стр Из ТаблицаПодбора Цикл
		Если Стр.Выбрать Тогда
			ИтогоКоличество =  ИтогоКоличество + Стр.Количество;
			ИтогоКоличествоСостав = ИтогоКоличествоСостав + Стр.КоличествоСостав;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораВыбратьПриИзменении(Элемент)
	ОбновитьИтоги();
КонецПроцедуры


