
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		// регистр алк_ДанныеАктаОТК 
		Движения.алк_ДанныеАктаОТК.Записывать = Истина;
		Если НЕ ЭтотОбъект.ПометкаУдаления Тогда	
			Для Каждого ТекСтрокаПакеты Из Пакеты Цикл
				Движение = Движения.алк_ДанныеАктаОТК.Добавить();
				Движение.Период = Дата;
				Движение.Шаблон = ШаблонОТК;
				Движение.Строка = ТекСтрокаПакеты.Деффект;
				Движение.СерийныйНомер = ТекСтрокаПакеты.СерийныйНомер; 
				Движение.Значение = 1;
			КонецЦикла;		
		Иначе	
			Движения.алк_ДанныеАктаОТК.Прочитать();
			Движения.алк_ДанныеАктаОТК.УстановитьАктивность(НЕ ЭтотОбъект.ПометкаУдаления);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
