
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРезервированиеЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_РезервизрованиеЗапасовЗапасы.СерийныйНомер,
	|	алк_РезервизрованиеЗапасовЗапасы.Ссылка.ЗаказПокупателя,
	|	алк_РезервизрованиеЗапасовЗапасы.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.алк_РезервизрованиеЗапасов.Запасы КАК алк_РезервизрованиеЗапасовЗапасы
	|ГДЕ
	|	алк_РезервизрованиеЗапасовЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРезервированиеЗапасов);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПакетыИсторияЗаказов", РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры
