
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодПоУмолчанию = Неопределено;
	Параметры.Свойство("ПериодПоУмолчанию", ПериодПоУмолчанию);
	
	Если ПериодПоУмолчанию <> Неопределено Тогда 
		ДатаНачала 	  = ПериодПоУмолчанию.ДатаНачала;
		ДатаОкончания = ПериодПоУмолчанию.ДатаОкончания; 
	Иначе
		ДатаНачала 	  = НачалоДня(ТекущаяДатаСеанса());
		ДатаОкончания = ТекущаяДатаСеанса(); 
	КонецЕсли;
	
	ДатаСмены 	  = НачалоДня(ДатаНачала);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ОшибкаВводаПериодаСобытия() Тогда
		ДатаОкончания = ДатаНачала;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)

	Если ОшибкаВводаПериодаСобытия() Тогда
		ДатаНачала = ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Период = Новый Структура;
	Период.Вставить("Период", Новый Структура("ДатаНачала, ДатаОкончания, Смена, ДатаСмены", ДатаНачала, ДатаОкончания, Смена,  ДатаСмены));
	//Оповестить("ИзмененПериодДокумента", Период, ЭтотОбъект);
	
	Закрыть(Период);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Период = Новый Структура;
	Период.Вставить("Период", Новый Структура("ДатаНачала, ДатаОкончания", ДатаНачала, ДатаОкончания));
	
	Закрыть(Период);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОшибкаВводаПериодаСобытия()
	Если (ДатаНачала > ДатаОкончания И ЗначениеЗаполнено(ДатаОкончания)) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;		
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоСменеПриИзменении(Элемент)
	Элементы.ПоСмене.Видимость = ЗаполнитьПоСмене;
	Элементы.Период.Доступность =  НЕ ЗаполнитьПоСмене;
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)	
	ПересчитатьПериодПоСмене();	
КонецПроцедуры 

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	ПересчитатьПериодПоСмене();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПериодПоСмене()
	
	ДатаОкончания = алк_ОбщегоНазначенияКлиентСервер.ПолучитьВремяКонцаСмены(Смена, ДатаСмены);   
	ДатаНачала = ДатаСмены + (ПолучитьДатуНачалаСмены(Смена) - Дата(1,1,1)); 
	
	//Если Смена = ПредопределенноеЗначение("Справочник.алк_Смены.День_2") Тогда
	//	ДатаНачала = ДатаСмены + 8*3600 + 1;
	//	ДатаОкончания = ДатаСмены + 20*3600 - 1;
	//ИначеЕсли Смена = ПредопределенноеЗначение("Справочник.алк_Смены.Ночь_2") Тогда
	//	ДатаНачала = ДатаСмены + 20*3600 +1;
	//	ДатаОкончания = КонецДня(ДатаСмены) + 8*3600;
	//Иначе
	//	ДатаНачала = ДатаСмены;
	//	ДатаОкончания = КонецДня(ДатаСмены);
	//КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезконтекста
Функция ПолучитьДатуНачалаСмены(Смена) 
	
	Возврат Смена.НачалоСмены;

КонецФункции // ПолучитьДатуНачалаСмены()


#КонецОбласти

