
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПоступлениеДС, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПоступлениеДенежныхСредств.Сумма,
		|	алк_ПоступлениеДенежныхСредств.Дата КАК Период
		|ИЗ
		|	Документ.алк_ПоступлениеДенежныхСредств КАК алк_ПоступлениеДенежныхСредств
		|ГДЕ
		|	алк_ПоступлениеДенежныхСредств.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПоступлениеДС);

		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаФинансыФакт", МассивРезультатов[0].Выгрузить());

	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
