
&НаСервере
Функция ПечатьТННаСервере()
	
	СтруктураДанныхПечати = Новый Структура();
	
	Для каждого  Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		
		Если Найти(Реквизит.Имя, "Пункт") > 0.00 Тогда
			
			СтруктураДанныхПечати.Вставить(Реквизит.Имя, ЭтаФорма[Реквизит.Имя]);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТТНПриложение4";
	МакетТТНПриложение4 = Обработки.алк_ПечатьТТН.ПолучитьМакет("ТТНПриложение4");
	ЛицеваяСторона = МакетТТНПриложение4.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона|ВертикальнаяОбласть");
	ЛицеваяСторона.Параметры.Заполнить(СтруктураДанныхПечати);
	ТабДокумент.Вывести(ЛицеваяСторона);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОборотнаяСторона = МакетТТНПриложение4.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона|ВертикальнаяОбласть");
	ОборотнаяСторона.Параметры.Заполнить(СтруктураДанныхПечати);
	ТабДокумент.Вывести(ОборотнаяСторона);
	ТабДокумент.ПолеСверху=0;
	ТабДокумент.ПолеСнизу=0;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура ПечатьТН(Команда)
	
	
	ФормаТН = ПечатьТННаСервере();
	ФормаТН.Показать();

КонецПроцедуры
