
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		//	
		//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		//	
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РапортКратко") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РапортКратко", "Сменный рапорт работы линии ЦЛП (кратко)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РапортКратко"));
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РапортРаспиловка") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РапортРаспиловка", "Выход по распиловке (расчетный)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РапортРаспиловка"));
			
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РапортУпаковка") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РапортУпаковка", "Упаковано продукции", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РапортУпаковка"));
			
		КонецЕсли;
		
		
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Идентификатор = "РапортКратко";
		//КомандаПечати.Представление = НСтр("ru = 'Сменный рапорт работы линии ЦЛП (кратко)'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		//КомандаПечати.Порядок = 1;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "РапортРаспиловка";
		КомандаПечати.Представление = НСтр("ru = 'Выход по распиловке (расчетный)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "РапортУпаковка";
		КомандаПечати.Представление = НСтр("ru = 'Сменный рапорт по участку упаковки'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 5;
		
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
		//КомандаПечати.Идентификатор = "ТН";
		//КомандаПечати.Представление = НСтр("ru = 'Приложение №4 (Товарная накладная)'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		//КомандаПечати.Порядок = 23;
		
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "РапортКратко" Тогда
				
				СформироватьРапортКратко(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			Если ИмяМакета = "РапортРаспиловка" Тогда
				
				СформироватьРапортРаспиловка(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
			Если ИмяМакета = "РапортУпаковка" Тогда
				
				СформироватьРапортУпаковка(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()	
	
	// Процедура формирования Железнодорожной спецификации для пиломатериалов
	//
	Процедура СформироватьРапортКратко(ТабличныйДокумент, ТекущийДокумент)
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		Макет = ПолучитьМакет("РапортОбщий");
		ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
		
		// Сортировка
		
		ОбластьРаздел.Параметры.Раздел = "Участок сортировки лесопродукции";
		
		ТабличныйДокумент.Вывести(ОбластьРаздел);
		
		СКД_Сортировка = ПолучитьМакет("СКД_Сортировка");
		ТД_Сортировка = СформироватьПоСКД(СКД_Сортировка, ТекущийДокумент);
		ТД_Сортировка.ОтображатьГруппировки = Истина;
		
		ТабличныйДокумент.Вывести(ТД_Сортировка);
		
		//ДобавитьОтчет(ТабличныйДокумент, ТД_Сортировка);
		
		
		//// Приемка
		
		//ОбластьРаздел.Параметры.Раздел = "Приемка сырья (УСЛМ)";
		//
		//ТабличныйДокумент.Вывести(ОбластьРаздел);
		//
		//СКД_Приемка = ПолучитьМакет("СКД_Приемка");
		//ТД_Приемка = СформироватьПоСКД(СКД_Приемка, ТекущийДокумент);	
		//ТД_Приемка.ОтображатьГруппировки = Истина;
		
		//ДобавитьОтчет(ТабличныйДокумент, ТД_Приемка);
		//		
		
		//ТабличныйДокумент.ОтображатьГруппировки = Истина;
		
	КонецПроцедуры  // СформироватьРапортКратко()	
	
	Процедура _СформироватьРапортРаспиловка(ТабличныйДокумент, ТекущийДокумент)
		
		СКД_Распиловка = ПолучитьМакет("СКД_РаспиловкаТеория");
		ТД_Распиловка  = СформироватьПоСКД(СКД_Распиловка, ТекущийДокумент);
		ТД_Распиловка.ОтображатьГруппировки = Истина;
		
		ТабличныйДокумент.Вывести(ТД_Распиловка);
		
	КонецПроцедуры
	
	Процедура СформироватьРапортРаспиловка(ТабличныйДокумент, ТекущийДокумент)
		
		СКД_Распиловка = ПолучитьМакет("СКД_РаспиловкаТеория");
		ТД_Распиловка  = СформироватьПоСКД(СКД_Распиловка, ТекущийДокумент);
		ТД_Распиловка.ОтображатьГруппировки = Истина;
		
		ТабличныйДокумент.Вывести(ТД_Распиловка);
		
	КонецПроцедуры
	
	Процедура СформироватьРапортУпаковка(ТабличныйДокумент, ТекущийДокумент)
		
		СКД_Упаковка = ПолучитьМакет("СКД_Упаковка");
		ТД_Упаковка = СформироватьПоСКД(СКД_Упаковка, ТекущийДокумент);
		ТД_Упаковка.ОтображатьГруппировки = Истина;
		
		ТабличныйДокумент.Автомасштаб = Истина;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ТабличныйДокумент.Вывести(ТД_Упаковка);
		
		Макет = Документы.алк_СменныйРапортЦЛП.ПолучитьМакет("ПодписиУпаковка");
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.МастерЦЛП = ТекущийДокумент.МастерЦЛП;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область ИнициализацияДаных
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СменныйРапортЦЛППередачаНаСГП.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ ВТ_СерийныеНомера
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ПередачаНаСГП КАК алк_СменныйРапортЦЛППередачаНаСГП
		|ГДЕ
		|	алк_СменныйРапортЦЛППередачаНаСГП.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(алк_СменныйРапортЦЛПДанныеУпаковка.Объем) КАК Объем,
		|	&Период,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Упаковано) КАК Операция,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка.Организация КАК Организация,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Номенклатура КАК Номенклатура,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка.Направление
		|ПОМЕСТИТЬ ВТ_УпакованоЦЛПУМП
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ДанныеУпаковка КАК алк_СменныйРапортЦЛПДанныеУпаковка
		|ГДЕ
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка = &Ссылка
		|	И алк_СменныйРапортЦЛПДанныеУпаковка.Объем <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Номенклатура,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка.Направление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Объем),
		|	&Период,
		|	NULL,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Номенклатура,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ДанныеУпаковкаУМП КАК алк_СменныйРапортЦЛПДанныеУпаковкаУМП
		|ГДЕ
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка = &Ссылка
		|	И алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Объем <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Номенклатура,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка.Направление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Номенклатура,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Характеристика,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Количество,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Объем,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.ВидТранспортировки КАК Аналитика_1,
		|	&Период,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.ПринятоСырьяУСЛ) КАК Показатель,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Штабель КАК Аналитика_2,
		|	"""" КАК Аналитика_3,
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ПринятоСырьяУСЛ КАК алк_СменныйРапортЦЛППринятоСырьяУСЛ
		|ГДЕ
		|	алк_СменныйРапортЦЛППринятоСырьяУСЛ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Номенклатура,
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Характеристика,
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Количество,
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Объем,
		|	NULL,
		|	&Период,
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.ПереданоСырьяВПроизводство),
		|	NULL,
		|	"""",
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ПереданоСырьяВПроизводство КАК алк_СменныйРапортЦЛППереданоСырьяВПроизводство
		|ГДЕ
		|	алк_СменныйРапортЦЛППереданоСырьяВПроизводство.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Номенклатура,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Характеристика,
		|	1,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Объем,
		|	NULL,
		|	&Период,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.УпакованоПродукции),
		|	NULL,
		|	"""",
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ДанныеУпаковка КАК алк_СменныйРапортЦЛПДанныеУпаковка
		|ГДЕ
		|	алк_СменныйРапортЦЛПДанныеУпаковка.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Номенклатура,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Характеристика,
		|	1,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Объем,
		|	NULL,
		|	&Период,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.УпакованоПродукцииУМП),
		|	NULL,
		|	"""",
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ДанныеУпаковкаУМП КАК алк_СменныйРапортЦЛПДанныеУпаковкаУМП
		|ГДЕ
		|	алк_СменныйРапортЦЛПДанныеУпаковкаУМП.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПТ_Распилено.Номенклатура,
		|	алк_СменныйРапортЦЛПТ_Распилено.Характеристика,
		|	алк_СменныйРапортЦЛПТ_Распилено.Количество,
		|	алк_СменныйРапортЦЛПТ_Распилено.Объем,
		|	алк_СменныйРапортЦЛПТ_Распилено.КлючСвязи,
		|	&Период,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.ТРаспилено),
		|	алк_СменныйРапортЦЛПТ_Распилено.СертификатFSC,
		|	ВЫБОР
		|		КОГДА алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Инвентаризация
		|			ТОГДА ""Инвентаризация""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Т_Распилено КАК алк_СменныйРапортЦЛПТ_Распилено
		|ГДЕ
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПТ_Выход.Номенклатура,
		|	алк_СменныйРапортЦЛПТ_Выход.Характеристика,
		|	алк_СменныйРапортЦЛПТ_Выход.Количество,
		|	алк_СменныйРапортЦЛПТ_Выход.Объем,
		|	алк_СменныйРапортЦЛПТ_Выход.КлючСвязи,
		|	&Период,
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.ТВыход),
		|	алк_СменныйРапортЦЛПТ_Выход.СертификатFSC,
		|	ВЫБОР
		|		КОГДА алк_СменныйРапортЦЛПТ_Выход.Ссылка.Инвентаризация
		|			ТОГДА ""Инвентаризация""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Т_Выход КАК алк_СменныйРапортЦЛПТ_Выход
		|ГДЕ
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПТ_Выход.Номенклатура,
		|	алк_СменныйРапортЦЛПТ_Выход.Характеристика,
		|	алк_СменныйРапортЦЛПТ_Выход.Количество,
		|	алк_СменныйРапортЦЛПТ_Выход.ОбъемСПрипуском,
		|	алк_СменныйРапортЦЛПТ_Выход.КлючСвязи,
		|	&Период,
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.ТВыход),
		|	алк_СменныйРапортЦЛПТ_Выход.СертификатFSC,
		|	""ВыходСУчетомПрипуска"",
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Т_Выход КАК алк_СменныйРапортЦЛПТ_Выход
		|ГДЕ
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛППередачаНаСГП.Номенклатура,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	1,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_СменныйРапортЦЛППередачаНаСГП.СерийныйНомер,
		|	&Период,
		|	алк_СменныйРапортЦЛППередачаНаСГП.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛППередачаНаСГП.Ссылка.Смена,
		|	ЗНАЧЕНИЕ(Справочник.алк_ПоказателиРапортов.ПереданоНаСГП),
		|	NULL,
		|	"""",
		|	алк_СменныйРапортЦЛППередачаНаСГП.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.ПередачаНаСГП КАК алк_СменныйРапортЦЛППередачаНаСГП
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&Период,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_СерийныеНомера.СерийныйНомер
		|					ИЗ
		|						ВТ_СерийныеНомера)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_СменныйРапортЦЛППередачаНаСГП.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_СменныйРапортЦЛППередачаНаСГП.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(алк_СменныйРапортЦЛПТ_Распилено.Объем) КАК Объем,
		|	&Период,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Подано) КАК Операция,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Организация КАК Организация,
		|	NULL КАК Номенклатура,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Т_Распилено КАК алк_СменныйРапортЦЛПТ_Распилено
		|ГДЕ
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка = &Ссылка
		|	И алк_СменныйРапортЦЛПТ_Распилено.Объем <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Направление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(алк_СменныйРапортЦЛПТ_Выход.Объем),
		|	&Период,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Получено),
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Организация,
		|	NULL,
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Направление
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Т_Выход КАК алк_СменныйРапортЦЛПТ_Выход
		|ГДЕ
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка = &Ссылка
		|	И алк_СменныйРапортЦЛПТ_Выход.Объем <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка.Направление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(ВТ_УпакованоЦЛПУМП.Объем),
		|	ВТ_УпакованоЦЛПУМП.Период,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Упаковано),
		|	ВТ_УпакованоЦЛПУМП.Организация,
		|	ВТ_УпакованоЦЛПУМП.Номенклатура,
		|	ВТ_УпакованоЦЛПУМП.Направление
		|ИЗ
		|	ВТ_УпакованоЦЛПУМП КАК ВТ_УпакованоЦЛПУМП
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_УпакованоЦЛПУМП.Организация,
		|	ВТ_УпакованоЦЛПУМП.Номенклатура,
		|	ВТ_УпакованоЦЛПУМП.Направление,
		|	ВТ_УпакованоЦЛПУМП.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Бригада,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Отходы) КАК ВидДвиженияПроизводства,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Смена,
		|	алк_СменныйРапортЦЛПОтходы.Номенклатура,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПОтходы.Характеристика,
		|	алк_СменныйРапортЦЛПОтходы.Количество,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Распил) КАК Операция,
		|	&Склад,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Отходы КАК алк_СменныйРапортЦЛПОтходы
		|ГДЕ
		|	алк_СменныйРапортЦЛПОтходы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПОтходы.Номенклатура,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПОтходы.Характеристика,
		|	алк_СменныйРапортЦЛПОтходы.Количество,
		|	&Склад КАК СтруктурнаяЕдиница,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Отходы КАК алк_СменныйРапортЦЛПОтходы
		|ГДЕ
		|	алк_СменныйРапортЦЛПОтходы.Ссылка = &Ссылка";
		
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаСменныйРапорт.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСменныйРапорт.Ссылка);
		Запрос.УстановитьПараметр("Склад",Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000003"));
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСменныйРапорт", МассивРезультатов[2].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов[3].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", МассивРезультатов[4].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[5].Выгрузить());
		
		СформироватьТаблицаОтходы(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства); 
		СформироватьТаблицаВыпускОтходы(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства);
		СформироватьТаблицаРасчетныйВыход(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства);
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область Проведение
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаОтходы(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства)
		
		ТаблицаОтходы = Новый ТаблицаЗначений;
		ТаблицаОтходы.Колонки.Добавить("Номенклатура");
		ТаблицаОтходы.Колонки.Добавить("Характеристика");
		ТаблицаОтходы.Колонки.Добавить("ДатаСмены");
		ТаблицаОтходы.Колонки.Добавить("Смена");
		ТаблицаОтходы.Колонки.Добавить("Объем");
		ТаблицаОтходы.Колонки.Добавить("ВидДвижения");
		ТаблицаОтходы.Колонки.Добавить("Период");
		ТаблицаОтходы.Колонки.Добавить("Аналитика");
		
		// Нач мод [Пакушев И.С.] [25.07.2019] 
		// Обращение № [0000108649] [ТекстЗаявки]
		// Было
		
		//ОбъемОтходов = ДокументСсылкаСменныйРапорт.Т_Распилено.Итог("Объем") - ДокументСсылкаСменныйРапорт.Т_Выход.Итог("Объем");
		//
		//НоваяСтрока = ТаблицаОтходы.Добавить();
		//НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
		//НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Щепа);
		//НоваяСтрока.Объем = ОбъемОтходов * 0.68;
		//
		//НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
		//НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
		//
		//НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		//НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;
		//
		//НоваяСтрока = ТаблицаОтходы.Добавить();
		//НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
		//НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Кора);
		//НоваяСтрока.Объем = ОбъемОтходов * 0.08;
		//
		//НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
		//НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
		//
		//НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		//НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;
		//
		//НоваяСтрока = ТаблицаОтходы.Добавить();
		//НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
		//НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Опилки);
		//НоваяСтрока.Объем = ОбъемОтходов * 0.24;
		//
		//НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
		//НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
		//
		//НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		//НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;

		// Стало
		
		Отбор = Новый Структура;
		Отбор.Вставить("Актуален",Истина);
		ТЗ = РегистрыСведений.алк_КоэффициентВыходаОтходов.СрезПоследних(ДокументСсылкаСменныйРапорт.Дата, Отбор);
		
		ОбъемСырья  = ДокументСсылкаСменныйРапорт.Т_Распилено.Итог("Объем");
		
		
		// получить породу сырья (по идее пилят в смену только одной породы) 
		
		Если ДокументСсылкаСменныйРапорт.Т_Распилено.Количество() > 0 Тогда
			
			ХаракткристикаСырья = ДокументСсылкаСменныйРапорт.Т_Распилено[0].Характеристика; 
			
			Порода = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(ХаракткристикаСырья).Порода;
			
			ТаблицаСвойствЗначений = Новый ТаблицаЗначений;
			
			ТаблицаСвойствЗначений.Колонки.Добавить("Свойство");
			ТаблицаСвойствЗначений.Колонки.Добавить("Значение");
			
			НоваяСтрокаСвойств = ТаблицаСвойствЗначений.Добавить();
			НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
			НоваяСтрокаСвойств.Значение = Порода;
					
			Для каждого Стр Из ТЗ Цикл
				
				НоваяСтрока = ТаблицаОтходы.Добавить();
				НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
				НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Стр.Номенклатура);
				НоваяСтрока.Характеристика = АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(НоваяСтрока.Номенклатура, ТаблицаСвойствЗначений);
				
				НоваяСтрока.Объем = ОбъемСырья * Стр.ДоляОтСырья;
				
				НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
				НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
				
				НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата; 		
				
			КонецЦикла; 
			
		КонецЕсли; 
		

		
		
		Если ТЗ.Количество() = 0 Тогда    // для обратной совместимости
			
			ОбъемОтходов = ДокументСсылкаСменныйРапорт.Т_Распилено.Итог("Объем") - ДокументСсылкаСменныйРапорт.Т_Выход.Итог("Объем");
			
			НоваяСтрока = ТаблицаОтходы.Добавить();
			НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
			НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Щепа);
			НоваяСтрока.Объем = ОбъемОтходов * 0.68;
			
			НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
			НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
			
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;
			
			НоваяСтрока = ТаблицаОтходы.Добавить();
			НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
			НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Кора);
			НоваяСтрока.Объем = ОбъемОтходов * 0.08;
			
			НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
			НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
			
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;
			
			НоваяСтрока = ТаблицаОтходы.Добавить();
			НоваяСтрока.Аналитика = Перечисления.алк_АналитикаЩепа.ЦЛП;
			НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Опилки);
			НоваяСтрока.Объем = ОбъемОтходов * 0.24;
			
			НоваяСтрока.ДатаСмены = ДокументСсылкаСменныйРапорт.ДатаСмены;
			НоваяСтрока.Смена     = ДокументСсылкаСменныйРапорт.Смена;
			
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяСтрока.Период      = ДокументСсылкаСменныйРапорт.Дата;  		
		
		КонецЕсли;
			
		// Кон мод [Пакушев И.С.] [25.07.2019]
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", ТаблицаОтходы);
		
	КонецПроцедуры // СформироватьТаблицаОтходы
	
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаРасчетныйВыход(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПТ_Выход.КлючСвязи,
		|	СУММА(алк_СменныйРапортЦЛПТ_Выход.Количество) КАК Количество,
		|	СУММА(алк_СменныйРапортЦЛПТ_Выход.Объем) КАК Объем,
		|	СУММА(алк_СменныйРапортЦЛПТ_Выход.ОбъемСПрипуском) КАК ОбъемСПрипуском
		|ПОМЕСТИТЬ втСуммарныйВыход
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Т_Выход КАК алк_СменныйРапортЦЛПТ_Выход
		|ГДЕ
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_СменныйРапортЦЛПТ_Выход.КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПТ_Распилено.Номенклатура КАК НоменклатураСырье,
		|	алк_СменныйРапортЦЛПТ_Распилено.Характеристика КАК ХарактеристикаСырье,
		|	алк_СменныйРапортЦЛПТ_Выход.Номенклатура КАК НоменклатураПродукция,
		|	алк_СменныйРапортЦЛПТ_Выход.Характеристика КАК ХарактеристикаПродукция,
		|	алк_СменныйРапортЦЛПТ_Распилено.Постав,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Смена,
		|	алк_СменныйРапортЦЛПТ_Распилено.Количество КАК КоличествоСырье,
		|	алк_СменныйРапортЦЛПТ_Распилено.Объем КАК ОбъемСырье,
		|	алк_СменныйРапортЦЛПТ_Выход.Количество КАК КоличествоПродукция,
		|	алк_СменныйРапортЦЛПТ_Выход.Объем КАК ОбъемПродукция,
		|	алк_СменныйРапортЦЛПТ_Распилено.КлючСвязи,
		|	алк_СменныйРапортЦЛПТ_Распилено.СертификатFSC,
		|	алк_СменныйРапортЦЛПТ_Распилено.Сертификат КАК СертификатСырье,
		|	алк_СменныйРапортЦЛПТ_Выход.Сертификат КАК СертификатПродукция,
		|	алк_СменныйРапортЦЛПТ_Распилено.Ссылка.Инвентаризация,
		|	алк_СменныйРапортЦЛПТ_Выход.ОбъемСПрипуском КАК ОбъемСПрипускомПродукция
		|ПОМЕСТИТЬ втОсновная
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Т_Распилено КАК алк_СменныйРапортЦЛПТ_Распилено
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_СменныйРапортЦЛП.Т_Выход КАК алк_СменныйРапортЦЛПТ_Выход
		|		ПО алк_СменныйРапортЦЛПТ_Распилено.Ссылка = алк_СменныйРапортЦЛПТ_Выход.Ссылка
		|			И алк_СменныйРапортЦЛПТ_Распилено.КлючСвязи = алк_СменныйРапортЦЛПТ_Выход.КлючСвязи
		|ГДЕ
		|	алк_СменныйРапортЦЛПТ_Выход.Ссылка = &Ссылка
		|	И алк_СменныйРапортЦЛПТ_Распилено.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОсновная.НоменклатураСырье,
		|	втОсновная.ХарактеристикаСырье,
		|	втОсновная.НоменклатураПродукция,
		|	втОсновная.ХарактеристикаПродукция,
		|	втОсновная.Постав,
		|	втОсновная.ДатаСмены,
		|	втОсновная.Смена,
		|	втОсновная.КоличествоСырье,
		|	втОсновная.ОбъемСырье,
		|	втОсновная.КоличествоПродукция,
		|	втОсновная.ОбъемПродукция,
		|	втОсновная.КлючСвязи,
		|	втСуммарныйВыход.Количество КАК КоличествоПродукцияСумма,
		|	втСуммарныйВыход.Объем КАК ОбъемПродукцияСумма,
		|	ВЫБОР
		|		КОГДА втОсновная.ОбъемСырье <> 0
		|			ТОГДА 100 * втСуммарныйВыход.Объем / втОсновная.ОбъемСырье
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПроцентВыхода,
		|	&Период,
		|	втОсновная.СертификатFSC,
		|	втОсновная.СертификатСырье,
		|	втОсновная.СертификатПродукция,
		|	втОсновная.Инвентаризация,
		|	втОсновная.ОбъемСПрипускомПродукция,
		|	ВЫБОР
		|		КОГДА втОсновная.ОбъемСырье <> 0
		|			ТОГДА 100 * втСуммарныйВыход.ОбъемСПрипуском / втОсновная.ОбъемСырье
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПроцентВыходаСПрипуском
		|ИЗ
		|	втОсновная КАК втОсновная
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСуммарныйВыход КАК втСуммарныйВыход
		|		ПО втОсновная.КлючСвязи = втСуммарныйВыход.КлючСвязи";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаСменныйРапорт.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСменныйРапорт);
		
		РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетныйВыход", РезультатЗапроса.Выгрузить());
		
		
	КонецПроцедуры // СформироватьТаблицаРасчетныйВыход
		
	// Формирует таблицу значений, содержащую данные для проведения по регистру.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура СформироватьТаблицаВыпускОтходы(ДокументСсылкаСменныйРапорт, СтруктураДополнительныеСвойства)
		
		
		СтруктурнаяЕдиница = ДокументСсылкаСменныйРапорт.Организация.ДополнительныеРеквизиты.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Буферный склад"),"Свойство").Значение; 
		
		Запрос = Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Организация,
		|	алк_СменныйРапортЦЛПОтходы.Номенклатура,
		|	алк_СменныйРапортЦЛПОтходы.Характеристика,
		|	алк_СменныйРапортЦЛПОтходы.Количество КАК Объем,
		|	&Период,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.ДатаСмены,
		|	алк_СменныйРапортЦЛПОтходы.Ссылка.Смена,
		|	&СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	"""" КАК СертификатFSC,
		|	"""" КАК Сертификат,
		|	НЕОПРЕДЕЛЕНО КАК Ячейка
		|ИЗ
		|	Документ.алк_СменныйРапортЦЛП.Отходы КАК алк_СменныйРапортЦЛПОтходы
		|ГДЕ
		|	алк_СменныйРапортЦЛПОтходы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаСменныйРапорт.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСменныйРапорт);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыпускОтходы", МассивРезультатов[0].Выгрузить());
		
		
	КонецПроцедуры // СформироватьТаблицаЗапасыОрганизации
	
	
	#КонецОбласти 
	
	
	#Область СлужебныеПроцедуры
	
	// ТДПриемник - табличный документ, в кот. устанавливается новый формат
	// Отчет - табличный документ, на основании кот. будет установлен новый формат
	//
	Процедура ДобавитьОтчет(ТДПриемник, Отчет)
		
		НачалоНовогоФорматаСтрок = ТДПриемник.ВысотаТаблицы + 1;
		ОбластьПрямоугольная = Отчет.Область(1, , Отчет.ВысотаТаблицы, );
		ТДПриемник.ВставитьОбласть(ОбластьПрямоугольная, ТДПриемник.Область(НачалоНовогоФорматаСтрок, 1));
		ТДПриемник.Область(НачалоНовогоФорматаСтрок, , 
		НачалоНовогоФорматаСтрок + Отчет.ВысотаТаблицы - 1, ).СоздатьФорматСтрок();
		// назначим ширину колонок у новой области формата строк
		
		Для Счетчик = 1 По Отчет.ШиринаТаблицы Цикл
			ТДПриемник.Область(НачалоНовогоФорматаСтрок, Счетчик).ШиринаКолонки = Отчет.Область(1, Счетчик).ШиринаКолонки;
		КонецЦикла;
		ТДПриемник.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецПроцедуры // ДобавитьОтчет 
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	Функция СформироватьПоСКД(СхемаКомпоновкиДанных, Параметры)
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
		Настройки = КомпоновщикНастроек. ПолучитьНастройки();
		
		УстановитьОтбор(Настройки, "Ссылка", Параметры.Ссылка);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		Настройки,
		);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		,
		);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции	 
	
	#КонецОбласти 
	
	
#КонецЕсли

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	//Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
КонецПроцедуры
// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	//Реквизиты.Добавить("ИмяРеквизита"); // реквизит объекта
	//Реквизиты.Добавить("ИмяТабличнойЧасти.*"); // табличная часть объекта
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов