
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
			
			ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
			
			Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
			
		КонецЕсли; 
				
	КонецПроцедуры
	
	// Процедура - обработчик события ОбработкаПроведения объекта.
	//
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа.
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.алк_СменныйРапортЦЛП.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		РфпСервер.ОтразитьСменныйРапорт(ДополнительныеСвойства, Движения, Отказ);
		РФПСервер.ОтразитьРасчетныйВыход(ДополнительныеСвойства, Движения, Отказ);
		
		//Сергеева Г.О. Оборотный регистр ++
		РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ); 
		//Сергеева Г.О. Оборотный регистр -- 
		
		//добавить запись в новые регистры
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		//\\

		Если ДатаСмены >= '2017-10-01' Тогда
			РфпСервер.ОтразитьОтходы(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
		
		РфпСервер.ОтразитьОтходыВЗапасахОрганизации(ДополнительныеСвойства, Движения, Отказ);
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  
		
		Отказ = Не СменаЗакрыта();

	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		Для каждого стрВыход Из Т_Выход Цикл
			
			СтрокаРодитель = Т_Распилено.Найти(стрВыход.КлючСвязи, "КлючСвязи");
			Если стрВыход.СертификатFSC <> СтрокаРодитель.СертификатFSC Тогда
				Отказ = Истина;
				Прервать;
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если Отказ = Истина Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = " Расхождение ""Выход"" и ""Распилено"" по сертификату";
			Сообщение.Сообщить(); 	
		КонецЕсли; 
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
#КонецЕсли

Процедура Конец()	
КонецПроцедуры

Функция СменаЗакрыта() 
	
	Если Смена = Справочники.алк_Смены.Ночь_2 Тогда 
		ПрошлаяДатаСмены = ДатаСмены; 
		ПрошлаяСмена = Справочники.алк_Смены.День_2;
	Иначе 
		ПрошлаяДатаСмены = ДатаСмены - 1*24*60*60;
		ПрошлаяСмена = Справочники.алк_Смены.Ночь_2; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ПроизводствоПродукция.Ссылка.ДатаСмены КАК ДатаСмены,
	               |	алк_ПроизводствоПродукция.Ссылка.Смена КАК Смена,
	               |	алк_ПроизводствоПродукция.СерийныйНомер КАК СерийныйНомер
	               |ПОМЕСТИТЬ ВТ_ПакетыПроизведенныеЗаДень
	               |ИЗ
	               |	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
	               |ГДЕ
	               |	(алк_ПроизводствоПродукция.Ссылка.ДатаСмены = &ТекДатаСмены
	               |				И алк_ПроизводствоПродукция.Ссылка.Смена = &ТекСмена
	               |			ИЛИ алк_ПроизводствоПродукция.Ссылка.ДатаСмены = &ПрошлаяДатаСмены
	               |				И алк_ПроизводствоПродукция.Ссылка.Смена = &ПрошлаяСмена)
	               |	И алк_ПроизводствоПродукция.СерийныйНомер.Наименование ПОДОБНО ""СП%""
	               |	И алк_ПроизводствоПродукция.Ссылка.Участок.Код <> ""000000046""
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	алк_ПроизводствоПродукция.Ссылка.ДатаСмены,
	               |	алк_ПроизводствоПродукция.Ссылка.Смена,
	               |	алк_ПроизводствоПродукция.СерийныйНомер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПакетыПроизведенныеЗаДень.ДатаСмены КАК ДатаСмены,
	               |	ВТ_ПакетыПроизведенныеЗаДень.Смена КАК Смена,
	               |	ЕСТЬNULL(алк_ПроизводствоОборотОбороты.СерийныйНомер, ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)) КАК СерийныйНомер
	               |ПОМЕСТИТЬ ВТ_СНВОбороте
	               |ИЗ
	               |	ВТ_ПакетыПроизведенныеЗаДень КАК ВТ_ПакетыПроизведенныеЗаДень
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	               |				,
	               |				,
	               |				,
	               |				(ДатаСмены = &ТекДатаСмены
	               |						И Смена = &ТекСмена
	               |					ИЛИ ДатаСмены = &ПрошлаяДатаСмены
	               |						И Смена = &ПрошлаяСмена)
	               |					И Номенклатура.Код = ""ПБ-00000012""
	               |					И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеПриход)
	               |					И Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.СушильныйБуфер)
	               |					И СерийныйНомер В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПакетыПроизведенныеЗаДень.СерийныйНомер КАК СерийныйНомер
	               |						ИЗ
	               |							ВТ_ПакетыПроизведенныеЗаДень КАК ВТ_ПакетыПроизведенныеЗаДень)) КАК алк_ПроизводствоОборотОбороты
	               |		ПО ВТ_ПакетыПроизведенныеЗаДень.СерийныйНомер = алк_ПроизводствоОборотОбороты.СерийныйНомер
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПакетыПроизведенныеЗаДень.ДатаСмены,
	               |	ВТ_ПакетыПроизведенныеЗаДень.Смена,
	               |	ЕСТЬNULL(алк_ПроизводствоОборотОбороты.СерийныйНомер, ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СНВОбороте.ДатаСмены КАК ДатаСмены,
	               |	ВТ_СНВОбороте.Смена КАК Смена
	               |ИЗ
	               |	ВТ_СНВОбороте КАК ВТ_СНВОбороте
	               |ГДЕ
	               |	ВТ_СНВОбороте.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СНВОбороте.ДатаСмены,
	               |	ВТ_СНВОбороте.Смена" ;
				   		   
	Запрос.УстановитьПараметр("Актуальность", Перечисления.алк_ОперативнаяАктуальностьПакетов.Актуален);
	Запрос.УстановитьПараметр("ТекДатаСмены", ДатаСмены); 
	Запрос.УстановитьПараметр("ТекСмена", Смена); 
	Запрос.УстановитьПараметр("ПрошлаяДатаСмены", ПрошлаяДатаСмены);
	Запрос.УстановитьПараметр("ПрошлаяСмена", ПрошлаяСмена);
		
	Участки = Новый Массив;
	Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000004")); //УЧАСТОК ПФМ И УПАКОВКА (1 ЛИНИЯ) 
	Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000026")); //УЧАСТОК ПФМ И УПАКОВКА (2 ЛИНИЯ)
	Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000002")); //ЛИНИЯ ПИЛЕНИЯ LINCK  	 
	
	Запрос.УстановитьПараметр("Участок", Участки);   
	
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Выборка = РезЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Смена = Смена Тогда 
			Сообщить("Ошибка! Запрещено проводить текущий документ, пока не выполнено закрытие смены!");
		Иначе
			Сообщить("Ошибка! Запрещено проводить текущий документ, пока не выполнено закрытие предыдущей смены!");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


