#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["РеестрТС"].Рекомендуемый = Истина;
	
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Период = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	//Отпустил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	//Получил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	//Отпустил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	//Получил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;
	
	//Проверим параметры периода
	Если НЕ Период.ДатаНачала = Дата(1,1,1)
		И НЕ Период.ДатаОкончания = Дата(1,1,1)
		И Период.ДатаНачала > Период.ДатаОкончания Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ru = 'Дата начала периода не должна превышать дату окончания.'");
		
		Возврат;
		
	КонецЕсли;
	
	ТабличныйДокумент = Сформировать(Период);
	
	ДокументРезультат.Вывести(ТабличныйДокумент);
	ДокументРезультат.ФиксацияСверху = ТабличныйДокумент.ФиксацияСверху;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["РеестрТС"].Теги = НСТР("ru = 'Реестр транспортных средств по лесопродукции, принятой на ответхранение'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["АктПередачи"].СвязанныеПоля, "Контрагент", "Справочник.Контрагенты");
	
КонецПроцедуры

Функция Сформировать(Период)
	
	таб = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Д1", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Д2", КонецПериода);
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель КАК Производитель,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата КАК ДатаПриемки,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерНакладной КАК НомерНакладной,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерВагона,
	|	СУММА(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем) КАК Объем
	|ИЗ
	|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
	|ГДЕ
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Проведен
	|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата МЕЖДУ &Д1 И &Д2
	|	И НЕ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Основная
	|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Наименование <> ""Основной штабель""
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерНакладной,
	|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерВагона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Производитель,
	|	ДатаПриемки,
	|	НомерНакладной
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	ОБЩИЕ,
	|	Производитель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = запрос.Выполнить();
	
	Итоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	макет = получитьмакет("Макет");
	шапка = макет.ПолучитьОбласть("Шапка");
	СтрокаПроизводитель = макет.ПолучитьОбласть("СтрокаПроизводитель");
	Строка = макет.ПолучитьОбласть("Строка");
	Подвал = макет.ПолучитьОбласть("Подвал");
	шапка.Параметры.период = ПредставлениеПериода(началодня(Запрос.Параметры.Д1), конецдня(Запрос.Параметры.Д2));
	шапка.Параметры.ДатаСоставления = Формат(Запрос.Параметры.Д2,"ДФ=dd.MM.yyyy")+" г.";
	таб.вывести(шапка);
	
	Итоги.Следующий();
	
	таб.НачатьАвтогруппировкуСтрок();
	
	стрПроизводитель = Итоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока стрПроизводитель.Следующий() Цикл
		СтрокаПроизводитель.параметры.заполнить(стрПроизводитель);
		таб.вывести(СтрокаПроизводитель, стрПроизводитель.Уровень());
		стр = стрПроизводитель.Выбрать();
		Пока стр.Следующий() Цикл
			Строка.параметры.заполнить(стр);
			таб.вывести(строка, стр.Уровень());
		КонецЦикла;
	КонецЦикла;
	
	таб.ЗакончитьАвтогруппировкуСтрок();
	
	подвал.Параметры.Заполнить(Итоги);
	таб.вывести(Подвал);
	
	Возврат таб;
	
КонецФункции

#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли