
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_РапортПропарка.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета  
	
	ЗаписыватьДвижения = Истина;
	ПараметрНастройки = "ДатаПерехода_ГТО";          
	
	СтруктураНастроек = Новый Структура("Параметр", ПараметрНастройки);
	ПолучитьДатуВвода = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
	ДатаВвода = Дата(1,1,1);
	Если ПолучитьДатуВвода.Количество() > 0 Тогда
		ДатаВвода = ПолучитьДатуВвода[0].Дата;
	КонецЕсли;
	
	Если ДатаВвода <= ДатаСмены И НЕ ДатаВвода = Дата(1,1,1) Тогда
		ЗаписыватьДвижения = Ложь;
	КонецЕсли;  
	
	Если ЗаписыватьДвижения Тогда 
		РфпСервер.ОтразитьОстаткиКамерыГТО(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьВремяПропарки(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;

	//РфпСервер.ОтразитьСтатусыПропарки(ДополнительныеСвойства, Движения, Отказ);
	//РфпСервер.ОтразитьОстаткиВКамерахПропарки(ДополнительныеСвойства, Движения, Отказ);
	//РфпСервер.ОтразитьУчетВремениПропарки(ДополнительныеСвойства, Движения, Отказ);
		
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	//КонтрольЗаполнения(Отказ);
	
КонецПроцедуры

// проверка 
// - соответствие объемов загрузки и выгрузки
// - дублирования выгрузки
// - дата выгрузки познее даты загрузки
Процедура КонтрольЗаполнения(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;   	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	НаНачалоВсего = Камеры.Итог("ОстатокНаНачалоСмены");
	
	РазгрузилиВсего = Камеры.Итог("РазгрузилиОбъем");
	
	ЗагрузилиВсего = Камеры.Итог("ЗагрузкаОбъем");
	
	НаКонецВсего = Камеры.Итог("ОстатокНаКонецСмены");
	
	ПравильныйОстатокНаКонецСмены = НаНачалоВсего + ЗагрузилиВсего - РазгрузилиВсего;
	
	Если ПравильныйОстатокНаКонецСмены = НаКонецВсего Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого эл ИЗ Камеры Цикл    
		ОстатокНаКонецСменыИзРасчета = эл.ОстатокНаНачалоСмены + эл.ЗагрузкаОбъем - эл.РазгрузилиОбъем;
		Если ОстатокНаКонецСменыИзРасчета <> эл.ОстатокНаКонецСмены Тогда
			Сообщить(СтрШаблон("В строке №%1 неправильный остаток на конец смены, исправьте! Должен быть %2!", 
			эл.НомерСтроки,ОстатокНаКонецСменыИзРасчета));
		КонецЕсли;
	КонецЦикла;
	
	Отказ = Истина;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ) 
	
	//добавим запись для пересчета показателей ЕДС
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	Дата,
	Справочники.алк_ОперацииПроизводства.НайтиПоКоду("000000448"),
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);
	//\\
	
КонецПроцедуры
 
