

		   
///// *!!!!!!!!!!!!!!!!* /////

// запросы движений, разбитые по показателям для тестирования и отладки		
// в конце итоговый запрос, что помещается во вложенный запрос запроса СКД
		   
Функция ЗапросДвиженияПроизводствоШпон_исходный()
	
	Тест = "ВЫБРАТЬ
	       |	алк_ПараметрыХарактеристик.Порода КАК Порода,
	       |	Градации.Наименование КАК Градация,
	       |	алк_ПараметрыХарактеристик.Длина КАК Длина,
	       |	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК ОстатокБиржаНаНачало,
	       |	NULL КАК ОстатокБиржаНаКонец,
	       |	""Биржа"" КАК ГруппаПоказателя,
	       |	1 КАК ПорядокГруппыПоказателя,
	       |	алк_ПараметрыХарактеристик.Порода.Наименование + "" "" + алк_ПараметрыХарактеристик.Длина.Наименование + ЕСТЬNULL(""/"" + алк_ПараметрыХарактеристик.Сорт.Наименование, """") + ЕСТЬNULL(""/"" + Градации.Наименование, """") КАК Показатель,
	       |	ДЛИНАСТРОКИ(алк_ПараметрыХарактеристик.Порода.Наименование) * 1000 + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 1) + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Порядок, 1) * 10 + ЕСТЬNULL(Градации.От, 1) КАК ПорядокПоказателя,
	       |	""Запасы на начало"" КАК ВидДвижения,
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Количество,
	       |	1 КАК ПорядокВидаДвижения
	       |ПОМЕСТИТЬ ВТ_ОстатокБиржа
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	       |			&ДатаНачалаГраница,
	       |			Номенклатура = &НоменклатураПиловочник
	       |				И СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Биржа)
	       |				И Штабель.Код = ""000000001"") КАК алк_ОстаткиЗапасовОстатки
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Градации КАК Градации
	       |			ПО (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 <= Градации.До)
	       |				И (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 >= Градации.От)
	       |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ПараметрыХарактеристик.Порода.Код = ""000000004""
	       |	И алк_ПараметрыХарактеристик.Длина.ДлинаММ = 4000
	       |	И алк_ПараметрыХарактеристик.Сорт.Код В (""000000003"", ""000000008"")
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	алк_ПараметрыХарактеристик.Порода,
	       |	Градации.Наименование,
	       |	алк_ПараметрыХарактеристик.Длина,
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ПараметрыХарактеристик.Порода.Наименование + "" "" + алк_ПараметрыХарактеристик.Длина.Наименование + ""/"" + алк_ПараметрыХарактеристик.Сорт.Наименование + ""/"" + Градации.Наименование,
	       |	алк_ПараметрыХарактеристик.Порода.Наименование + "" "" + алк_ПараметрыХарактеристик.Длина.Наименование + ЕСТЬNULL(""/"" + алк_ПараметрыХарактеристик.Сорт.Наименование, """") + ЕСТЬNULL(""/"" + Градации.Наименование, """"),
	       |	ДЛИНАСТРОКИ(алк_ПараметрыХарактеристик.Порода.Наименование) * 1000 + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 1) + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Порядок, 1) * 10 + ЕСТЬNULL(Градации.От, 1)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	алк_ПараметрыХарактеристик.Порода,
	       |	Градации.Наименование,
	       |	алк_ПараметрыХарактеристик.Длина,
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	NULL,
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток),
	       |	""Биржа"",
	       |	1,
	       |	алк_ПараметрыХарактеристик.Порода.Наименование + "" "" + алк_ПараметрыХарактеристик.Длина.Наименование + ЕСТЬNULL(""/"" + алк_ПараметрыХарактеристик.Сорт.Наименование, """") + ЕСТЬNULL(""/"" + Градации.Наименование, """"),
	       |	ДЛИНАСТРОКИ(алк_ПараметрыХарактеристик.Порода.Наименование) * 1000 + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 1) + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Порядок, 1) * 10 + ЕСТЬNULL(Градации.От, 1),
	       |	""Запасы на конец"",
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток),
	       |	1000
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	       |			&ДатаОкончанияГраница,
	       |			Номенклатура = &НоменклатураПиловочник
	       |				И СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Биржа)
	       |				И Штабель.Код = ""000000001"") КАК алк_ОстаткиЗапасовОстатки
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Градации КАК Градации
	       |			ПО (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 <= Градации.До)
	       |				И (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 >= Градации.От)
	       |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ПараметрыХарактеристик.Порода.Код = ""000000004""
	       |	И алк_ПараметрыХарактеристик.Длина.ДлинаММ = 4000
	       |	И алк_ПараметрыХарактеристик.Сорт.Код В (""000000003"", ""000000008"")
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	алк_ПараметрыХарактеристик.Порода,
	       |	Градации.Наименование,
	       |	алк_ПараметрыХарактеристик.Длина,
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ПараметрыХарактеристик.Порода.Наименование + "" "" + алк_ПараметрыХарактеристик.Длина.Наименование + ЕСТЬNULL(""/"" + алк_ПараметрыХарактеристик.Сорт.Наименование, """") + ЕСТЬNULL(""/"" + Градации.Наименование, """"),
	       |	ДЛИНАСТРОКИ(алк_ПараметрыХарактеристик.Порода.Наименование) * 1000 + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 1) + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Порядок, 1) * 10 + ЕСТЬNULL(Градации.От, 1)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Количество,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА 3
	       |		ИНАЧЕ 2
	       |	КОНЕЦ КАК ПорядокГруппыПоказателя,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой""
	       |	КОНЕЦ КАК Показатель,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА 20
	       |	КОНЕЦ КАК ПорядокПоказателя,
	       |	""Запасы на начало"" КАК ВидДвижения,
	       |	1 КАК ПорядокВидаДвижения
	       |ПОМЕСТИТЬ ВТ_ОстатокПроизводство
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	       |			&ДатаНачалаГраница,
	       |			Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.Шпон)
	       |				И СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)) КАК алк_ОстаткиЗапасовОстатки
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	(алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ИЛИ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ИЛИ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ИЛИ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА 20
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой""
	       |	КОНЕЦ
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток),
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА 3
	       |		ИНАЧЕ 2
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА 20
	       |	КОНЕЦ,
	       |	""Запасы на конец"",
	       |	1000
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	       |			&ДатаОкончанияГраница,
	       |			Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.Шпон)
	       |				И СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)) КАК алк_ОстаткиЗапасовОстатки
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	(алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ИЛИ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ИЛИ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ИЛИ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки)
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА 20
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой""
	       |	КОНЕЦ
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Количество,
	       |	4 КАК ПорядокГруппыПоказателя,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Показатель,
	       |	алк_ПараметрыХарактеристик.Сорт.Порядок КАК ПорядокПоказателя,
	       |	""Запасы на начало"" КАК ВидДвижения,
	       |	1 КАК ПорядокВидаДвижения
	       |ПОМЕСТИТЬ ВТ_ОстатокСГП
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	       |			&ДатаНачалаГраница,
	       |			Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.Шпон)
	       |				И СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.СГП)) КАК алк_ОстаткиЗапасовОстатки
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование,
	       |	алк_ПараметрыХарактеристик.Сорт.Порядок
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток),
	       |	4,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование,
	       |	алк_ПараметрыХарактеристик.Сорт.Порядок,
	       |	""Запасы на конец"",
	       |	1000
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	       |			&ДатаОкончанияГраница,
	       |			Номенклатура = ЗНАЧЕНИЕ(Справочник.номенклатура.Шпон)
	       |				И СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.СГП)) КАК алк_ОстаткиЗапасовОстатки
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	       |	алк_ПараметрыХарактеристик.Сорт,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование,
	       |	алк_ПараметрыХарактеристик.Сорт.Порядок
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА ""Полуфабрикат: Окоренное сырье""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И НЕ алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА алк_ПараметрыХарактеристик.Порода.Наименование + "" "" + алк_ПараметрыХарактеристик.Длина.Наименование + ЕСТЬNULL(""/"" + алк_ПараметрыХарактеристик.Сорт.Наименование, """") + ЕСТЬNULL(""/"" + Градации.Наименование, """")
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой1""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой2""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон сырой00""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой9990""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой999""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой3""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Окоренное сырье""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой4""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой5""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Продукция: Поддоны""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Продукция: Фанера""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Продукция: Фанера""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой6""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		ИНАЧЕ ""Не определен""
	       |	КОНЕЦ КАК Показатель,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА 1
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И НЕ алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА ДЛИНАСТРОКИ(алк_ПараметрыХарактеристик.Порода.Наименование) * 1000 + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 1) + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Порядок, 1) * 10 + ЕСТЬNULL(Градации.От, 1)
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 20
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 1
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 50
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 40
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 40
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 20
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА 1000 * алк_ПараметрыХарактеристик.Сорт.Порядок
	       |	КОНЕЦ КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА 2
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И НЕ алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА 1
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА 3
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |				И НЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 3
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |			ТОГДА 2
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |			ТОГДА 4
	       |	КОНЕЦ КАК ПорядокГруппПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И НЕ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА ""Поступление1 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА ""Возврат (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА ""Поступление2 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление3 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И (алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |					И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005"")
	       |			ТОГДА ""Списание1 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица)
	       |			ТОГДА ""Поступление5 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано1 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА ""На комплектовочный склад""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Передано2 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА ""Передано3 (-)""
	       |		КОГДА ЛОЖЬ
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |			ТОГДА ""Возврат (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	       |			ТОГДА ""Отгружено на сторону (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание2"") + "" (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление5 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |			ТОГДА ""Передано4 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |			ТОГДА ""Прочий (-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И НЕ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА 20
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И (алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |						И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |						И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005""
	       |					ИЛИ алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица))
	       |			ТОГДА 45
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 55
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	       |			ТОГДА 50
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |			ТОГДА 60
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор
	       |ПОМЕСТИТЬ ВТ_ДвиженияБиржа
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Градации КАК Градации
	       |			ПО (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 >= Градации.От)
	       |				И (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 <= Градации.До)
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (алк_ОстаткиЗапасов.Штабель.Код = ""000000001""
	       |				И алк_ПараметрыХарактеристик.Порода.Код = ""000000004""
	       |				И алк_ПараметрыХарактеристик.Длина.ДлинаММ = 4000
	       |				И алк_ПараметрыХарактеристик.Сорт.Код В (""000000003"", ""000000008"")
	       |			ИЛИ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.Алк_Штабели.пустаяСсылка)
	       |			ИЛИ НЕ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа))
	       |	И НЕ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Порт)
	       |	И НЕ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Пустаяссылка)
	       |	И (алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.Регистратор.СкладОтправитель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |				И НЕ алк_ОстаткиЗапасов.Регистратор.СкладПолучатель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |			ИЛИ НЕ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение)
	       |	И (НЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |			ИЛИ НЕ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство)
	       |	И (НЕ(ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	       |			ИЛИ НЕ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	алк_ПроизводствоОборотОбороты.КоличествоОборот,
	       |	ВЫБОР
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |			ТОГДА ""3. Передел - Производство сырого шпона""
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |			ТОГДА ""4. Передел - Сушка шпона""
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |			ТОГДА ""6. Передел - Упаковка шпона""
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка)
	       |			ТОГДА ""6.1 Передел - Переупаковка шпона""
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |			ТОГДА ""5. Передел - Ребросклеивание шпона""
	       |		ИНАЧЕ ""Не определен""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |			ТОГДА 5
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |			ТОГДА 15
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |			ТОГДА 25
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка)
	       |			ТОГДА 31
	       |		КОГДА алк_ПроизводствоОборотОбороты.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |			ТОГДА 26
	       |		ИНАЧЕ 99999
	       |	КОНЕЦ,
	       |	2,
	       |	ВЫБОР
	       |		КОГДА алк_ПроизводствоОборотОбороты.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	       |			ТОГДА ""Выпуск (+)""
	       |		КОГДА алк_ПроизводствоОборотОбороты.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)
	       |			ТОГДА ""Поступление (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ПроизводствоОборотОбороты.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	       |			ТОГДА 40
	       |		КОГДА алк_ПроизводствоОборотОбороты.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)
	       |			ТОГДА 10
	       |	КОНЕЦ,
	       |	алк_ПроизводствоОборотОбороты.Регистратор
	       |ИЗ
	       |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(&ДатаНачалаГраница, &ДатаОкончанияГраница, Регистратор, Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка))) КАК алк_ПроизводствоОборотОбороты
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ПроизводствоОборотОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВЫБОР
	       |		КОГДА ЕСТЬNULL(ВЗ_ОбъемыПроизводства.ОбъемСписано, 0) = 0
	       |			ТОГДА 0
	       |		ИНАЧЕ ВЫРАЗИТЬ(ВЗ_ОбъемыПроизводства.ОбъемВыпущено / ВЗ_ОбъемыПроизводства.ОбъемСписано КАК ЧИСЛО(15, 2))
	       |	КОНЕЦ КАК Количество,
	       |	ВЫБОР
	       |		КОГДА ВЗ_ОбъемыПроизводства.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |			ТОГДА ""3. Передел - Производство сырого шпона""
	       |		КОГДА ВЗ_ОбъемыПроизводства.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |			ТОГДА ""4. Передел - Сушка шпона""
	       |		КОГДА ВЗ_ОбъемыПроизводства.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |			ТОГДА ""5. Передел - Ребросклеивание шпона""
	       |	КОНЕЦ КАК Показатель,
	       |	ВЫБОР
	       |		КОГДА ВЗ_ОбъемыПроизводства.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |			ТОГДА 5
	       |		КОГДА ВЗ_ОбъемыПроизводства.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |			ТОГДА 15
	       |		КОГДА ВЗ_ОбъемыПроизводства.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |			ТОГДА 26
	       |	КОНЕЦ КАК ПорядокПоказателей,
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""% выхода по переделам"" КАК ВидДвижения,
	       |	1001 КАК ПорядокВидаДвижения
	       |ПОМЕСТИТЬ ВТ_ВыходПроизводства
	       |ИЗ
	       |	(ВЫБРАТЬ
	       |		алк_ПроизводствоОборотОбороты.Операция КАК Операция,
	       |		СУММА(ВЫБОР
	       |				КОГДА алк_ПроизводствоОборотОбороты.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)
	       |					ТОГДА алк_ПроизводствоОборотОбороты.КоличествоОборот
	       |				ИНАЧЕ 0
	       |			КОНЕЦ) КАК ОбъемСписано,
	       |		СУММА(ВЫБОР
	       |				КОГДА алк_ПроизводствоОборотОбороты.ВидДвиженияПроизводства = ЗНАЧЕНИЕ(перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	       |					ТОГДА алк_ПроизводствоОборотОбороты.КоличествоОборот
	       |				ИНАЧЕ 0
	       |			КОНЕЦ) КАК ОбъемВыпущено
	       |	ИЗ
	       |		РегистрНакопления.алк_ПроизводствоОборот.Обороты(&ДатаНачалаГраница, &ДатаОкончанияГраница, , Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей))) КАК алк_ПроизводствоОборотОбороты
	       |	
	       |	СГРУППИРОВАТЬ ПО
	       |		алк_ПроизводствоОборотОбороты.Операция) КАК ВЗ_ОбъемыПроизводства
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияБиржа.КоличествоОборот КАК Количество,
	       |	ВТ_ДвиженияБиржа.Показатель,
	       |	ВТ_ДвиженияБиржа.ПорядокПоказателей,
	       |	ВТ_ДвиженияБиржа.ПорядокГруппПоказателей,
	       |	ВТ_ДвиженияБиржа.ВидДвижения,
	       |	ВТ_ДвиженияБиржа.ПорядокВидаДвижения,
	       |	ВТ_ДвиженияБиржа.Регистратор
	       |ИЗ
	       |	ВТ_ДвиженияБиржа КАК ВТ_ДвиженияБиржа
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	ВТ_ОстатокБиржа.Количество,
	       |	ВТ_ОстатокБиржа.Показатель,
	       |	ВТ_ОстатокБиржа.ПорядокПоказателя,
	       |	ВТ_ОстатокБиржа.ПорядокГруппыПоказателя,
	       |	ВТ_ОстатокБиржа.ВидДвижения,
	       |	ВТ_ОстатокБиржа.ПорядокВидаДвижения,
	       |	NULL
	       |ИЗ
	       |	ВТ_ОстатокБиржа КАК ВТ_ОстатокБиржа
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	ВТ_ОстатокПроизводство.Количество,
	       |	ВТ_ОстатокПроизводство.Показатель,
	       |	ВТ_ОстатокПроизводство.ПорядокПоказателя,
	       |	ВТ_ОстатокПроизводство.ПорядокГруппыПоказателя,
	       |	ВТ_ОстатокПроизводство.ВидДвижения,
	       |	ВТ_ОстатокПроизводство.ПорядокВидаДвижения,
	       |	NULL
	       |ИЗ
	       |	ВТ_ОстатокПроизводство КАК ВТ_ОстатокПроизводство
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	ВТ_ОстатокСГП.Количество,
	       |	ВТ_ОстатокСГП.Показатель,
	       |	ВТ_ОстатокСГП.ПорядокПоказателя,
	       |	ВТ_ОстатокСГП.ПорядокГруппыПоказателя,
	       |	ВТ_ОстатокСГП.ВидДвижения,
	       |	ВТ_ОстатокСГП.ПорядокВидаДвижения,
	       |	NULL
	       |ИЗ
	       |	ВТ_ОстатокСГП КАК ВТ_ОстатокСГП
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	ВТ_ВыходПроизводства.Количество,
	       |	ВТ_ВыходПроизводства.Показатель,
	       |	ВТ_ВыходПроизводства.ПорядокПоказателей,
	       |	ВТ_ВыходПроизводства.ПорядокГруппПоказателей,
	       |	ВТ_ВыходПроизводства.ВидДвижения,
	       |	ВТ_ВыходПроизводства.ПорядокВидаДвижения,
	       |	NULL
	       |ИЗ
	       |	ВТ_ВыходПроизводства КАК ВТ_ВыходПроизводства";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_0()
	
	Тест = "ВЫБРАТЬ
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА ""Полуфабрикат: Окоренное сырье""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И НЕ алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА алк_ПараметрыХарактеристик.Порода.Наименование + "" "" + алк_ПараметрыХарактеристик.Длина.Наименование + ЕСТЬNULL(""/"" + алк_ПараметрыХарактеристик.Сорт.Наименование, """") + ЕСТЬNULL(""/"" + Градации.Наименование, """")
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой1""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой2""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон сырой00""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой9990""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА ""Полуфабрикат: Шпон сухой999""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой3""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Окоренное сырье""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Полуфабрикат: Шпон сырой""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой4""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Полуфабрикат: Шпон ребросклеенный""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой5""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Продукция: Поддоны""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Продукция: Фанера""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Продукция: Фанера""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Полуфабрикат: Шпон сухой6""
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		ИНАЧЕ ""Не определен""
	       |	КОНЕЦ КАК Показатель,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА 1
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И НЕ алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА ДЛИНАСТРОКИ(алк_ПараметрыХарактеристик.Порода.Наименование) * 1000 + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 1) + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Порядок, 1) * 10 + ЕСТЬNULL(Градации.От, 1)
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Наименование
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""SP"", ""JP"")
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница <> &СкладБуферУпаковки
	       |			ТОГДА 20
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 1
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 50
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоПоддонов)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 40
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 40
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 20
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |			ТОГДА алк_ПараметрыХарактеристик.Сорт.Порядок
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА 1000 * алк_ПараметрыХарактеристик.Сорт.Порядок
	       |	КОНЕЦ КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА 2
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |				И НЕ алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	       |			ТОГДА 1
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |			ТОГДА 3
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |				И НЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 3
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Производство)
	       |			ТОГДА 2
	       |		КОГДА алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
	       |			ТОГДА 4
	       |	КОНЕЦ КАК ПорядокГруппПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И НЕ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА ""Поступление1 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА ""Возврат (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА ""Поступление2 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление3 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И (алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |					И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005"")
	       |			ТОГДА ""Списание1 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица)
	       |			ТОГДА ""Поступление5 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано1 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА ""На комплектовочный склад""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.пустаяссылка)
	       |			ТОГДА ""Передано2 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА ""Передано3 (-)""
	       |		КОГДА ЛОЖЬ
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |			ТОГДА ""Возврат (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	       |			ТОГДА ""Отгружено на сторону (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание2"") + "" (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление5 (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |			ТОГДА ""Передано4 (-)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |			ТОГДА ""Прочий (-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И НЕ алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Алк_ТипСклада.Производство)
	       |			ТОГДА 20
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И (алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |						И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	       |						И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005""
	       |					ИЛИ алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Пересортица))
	       |			ТОГДА 45
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 55
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	       |			ТОГДА 50
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |			ТОГДА 30
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |			ТОГДА 60
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор
	       |ПОМЕСТИТЬ ВТ_ДвиженияБиржа
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Градации КАК Градации
	       |			ПО (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 >= Градации.От)
	       |				И (алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 <= Градации.До)
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	       |			И алк_ОстаткиЗапасов.Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_1() // "Полуфабрикат: Окоренное сырье"
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""Полуфабрикат: Окоренное сырье"" КАК Показатель,
	       |	1 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 20
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход))
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.ПорядокГруппПоказателей,
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ПорядокПоказателей,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	ВТ_ДвиженияОкоренноеСырье.ПорядокВидаДвижения,
	       |	ВТ_ДвиженияОкоренноеСырье.КоличествоОборот КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_5() // "3. Передел - Производство сырого шпона"
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""3. Передел - Производство сырого шпона"" КАК Показатель,
	       |	5 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 25
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	ВТ_ДвиженияОкоренноеСырье.КоличествоОборот КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_10() // "Полуфабрикат: Шпон сырой"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""Полуфабрикат: Шпон сырой"" КАК Показатель,
	       |	10 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |			ТОГДА 70
	       |		ИНАЧЕ 25
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание))
	       |	И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	ВТ_ДвиженияОкоренноеСырье.КоличествоОборот КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()

// возврат:  только передача с СГП
//  
//
//
Функция ЗапросДвиженияПроизводствоШпон_15() // "4. Передел - Сушка шпона"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""4. Передел - Сушка шпона"" КАК Показатель,
	       |	15 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА ""Возврат (+)""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Выпуск (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА 15
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 666
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Перемещение).СкладОтправитель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП))
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	СУММА(ВТ_ДвиженияОкоренноеСырье.КоличествоОборот) КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()

//**
Функция ЗапросДвиженияПроизводствоШпон_20() // "Полуфабрикат: Шпон сухой"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""Полуфабрикат: Шпон сухой"" КАК Показатель,
	       |	20 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 20
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ((ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP""))
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	СУММА(ВТ_ДвиженияОкоренноеСырье.КоличествоОборот) КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_25() // "6. Передел - Упаковка шпона"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""6. Передел - Упаковка шпона"" КАК Показатель,
	       |	25 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |	И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	СУММА(ВТ_ДвиженияОкоренноеСырье.КоличествоОборот) КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_26() // "5.1 Передел - Ребросклеивание шпона"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""5.1 Передел - Ребросклеивание шпона"" КАК Показатель,
	       |	26 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Выпуск (+)""
	       |		ИНАЧЕ ""Поступление (+)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 30
	       |		ИНАЧЕ 10
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP""))
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	СУММА(ВТ_ДвиженияОкоренноеСырье.КоличествоОборот) КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_30() // "Полуфабрикат: Шпон ребросклеенный"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК Поле1,
	       |	""Полуфабрикат: Шпон ребросклеенный"" КАК Показатель,
	       |	30 КАК Поле2,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Возврат (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 25
	       |		ИНАЧЕ 20
	       |	КОНЕЦ КАК Поле3,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |				И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005"")
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	СУММА(ВТ_ДвиженияОкоренноеСырье.КоличествоОборот) КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_35() // "6. Передел - упаковка лущеного шпона"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""6. Передел - упаковка лущеного шпона"" КАК Показатель,
	       |	35 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	СУММА(ВТ_ДвиженияОкоренноеСырье.КоличествоОборот) КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_36() // "6.1 Передел - Переупаковка шпона"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""6.1 Передел - Переупаковка шпона"" КАК Показатель,
	       |	36 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Перемещение).СкладПолучатель = &СкладБуферУпаковки
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки)
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	СУММА(ВТ_ДвиженияОкоренноеСырье.КоличествоОборот) КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |
	       |СГРУППИРОВАТЬ ПО
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	Показатель,
	       |	ВидДвижения";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_Упаковка() // "сорт"    ДатаНачалаГраница 01.10.2022 8:00:00   ДатаОкончанияГраница 01.11.2022 7:59:59
	
	Тест = "ВЫБРАТЬ
	       |	3 КАК ПорядокГруппПоказателей,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Показатель,
	       |	1000 * алк_ПараметрыХарактеристик.Сорт.Порядок КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.Регистратор.СкладОтправитель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_типСклада.СГП)
	       |			ТОГДА ""Передано с СГП (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА ""На комплектовочный склад""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.Регистратор.СкладОтправитель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_типСклада.СГП)
	       |			ТОГДА 51
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 55
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 20
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот
	       |ПОМЕСТИТЬ ВТ_ДвиженияОкоренноеСырье
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки
	       |;
	       |
	       |////////////////////////////////////////////////////////////////////////////////
	       |ВЫБРАТЬ
	       |	ВТ_ДвиженияОкоренноеСырье.Показатель КАК Показатель,
	       |	ВТ_ДвиженияОкоренноеСырье.ВидДвижения КАК ВидДвижения,
	       |	ВТ_ДвиженияОкоренноеСырье.КоличествоОборот КАК КоличествоОборот
	       |ИЗ
	       |	ВТ_ДвиженияОкоренноеСырье КАК ВТ_ДвиженияОкоренноеСырье
	       |ИТОГИ
	       |	СУММА(КоличествоОборот)
	       |ПО
	       |	ОБЩИЕ,
	       |	ВидДвижения,
	       |	Показатель";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()



Функция ЗапросДвиженияПроизводствоШпон_Объединенный() // "Полуфабрикат: Окоренное сырье"
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""Полуфабрикат: Окоренное сырье"" КАК Показатель,
	       |	1 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 20
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор КАК Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход))
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""3. Передел - Производство сырого шпона"",
	       |	5,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 25
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон сырой"",
	       |	10,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Возврат (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |			ТОГДА 20
	       |		ИНАЧЕ 25
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание))
	       |	И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""4. Передел - Сушка шпона"",
	       |	15,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА ""Возврат (+)""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Выпуск (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Списание (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА 15
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 25
	       |		ИНАЧЕ 666
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон сухой"",
	       |	20,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Списание (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 25
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ((ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP""))
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6. Передел - Упаковка шпона"",
	       |	25,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |	И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""5.1 Передел - Ребросклеивание шпона"",
	       |	26,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон ребросклеенный"",
	       |	30,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Списание (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 25
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"", ""JT"", ""ST"")
	       |				И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005"")
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6. Передел - упаковка лущеного шпона"",
	       |	35,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6.1 Передел - Переупаковка шпона"",
	       |	36,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Перемещение).СкладПолучатель = &СкладБуферУпаковки
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	3,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование,
	       |	1000 * алк_ПараметрыХарактеристик.Сорт.Порядок,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА ""На комплектовочный склад""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 55
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()


Функция ЗапросДвиженияПроизводствоШпон_Объединенный_1() // с уменьшением выпуска на ошибку операторов
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""Полуфабрикат: Окоренное сырье"" КАК Показатель,
	       |	1 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 20
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор КАК Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход))
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""3. Передел - Производство сырого шпона"",
	       |	5,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон сырой"",
	       |	10,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 20
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 99
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание))
	       |	И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""4. Передел - Сушка шпона"",
	       |	15,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА ""Возврат (+)""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Выпуск (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА 15
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 666
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |				И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Перемещение).СкладОтправитель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП))
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон сухой"",
	       |	20,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |					ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |					И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ((ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP""))
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6. Передел - Упаковка шпона"",
	       |	25,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |	И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""5.1 Передел - Ребросклеивание шпона"",
	       |	26,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Выпуск (+)""
	       |		ИНАЧЕ ""Поступление (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 30
	       |		ИНАЧЕ 10
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP""))
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон ребросклеенный"",
	       |	30,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).Основание.Код = ""000000005""
	       |			ТОГДА -алк_ОстаткиЗапасов.Количество
	       |		ИНАЧЕ алк_ОстаткиЗапасов.Количество
	       |	КОНЕЦ
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"", ""JT"", ""ST"")
	       |				И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005"")
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6. Передел - упаковка лущеного шпона"",
	       |	35,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6.1 Передел - Переупаковка шпона"",
	       |	36,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Перемещение).СкладПолучатель = &СкладБуферУпаковки
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	3,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование,
	       |	1000 * алк_ПараметрыХарактеристик.Сорт.Порядок,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА ""На комплектовочный склад""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 55
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки"
		   ;

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()



Функция ЗапросДвиженияПроизводствоШпон_Объединенный_плюс() // "Полуфабрикат: Окоренное сырье"
	
	Тест = "ВЫБРАТЬ
	       |	2 КАК ПорядокГруппПоказателей,
	       |	""Полуфабрикат: Окоренное сырье"" КАК Показатель,
	       |	1 КАК ПорядокПоказателей,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ КАК ВидДвижения,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 20
	       |	КОНЕЦ КАК ПорядокВидаДвижения,
	       |	алк_ОстаткиЗапасов.Регистратор КАК Регистратор,
	       |	алк_ОстаткиЗапасов.Количество КАК КоличествоОборот,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок КАК Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция КАК Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачанаЦПШ)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход))
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""3. Передел - Производство сырого шпона"",
	       |	5,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 25
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон сырой"",
	       |	10,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Передано (-)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Списание (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |			ТОГДА 20
	       |		ИНАЧЕ 25
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Лущение)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание))
	       |	И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""4. Передел - Сушка шпона"",
	       |	15,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА ""Возврат (+)""
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Выпуск (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Списание (-)""
	       |		ИНАЧЕ ""Прочий (+/-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |			ТОГДА 15
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 30
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 25
	       |		ИНАЧЕ 666
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферЛущения)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон сухой"",
	       |	20,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Списание (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 25
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ((ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	       |				ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка))
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP""))
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферСортировки
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6. Передел - Упаковка шпона"",
	       |	25,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |	И НЕ алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""5.1 Передел - Ребросклеивание шпона"",
	       |	26,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""Полуфабрикат: Шпон ребросклеенный"",
	       |	30,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ""Списание (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 25
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Ребросклей)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"")
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |				И алк_ПараметрыХарактеристик.Сорт.Наименование В (""JP"", ""SP"", ""JT"", ""ST"")
	       |				И алк_ОстаткиЗапасов.Регистратор.Основание.Код = ""000000005"")
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6. Передел - упаковка лущеного шпона"",
	       |	35,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	2,
	       |	""6.1 Передел - Переупаковка шпона"",
	       |	36,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		ИНАЧЕ ""Выпуск (+)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		ИНАЧЕ 30
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И (ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка)
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Перемещение).СкладПолучатель = &СкладБуферУпаковки
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Расход)
	       |			ИЛИ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
	       |				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |				И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки)
	       |
	       |ОБЪЕДИНИТЬ ВСЕ
	       |
	       |ВЫБРАТЬ
	       |	3,
	       |	алк_ПараметрыХарактеристик.Сорт.Наименование,
	       |	1000 * алк_ПараметрыХарактеристик.Сорт.Порядок,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА ""Поступление (+)""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА ""На комплектовочный склад""
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА ЕСТЬNULL(алк_ОстаткиЗапасов.Регистратор.Основание.Наименование, ""Списание"") + "" (-)""
	       |		ИНАЧЕ ""Передано (-)""
	       |	КОНЕЦ,
	       |	ВЫБОР
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(видДвиженияНакопления.Приход)
	       |			ТОГДА 10
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И ВЫРАЗИТЬ(алк_ОстаткиЗапасов.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
	       |			ТОГДА 55
	       |		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВиддвиженияНакопления.Расход)
	       |				И алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СкладскиеОперации
	       |				И алк_ОстаткиЗапасов.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
	       |			ТОГДА 70
	       |		ИНАЧЕ 20
	       |	КОНЕЦ,
	       |	алк_ОстаткиЗапасов.Регистратор,
	       |	алк_ОстаткиЗапасов.Количество,
	       |	алк_ОстаткиЗапасов.Регистратор.Участок,
	       |	алк_ОстаткиЗапасов.Регистратор.Операция
	       |ИЗ
	       |	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	       |		ПО алк_ОстаткиЗапасов.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	       |ГДЕ
	       |	алк_ОстаткиЗапасов.Период МЕЖДУ &ДатаНачалаГраница И &ДатаОкончанияГраница
	       |	И алк_ОстаткиЗапасов.СтруктурнаяЕдиница = &СкладБуферУпаковки";

	

КонецФункции // ЗапросДвиженияПроизводствоШпон()
