
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);  
	
	УчастокПриИзмененииНаСервере();
		
КонецПроцедуры


#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапасыВесНеттоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	//РфпРаботаСДокументами.ПересчитатьОбъемСтрокиПоВесу(СтрокаТабличнойЧасти);
	
	ПересчитатьПлотность(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтрокиПоВесу(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


Процедура Конец()
КонецПроцедуры


// Нач мод [Пакушев И.С.] [24.04.2018] 
// Обращение № [0000089575] [ТекстЗаявки]
// Было
// Стало

&НаКлиенте
Процедура ЗапасыОбъемТаможняПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	ПересчитатьПлотность(СтрокаТабличнойЧасти); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьПлотность(СтрокаТабличнойЧасти)  
	
	Если СтрокаТабличнойЧасти.ОбъемТаможня = 0 Тогда		
		СтрокаТабличнойЧасти.Плотность = 0;
	Иначе
		СтрокаТабличнойЧасти.Плотность = СтрокаТабличнойЧасти.ВесНетто * 1000/СтрокаТабличнойЧасти.ОбъемТаможня; 	
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПлотностьПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;

	Если СтрокаТабличнойЧасти.Плотность = 0 Тогда		
		СтрокаТабличнойЧасти.ОбъемТаможня = 0;
	Иначе
		СтрокаТабличнойЧасти.ОбъемТаможня = СтрокаТабличнойЧасти.ВесНетто * 1000/СтрокаТабличнойЧасти.Плотность; 	
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого СтрокаТабличнойЧасти Из Объект.Запасы Цикл
		
		ПересчитатьПлотность(СтрокаТабличнойЧасти);	
	
	КонецЦикла; 
	
КонецПроцедуры

// Кон мод [Пакушев И.С.] [24.04.2018]

&НаСервере
Процедура ЗаполнитьУсловияПоставкиНаСервере()
	
	Объект.УсловияПоставки = Объект.Заказ.УсловияПоставки.Описание;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУсловияПоставки(Команда)
	ЗаполнитьУсловияПоставкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);

КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры






















