
Процедура ЗаписатьДопСведения(ДатаСмены, Смена, Участок, ТЧПроблемы) Экспорт 
	
	НаборЗаписей = РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДатаСмены.Установить(ДатаСмены);
	НаборЗаписей.Отбор.Смена.Установить(Смена);
	НаборЗаписей.Отбор.Участок.Установить(Участок);  
	
	НаборЗаписей.Прочитать();  
	
	НаборЗаписей.Очистить();	
	
	Для Каждого стр ИЗ ТЧПроблемы Цикл  
		
		Запись = НаборЗаписей.Добавить(); 
		
		Запись.ДатаСмены = ДатаСмены;
		Запись.Смена = Смена;
		Запись.Участок = Участок;		
		Запись.Проблема = стр.Проблема;
		
		Запись.НомерЗаписи = стр.НомерСтроки;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(ИСТИНА);	
	
КонецПроцедуры  

Функция ВернутьПроблемыУчастка(ДатаСмены, Смена, Участок) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ДополнительныеСведенияПоУчасткам.НомерЗаписи КАК НомерСтроки,
	               |	алк_ДополнительныеСведенияПоУчасткам.Проблема КАК Проблема
	               |ИЗ
	               |	РегистрСведений.алк_ДополнительныеСведенияПоУчасткам КАК алк_ДополнительныеСведенияПоУчасткам
	               |ГДЕ
	               |	алк_ДополнительныеСведенияПоУчасткам.ДатаСмены = &ДатаСмены
	               |	И алк_ДополнительныеСведенияПоУчасткам.Смена = &Смена
	               |	И алк_ДополнительныеСведенияПоУчасткам.Участок = &Участок";
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Участок", Участок); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


