

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаЗапретаБиржа = Константы.алк_ДатаЗапретаРедактированияБиржа.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказатьПоследовательность();
	
	Если НЕ Строка(ПользователиКлиентСервер.АвторизованныйПользователь()) = "Администратор РФП" Тогда	
		ПодключитьОбработчикОжидания("ПоказатьПоследовательность", 60);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиКоманд

&НаСервере
Процедура ВосстановитьПоследовательностьГПНаСервере()
	
	//РфпСерверРегламентные.ВосстановитьПоследовательностьГП();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ГотоваяПродукция.Регистратор,
	|	алк_ГотоваяПродукция.Период КАК Период
	|ИЗ
	|	Последовательность.алк_ГотоваяПродукция КАК алк_ГотоваяПродукция
	|ГДЕ
	|	алк_ГотоваяПродукция.МоментВремени >= &МоментВремени
	|	И алк_ГотоваяПродукция.Регистратор.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("МоментВремени", Последовательности.алк_ГотоваяПродукция.ПолучитьГраницу());
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Восстановили = Истина;
	
	Сообщение = Новый СообщениеПользователю;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			
			ОбъектПоследовательности = ВыборкаДетальныеЗаписи.Регистратор.ПолучитьОбъект();
			//Элементы.СтрокаСостояния.Заголовок = Формат(ВыборкаДетальныеЗаписи.Регистратор);
			
			Сообщение.Текст = "Проводится документ " + ВыборкаДетальныеЗаписи.Регистратор + " .....";
			//Сообщение.Сообщить(); 
			ОбъектПоследовательности.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			//ОписаниеОшибки()
			Восстановили = Ложь;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ " + ВыборкаДетальныеЗаписи.Регистратор + " не проведен!!!";
			Сообщение.Сообщить(); 
			Прервать;
		КонецПопытки; 
		
		Последовательности.алк_ГотоваяПродукция.УстановитьГраницу(ВыборкаДетальныеЗаписи.Регистратор.МоментВремени());
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоследовательностьБиржаНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_Биржа.Регистратор,
	|	алк_Биржа.Период КАК Период
	|ИЗ
	|	Последовательность.алк_Биржа КАК алк_Биржа
	|ГДЕ
	|	алк_Биржа.МоментВремени >= &МоментВремени
	|	И алк_Биржа.Регистратор.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("МоментВремени", Последовательности.алк_Биржа.ПолучитьГраницу());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Восстановили = Истина;
	
	Сообщение = Новый СообщениеПользователю;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			
			ОбъектПоследовательности = ВыборкаДетальныеЗаписи.Регистратор.ПолучитьОбъект();
			
			ОбъектПоследовательности.ДополнительныеСвойства.Вставить("Обработка","алк_УправлениеПоследовательностями");
			
			Сообщение.Текст = "Проводится документ " + ВыборкаДетальныеЗаписи.Регистратор + " .....";
						
			ОбъектПоследовательности.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			Восстановили = Ложь;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ " + ВыборкаДетальныеЗаписи.Регистратор + " не проведен!!!";
			Сообщение.Сообщить(); 
			Прервать;
		КонецПопытки; 
		
		Последовательности.алк_Биржа.УстановитьГраницу(ВыборкаДетальныеЗаписи.Регистратор.МоментВремени());
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ВосстановитьПоследовательностьГП(Команда)
	
	ВосстановитьПоследовательностьГПНаСервере();
	
	ПоказатьПоследовательность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследовательностьБиржа(Команда)
	
	ВосстановитьПоследовательностьБиржаНаСервере();
	
	ПоказатьПоследовательность();
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаЗапретаБиржаПриИзменении(Элемент)
	ДатаЗапретаБиржаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаЗапретаБиржаПриИзмененииНаСервере()
	
	Если РольДоступна("алк_Администратор") ИЛИ РольДоступна("алк_ДополнительныеПраваТехнолог") Или РольДоступна("ПолныеПрава") Тогда
		
		Константы.алк_ДатаЗапретаРедактированияБиржа.Установить(ДатаЗапретаБиржа);
		
	Иначе
		Если(День(ТекущаяДата()) >= 3) Тогда
			
			Если ДатаЗапретаБиржа < НачалоМесяца(ТекущаяДата()) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Период закрыт!!!";
				Сообщение.Сообщить();
				
				ДатаЗапретаБиржа = Константы.алк_ДатаЗапретаРедактированияБиржа.Получить();
				Возврат;
			Иначе
				Константы.алк_ДатаЗапретаРедактированияБиржа.Установить(ДатаЗапретаБиржа);
			КонецЕсли; 
		Иначе	
			Если ДатаЗапретаБиржа < НачалоМесяца(НачалоМесяца(ТекущаяДата())-1) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Период закрыт!!!";
				Сообщение.Сообщить();
				
				ДатаЗапретаБиржа = Константы.алк_ДатаЗапретаРедактированияБиржа.Получить();
				Возврат;
			Иначе
				Константы.алк_ДатаЗапретаРедактированияБиржа.Установить(ДатаЗапретаБиржа);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 


#Область СлужебныеПиФ

&НаКлиенте
Процедура ПоказатьПоследовательность() 
	
	Элементы.СостояниеПоследовательности.Заголовок = "";
	Элементы.СостояниеПоследовательностиБиржа.Заголовок = "";
	Элементы.ГраницаПоследовательностиБиржа.Заголовок = "";
	
	ДатаГраницаПоследГП = ПолучитьДатуГраницыПродукцияНаСервере();
	
	Элементы.СостояниеПоследовательности.Заголовок = "Граница последовательности по документам (готовая продукция): " + ДатаГраницаПоследГП;
	
	Если (ТекущаяДата() - ДатаГраницаПоследГП) > 3600*24*3  Тогда
		
		Элементы.СостояниеПоследовательности.ЦветТекста = WebЦвета.Красный;
		Элементы.СостояниеПоследовательности.Заголовок = Элементы.СостояниеПоследовательности.Заголовок + ". Необходимо восстановление!";
		
	Иначе
		Элементы.СостояниеПоследовательности.ЦветТекста = WebЦвета.Черный;
		
	КонецЕсли; 
	
	МоментВремениГр = ПолучитьГраницуПродукцияНаСервере();
	
	Элементы.ГраницаПоследовательностиПродукция.Заголовок = Строка(МоментВремениГр) + " " + СотрудникПроводивший(МоментВремениГр);
	
	//------------------------------------------------------------------------------------------------------------------------
	
	ДатаГраницаПоследБиржа = ПолучитьДатуГраницыБиржаНаСервере();
	
	Элементы.СостояниеПоследовательностиБиржа.Заголовок = "Граница последовательности по документам (биржа): " + ДатаГраницаПоследБиржа;
	
	Если (ТекущаяДата() - ДатаГраницаПоследБиржа) > 3600*24*3  Тогда
		
		Элементы.СостояниеПоследовательностиБиржа.ЦветТекста = WebЦвета.Красный;
		Элементы.СостояниеПоследовательностиБиржа.Заголовок = Элементы.СостояниеПоследовательностиБиржа.Заголовок + ". Необходимо восстановление!";
		
	Иначе
		Элементы.СостояниеПоследовательностиБиржа.ЦветТекста = WebЦвета.Черный;
		
	КонецЕсли; 
	
	МоментВремениГр = ПолучитьГраницуБиржаНаСервере();
	
	Элементы.ГраницаПоследовательностиБиржа.Заголовок = Строка(МоментВремениГр) + " " + СотрудникПроводивший(МоментВремениГр);
	
КонецПроцедуры 

&НаСервере
Функция СотрудникПроводивший(МоментВремени)
	
	Ссылка = МоментВремени.Ссылка;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алк_ДокументыПоследовательностиБиржаОбороты.Сотрудник
		|ИЗ
		|	РегистрНакопления.алк_ДокументыПоследовательностиБиржа.Обороты(, , Регистратор, ) КАК алк_ДокументыПоследовательностиБиржаОбороты
		|ГДЕ
		|	алк_ДокументыПоследовательностиБиржаОбороты.Регистратор = &Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ДокументыПоследовательностиБиржаОбороты.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать(); Выборка.Следующий();
		
		Сотрудник = Выборка.Сотрудник;
		
		Возврат Сотрудник.Наименование;
		
	Иначе
		
		Возврат "";

	КонецЕсли; 
	
		
КонецФункции
 

&НаСервере
Функция ПолучитьДатуГраницыПродукцияНаСервере()
	
	Возврат Последовательности.алк_ГотоваяПродукция.ПолучитьГраницу().Дата;
	
КонецФункции

&НаСервере
Функция ПолучитьДатуГраницыБиржаНаСервере()
	
	Возврат Последовательности.алк_Биржа.ПолучитьГраницу().Дата;
	
КонецФункции

&НаСервере
Функция ПолучитьГраницуБиржаНаСервере()
	
	Возврат Последовательности.алк_Биржа.ПолучитьГраницу();
	
КонецФункции

&НаСервере
Функция ПолучитьГраницуПродукцияНаСервере()
	
	Возврат Последовательности.алк_ГотоваяПродукция.ПолучитьГраницу();
	
КонецФункции

#КонецОбласти 


&НаКлиенте
Процедура ДатыЗапретаИзмененияДанных(Команда)
	
	ОткрытьФорму("РегистрСведений.ДатыЗапретаИзменения.Форма.ДатыЗапретаИзменения");
	
КонецПроцедуры


Процедура Конец()		
КонецПроцедуры

