
Процедура ПередЗаписью(Отказ)
	Если Не РольДоступна("алк_Администратор") Тогда
		Отказ = ЭтоДублер(Владелец, ДлинаММ);	
	КонецЕсли;
	
	СформироватьНаименование();	
	
КонецПроцедуры

Процедура СформироватьНаименование()
	
	Если Владелец = Справочники.КатегорииНоменклатуры.Пиломатериал ИЛИ Владелец = Справочники.КатегорииНоменклатуры.ПиломатериалСП Тогда
		Наименование = Формат(ДлинаММ/1000, "ЧДЦ=3; ЧРД=.; ЧГ=");
		НаименованиеПолное = Формат(ДлинаММ, "ЧГ=") + " (мм.)";
	ИначеЕсли Владелец = Справочники.КатегорииНоменклатуры.Пиловочник ИЛИ Владелец = Справочники.КатегорииНоменклатуры.Окорка Тогда
		Наименование = Формат(ДлинаММ/1000, "ЧРД=.; ЧГ=");
		НаименованиеПолное = Формат(ДлинаММ, "ЧГ=") + " (мм.)";	
	Иначе
		Наименование = Формат(ДлинаММ, "ЧГ=");
		НаименованиеПолное = Наименование + " (мм.)";	
	КонецЕсли; 
	
КонецПроцедуры

Функция ЭтоДублер(ВладелецСправочника, КонтролируемыйРеквизит)
	
	Дубль = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Длины.Ссылка
	|ИЗ
	|	Справочник.Длины КАК Длины
	|ГДЕ
	|	Длины.Владелец = &Владелец
	|	И Длины.ДлинаММ = &ДлинаММ
	|	И НЕ Длины.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", ВладелецСправочника);
	Запрос.УстановитьПараметр("ДлинаММ", КонтролируемыйРеквизит);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Дубль = Истина;
		
	КонецЕсли; 
	
	Возврат Дубль;
	
КонецФункции // ЭтоДублер()


