/////////////////////////////////////// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ /////////////////////////////////////////////////////////////////

Функция ПреобразоватьСтрокуВДату(СтрокаДата)
	СтрокаДатаБезЧерточек = СтрЗаменить(СтрокаДата,"-","");
	СтрокаДатаБезT = СтрЗаменить(СтрокаДатаБезЧерточек,"T","");
	СтрокаДатаБезДвоеточия = СтрЗаменить(СтрокаДатаБезT,":","");
	Попытка 
		НД = Дата(СтрокаДатаБезДвоеточия);
		Возврат НД;
	Исключение
		Возврат Неопределено
	КонецПопытки;
КонецФункции  

Функция ПреобразоватьСтрокуВБулево(СтрокаБулево)
	Если НРег(СтрокаБулево) = "истина" Тогда 
		Возврат Истина;
	ИначеЕсли НРег(СтрокаБулево) = "ложь" Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции  

Функция ПреобразоватьДатуВСтроку(Дата,НФорматДатаВремя=Ложь) 
	Если НЕ НФорматДатаВремя Тогда 
		Возврат Формат(Дата, "ДФ=yyyy-MM-dd-HHmmss"); 
	Иначе 
		Возврат Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss");
	КонецЕсли;
КонецФункции

Процедура ДобавитьЗаписьВМассивJSON(Запись,ИмяСвойства,Значение)
	Запись.ЗаписатьИмяСвойства(ИмяСвойства);
	Запись.ЗаписатьЗначение(Значение);
КонецПроцедуры

Функция ВернутьОтветJSON(Таб,НФорматДатаВремя=Ложь)
	
	Запись = Новый ЗаписьJSON;   
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);  
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON); 
	
	Запись.ЗаписатьНачалоМассива();  
	
	Для Каждого Стр ИЗ Таб Цикл 
		
		Запись.ЗаписатьНачалоОбъекта();
		
		Для Каждого Колонка ИЗ Таб.Колонки Цикл 
			
			Если ТипЗнч(Стр[Колонка.Имя]) = Тип("Дата") Тогда 
				
				ДобавитьЗаписьВМассивJSON(Запись,Колонка.Имя,ПреобразоватьДатуВСтроку(Стр[Колонка.Имя],НФорматДатаВремя));
				
			ИначеЕсли ТипЗнч(Стр[Колонка.Имя]) = Тип("ТаблицаЗначений") Тогда 
				
				Запись.ЗаписатьИмяСвойства(Колонка.Имя);
				Запись.ЗаписатьНачалоМассива();
				
				Для Каждого строкитз ИЗ Стр[Колонка.Имя] Цикл
					
					Запись.ЗаписатьНачалоОбъекта();
					
					Для Каждого колонкитз ИЗ Стр[Колонка.Имя].Колонки Цикл   
						
						Значение = строкитз[колонкитз.Имя];
						
						Если ТипЗнч(Значение) = Тип("Дата") Тогда
							Значение = ПреобразоватьДатуВСтроку(Значение,НФорматДатаВремя);
						КонецЕсли; 
						
						ДобавитьЗаписьВМассивJSON(Запись,колонкитз.Имя,Значение);	
						
					КонецЦикла;
					
					Запись.ЗаписатьКонецОбъекта();
					
				КонецЦикла;
				
				Запись.ЗаписатьКонецМассива();
				
			Иначе
				
				ДобавитьЗаписьВМассивJSON(Запись,Колонка.Имя,Стр[Колонка.Имя]);
				
			КонецЕсли;		 
			
		КонецЦикла;  
		
		Запись.ЗаписатьКонецОбъекта(); 
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецМассива();	
	
	Возврат Запись.Закрыть();  
	
КонецФункции 

Функция ДобавлениеКолонкиСтруктурыКолДлинБревен(СтруктураТЗ,ТЗ)	
				
	Для Каждого эл ИЗ ТЗ Цикл 
		
		//добавляемое поле (таблица значений)
		Struct = Новый ТаблицаЗначений;
		
		Struct.Колонки.Добавить("Count");
		
		Struct.Колонки.Добавить("Length");
		
		strStruct = Struct.Добавить();
		
		strStruct.Count = эл.Count; 
		
		strStruct.Length = эл.Length;
		//\\
		
		//добавляем строку в новую ТЗ
		стрФормируемаяТЗ = СтруктураТЗ.Добавить();
		
		ЗаполнитьЗначенияСвойств(стрФормируемаяТЗ,эл);
		
		стрФормируемаяТЗ.Struct = Struct;
		//\\
				
	КонецЦикла;
	
	Возврат СтруктураТЗ;
	
КонецФункции

Функция ДобавлениеКолонкиСтруктурыДатПростоев(СтруктураТЗ,ТЗ)	
				
	Для Каждого эл ИЗ ТЗ Цикл 
		
		//добавляемое поле (таблица значений)
		Struct = Новый ТаблицаЗначений;
		
		Struct.Колонки.Добавить("DowntimeStart");
		
		Struct.Колонки.Добавить("DowntimeFinish");
		
		Struct.Колонки.Добавить("DowntimeGroup");
		
		strStruct = Struct.Добавить();
		
		strStruct.DowntimeStart = эл.DowntimeStart; 
		
		strStruct.DowntimeFinish = эл.DowntimeFinish;
		
		strStruct.DowntimeGroup = эл.DowntimeGroup;
		//\\
		
		//добавляем строку в новую ТЗ
		стрФормируемаяТЗ = СтруктураТЗ.Добавить();
		
		ЗаполнитьЗначенияСвойств(стрФормируемаяТЗ,эл);
		
		стрФормируемаяТЗ.Struct = Struct;
		//\\
				
	КонецЦикла;
	
	Возврат СтруктураТЗ;
	
КонецФункции


Функция ФормируемСтруктуруТЗДляОбменаLumberStoreMonitoring()
	
	ФормируемаяТЗ = Новый ТаблицаЗначений;
	
	ФормируемаяТЗ.Колонки.Добавить("StoreCode");
	ФормируемаяТЗ.Колонки.Добавить("PacketNumber");
	ФормируемаяТЗ.Колонки.Добавить("WoodKindCode");
	ФормируемаяТЗ.Колонки.Добавить("ThicknessProd");
	ФормируемаяТЗ.Колонки.Добавить("WidthProd");
	ФормируемаяТЗ.Колонки.Добавить("TypeProdCode");
	ФормируемаяТЗ.Колонки.Добавить("GradeCode");
	ФормируемаяТЗ.Колонки.Добавить("Volume");
	ФормируемаяТЗ.Колонки.Добавить("Wetness");
	ФормируемаяТЗ.Колонки.Добавить("SawType");
	ФормируемаяТЗ.Колонки.Добавить("PacketCode");
	ФормируемаяТЗ.Колонки.Добавить("WorkCenterCode");
	ФормируемаяТЗ.Колонки.Добавить("DateCreate");
	ФормируемаяТЗ.Колонки.Добавить("DateIncome"); 
	ФормируемаяТЗ.Колонки.Добавить("DateOutcome"); 
	ФормируемаяТЗ.Колонки.Добавить("DateRequest"); 
	ФормируемаяТЗ.Колонки.Добавить("TunnelCode");
	ФормируемаяТЗ.Колонки.Добавить("Struct",Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат ФормируемаяТЗ;  
	
КонецФункции

Функция ФормируемСтруктуруТЗДляОбменаWorkScheduleMonitoring()
	
	ФормируемаяТЗ = Новый ТаблицаЗначений;

	ФормируемаяТЗ.Колонки.Добавить("DepartmentCode");
	ФормируемаяТЗ.Колонки.Добавить("ShiftStart");
	ФормируемаяТЗ.Колонки.Добавить("ShiftFinish");
	ФормируемаяТЗ.Колонки.Добавить("ShiftNameCode");
	ФормируемаяТЗ.Колонки.Добавить("PlanDowntime",Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат ФормируемаяТЗ;  
	
КонецФункции
 
Функция Разложить(Знач Стр, Разделитель = ",") 
	
	Если Стр = Неопределено Тогда 
		Возврат Новый Массив;
	КонецЕсли;
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Если Стр <> "" Тогда
		Список.Добавить(Стр);
	КонецЕсли;
	
	Возврат Список;
	
КонецФункции //Разложить()

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////// ОТВЕТЫ К ЗАПРОСАМ ОПТИ СОФТ /////////////////////////////////////////////////////////////

Функция WoodStoreMonitoringAction(Запрос) 
		
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса.Получить("date"); 
	
	Если ПараметрыЗапроса = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПараметрыЗапроса); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапросаWoodStoreMonitoring(); 
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаЗапроса) + 8*3600);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000001")); //Участок сортированных ЛМ 
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002")); //пиловочник
	Запрос.УстановитьПараметр("КодКлассификацииКатегорий", "00000000001"); //за 2024г.  

	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.StoreCode = "";
		Стр.WoodKindCode = "";
		Стр.SortGroupCode = "";
		Стр.Diameter = 0; 
		Стр.Length = 0;
		Стр.Count = 0;
		Стр.Volume = 0;	
	КонецЕсли;
		
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;
	
КонецФункции

Функция WoodTransportMonitoringAction(Запрос) 
		
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса.Получить("date"); 
	
	Если ПараметрыЗапроса = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПараметрыЗапроса); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапросаWoodTransportMonitoring();
	Запрос.УстановитьПараметр("ДатаНачалаСмены", НачалоДня(ДатаЗапроса)+ 7*3600+59*60+59); //7:59:59
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.TransportCode = 0;
		Стр.TransportNo = "";
		Стр.DeliveryDate = "";
		Стр.UnloadingDate = ""; 
		Стр.WoodKindCode = "";
		Стр.Volume = 0;	
	КонецЕсли;
		
	Ответ = ВернутьОтветJSON(ТЗ,Истина);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет; 
	
КонецФункции

Функция WoodTransportMonitoringStructAction(Запрос)
			
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса.Получить("date"); 
	
	Если ПараметрыЗапроса = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПараметрыЗапроса); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;   
	
	НачалоДневнойСмены = НачалоДня(ДатаЗапроса) + 8*3600;
	НачалоНочнойСмены = НачалоДня(ДатаЗапроса) + 20*3600;
	
	Если ДатаЗапроса < НачалоНочнойСмены И ДатаЗапроса >= НачалоДневнойСмены Тогда 
		НачалоСмены = НачалоДневнойСмены; 
	Иначе
		НачалоСмены = НачалоНочнойСмены - 24*3600; 
	КонецЕсли;
	
	Запрос.Текст = ПолучитьТекстЗапросаWoodTransportMonitoringStruct(); 
	Запрос.УстановитьПараметр("ДатаНачалаСмены", НачалоСмены); 
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаЗапроса);

	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.TransportCode = 0;
		Стр.WoodKindCode = "";
		Стр.GradeCode = "";
		Стр.SortGroupCode = ""; 
		Стр.Diameter = 0;
		Стр.Length = 0;
		Стр.Count = 0;
		Стр.Volume = 0;	
	КонецЕсли;
			
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет; 
	
КонецФункции

Функция LumberStoreMonitoringAction(Запрос)
			
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса.Получить("date"); 
	
	Если ПараметрыЗапроса = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПараметрыЗапроса); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;   
	
	Запрос.Текст = ПолучитьТекстЗапросаLumberStoreMonitoring(); 
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаЗапроса);

	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.StoreCode = "";
		Стр.PacketNumber = "";
		Стр.ThicknessProd = 0;
		Стр.WoodKindCode = "";
		Стр.WidthProd = 0;
		Стр.TypeProdCode = "";
		Стр.GradeCode = "";
		Стр.Wetness = 0;
		Стр.SawType = 0;
		Стр.WorkCenterCode = "";
		Стр.DateCreate = "";
		Стр.DateIncome = "";
		Стр.DateOutcome = ""; 
		Стр.DateRequest = ""; 
		Стр.TunnelCode = "";
		Стр.PacketCode = "";
		Стр.Volume = 0;
		Стр.Count = 0;
		Стр.Length = 0;
	КонецЕсли;
	
	НоваяТЗ = ДобавлениеКолонкиСтруктурыКолДлинБревен(ФормируемСтруктуруТЗДляОбменаLumberStoreMonitoring(),ТЗ);
			
	Ответ = ВернутьОтветJSON(НоваяТЗ,Истина);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет; 
	
КонецФункции

Функция WorkScheduleMonitoringAction(Запрос) 
	
	// таблицы результата
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("DepartmentCode"); // участок
	ТЗ.Колонки.Добавить("ShiftStart");     // начало смены
	ТЗ.Колонки.Добавить("ShiftFinish");    // конец смены
	ТЗ.Колонки.Добавить("ShiftNameCode");  // номер бригады
	ТЗ.Колонки.Добавить("PlanDowntime");   // сюда ТЗ с простоями по смене  
	
	ТЗ_Простои = Новый ТаблицаЗначений;
	
	ТЗ_Простои.Колонки.Добавить("DowntimeStart");	// начало простоя	
	ТЗ_Простои.Колонки.Добавить("DowntimeFinish");	// конец простоя
	ТЗ_Простои.Колонки.Добавить("DowntimeGroup");  	// код вида простоя 

	//
			
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса.Получить("date");
	ПараметрыЗапросаУчастки = Запрос.ПараметрыЗапроса.Получить("DepartmentCode");
	
	Если ПараметрыЗапроса = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПараметрыЗапроса); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;   
	
	КодыУчастков = Разложить(ПараметрыЗапросаУчастки, ";");
	
	Запрос.Текст = ПолучитьТекстЗапросаWorkScheduleMonitoring(); 
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(ДатаЗапроса));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(ДатаЗапроса));
	Запрос.УстановитьПараметр("ВсеУчастки", КодыУчастков.Количество() = 0 );
	Запрос.УстановитьПараметр("КодыУчастков", КодыУчастков);    
	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаDepartmentCode = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаDepartmentCode.Следующий() Цикл    // участки
		
		ВыборкаShiftStart = ВыборкаDepartmentCode.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаShiftStart.Следующий() Цикл   // смены 
			
			НоваяСтр = ТЗ.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаShiftStart); 
				
			ВыборкаДетальныеЗаписи = ВыборкаShiftStart.Выбрать();
			
			ТЗ_Простои.Очистить();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				
				НоваяСтр_Простои = ТЗ_Простои.Добавить();			
				ЗаполнитьЗначенияСвойств(НоваяСтр_Простои, ВыборкаДетальныеЗаписи);
				
			КонецЦикла;      		
			
			НоваяСтр.PlanDowntime = ТЗ_Простои.Скопировать();  		
			
		КонецЦикла;  
		
	КонецЦикла;	
				
	Ответ = ВернутьОтветJSON(ТЗ,Истина);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;
	
КонецФункции

Функция TunnelsStatusMonitoringAction(Запрос)
			
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса.Получить("date"); 
	
	Если ПараметрыЗапроса = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПараметрыЗапроса); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = ПолучитьТекстЗапросаTunnelsStatusMonitoring(); 
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ДатаЗапроса,-2)); //на два месяца назад
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаЗапроса);

	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.TunnelCode = "";
		Стр.DateStart = "";
		Стр.DateFinish = "";
	КонецЕсли;   
			
	Ответ = ВернутьОтветJSON(ТЗ,Истина);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет; 
	
КонецФункции

Функция IdleEquipmentAction(Запрос)   
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();	
	
	Ответ = СоздатьДокументыПростоя(СтрокаJSON);
			
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","application/json");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;

КонецФункции

Функция VeneerLogMonitoring(Запрос)  
	
	//Параметры 
	//Параметер Тип       Назначение
	//dateFrom  DateTime  Дата и время начала периода (формат: 2025-07-31T20:30:15)
	//dateTo    DateTime  Дата и время конца периода
	//Type      String    In – подача на линию; out — выпуск; если «» или Null – не фильтровать - необязательный
	//LineCode  String    Код линии, если «» или Null – не фильтровать - необязательный
	
	//Пример http://rfp04-srv046/ut_lk/hs/OptiMonitoring/VeneerLogMonitoring/?dateFrom=2025-07-09T08:00:00&dateTo=2025-07-10T07:59:59&Type=In&LineCode=000000015
	
	ДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");  
	ДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo"); 
	
	Если ДатаС = Неопределено ИЛИ ДатаПо = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаС = ПреобразоватьСтрокуВДату(ДатаС); 
	ДатаПо = ПреобразоватьСтрокуВДату(ДатаПо);
	
	Если ДатаС = Неопределено ИЛИ ДатаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Тип = Запрос.ПараметрыЗапроса.Получить("Type"); 
	Выпуск = Истина;
	Подача = Истина;
	Если НЕ Тип = Неопределено И НЕ НРег(Тип) = "null" Тогда 
		Если ЗначениеЗаполнено(Тип) Тогда 
			Если НРег(Тип) = "in" Тогда //Подача на линию
				Выпуск = Ложь;
			Иначе 
				Подача = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	КодУчастка = Запрос.ПараметрыЗапроса.Получить("LineCode");
	Участки = Новый Массив; 
	Если НЕ КодУчастка = Неопределено И НЕ НРег(КодУчастка) = "null" Тогда 
		Если ЗначениеЗаполнено(КодУчастка) Тогда 
			Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду(КодУчастка));
		КонецЕсли;
	КонецЕсли;
	
	Если Участки.Количество() = 0 Тогда 
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000021")); //ЛИНИЯ УПАКОВКИ ШПОНА 
		
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000013")); //ЛИНИЯ СУШКИ ШПОНА №1
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000014")); //ЛИНИЯ СУШКИ ШПОНА №2
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000015")); //ЛИНИЯ СУШКИ ШПОНА №3
		
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000010")); //ЛИНИЯ ЛУЩЕНИЯ №1
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000011")); //ЛИНИЯ ЛУЩЕНИЯ №2
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000012")); //ЛИНИЯ ЛУЩЕНИЯ №3
		
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000017")); //РЕБРОСКЛЕИВАЮЩИЙ СТАНОК №1
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000018")); //РЕБРОСКЛЕИВАЮЩИЙ СТАНОК №2
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000019")); //РЕБРОСКЛЕИВАЮЩИЙ СТАНОК №3 
		Участки.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000020")); //РЕБРОСКЛЕИВАЮЩИЙ СТАНОК №4
	КонецЕсли;
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = ПолучитьТекстЗапросаVeneerLogMonitoring(); 
	Запрос.УстановитьПараметр("НачалоПериода", ДатаС); 
	Запрос.УстановитьПараметр("КонецПериода", ДатаПо);
	Запрос.УстановитьПараметр("Участок", Участки);
	Запрос.УстановитьПараметр("Выпуск", Выпуск);
	Запрос.УстановитьПараметр("Подача", Подача);
    
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.DateLog = "";
		Стр.PacketNumber = "";
		Стр.WoodKindCode = "";
		Стр.GradeCode = "";
		Стр.isWet = 0;
		Стр.Thickness = 0;
		Стр.Width = 0;
		Стр.Length = 0;
		Стр.Count = 0;
		Стр.Volume = 0; 
		Стр.Type = "";
		Стр.LineCode = "";
	КонецЕсли;   
			
	Ответ = ВернутьОтветJSON(ТЗ,Истина);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","application/json");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;

КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



//////////////////////////// СОЗДАНИЕ ДОКУМЕНТОВ //////////////////////////////////////////////////////////////////////////////  

Функция СоздатьДокументыПростоя(СтрокаJSON)  	
		
	ЧтениеJSON = Новый ЧтениеJSON;
	
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON); 
	
	ПоляДат = Новый Массив;
	ПоляДат.Добавить("StartTime");
	ПоляДат.Добавить("EndTime");
	
	Простои = ПрочитатьJSON(ЧтениеJSON,, ПоляДат, ФорматДатыJSON.ISO);
		
	//  Формат получаемых данных:
	//
	//"ID":2056, 
	//"LineCode":"000000010",
	//"EquipmentID":173,
	//"PositionID":173, 
	//"IdleReasonID":1,
	//"Comment":"TEST",
	//"MasterID":61,
	//"OperatorID":75,
	//"SupervisorID":null,
	//"StartTime":"2024-12-04T08:00:00",
	//"EndTime":"2024-12-04T20:00:00", 
	
	Запись = Новый ЗаписьJSON; 
	//Запись.ПроверятьСтруктуру = Ложь; // отключаем проверку для ускорения
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);  
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON); 
	
	Запись.ЗаписатьНачалоМассива();	
	
	Для каждого Стр Из Простои Цикл  
		
		Отказ = Ложь;
		КодОшибки = 200;
		ТекстОшибки = "";		
		
		Если Не ЗначениеЗаполнено(Стр.ID) Тогда 
			
			Отказ = Истина;
			
			КодОшибки = 400;
			ТекстОшибки = "Не заполнено ID простоя!";
			
		Иначе	
			  		
			// получаем машинный центр сначала PositionID потом по EquipmentID, если в этих полях передоно "-1", 
			// указываем пустую сслыку на машинный центр, а участок ищем по LineCode 
			
			МашинныйЦентр = ПолучитьМЦ(Стр.PositionID, Стр.EquipmentID, Стр.LineCode, ТекстОшибки, Отказ);   //Структура
			
			ДокПростой = ПолучитьДокументПростоя(Стр.ID); 
			
			
			Если Ложь Тогда                                                                       			
				ДокПростой = Документы.алк_ПростойОборудования.НайтиПоНомеру("").ПолучитьОбъект();			
			КонецЕсли; 
			
			ДокПростой.Автозагрузка = Истина;
			
			Если ЗначениеЗаполнено(МашинныйЦентр.Участок) И ЗначениеЗаполнено(Стр.StartTime) Тогда
				ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(МашинныйЦентр.Участок, Стр.StartTime); 	
				
				Если ЗначениеЗаполнено(ПараметрыСменыПоТекущейДате) Тогда
					ЗаполнитьЗначенияСвойств(ДокПростой, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
				Иначе 
					Отказ = Истина;
					ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Ошибка получения смены по участку.";				
				КонецЕсли;				
			КонецЕсли;      		
			
			ДокПростой.Дата = Стр.StartTime;		
			ДокПростой.ID = Стр.ID;
			ДокПростой.Комментарий = Стр.Comment;
			ДокПростой.Участок = МашинныйЦентр.Участок;
			ДокПростой.Цех = МашинныйЦентр.Цех;
			
			ДокПростой.Мастер = ПолучитьПользователя(Стр.MasterID, ТекстОшибки, "MasterID", Отказ);
			ДокПростой.Ответственный = ПолучитьПользователя(Стр.OperatorID, ТекстОшибки, "OperatorID", Отказ); 		
			ДокПростой.Диспетчер = ПолучитьПользователя(Стр.SupervisorID, ТекстОшибки, "SupervisorID", Отказ); 
			       		
			ТабличнаяЧасть = ДокПростой.ТабличнаяЧасть;
			ТабличнаяЧасть.Очистить();
			
			НоваяСтр = ТабличнаяЧасть.Добавить();  
			НоваяСтр.Дата = ДокПростой.ДатаСмены;
			НоваяСтр.МашинныйЦентр = МашинныйЦентр.МашинныйЦентр;
			НоваяСтр.Простой = ПолучитьПростой(Стр.IdleReasonID, ТекстОшибки, Отказ);   //Ссылка 		
			НоваяСтр.Комментарий = ДокПростой.Комментарий;
			
			НоваяСтр.ВремяНачала = '00010101' + (Стр.StartTime - НачалоДня(Стр.StartTime));
			НоваяСтр.ВремяЗавершения = '00010101' + (Стр.EndTime - НачалоДня(Стр.StartTime));    
			
			Если НоваяСтр.ВремяНачала > НоваяСтр.ВремяЗавершения Тогда   		
				НоваяСтр.ВремяПростоя = (НоваяСтр.ВремяЗавершения + 24*3600) - НоваяСтр.ВремяНачала; 		
			Иначе 
				НоваяСтр.ВремяПростоя = НоваяСтр.ВремяЗавершения - НоваяСтр.ВремяНачала;   // получаем в секундах   		
			КонецЕсли;  		
			
			Если Отказ = Ложь Тогда 			
				
				Попытка
					ДокПростой.Записать(РежимЗаписиДокумента.Проведение);	
					КодОшибки = 201;
					ТекстОшибки = "Успех" + ?(ТекстОшибки = "", "", "; ") + ТекстОшибки;		
				Исключение
					КодОшибки = 501;  
					ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Ошибка записи документа!" + ОписаниеОшибки();
				КонецПопытки; 				
				
			Иначе				
				КодОшибки = 501;			
			КонецЕсли;			
			
		КонецЕсли;  
		
		Запись.ЗаписатьНачалоОбъекта();
		
		ДобавитьЗаписьВМассивJSON(Запись,"ID", Стр.ID);
		ДобавитьЗаписьВМассивJSON(Запись,"ErrorCode", КодОшибки);
		ДобавитьЗаписьВМассивJSON(Запись,"ErrorMessage", ТекстОшибки);
		
		Запись.ЗаписатьКонецОбъекта();   
		
		Сообщить("" + КодОшибки +": " + ТекстОшибки);
		
	КонецЦикла;	 
	
	Запись.ЗаписатьКонецМассива(); 
	
	Возврат Запись.Закрыть(); 
	
КонецФункции   

Функция ПолучитьМЦ(PositionID, EquipmentID, LineCode, ТекстОшибки, Отказ)  
	
	МашинныйЦентр = Новый Структура; 
	МашинныйЦентр.Вставить("МашинныйЦентр",	Справочники.алк_МашинныйЦентр.ПустаяСсылка());
	МашинныйЦентр.Вставить("Участок", 		Справочники.алк_Участки.ПустаяСсылка());
	МашинныйЦентр.Вставить("Цех", 			Справочники.алк_Цеха.ПустаяСсылка());
   	
	Если PositionID = -1 или EquipmentID = -1 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_Участки.Ссылка КАК Участок,
		|	алк_Участки.Цех КАК Цех
		|ИЗ
		|	Справочник.алк_Участки КАК алк_Участки
		|ГДЕ
		|	алк_Участки.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", LineCode);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 		
		
		Если РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Участок LineCode " + LineCode + " не найден";
		КонецЕсли;    	
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МашинныйЦентр.Вставить("Участок",	ВыборкаДетальныеЗаписи.Участок);
			МашинныйЦентр.Вставить("Цех", 		ВыборкаДетальныеЗаписи.Цех);	
		КонецЦикла; 
		
		Возврат МашинныйЦентр;
		
	КонецЕсли; 	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_МашинныйЦентр.Ссылка КАК МашинныйЦентр,
		|	алк_МашинныйЦентр.Участок,
		|	алк_МашинныйЦентр.Участок.Цех КАК Цех,
		|	1 КАК Порядок
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.алк_МашинныйЦентр КАК алк_МашинныйЦентр
		|ГДЕ
		|	алк_МашинныйЦентр.EquipmentID = &PositionID
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_МашинныйЦентр.Ссылка,
		|	алк_МашинныйЦентр.Участок,
		|	алк_МашинныйЦентр.Участок.Цех,
		|	2
		|ИЗ
		|	Справочник.алк_МашинныйЦентр КАК алк_МашинныйЦентр
		|ГДЕ
		|	алк_МашинныйЦентр.EquipmentID = &EquipmentID
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ.МашинныйЦентр,
		|	ВТ.Участок,
		|	ВТ.Цех,
		|	ВТ.Порядок КАК Порядок
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("PositionID", ?(ЗначениеЗаполнено(PositionID), PositionID, 999999999999));
	Запрос.УстановитьПараметр("EquipmentID", EquipmentID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Машинный центр по коду PositionID " + PositionID + " не найден";
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Машинный центр по коду EquipmentID " + EquipmentID + " не найден";
	КонецЕсли;
	
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МашинныйЦентр.Вставить("МашинныйЦентр",	ВыборкаДетальныеЗаписи.МашинныйЦентр);
		МашинныйЦентр.Вставить("Участок", 		ВыборкаДетальныеЗаписи.Участок);
		МашинныйЦентр.Вставить("Цех", 			ВыборкаДетальныеЗаписи.Цех);	
	КонецЦикла;  
	
	Возврат МашинныйЦентр;
		
 
 КонецФункции // ПолучитьМЦ()

Функция ПолучитьПростой(IdleReasonID, ТекстОшибки, Отказ)    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_Простой.Ссылка
		|ИЗ
		|	Справочник.алк_Простой КАК алк_Простой
		|ГДЕ
		|	алк_Простой.IdleReasonID = &IdleReasonID
		|	И алк_Простой.IdleReasonID <> 0";
	
	Запрос.УстановитьПараметр("IdleReasonID", IdleReasonID);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Простой (справочник) по коду " + IdleReasonID + " не найден";
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СсылкаПростой = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СсылкаПростой = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;  
	
	Возврат СсылкаПростой;
		
 
 КонецФункции // ПолучитьМЦ()
 
Функция ПолучитьПользователя(ID, ТекстОшибки, Поле, Отказ)    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ID = &ID
		|	И Пользователи.ID <> 0";
	
	Запрос.УстановитьПараметр("ID", ID);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		Если Поле = "MasterID" Тогда // ошибка только при не заполненном мастере, другие пользователи не учитываюся		
			
			Отказ = Истина;		
			
			Если ЗначениеЗаполнено(ID) Тогда    
				ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Пользователь " + Поле + " по коду " + ID + " не найден";		
			Иначе
				ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", "; ") + "Поле " + Поле + " передано пустым";	
			КонецЕсли;    	
			
		КонецЕсли;

	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СсылкаПростой = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СсылкаПростой = ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЦикла;  
	
	Возврат СсылкаПростой;
		
 
 КонецФункции // ПолучитьМЦ()

Функция ПолучитьДокументПростоя(ID)    
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПростойОборудования.Ссылка
		|ИЗ
		|	Документ.алк_ПростойОборудования КАК алк_ПростойОборудования
		|ГДЕ
		|	алк_ПростойОборудования.ID = &ID
		|	И алк_ПростойОборудования.ID <> 0";
	
	Запрос.УстановитьПараметр("ID", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СсылкаПростой = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СсылкаПростой = ВыборкаДетальныеЗаписи.Ссылка;
		Док = СсылкаПростой.ПолучитьОбъект(); 
	КонецЦикла; 
	
	Если СсылкаПростой = "" Тогда 		
		Док = Документы.алк_ПростойОборудования.СоздатьДокумент(); 	
	КонецЕсли;	
	
	Возврат Док;
		
 
 КонецФункции // ПолучитьМЦ()


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



//////////////////////////// ТЕКСТЫ ЗАПРОСОВ К БД //////////////////////////////////////////////////////////////////////////////  

Функция ПолучитьТекстЗапросаWoodStoreMonitoring()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	алк_ПроизводственныеКатегорииНоменклатуры.Ссылка КАК Категория,
	|	алк_ПроизводственныеКатегорииНоменклатурыДлины.Длина КАК Длина,
	|	алк_ПроизводственныеКатегорииНоменклатурыПороды.Порода КАК Порода,
	|	алк_ПроизводственныеКатегорииНоменклатурыСорта.Сорт КАК Сорт,
	|	алк_ПроизводственныеКатегорииНоменклатуры.ДляВсехПород КАК ДляВсехПород,
	|	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонС КАК ДиапазонС,
	|	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонПо КАК ДиапазонПо
	|ПОМЕСТИТЬ Категории
	|ИЗ
	|	Справочник.алк_ПроизводственныеКатегорииНоменклатуры КАК алк_ПроизводственныеКатегорииНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Сорта КАК алк_ПроизводственныеКатегорииНоменклатурыСорта
	|		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыСорта.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Породы КАК алк_ПроизводственныеКатегорииНоменклатурыПороды
	|		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыПороды.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Длины КАК алк_ПроизводственныеКатегорииНоменклатурыДлины
	|		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыДлины.Ссылка
	|ГДЕ
	|	НЕ алк_ПроизводственныеКатегорииНоменклатуры.ЭтоГруппа
	|	И алк_ПроизводственныеКатегорииНоменклатуры.Родитель.Родитель.Код = &КодКлассификацииКатегорий
	|	И НЕ алк_ПроизводственныеКатегорииНоменклатуры.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Категории.Категория.Код, ""Без категории"") КАК StoreCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	""S"" + СТРЗАМЕНИТЬ(СТРОКА(алк_ПараметрыХарактеристик.Порода.Код), ""0"", """") + ""D"" + СТРОКА(ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ДиаметрММ, 0)) + ""L"" + СТРОКА(ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, 0)) КАК SortGroupCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ДиаметрММ, 0) КАК Diameter,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length,
	|	ОКР(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) / ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 1)) КАК Count,
	|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) КАК Volume
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Номенклатура = &Номенклатура) КАК алк_ОстаткиЗапасовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ЛЕВОЕ СОЕДИНЕНИЕ Категории КАК Категории
	|			ПО алк_ПараметрыХарактеристик.Сорт = Категории.Сорт
	|				И алк_ПараметрыХарактеристик.Длина = Категории.Длина
	|				И алк_ПараметрыХарактеристик.Порода = Категории.Порода
	|				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ >= Категории.ДиапазонС
	|				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ <= Категории.ДиапазонПо
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	НЕ Категории.ДляВсехПород
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Категории.Категория.Код, ""Без категории""),
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """"),
	|	""S"" + СТРЗАМЕНИТЬ(СТРОКА(алк_ПараметрыХарактеристик.Порода.Код), ""0"", """") + ""D"" + СТРОКА(ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ДиаметрММ, 0)) + ""L"" + СТРОКА(ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, 0)),
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ДиаметрММ, 0),
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000,
	|	ЕСТЬNULL(ОКР(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем), 0),
	|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0)
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Номенклатура = &Номенклатура) КАК алк_ОстаткиЗапасовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ЛЕВОЕ СОЕДИНЕНИЕ Категории КАК Категории
	|			ПО алк_ПараметрыХарактеристик.Сорт = Категории.Сорт
	|				И алк_ПараметрыХарактеристик.Длина = Категории.Длина
	|				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ >= Категории.ДиапазонС
	|				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ <= Категории.ДиапазонПо
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	Категории.ДляВсехПород
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Несортированное"",
	|	ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.Порода.Код, """"),
	|	""S"" + СТРЗАМЕНИТЬ(СТРОКА(алк_ОстаткиНесортированногоОстатки.Порода.Код), ""0"", """") + ""D"" + СТРОКА(0) + ""L"" + СТРОКА(0),
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0)
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиНесортированного.Остатки(&ДатаОстатков, ) КАК алк_ОстаткиНесортированногоОстатки";
	
	Возврат ЗапросТекст; 
	
	

КонецФункции // ПолучитьТекстЗапроса1()

Функция ПолучитьТекстЗапросаWoodTransportMonitoring()

	ЗапросТекст = "ВЫБРАТЬ
	              |	ЕСТЬNULL(ПОДСТРОКА(СТРОКА(рфп_ОтгрузкаВагона.Дата), 7, 4) + рфп_ОтгрузкаВагона.Номер, """") КАК TransportCode,
	              |	ВЫБОР
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.ПустаяСсылка)
	              |			ТОГДА 0
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
	              |			ТОГДА 1
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Теплоход)
	              |			ТОГДА 2
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Железнодорожная)
	              |			ТОГДА 3
	              |	КОНЕЦ КАК TransportType,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагона.НомерВагона, """") КАК TransportNo,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагона.ДатаПрибытия, """") КАК DeliveryDate,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагона.ДатаРазгрузки, """") КАК UnloadingDate,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Порода.Код, """") КАК WoodKindCode,
	              |	СУММА(ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Объем, 0)) КАК Volume
	              |ИЗ
	              |	Документ.рфп_ОтгрузкаВагона КАК рфп_ОтгрузкаВагона
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	              |		ПО (рфп_ОтгрузкаВагонаПиловочник.Ссылка = рфп_ОтгрузкаВагона.Ссылка)
	              |ГДЕ
	              |	рфп_ОтгрузкаВагона.Проведен
	              |	И рфп_ОтгрузкаВагона.ДатаПрибытия МЕЖДУ &ДатаНачалаСмены И &ТекущаяДата
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЕСТЬNULL(ПОДСТРОКА(СТРОКА(рфп_ОтгрузкаВагона.Дата), 7, 4) + рфп_ОтгрузкаВагона.Номер, """"),
	              |	ВЫБОР
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.ПустаяСсылка)
	              |			ТОГДА 0
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
	              |			ТОГДА 1
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Теплоход)
	              |			ТОГДА 2
	              |		КОГДА рфп_ОтгрузкаВагона.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Железнодорожная)
	              |			ТОГДА 3
	              |	КОНЕЦ,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагона.НомерВагона, """"),
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагона.ДатаПрибытия, """"),
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагона.ДатаРазгрузки, """"),
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Порода.Код, """")"; 
	
		Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса2()

Функция ПолучитьТекстЗапросаWoodTransportMonitoringStruct()
	
	ЗапросТекст = "ВЫБРАТЬ
	              |	ЕСТЬNULL(ПОДСТРОКА(СТРОКА(рфп_ОтгрузкаВагона.Дата), 7, 4) + рфп_ОтгрузкаВагона.Номер, """") КАК TransportCode,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Порода.Код, """") КАК WoodKindCode,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Сорт.Код, """") КАК GradeCode,
	              |	""S"" + СТРЗАМЕНИТЬ(СТРОКА(рфп_ОтгрузкаВагонаПиловочник.Порода.Код), ""0"", """") + ""D"" + СТРОКА(ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Сечение.ДиаметрММ, 0)) + ""L"" + СТРОКА(ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Длина.Наименование, 0)) КАК SortGroupCode,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Сечение.ДиаметрММ, 0) КАК Diameter,
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Длина.ДлинаММ, 0) КАК Length,
	              |	СУММА(ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Количество, 0)) КАК Count,
	              |	СУММА(ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Объем, 0)) КАК Volume
	              |ИЗ
	              |	Документ.рфп_ОтгрузкаВагона КАК рфп_ОтгрузкаВагона
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	              |		ПО (рфп_ОтгрузкаВагонаПиловочник.Ссылка = рфп_ОтгрузкаВагона.Ссылка)
	              |ГДЕ
	              |	рфп_ОтгрузкаВагона.Проведен
	              |	И рфп_ОтгрузкаВагона.Дата МЕЖДУ &ДатаНачалаСмены И &ТекущаяДата
	              |	И НЕ рфп_ОтгрузкаВагона.Статус В (ЗНАЧЕНИЕ(Перечисление.алк_СтатусыВходящейОтгрузки.Принят), ЗНАЧЕНИЕ(Перечисление.алк_СтатусыВходящейОтгрузки.Разгружен))
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	""S"" + СТРЗАМЕНИТЬ(СТРОКА(рфп_ОтгрузкаВагонаПиловочник.Порода.Код), ""0"", """") + ""D"" + СТРОКА(ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Сечение.ДиаметрММ, 0)) + ""L"" + СТРОКА(ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Длина.Наименование, 0)),
	              |	ЕСТЬNULL(ПОДСТРОКА(СТРОКА(рфп_ОтгрузкаВагона.Дата), 7, 4) + рфп_ОтгрузкаВагона.Номер, """"),
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Порода.Код, """"),
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Сорт.Код, """"),
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Сечение.ДиаметрММ, 0),
	              |	ЕСТЬNULL(рфп_ОтгрузкаВагонаПиловочник.Длина.ДлинаММ, 0)
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	TransportCode,
	              |	WoodKindCode,
	              |	GradeCode,
	              |	Diameter,
	              |	Length"; 
	
	Возврат ЗапросТекст;
	
КонецФункции // ПолучитьТекстЗапроса3()

Функция ПолучитьТекстЗапросаLumberStoreMonitoring()

	ЗапросТекст = "ВЫБРАТЬ
	              |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	              |	алк_ОстаткиЗапасовОстатки.Штабель,
	              |	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	              |	алк_ОстаткиЗапасовОстатки.Характеристика,
	              |	алк_ОстаткиЗапасовОстатки.Номенклатура,
	              |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток
	              |ПОМЕСТИТЬ ВТ_Ост
	              |ИЗ
	              |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	              |			&ДатаОстатков,
	              |			Номенклатура.Код = ""ПБ-00000012""
	              |				И СтруктурнаяЕдиница.Код В (""00-000005"", ""ПБ-000031"", ""ПБ-000090"", ""ПБ-000095"", ""ПБ-000098"", ""ПБ-000097"")) КАК алк_ОстаткиЗапасовОстатки
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	              |	алк_ОстаткиЗапасовОстатки.Штабель,
	              |	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	              |	алк_ОстаткиЗапасовОстатки.Характеристика,
	              |	алк_ОстаткиЗапасовОстатки.Номенклатура,
	              |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток
	              |ИЗ
	              |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	              |			&ДатаОстатков,
	              |			Номенклатура.Код = ""ПБ-00000001""
	              |				И СтруктурнаяЕдиница.Код = ""00-000001"") КАК алк_ОстаткиЗапасовОстатки
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
	              |	МИНИМУМ(алк_ОстаткиЗапасовОбороты.Период) КАК DateCreate
	              |ПОМЕСТИТЬ ВТ_МинимальнаяДатаСозданияПакета
	              |ИЗ
	              |	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	              |			,
	              |			,
	              |			Регистратор,
	              |			СерийныйНомер В
	              |				(ВЫБРАТЬ
	              |					ВТ_Ост.СерийныйНомер
	              |				ИЗ
	              |					ВТ_Ост КАК ВТ_Ост)) КАК алк_ОстаткиЗапасовОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_ОстаткиЗапасовОбороты.СерийныйНомер
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	алк_ПроизводствоОборотОбороты.Склад,
	              |	алк_ПроизводствоОборотОбороты.Штабель,
	              |	алк_ПроизводствоОборотОбороты.СерийныйНомер,
	              |	МИНИМУМ(алк_ПроизводствоОборотОбороты.Период) КАК DateIncome
	              |ПОМЕСТИТЬ ВТ_МинимальнаяДатаПоступленияНаСклад
	              |ИЗ
	              |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	              |			,
	              |			,
	              |			Регистратор,
	              |			СерийныйНомер В
	              |					(ВЫБРАТЬ
	              |						ВТ_Ост.СерийныйНомер
	              |					ИЗ
	              |						ВТ_Ост КАК ВТ_Ост)
	              |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)) КАК алк_ПроизводствоОборотОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_ПроизводствоОборотОбороты.СерийныйНомер,
	              |	алк_ПроизводствоОборотОбороты.Склад,
	              |	алк_ПроизводствоОборотОбороты.Штабель
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	алк_ПроизводствоОборотОбороты1.СерийныйНомер,
	              |	МАКСИМУМ(алк_ЗагрузкаВКамеру.ДатаВыгрузки) КАК DateOutcome
	              |ПОМЕСТИТЬ ВТ_МаксимальнаяДатаВыгрузки
	              |ИЗ
	              |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	              |			,
	              |			,
	              |			Авто,
	              |			СерийныйНомер В
	              |					(ВЫБРАТЬ
	              |						ВТ_Ост.СерийныйНомер
	              |					ИЗ
	              |						ВТ_Ост КАК ВТ_Ост
	              |					ГДЕ
	              |						ВТ_Ост.Номенклатура.Код = ""ПБ-00000012"")
	              |				И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	              |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	              |				И Склад.Код В (""ПБ-000031"", ""ПБ-000090"")) КАК алк_ПроизводствоОборотОбороты1
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ЗагрузкаВКамеру КАК алк_ЗагрузкаВКамеру
	              |		ПО алк_ПроизводствоОборотОбороты1.Регистратор = алк_ЗагрузкаВКамеру.Ссылка
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_ПроизводствоОборотОбороты1.СерийныйНомер
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	алк_ПроизводствоОборотОбороты2.СерийныйНомер,
	              |	МАКСИМУМ(алк_ПроизводствоОборотОбороты2.Период) КАК Период,
	              |	алк_ПроизводствоОборотОбороты2.Штабель.Код КАК TunnelCode
	              |ПОМЕСТИТЬ ВТ_ПоследняяКамераВыгрузки
	              |ИЗ
	              |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	              |			,
	              |			&ДатаОстатков,
	              |			Регистратор,
	              |			СерийныйНомер В
	              |					(ВЫБРАТЬ
	              |						ВТ_Ост.СерийныйНомер
	              |					ИЗ
	              |						ВТ_Ост КАК ВТ_Ост
	              |					ГДЕ
	              |						ВТ_Ост.Номенклатура.Код = ""ПБ-00000012"")
	              |				И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	              |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)
	              |				И Склад.Код В (""ПБ-000031"", ""ПБ-000090"")) КАК алк_ПроизводствоОборотОбороты2
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_ПроизводствоОборотОбороты2.Штабель.Код,
	              |	алк_ПроизводствоОборотОбороты2.СерийныйНомер
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ВТ_Ост.СтруктурнаяЕдиница.Код В (""00-000005"", ""00-000001"")
	              |				ТОГДА ВТ_Ост.СтруктурнаяЕдиница.Код
	              |			ИНАЧЕ ВТ_Ост.Штабель.Код
	              |		КОНЕЦ, """") КАК StoreCode,
	              |	ЕСТЬNULL(ВТ_Ост.СерийныйНомер.Наименование, """") КАК PacketNumber,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ПОДСТРОКА(ВТ_Ост.СерийныйНомер.Наименование, 1, 2) = ""СП""
	              |				ТОГДА ""СП""
	              |			КОГДА ПОДСТРОКА(ВТ_Ост.СерийныйНомер.Наименование, 1, 2) = ""МС""
	              |				ТОГДА ""МС""
	              |			ИНАЧЕ ЕСТЬNULL(СТРОКА(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код), """")
	              |		КОНЕЦ, """") КАК TypeProdCode,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ВТ_Ост.Номенклатура.Код = ""ПБ-00000012""
	              |				ТОГДА ""all""
	              |			ИНАЧЕ СТРОКА(алк_ПараметрыХарактеристик.Сорт.Код)
	              |		КОНЕЦ, """") КАК GradeCode,
	              |	СУММА(ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0)) КАК Volume,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 0) КАК Wetness,
	              |	СУММА(ОКР(ЕСТЬNULL(ВТ_Ост.КоличествоОстаток, 0) / ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 1))) КАК Count,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length,
	              |	"""" КАК SawType,
	              |	ЕСТЬNULL(ПОДСТРОКА(ВТ_Ост.СерийныйНомер.Наименование, 1, 2), """") КАК PacketCode,
	              |	"""" КАК WorkCenterCode,
	              |	МИНИМУМ(ЕСТЬNULL(ВТ_МинимальнаяДатаСозданияПакета.DateCreate, """")) КАК DateCreate,
	              |	МИНИМУМ(ЕСТЬNULL(ВТ_МинимальнаяДатаПоступленияНаСклад.DateIncome, """")) КАК DateIncome,
	              |	МАКСИМУМ(ЕСТЬNULL(ВТ_МаксимальнаяДатаВыгрузки.DateOutcome, """")) КАК DateOutcome,
	              |	ЕСТЬNULL(&ДатаОстатков, """") КАК DateRequest,
	              |	ЕСТЬNULL(ВТ_ПоследняяКамераВыгрузки.TunnelCode, """") КАК TunnelCode
	              |ИЗ
	              |	ВТ_Ост КАК ВТ_Ост
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	              |		ПО ВТ_Ост.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	              |				,
	              |				СерийныйНомер В
	              |					(ВЫБРАТЬ
	              |						ВТ_Ост.СерийныйНомер
	              |					ИЗ
	              |						ВТ_Ост КАК ВТ_Ост)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	              |		ПО ВТ_Ост.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МинимальнаяДатаСозданияПакета КАК ВТ_МинимальнаяДатаСозданияПакета
	              |		ПО ВТ_Ост.СерийныйНомер = ВТ_МинимальнаяДатаСозданияПакета.СерийныйНомер
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МинимальнаяДатаПоступленияНаСклад КАК ВТ_МинимальнаяДатаПоступленияНаСклад
	              |		ПО (ВТ_МинимальнаяДатаПоступленияНаСклад.Склад = ВТ_Ост.СтруктурнаяЕдиница)
	              |			И (ВТ_МинимальнаяДатаПоступленияНаСклад.Штабель = ВТ_Ост.Штабель)
	              |			И (ВТ_МинимальнаяДатаПоступленияНаСклад.СерийныйНомер = ВТ_Ост.СерийныйНомер)
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаксимальнаяДатаВыгрузки КАК ВТ_МаксимальнаяДатаВыгрузки
	              |		ПО ВТ_Ост.СерийныйНомер = ВТ_МаксимальнаяДатаВыгрузки.СерийныйНомер
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследняяКамераВыгрузки КАК ВТ_ПоследняяКамераВыгрузки
	              |		ПО ВТ_Ост.СерийныйНомер = ВТ_ПоследняяКамераВыгрузки.СерийныйНомер
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ВТ_Ост.СтруктурнаяЕдиница.Код В (""00-000005"", ""00-000001"")
	              |				ТОГДА ВТ_Ост.СтруктурнаяЕдиница.Код
	              |			ИНАЧЕ ВТ_Ост.Штабель.Код
	              |		КОНЕЦ, """"),
	              |	ЕСТЬNULL(ВТ_Ост.СерийныйНомер.Наименование, """"),
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """"),
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ПОДСТРОКА(ВТ_Ост.СерийныйНомер.Наименование, 1, 2) = ""СП""
	              |				ТОГДА ""СП""
	              |			КОГДА ПОДСТРОКА(ВТ_Ост.СерийныйНомер.Наименование, 1, 2) = ""МС""
	              |				ТОГДА ""МС""
	              |			ИНАЧЕ ЕСТЬNULL(СТРОКА(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код), """")
	              |		КОНЕЦ, """"),
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ВТ_Ост.Номенклатура.Код = ""ПБ-00000012""
	              |				ТОГДА ""all""
	              |			ИНАЧЕ СТРОКА(алк_ПараметрыХарактеристик.Сорт.Код)
	              |		КОНЕЦ, """"),
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 0),
	              |	ЕСТЬNULL(ВТ_ПоследняяКамераВыгрузки.TunnelCode, """"),
	              |	ЕСТЬNULL(ПОДСТРОКА(ВТ_Ост.СерийныйНомер.Наименование, 1, 2), """")
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	StoreCode,
	              |	PacketNumber,
	              |	WoodKindCode,
	              |	ThicknessProd,
	              |	WidthProd,
	              |	GradeCode"; 
	
		Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса4()

Функция ПолучитьТекстЗапросаWorkScheduleMonitoring()
	
	ЗапросТекст = "ВЫБРАТЬ
	              |	ЕСТЬNULL(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Ссылка.Участок.Код, """") КАК DepartmentCode,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена = ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, ЧАС, 8)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, ЧАС, 20)
	              |		КОНЕЦ, """") КАК ShiftStart,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена = ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, 20 * 3600 - 1)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, 32 * 3600 - 1)
	              |		КОНЕЦ, """") КАК ShiftFinish,
	              |	ЕСТЬNULL(алк_ГрафикРаботыУчасткаВремяРаботы.Бригада, 0) КАК ShiftNameCode,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена <> ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |					И алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяНачала <= ДАТАВРЕМЯ(1, 1, 1, 8, 0, 0)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяНачала, СЕКУНДА) + 24 * 3600)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяНачала, СЕКУНДА))
	              |		КОНЕЦ, """") КАК DowntimeStart,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена <> ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |					И алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяЗавершения <= ДАТАВРЕМЯ(1, 1, 1, 8, 0, 0)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяЗавершения, СЕКУНДА) + 24 * 3600)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяЗавершения, СЕКУНДА))
	              |		КОНЕЦ, """") КАК DowntimeFinish,
	              |	ЕСТЬNULL(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Простой.Тип.Код, """") КАК DowntimeGroup
	              |ПОМЕСТИТЬ ВТ
	              |ИЗ
	              |	Документ.алк_ГрафикРаботыУчастка.ТабличнаяЧасть КАК алк_ГрафикРаботыУчасткаТабличнаяЧасть
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ГрафикРаботыУчастка.ВремяРаботы КАК алк_ГрафикРаботыУчасткаВремяРаботы
	              |		ПО алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата = алк_ГрафикРаботыУчасткаВремяРаботы.Дата
	              |			И алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена = алк_ГрафикРаботыУчасткаВремяРаботы.Смена
	              |			И алк_ГрафикРаботыУчасткаТабличнаяЧасть.Ссылка = алк_ГрафикРаботыУчасткаВремяРаботы.Ссылка
	              |ГДЕ
	              |	алк_ГрафикРаботыУчасткаВремяРаботы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	              |	И алк_ГрафикРаботыУчасткаВремяРаботы.Ссылка.Проведен
	              |	И (алк_ГрафикРаботыУчасткаВремяРаботы.Ссылка.Участок.Код В (&КодыУчастков)
	              |			ИЛИ &ВсеУчастки)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ЕСТЬNULL(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Ссылка.Участок.Код, """"),
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена = ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, ЧАС, 8)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, ЧАС, 20)
	              |		КОНЕЦ, """"),
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена <> ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |					И алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяНачала <= ДАТАВРЕМЯ(1, 1, 1, 8, 0, 0)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяНачала, СЕКУНДА) + 24 * 3600)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяНачала, СЕКУНДА))
	              |		КОНЕЦ, """"),
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена <> ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |					И алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяЗавершения <= ДАТАВРЕМЯ(1, 1, 1, 8, 0, 0)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяЗавершения, СЕКУНДА) + 24 * 3600)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), алк_ГрафикРаботыУчасткаТабличнаяЧасть.ВремяЗавершения, СЕКУНДА))
	              |		КОНЕЦ, """"),
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА алк_ГрафикРаботыУчасткаТабличнаяЧасть.Смена = ЗНАЧЕНИЕ(Справочник.алк_Смены.День_2)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, 20 * 3600 - 1)
	              |			ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Дата, СЕКУНДА, 32 * 3600 - 1)
	              |		КОНЕЦ, """"),
	              |	ЕСТЬNULL(алк_ГрафикРаботыУчасткаВремяРаботы.Бригада, 0),
	              |	ЕСТЬNULL(алк_ГрафикРаботыУчасткаТабличнаяЧасть.Простой.Тип.Код, """")
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ.DepartmentCode КАК DepartmentCode,
	              |	ВТ.ShiftStart КАК ShiftStart,
	              |	ВТ.ShiftFinish КАК ShiftFinish,
	              |	ВТ.ShiftNameCode КАК ShiftNameCode,
	              |	ВТ.DowntimeStart КАК DowntimeStart,
	              |	ВТ.DowntimeFinish КАК DowntimeFinish,
	              |	ВТ.DowntimeGroup КАК DowntimeGroup
	              |ИЗ
	              |	ВТ КАК ВТ
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	DepartmentCode,
	              |	ShiftStart
	              |ИТОГИ
	              |	МАКСИМУМ(ShiftFinish),
	              |	МАКСИМУМ(ShiftNameCode)
	              |ПО
	              |	DepartmentCode,
	              |	ShiftStart"; 
	
	Возврат ЗапросТекст;
	
КонецФункции // ПолучитьТекстЗапроса4()

Функция ПолучитьТекстЗапросаTunnelsStatusMonitoring() 
	ЗапросТекст = "ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ПроизводствоОборотОбороты.Штабель.Код, """") КАК ШтабельКод,
	|	ЕСТЬNULL(алк_ПроизводствоОборотОбороты.Период, """") КАК ДатаСмены,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(алк_ПроизводствоОборотОбороты.Регистратор КАК Документ.алк_ЗагрузкаВКамеру).ДатаВыгрузки, """") КАК ДатаВыгрузки
	|ПОМЕСТИТЬ ВТ_ВсеЗагрузкиЗаМесяц
	|ИЗ
	|	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	|				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	|				И Склад.Код В (""ПБ-000031"", ""ПБ-000090"")) КАК алк_ПроизводствоОборотОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследняяПартияЗагрузки.ШтабельКод КАК TunnelCode,
	|	ПоследняяПартияЗагрузки.ДатаСмены КАК DateStart,
	|	ВТ_ВсеЗагрузкиЗаМесяц.ДатаВыгрузки КАК DateFinish
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ВсеЗагрузкиЗаМесяц.ШтабельКод КАК ШтабельКод,
	|		МАКСИМУМ(ВТ_ВсеЗагрузкиЗаМесяц.ДатаСмены) КАК ДатаСмены
	|	ИЗ
	|		ВТ_ВсеЗагрузкиЗаМесяц КАК ВТ_ВсеЗагрузкиЗаМесяц
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_ВсеЗагрузкиЗаМесяц.ШтабельКод) КАК ПоследняяПартияЗагрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеЗагрузкиЗаМесяц КАК ВТ_ВсеЗагрузкиЗаМесяц
	|		ПО ПоследняяПартияЗагрузки.ШтабельКод = ВТ_ВсеЗагрузкиЗаМесяц.ШтабельКод
	|			И ПоследняяПартияЗагрузки.ДатаСмены = ВТ_ВсеЗагрузкиЗаМесяц.ДатаСмены
	|
	|УПОРЯДОЧИТЬ ПО
	|	TunnelCode";
	Возврат ЗапросТекст;
КонецФункции

Функция ПолучитьТекстЗапросаVeneerLogMonitoring()
	ЗапросТекст ="ВЫБРАТЬ
	             |	ЕСТЬNULL(Продукция.Период, """") КАК DateLog,
	             |	ЕСТЬNULL(Продукция.СерийныйНомерНаименование, """") КАК PacketNumber,
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Код, ""all"") КАК GradeCode,
	             |	ВЫБОР
	             |		КОГДА Продукция.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка)
	             |			ТОГДА 1
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК isWet,
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК Thickness,
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК Width,
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) КАК Length,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ОКР(ЕСТЬNULL(Продукция.Количество, 0) / алк_ПараметрыХарактеристик.Объем)
	             |	КОНЕЦ КАК Count,
	             |	ЕСТЬNULL(Продукция.Количество, 0) КАК Volume,
	             |	""out"" КАК Type,
	             |	ЕСТЬNULL(Продукция.УчастокКод, """") КАК LineCode
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		алк_ПроизводствоПродукция.Период КАК Период,
	             |		алк_ПроизводствоПродукция.СерийныйНомер.Наименование КАК СерийныйНомерНаименование,
	             |		алк_ПроизводствоПродукция.Характеристика КАК Характеристика,
	             |		алк_ПроизводствоПродукция.Количество КАК Количество,
	             |		алк_ПроизводствоПродукция.Ссылка.Участок.Код КАК УчастокКод,
	             |		алк_ПроизводствоПродукция.Ссылка.Операция КАК Операция
	             |	ИЗ
	             |		Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
	             |	ГДЕ
	             |		алк_ПроизводствоПродукция.Ссылка.Участок В(&Участок)
	             |		И алк_ПроизводствоПродукция.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Шпон)
	             |		И алк_ПроизводствоПродукция.Период МЕЖДУ &НачалоПериода И &КонецПериода) КАК Продукция
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	             |		ПО Продукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	             |ГДЕ
	             |	&Выпуск
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	ЕСТЬNULL(Материалы.Период, """"),
	             |	ЕСТЬNULL(Материалы.СерийныйНомерНаименование, """"),
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """"),
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Код, ""all""),
	             |	ВЫБОР
	             |		КОГДА Материалы.Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Досушка)
	             |			ТОГДА 1
	             |		ИНАЧЕ 0
	             |	КОНЕЦ,
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
	             |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0),
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ОКР(ЕСТЬNULL(Материалы.Количество, 0) / алк_ПараметрыХарактеристик.Объем)
	             |	КОНЕЦ,
	             |	ЕСТЬNULL(Материалы.Количество, 0),
	             |	""In"",
	             |	ЕСТЬNULL(Материалы.УчастокКод, """")
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		алк_ПроизводствоМатериалы.Период КАК Период,
	             |		алк_ПроизводствоМатериалы.СерийныйНомер.Наименование КАК СерийныйНомерНаименование,
	             |		алк_ПроизводствоМатериалы.Характеристика КАК Характеристика,
	             |		алк_ПроизводствоМатериалы.Количество КАК Количество,
	             |		алк_ПроизводствоМатериалы.Ссылка.Участок.Код КАК УчастокКод,
	             |		алк_ПроизводствоМатериалы.Ссылка.Операция КАК Операция
	             |	ИЗ
	             |		Документ.алк_Производство.Материалы КАК алк_ПроизводствоМатериалы
	             |	ГДЕ
	             |		алк_ПроизводствоМатериалы.Ссылка.Участок В(&Участок)
	             |		И алк_ПроизводствоМатериалы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Шпон)
	             |		И алк_ПроизводствоМатериалы.Период МЕЖДУ &НачалоПериода И &КонецПериода) КАК Материалы
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	             |		ПО Материалы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	             |ГДЕ
	             |	&Подача"; 
	Возврат ЗапросТекст;
КонецФункции

//для post
Функция ПолучитьПараметрыЗапросаVeneerLogMonitoring(СтрокаЗапроса) 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	
	ЧтениеJSON.УстановитьСтроку(СтрокаЗапроса); 
	
	ПоляДат = Новый Массив;
	ПоляДат.Добавить("dateFrom");
	ПоляДат.Добавить("dateTo");
	
	МассивПараметров = ПрочитатьJSON(ЧтениеJSON,, ПоляДат, ФорматДатыJSON.ISO);   
	
	//Параметры 
	//Параметер Тип       Назначение
	//dateFrom  DateTime  Дата и время начала периода (формат: 2025-07-31T20:30:15)
	//dateTo    DateTime  Дата и время конца периода
	//Type      String    In – подача на линию; out — выпуск; если «» или Null – не фильтровать - необязательный
	//LineCode  String    Код линии, если «» или Null – не фильтровать - необязательный
	
	//Пример 
	//[
	//{
	//"dateFrom":"2025-07-09T23:40:37",
	//"dateTo":"2025-07-10T00:00:26",
	//"Type":null,
	//"LineCode":""
	//}
	//]
	//\\
			
	Если МассивПараметров.Количество() = 0 Тогда 
		Возврат 404;
	КонецЕсли;
	
	СтруктураПараметров = МассивПараметров[0];
	
	Если НЕ (СтруктураПараметров.Свойство("dateFrom") И СтруктураПараметров.Свойство("dateTo")) Тогда 
		Возврат 400;
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

