

&НаКлиенте
Процедура Подбор(Команда)
	
	
	
	ПараметрыФормы = Новый Структура("Номенклатура", ПолучитьНоменклатуру()); 
	ПараметрыФормы.Вставить("СтрокаКоманды", "Справочник.РазмерСечения.ФормаВыбора");
	
	СписокСсылок = Новый СписокЗначений;
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияПодбора", ЭтотОбъект, СписокСсылок);
	
	Форма = ОткрытьФорму("Обработка.алк_ПодборВСписки.Форма.ФормаПодборИзПодчинСпр", ПараметрыФормы, ЭтаФорма,,,,Оп);
	            
КонецПроцедуры

Функция ПолучитьНоменклатуру()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновнаяНоменклатураКатегорий.Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ОсновнаяНоменклатураКатегорий КАК ОсновнаяНоменклатураКатегорий
		|ГДЕ
		|	ОсновнаяНоменклатураКатегорий.КатегорияНоменклатуры = &КатегорияНоменклатуры";
	
	Запрос.УстановитьПараметр("КатегорияНоменклатуры", Объект.КатегорияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НоменклатураСсылка = Справочники.Номенклатура.ПустаяСсылка();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоменклатураСсылка =  ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат НоменклатураСсылка;

КонецФункции // ПолучитьНоменклатуру()
 

Процедура ВыполнитьПослеЗакрытияПодбора(СписокСсылок, Параметры)

	Если СписокСсылок = Неопределено Тогда		
		Возврат;	
	КонецЕсли; 
	
	Для каждого Стр Из СписокСсылок Цикл 		
		НоваяСтр = Объект.Сечения.Добавить();
		НоваяСтр.Сечение = Стр.Значение;		
	КонецЦикла; 

КонецПроцедуры
 