#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	// ТехнологияСервиса
	ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец ТехнологияСервиса
	
	//Мв+
	
	Попытка
		
		ПараметрыСеанса.алк_КонтрагентПортовогоАгента = РфпПолучениеДанныхСервер.ПолучитьКонтрагентаПользователяПортАгента(Пользователи.ТекущийПользователь());	
		
		Настройки = РфпПолучениеДанныхСервер.ПолучитьДополнительныеНастройкиПользователя(Пользователи.ТекущийПользователь());

		ПараметрыСеанса.алк_СеансПортовогоАгента      = Настройки.ПортовыйАгент;
		
	Исключение
	    ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	СоставФорм = Новый СоставФормНачальнойСтраницы;
	СоставФорм.ЛеваяКолонка.Добавить("Обработка.алк_УправлениеСериями.Форма.УправлениеСериями");
	СоставФорм.ПраваяКолонка.Добавить("Обработка.алк_УправлениеПоследовательностями.Форма.Форма");
	СоставФорм.ПраваяКолонка.Добавить("Задача.ЗадачаИсполнителя.Форма.МоиЗадачиДляРабочегоСтола");
	
	ВременныеНастройки = Новый НастройкиНачальнойСтраницы;
	ВременныеНастройки.УстановитьСоставФорм(СоставФорм); 
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",,ВременныеНастройки);
	
	//Мв
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли