Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид"            , "ДополнительнаяОбработка");
	//ПараметрыРегистрации.Вставить("Назначение"     , Неопределено);
	ПараметрыРегистрации.Вставить("Наименование"   , "Добавление комментария в докладную ОТК");
	ПараметрыРегистрации.Вставить("Версия"         , "2.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация"     , НСтр("ru = 'Добавление комментария в докладную ОТК'"));
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
					НСтр("ru = 'Добавление комментария в докладную ОТК'"),
					"ПроверитьЗаполнениеТабелей",
					"ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор"  , Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление        = Представление;
	НоваяКоманда.Идентификатор        = Идентификатор;
	НоваяКоманда.Использование        = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор          = Модификатор;
	
КонецПроцедуры




Процедура ЗаписатьКомментарийВДок(ДокладнаяОТК,Автор,Комментарий)  Экспорт  
	УстановитьПривилегированныйРежим(Истина);
	Докладная = ДокладнаяОТК.ПолучитьОбъект();
	Докладная.КомментарийОтветственногоСотрудника = Комментарий;
	Докладная.ОтветственныйСотрудник = Автор;
	
	Докладная.Записать(РежимЗаписиДокумента.Проведение);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры