
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		Объект.Участок = Справочники.алк_Участки.НайтиПоКоду("000000007");
		Объект.Склад = Справочники.СтруктурныеЕдиницы.УчастокГТО; 
		УстановитьСмену();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СоставПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Элементы.Состав.ТекущиеДанные <> Неопределено Тогда
		Элементы.Состав.ТекущиеДанные.Номенклатура = ПолучитьНоменклатуру();
		Элементы.Состав.ТекущиеДанные.Категория = ПолучитьКатегориюНоменклатуру();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьСмену();
КонецПроцедуры 

&НаКлиенте
Процедура СоставГрадацияПриИзменении(Элемент)
	ЗаполнитьНормативЗагрузкиПропаркиНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаЗагрузкиПриИзменении(Элемент)
	ЗаполнитьНормативЗагрузкиПропаркиНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПропаркиПриИзменении(Элемент)
	ЗаполнитьНормативЗагрузкиПропаркиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыЗагрузкиПропарки(Элемент.Имя); 
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыЗагрузкиПропарки(Элемент.Имя);  
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПропаркиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыЗагрузкиПропарки(Элемент.Имя);  
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПропаркиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыЗагрузкиПропарки(Элемент.Имя);  

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)   
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Форма = ПолучитьФорму("Обработка.алк_ГрафическоеОтображениеКамерГТО.Форма.Форма");
	Если Форма.Открыта() Тогда
		Форма.Закрыть();  
		ОткрытьФорму("Обработка.алк_ГрафическоеОтображениеКамерГТО.Форма.Форма"); //таким образом обновим данные на форме 1с
	Иначе  
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеФункции 

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуру()
	Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002"); 
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКатегориюНоменклатуру()
	Возврат Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000003"); 
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Процедура ЗаполнитьНормативЗагрузкиПропаркиНаСервере() 
	
	Документы.алк_ЗагрузкаВКамеруГТО.ЗаполнитьНормативЗагрузкиПропарки(Объект.Состав,Объект.ДатаНачалаЗагрузки,Объект.ДатаОкончанияЗагрузки,Объект.ДатаНачалаПропарки
	,Объект.ДатаОкончанияЗагрузкиНорматив,Объект.ДатаОкончанияПропаркиНорматив);
				
КонецПроцедуры

&НаСервере
Процедура УстановитьСмену() 
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, Объект.Дата);
		Если ПараметрыСменыПоТекущейДате = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;    	
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьЗначениеДатыЗагрузкиПропарки(ИмяЭлемента)   
	
	ПараметрыВремени = Новый Структура; 
	ПараметрыВремени.Вставить("ДатаВремя", ТекущаяДата()); 
	ПараметрыВремени.Вставить("ИмяЭлемента", ИмяЭлемента);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводВремениЗавершено", ЭтотОбъект, ПараметрыВремени);

	ОткрытьФорму("Документ.алк_РапортПропарка.Форма.ФормаВводаВремени",ПараметрыВремени,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВводВремениЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	ЭтаФорма.Объект[ДополнительныеПараметры.ИмяЭлемента] = РезультатЗакрытия;
	
	ЗаполнитьНормативЗагрузкиПропаркиНаСервере();
	
КонецПроцедуры

#КонецОбласти

