
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
		УстановитьОтбор(Настройки, "П1", Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		Настройки,
		ДанныеРасшифровки);
		
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПолучитьСтруктуруЗаголовковПолей(), МакетКомпоновки);
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураДинамическихЗаголовков(), МакетКомпоновки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		,
		ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		//КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
		
		ОбработатьРезультат(ДокументРезультат, 1);
		
		Макет = ПолучитьМакет("Подвал");
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ДокументРезультат.Вывести(ОбластьМакета);

	КонецПроцедуры
	
	#КонецОбласти
	
	Процедура ОбработатьРезультат(ТабДок, НомСтроки)
		
		//ТабДок = Новый ТабличныйДокумент;
		
		выс = ТабДок.ВысотаТаблицы;
		
		Индекс = выс; 
		
		Пока Индекс >= 0 Цикл 
			
			стр = НРег(ТабДок.Область(Индекс, 1, Индекс, 1).Текст);
			
			Если Найти(стр, "del") > 0  Тогда 
				
				Адрес = "R"+Формат(Индекс, "ЧГ=");
				УдаляемаяОбласть = ТабДок.Область(Адрес);
				
				ТабДок.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
				
			КонецЕсли; 
			
			Индекс = Индекс - 1; 
			
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	ЭтоОтчетУНФ = Ложь;
	
#КонецЕсли
