
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыгрузкаИзКамерыПропарки, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыгрузкаИзКамерыПропарки);
		//Запрос.УстановитьПараметр("ОперацияЗагрузка", Перечисления.алк_ОперацииПропарки.Загрузка);
		//Запрос.УстановитьПараметр("ОперацияВыгрузка", Перечисления.алк_ОперацииПропарки.Выгрузка);
		//Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		//Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		         		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетВремениПропарки", МассивРезультатовЗапроса[0].Выгрузить());  
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтатусыПропарки", МассивРезультатовЗапроса[0].Выгрузить());

		
	КонецПроцедуры

	#КонецОбласти
	
	
		
	#Область СервисныеПроцедурыИФункции
	
	
		
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_РапортПропарка.НачалоОперации КАК Период,
		|	алк_РапортПропарка.Ссылка КАК Регистратор,
		|	алк_РапортПропарка.КамераПропарки,
		|	алк_РапортПропарка.Операция КАК Статус,
		|	алк_РапортПропарка.НачалоОперации КАК ВремяНачала,
		|	алк_РапортПропарка.ОкончаниеОперации КАК ВремяОкончанияПлан
		|ИЗ
		|	Документ.алк_РапортПропарка КАК алк_РапортПропарка
		|ГДЕ
		|	алк_РапортПропарка.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса;
		
	КонецФункции


	
	
	Функция ТекстЗапросаДанныеДокумента0()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_РапортПропаркаКамеры.Ссылка.Дата КАК Период,
		|	алк_РапортПропаркаКамеры.Ссылка.Организация,
		|	алк_РапортПропаркаКамеры.Ссылка.СтруктурнаяЕдиница,
		|	алк_РапортПропаркаКамеры.КамераПропарки КАК Ячейка,
		|	алк_РапортПропаркаКамеры.Операция,
		|	алк_РапортПропаркаКамеры.ГрадацияПропарки,
		|	РАЗНОСТЬДАТ(алк_РапортПропаркаКамеры.НачалоОперации, алк_РапортПропаркаКамеры.ОкончаниеОперации, СЕКУНДА) КАК ВремяОперации
		|ИЗ
		|	Документ.алк_РапортПропарка.Камеры КАК алк_РапортПропаркаКамеры";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти

	
	
#КонецЕсли
