


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	//добавим операцию в задание
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	Дата,
	Справочники.алк_ОперацииПроизводства.Окорка,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);
	//\\
	
	//// Инициализация дополнительных свойств для проведения документа
	//УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	//
	//// Инициализация данных документа
	//Документы.алк_РапортПропарка.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//
	//// Подготовка наборов записей
	//УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	//// Отражение в разделах учета  
	//РфпСервер.ОтразитьСтатусыПропарки(ДополнительныеСвойства, Движения, Отказ);
	////РфпСервер.ОтразитьОстаткиВКамерахПропарки(ДополнительныеСвойства, Движения, Отказ);
	////РфпСервер.ОтразитьУчетВремениПропарки(ДополнительныеСвойства, Движения, Отказ);
	//	
	//// Запись наборов записей
	//УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	//
	//ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	//
	////КонтрольЗаполнения(Отказ);
	
КонецПроцедуры


// проверка 
// - соответствие объемов загрузки и выгрузки
// - дублирования выгрузки
// - дата выгрузки познее даты загрузки
Процедура КонтрольЗаполнения(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;   	
	
КонецПроцедуры
 
