
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Получение обновлений программы".
// ОбщийМодуль.ПолучениеОбновленийПрограммыГлобальный.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПолучениеОбновленийПрограммы_ПроверитьНаличиеОбновлений() Экспорт
	 
	 // Нач мод [Пакушев И.С.] [18.04.2019] 
	 // Обращение № [0000000000] [ТекстЗаявки]
	 // Было
	 // Стало  ПолучениеОбновленийПрограммыКлиент.ПроверитьНаличиеОбновлений();
	 // Кон мод [Пакушев И.С.] [18.04.2019]
	
КонецПроцедуры

#КонецОбласти
