
Процедура ИнициализироватьДанныеДокумента(Документ, ДополнительныеСвойства) Экспорт
	
	ДополнительныеСвойства.Вставить("ФактическиеПоказателиПроизводства", ПолучитьФактическиеПоказателиПроизводства(Документ));
	
КонецПроцедуры

Функция ПолучитьФактическиеПоказателиПроизводства(Документ)
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	алк_УстановкаФактическихПоказателейПоказатели.Период,
	|	алк_УстановкаФактическихПоказателейПоказатели.Смена,
	|	алк_УстановкаФактическихПоказателейПоказатели.Показатель,
	|	алк_УстановкаФактическихПоказателейПоказатели.Значение,
	|	ИСТИНА КАК Активность
	|ИЗ
	|	Документ.алк_УстановкаФактическихПоказателей.Показатели КАК алк_УстановкаФактическихПоказателейПоказатели
	|ГДЕ
	|	алк_УстановкаФактическихПоказателейПоказатели.Ссылка = &Документ");
	Запрос.УстановитьПараметр("Документ", Документ);
	ТаблицаРегистра = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРегистра;

КонецФункции

Процедура ДобавитьДвижениеРегистраФактическиеПоказателиПроизводства(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если ДополнительныеСвойства.ФактическиеПоказателиПроизводства.Количество() = 0 тогда
		Сообщить("Не указаны производственные показатели");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Движения = Документ.Движения.алк_ФактическиеПоказателиПроизводства;
	Движения.Записывать = Истина;
	
	Движения.Загрузить(ДополнительныеСвойства.ФактическиеПоказателиПроизводства);

КонецПроцедуры	
