Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	//проверка, что нет повторов
	
	//получаем колонку с показателями
	ВсеПоказатели = Показатели.Выгрузить(,"Показатель").ВыгрузитьКолонку("Показатель"); 
	РазличныеПоказатели = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВсеПоказатели); 
	//\\
	КоличествоПовторов = 0;
	
	Для Каждого эл ИЗ РазличныеПоказатели Цикл
		
		НайденныеСтроки = Показатели.НайтиСтроки(Новый Структура("Показатель", эл)); //все строки по показателю  
		
		ТЗПоПоказателю = ПреобразованиеМассивКоллекцийВТаблицуЗначений(НайденныеСтроки);   
		
		Периоды = ТЗПоПоказателю.ВыгрузитьКолонку("Период"); 
		РазличныеПериоды = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Периоды); 
		
		Смены = ТЗПоПоказателю.ВыгрузитьКолонку("Смена");
		РазличныеСмены = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Смены);   
		
		
		Если Периоды.Количество() <> РазличныеПериоды.Количество() Тогда //имеет смысл, если нет смен
			Для Каждого эл ИЗ РазличныеПериоды Цикл
				НайденныеСтрокиПоПоказателюИПериоду = ТЗПоПоказателю.НайтиСтроки(Новый Структура("Период",эл));
				Если НайденныеСтрокиПоПоказателюИПериоду.Количество() > 1 Тогда
					Для Каждого эл ИЗ РазличныеСмены Цикл
						ТЗПоПоказателюИПериоду = ПреобразованиеМассивКоллекцийВТаблицуЗначений(НайденныеСтрокиПоПоказателюИПериоду);
						ТЗПоПоказателюИПериодуИСмене = ТЗПоПоказателюИПериоду.НайтиСтроки(Новый Структура("Смена",эл));
						Если ТЗПоПоказателюИПериодуИСмене.Количество() > 1 Тогда 
							Сообщить(СтрШаблон("Найдены одинаковые строки по показателю ""%1"" !",НайденныеСтроки[0].Показатель)); 
							КоличествоПовторов = КоличествоПовторов + 1;
							Для Каждого эл ИЗ ТЗПоПоказателюИПериодуИСмене Цикл 
								Сообщить(СтрШаблон("№ %1",эл.НомерСтроки)); 
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	//\\ 
	
	Если КоличествоПовторов <> 0 Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//проверка отсутствия таких записей в регистре
	МассивСообщений = Новый Массив;
	
	Для Каждого стр ИЗ Показатели Цикл  
		Запись = ВернутьЗаписьИзРегистра(стр.Период,стр.Показатель,стр.Смена); 
		
		Если Запись <> Неопределено И Запись.Регистратор <> Ссылка Тогда
			МассивСообщений.Добавить(СтрШаблон("Запись № %1 уже есть в документе ""%2"" в строке № %3!",стр.НомерСтроки,Запись.Регистратор,Запись.НомерСтроки));
		КонецЕсли;	
		
	КонецЦикла;
	
	Если МассивСообщений.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого эл ИЗ МассивСообщений Цикл 
		Сообщить(эл); 
	КонецЦикла;
	//\\
	
	Отказ = Истина;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Документы.алк_УстановкаФактическихПоказателей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	Документы.алк_УстановкаФактическихПоказателей.ДобавитьДвижениеРегистраФактическиеПоказателиПроизводства(ЭтотОбъект, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры 

//возвращает записи из регистра алк_ФактическиеПоказателиПроизводства, если они уже есть
Функция ВернутьЗаписьИзРегистра(Период,Показатель,Смена)
	
	Записи = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ФактическиеПоказателиПроизводства.Регистратор,
	               |	алк_ФактическиеПоказателиПроизводства.НомерСтроки
	               |ИЗ
	               |	РегистрСведений.алк_ФактическиеПоказателиПроизводства КАК алк_ФактическиеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ФактическиеПоказателиПроизводства.Период = &Период
	               |	И алк_ФактическиеПоказателиПроизводства.Показатель = &Показатель
	               |	И алк_ФактическиеПоказателиПроизводства.Смена = &Смена";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Показатель", Показатель); 
	Запрос.УстановитьПараметр("Смена", Смена);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка;
	КонецЦикла;
	
	//Возврат Неопределено;
	
КонецФункции
Функция ПреобразованиеМассивКоллекцийВТаблицуЗначений(Массив)  
		
	ТЗ = Новый ТаблицаЗначений; 
	
	ТЗ.Колонки.Добавить("НомерСтроки");  
	ТЗ.Колонки.Добавить("Период");
	ТЗ.Колонки.Добавить("Смена");
	//ТЗ.Колонки.Добавить("");
	
	
	Для Каждого СтрокаМассива Из Массив Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.НомерСтроки = СтрокаМассива.НомерСтроки;
		НоваяСтрока.Период = СтрокаМассива.Период;
		НоваяСтрока.Смена = СтрокаМассива.Смена;
	КонецЦикла;
	
	Возврат ТЗ;

КонецФункции
