

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре"; 
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	ОборотыПроизводства = Движения.алк_ОборотыПроизводства;
	ОборотыПроизводства.Записывать = Истина;
	Запрос = новый запрос(
	"ВЫБРАТЬ
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Значение КАК Объем,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка.Направление,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Показатель,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка.ДатаСмены КАК Дата,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка.Организация
	|ПОМЕСТИТЬ ВТ_ПоказателиДокумента
	|ИЗ
	|	Документ.алк_ВводПроизводственныхПоказателейДГ.ПоказателиОперсводки КАК алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки
	|ГДЕ
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка = &ВводПоказателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказателиДокумента.Объем,
	|	ВТ_ПоказателиДокумента.Направление,
	|	ВТ_ПоказателиДокумента.Показатель,
	|	ВложенныйЗапрос.ВидОтгрузки,
	|	ВложенныйЗапрос.Влажность,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВТ_ПоказателиДокумента.Организация КАК Организация,
	|	ВложенныйЗапрос.Порода,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Сорт,
	|	ВложенныйЗапрос.Характеристика,
	|	ВТ_ПоказателиДокумента.Показатель.алк_ОперацияПроизводства КАК Операция,
	|	ИСТИНА КАК Активность,
	|	ВТ_ПоказателиДокумента.Дата КАК Период
	|ИЗ
	|	ВТ_ПоказателиДокумента КАК ВТ_ПоказателиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			алк_ПоказателиПроизводства.Ссылка КАК Ссылка,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваВидыОтгрузки.ВидОтгрузки) КАК ВидОтгрузки,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваВлажности.Влажность) КАК Влажность,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваНоменклатуры.Номенклатура) КАК Номенклатура,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваПороды.Порода) КАК Порода,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваСклады.Склад) КАК Склад,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваСорта.Сорт) КАК Сорт,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваХарактеристики.Характеристика) КАК Характеристика
	|		ИЗ
	|			Справочник.алк_ПоказателиПроизводства КАК алк_ПоказателиПроизводства
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Сорта КАК алк_ПоказателиПроизводстваСорта
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваСорта.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Породы КАК алк_ПоказателиПроизводстваПороды
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваПороды.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Номенклатуры КАК алк_ПоказателиПроизводстваНоменклатуры
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваНоменклатуры.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.ВидыОтгрузки КАК алк_ПоказателиПроизводстваВидыОтгрузки
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваВидыОтгрузки.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Склады КАК алк_ПоказателиПроизводстваСклады
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваСклады.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Характеристики КАК алк_ПоказателиПроизводстваХарактеристики
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваХарактеристики.Характеристика,
	|			Справочник.алк_ПоказателиПроизводства.Влажности КАК алк_ПоказателиПроизводстваВлажности
	|		ГДЕ
	|			алк_ПоказателиПроизводства.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТ.Показатель
	|					ИЗ
	|						ВТ_ПоказателиДокумента КАК ВТ)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			алк_ПоказателиПроизводства.Ссылка) КАК ВложенныйЗапрос
	|		ПО ВТ_ПоказателиДокумента.Показатель = ВложенныйЗапрос.Ссылка");
	Запрос.УстановитьПараметр("ВводПоказателей", Ссылка);
	ДвиженияПоОборотамПроизводства = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из ПоказателиОперсводки Цикл
		ОборотыПроизводства.Загрузить(ДвиженияПоОборотамПроизводства);
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)   
	
	//добавим операцию в задание
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	ДатаСмены,
	Справочники.алк_ОперацииПроизводства.НайтиПоКоду("000000419"),
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);
	//\\
	
КонецПроцедуры
