
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектТекущий = Параметры.Объект;
	ТранспортировкаДочка = Документы.алк_РасходнаяНакладная.ДочернийТранспортировка(ОбъектТекущий);	
	УстановитьВидимостьДоступностьЭлементов(?(ЗначениеЗаполнено(ТранспортировкаДочка), Истина, Ложь));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов(Связан)
	
	Если Связан Тогда
		
		Элементы.ДекорацияСвязан.Видимость = Истина;
		Элементы.ФормаРазблокировать.Доступность = Ложь;
		
	Иначе
		
		Элементы.ДекорацияСвязан.Видимость = Ложь;
		Элементы.ФормаРазблокировать.Доступность = Истина;

	КонецЕсли; 	
	
КонецПроцедуры


&НаКлиенте
Процедура Разблокировать(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры
 
