
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыгрузкаИзСушильнойКамеры, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();
		
		ДанныеДокументаВыгрузкаИзСушильнойКамеры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаВыгрузкаИзСушильнойКамеры, "Смена, Дата, СушильнаяКамера");
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыгрузкаИзСушильнойКамеры);
		Запрос.УстановитьПараметр("Период", ДанныеДокументаВыгрузкаИзСушильнойКамеры.Дата);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Смена", ДанныеДокументаВыгрузкаИзСушильнойКамеры.Смена);
		Запрос.УстановитьПараметр("ЯчейкаВыгрузки", ПолучитьЯчейкуПоКамере(ДанныеДокументаВыгрузкаИзСушильнойКамеры.СушильнаяКамера));
		Запрос.УстановитьПараметр("ОперацияВыгрузка", Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВыгрузкаИзСушильнойКамеры);
		Запрос.УстановитьПараметр("ШтабельВыгрузки", ПолучитьШтабельПоКамере(ДанныеДокументаВыгрузкаИзСушильнойКамеры.СушильнаяКамера));
		
		//Дубоделов Э.А 13.02.2023
		//Параметр, отвечающий за формирование таблиц с движениями по алк_ПроизводствоОборот и алк_ОстаткиЗапасов
		ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДанныеДокументаВыгрузкаИзСушильнойКамеры.Дата); 
		
        Запрос.УстановитьПараметр("ЗаписыватьДвиженияВНовыеРегистры", ЗаписыватьДвиженияВНовыеРегистры);
		//Дубоделов Э.А
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", 			МассивРезультатовЗапроса[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПакетыВСушильныхКамерах", 			МассивРезультатовЗапроса[2].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПиломатериалыПереданныеНаСушку", 	МассивРезультатовЗапроса[3].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", 			МассивРезультатовЗапроса[4].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов",	 			МассивРезультатовЗапроса[5].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции",  		МассивРезультатовЗапроса[6].Выгрузить());
		
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов",  			МассивРезультатовЗапроса[7].Выгрузить());
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот",  		МассивРезультатовЗапроса[8].Выгрузить());
		КонецЕсли;
		
	КонецПроцедуры

	#КонецОбласти
	
		
	#Область СервисныеПроцедурыИФункции

	Функция ПолучитьШтабельПоКамере(СушильнаяКамера);
		
		Штабель = Справочники.алк_Штабели.НайтиПоНаименованию("Сушильная камера " + СушильнаяКамера); 
		
		Возврат Штабель;
		
	КонецФункции

		
	Функция ПолучитьЯчейкуПоКамере(СушильнаяКамера)
		
		Если Не ЗначениеЗаполнено(СушильнаяКамера) Тогда			
			Возврат Справочники.Ячейки.ПустаяСсылка();			
		КонецЕсли; 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|ГДЕ
		|	Ячейки.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", "Сушильная камера " + СушильнаяКамера);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			НоваяЯчейка = Справочники.Ячейки.СоздатьЭлемент();	
			НоваяЯчейка.Владелец = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс
			НоваяЯчейка.Наименование =  "Сушильная камера " + СушильнаяКамера;			
			НоваяЯчейка.Записать();
			
		    Возврат НоваяЯчейка.Ссылка;
			
		КонецЕсли; 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
				
	КонецФункции // ПолучитьЯчейкуПоКамере()
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.Организация КАК Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер КАК СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура КАК Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика КАК Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат КАК Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество КАК Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем КАК Объем,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.СушильнаяКамера КАК СушильнаяКамера,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.НомерСтроки КАК НомерСтроки,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка.Участок
		|ПОМЕСТИТЬ ВТ_ТаблицаДвижений
		|ИЗ
		|	Документ.алк_ВыгрузкаИзСушильнойКамеры.Номенклатура КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|ГДЕ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	&ЯчейкаВыгрузки
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СушильнаяКамера
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ИСТИНА КАК Сухой
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ЛОЖЬ
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период КАК ДатаСмены,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка) КАК Ячейка,
		|	1 КАК КоличествоПакетов,
		|	&ОперацияВыгрузка КАК Операция
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход,
		|	&Смена,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	&ЯчейкаВыгрузки,
		|	1,
		|	&ОперацияВыгрузка
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	&Ссылка,
		|	ВТ_ТаблицаДвижений.НомерСтроки,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	алк_ПараметрыПакетовСрезПоследних.Активность,
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодПакета,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
		|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки,
		|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
		|	алк_ПараметрыПакетовСрезПоследних.Габарит,
		|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО,
		|	ИСТИНА КАК Сухой
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&Период,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_ТаблицаДвижений.СерийныйНомер
		|					ИЗ
		|						ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ_ТаблицаДвижений.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Период,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Организация,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Номенклатура,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Характеристика,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Сертификат,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Количество,
		|	алк_ВыгрузкаИзСушильнойКамерыНоменклатура.Объем,
		|	&ЯчейкаВыгрузки КАК Ячейка,
		|	ИСТИНА КАК ЭтоСушильнаяКамера
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК алк_ВыгрузкаИзСушильнойКамерыНоменклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период КАК Период,
		|	ВТ_ТаблицаДвижений.Организация КАК Организация,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	&ШтабельВыгрузки КАК Штабель,
		|	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		|	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		|	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Объем КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	ВТ_ТаблицаДвижений.Организация,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница,
		|	NULL,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	ВТ_ТаблицаДвижений.Характеристика,
		|	ВТ_ТаблицаДвижений.Сертификат,
		|	ВТ_ТаблицаДвижений.СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Объем,
		|	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Приход)
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период КАК Период,
		|	NULL КАК Бригада,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства,
		|	ВТ_ТаблицаДвижений.Период КАК ДатаСмены,
		|	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка) КАК Операция,
		|	ВТ_ТаблицаДвижений.Организация КАК Организация,
		|	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК Склад,
		|	&Смена КАК Смена,
		|	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		|	ВТ_ТаблицаДвижений.Количество КАК Количество,
		|	ВТ_ТаблицаДвижений.Участок КАК Участок
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДвижений.Период,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
		|	ВТ_ТаблицаДвижений.Период,
		|	ВТ_ТаблицаДвижений.Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка),
		|	ВТ_ТаблицаДвижений.Организация,
		|	ВТ_ТаблицаДвижений.СерийныйНомер,
		|	ВТ_ТаблицаДвижений.Сертификат,
		|	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница,
		|	&Смена,
		|	ВТ_ТаблицаДвижений.Характеристика,
		|	ВТ_ТаблицаДвижений.Количество,
		|	NULL
		|ИЗ
		|	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		|ГДЕ
		|	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	
	
#КонецЕсли
