

Функция ПолучитьВидСвойстваПоУказателю(КатегорияНоменклатуры, Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
	|ИЗ
	|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|ГДЕ
	|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КатегорияНоменклатуры.НаборСвойствХарактеристики);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если СтрНайти(ВыборкаДетальныеЗаписи.Свойство.Наименование, Свойство) > 0 Тогда
			Возврат ВыборкаДетальныеЗаписи.Свойство;	
		КонецЕсли; 	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьВидСвойстваПоУказателю

Функция ПолучитьВидСвойства(ФиквированноеСвойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизиты.ПВХ
	|ИЗ
	|	РегистрСведений.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Реквизит = &Реквизит";
	
	Запрос.УстановитьПараметр("Реквизит", ФиквированноеСвойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ПВХ;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции


Функция СоздатьХарактеристикуПоНаборуСвойств(ВладелецХарактеристики, ТаблицаСвойств) Экспорт
	
	// Выполнить необходимые проверки
	/////////////////////////////////
	
	Характеристика = Неопределено;
	
	Попытка
		НачатьТранзакцию();
		
		НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		НоваяХарактеристика.Владелец = ВладелецХарактеристики;
		
		Наименование = "";
		Для каждого стрСвойство Из ТаблицаСвойств Цикл
			НоваяСтрокаСвойства = НоваяХарактеристика.ДополнительныеРеквизиты.Добавить();
			НоваяСтрокаСвойства.Свойство = стрСвойство.Свойство;
			НоваяСтрокаСвойства.Значение = стрСвойство.Значение;
			Наименование = Наименование + ?(Наименование = "", "", ", ") + стрСвойство.Значение.Наименование;
		КонецЦикла; 
		
		////Наименования = СформироватьНаименованияПоШаблонуСервер("Оба", ВладелецХарактеристики.Ссылка);
		////НоваяХарактеристика.Наименование       = Наименования.Наименование;
		////НоваяХарактеристика.НаименованиеПолное = Наименования.НаименованиеПолное;
		//
		//ДанныеДляФормированияНаименования = НоменклатураСервер.ФормулаНаименования(ВладелецХарактеристики.ШаблонРабочегоНаименованияХарактеристики, НоваяХарактеристика); 
		//Наименование = НаименованиеПоФормуле(ДанныеДляФормированияНаименования, ВладелецХарактеристики);
		
		НоваяХарактеристика.Наименование          = Наименование;
		НоваяХарактеристика.НаименованиеДляПечати = Наименование;
		
		НоваяХарактеристика.Записать();
		
		Характеристика = НоваяХарактеристика.Ссылка;
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки; 
	
	Возврат Характеристика;
	
КонецФункции  // СоздатьХарактеристикуПоНаборуСвойств


Функция СформироватьНаименованияПоШаблонуСервер(ВариантФормирования, СправочникОбъект)
	
	СтруктураНаименований = Новый Структура("Наименование, НаименованиеПолное", "", "");
	
	ШаблонРабочегоНаименования  = СправочникОбъект.ШаблонРабочегоНаименованияХарактеристики;
	ШаблонНаименованияДляПечати = СправочникОбъект.ШаблонНаименованияДляПечатиХарактеристики;
	
	Если ВариантФормирования = "Рабочее" ИЛИ ВариантФормирования = "Оба" Тогда
		Наименование = НоменклатураСервер.НаименованиеПоШаблону(ШаблонРабочегоНаименования, СправочникОбъект);
		СтруктураНаименований.Наименование = Наименование;
	КонецЕсли;
	Если ВариантФормирования = "ДляПечати" ИЛИ ВариантФормирования = "Оба" Тогда
		НаименованиеПолное = НоменклатураСервер.НаименованиеПоШаблону(ШаблонНаименованияДляПечати, СправочникОбъект);
		СтруктураНаименований.НаименованиеПолное = НаименованиеПолное;
	КонецЕсли;
	
	Возврат СтруктураНаименований;
	
КонецФункции

// Формирует наименование элемента справочника по заданному для вида номенклатуры шаблону.
//
//Параметры:
//		ДанныеДляФормированияНаименования - Структура - структура, возвращаемая фукнцией НоменклатураСервер.ФормулаНаименования
//		ВидНоменклатуры - СправочникСслыка.ВидыНоменклатуры	- вид номенклатуры, в котором задан шаблон наименования
//		Наименование - Строка - в формулу полного наименования может входить наименование. Наименование может быть не
//								заполнено на момент формирования массива ДанныеДляФормированияНаименования.МассивЗначенийРеквизитов,
//								поэтому перед расчетом полного наименования значение наименования нужно обновить
// Возвращаемое значение:
// Строка - Наименование полученное по алгоритму расчета
// Пустая строка - если не удалось сформировать наименование или не заполнены операнды алгоритма
//
Функция НаименованиеПоФормуле(ДанныеДляФормированияНаименования, ВидНоменклатуры, ЗначениеНаименования = "") Экспорт
	
	Наименование = "";
	Если ЗначениеЗаполнено(ДанныеДляФормированияНаименования.ФормулаНаименования) Тогда
		
		МассивЗначенийРеквизитов = ДанныеДляФормированияНаименования.МассивЗначенийРеквизитов;
		
		Для Каждого Индекс из ДанныеДляФормированияНаименования.ИндексыНаименованияВМассивеЗначенийРеквизитов Цикл
			МассивЗначенийРеквизитов[Индекс] = ЗначениеНаименования;
		КонецЦикла;
		
		Попытка
			
			Выполнить("Наименование = """" + " + ДанныеДляФормированияНаименования.ФормулаНаименования);
			
		Исключение
			
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

// Примитивная проверка на наличие характеристики с аналогичными Свойствами "ТаблицаСвойствЗначений"
//
Функция ПроверитьУникальностьХарактеристик(Владелец, ТаблицаСвойствЗначений) Экспорт
	
	КоличествоСвойств = 0;
	Для каждого стрСвойство Из ТаблицаСвойствЗначений Цикл
		Если ЗначениеЗаполнено(стрСвойство.Значение) Тогда
			КоличествоСвойств = КоличествоСвойств + 1;	
		КонецЕсли; 	
	КонецЦикла;                            
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|	1 КАК Счетчик
	|ПОМЕСТИТЬ втХарактеристики
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСвойств.Свойство,
	|	ТабСвойств.Значение
	|ПОМЕСТИТЬ втСвойства
	|ИЗ
	|	&ТабСвойств КАК ТабСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втХарактеристики.Ссылка КАК Ссылка,
	|	СУММА(ЕСТЬNULL(втХарактеристики.Счетчик, 0)) КАК Счетчик
	|ПОМЕСТИТЬ втОтобранныеХарактеристики
	|ИЗ
	|	втСвойства КАК втСвойства
	|		ЛЕВОЕ СОЕДИНЕНИЕ втХарактеристики КАК втХарактеристики
	|		ПО (втХарактеристики.Свойство = втСвойства.Свойство)
	|			И (втХарактеристики.Значение = втСвойства.Значение)
	|
	|СГРУППИРОВАТЬ ПО
	|	втХарактеристики.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОтобранныеХарактеристики.Ссылка
	|ИЗ
	|	втОтобранныеХарактеристики КАК втОтобранныеХарактеристики";
	//|ГДЕ
	//|	втОтобранныеХарактеристики.Счетчик = &КоличествоСвойств";
	//
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ТабСвойств", ТаблицаСвойствЗначений);
	Запрос.УстановитьПараметр("КоличествоСвойств", КоличествоСвойств);
	
	РезультатЗапросаХарактеристики = Запрос.Выполнить();  // РезультатЗапросаХарактеристики.Выгрузить()
	
	Если Не РезультатЗапросаХарактеристики.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции //ПроверитьУникальностьХарактеристик()

// Проверяет наличие характеристики с аналогичными параметрами по регистру сведений
// "ПараметрыХарактеристик"
// СсылкаНаХарактеристику - нужна только при записи справочника характеристика, чтобы можно было перезаписать существующую характеристику
Функция ПроверитьХарактеристикуПоПараметрам(Владелец, ТаблицаСвойствЗначений, СсылкаНаХарактеристику=Неопределено) Экспорт
	Если СсылкаНаХарактеристику = Неопределено тогда
		СсылкаНаХарактеристику = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Сч = 0;
	Для каждого стрРеквизит Из ТаблицаСвойствЗначений Цикл
		Если ЗначениеЗаполнено(стрРеквизит) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода) Тогда
			Порода = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт) Тогда
			Сорт = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина) Тогда
			Длина = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение) Тогда
			Сечение = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность) Тогда
			Влажность = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Поверхность) Тогда
			Поверхность = стрРеквизит.Значение;	
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыХарактеристик.Характеристика
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК ПараметрыХарактеристик
	|ГДЕ
	|	ПараметрыХарактеристик.Порода = &Порода
	|	И ПараметрыХарактеристик.Сорт = &Сорт
	|	И ПараметрыХарактеристик.Длина = &Длина
	|	И ПараметрыХарактеристик.Сечение = &Сечение
	|	И ПараметрыХарактеристик.Влажность = &Влажность
	|	И ПараметрыХарактеристик.Характеристика.Владелец = &Владелец
	|	И ПараметрыХарактеристик.КоличествоРеквизитов = &КоличествоРеквизитов
	|	И ПараметрыХарактеристик.Характеристика <> &СсылкаНаХарактеристику
	|	И ПараметрыХарактеристик.Поверхность = &Поверхность";
	
	Запрос.УстановитьПараметр("Порода",    ?(Порода <> Неопределено, Порода, Справочники.Породы.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Сорт",      ?(Сорт <> Неопределено, Сорт, Справочники.Сорта.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Длина",     ?(Длина <> Неопределено, Длина, Справочники.Длины.ПустаяСсылка()));	
	Запрос.УстановитьПараметр("Сечение",   ?(Сечение <> Неопределено, Сечение, Справочники.РазмерСечения.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Влажность", ?(Влажность <> Неопределено, Влажность, Справочники.Влажность.ПустаяСсылка()));  
	Запрос.УстановитьПараметр("Поверхность", ?(Поверхность <> Неопределено, Поверхность, Справочники.Поверхности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Владелец",  Владелец);
	Запрос.УстановитьПараметр("КоличествоРеквизитов",  Сч);
	Запрос.УстановитьПараметр("СсылкаНаХарактеристику", СсылкаНаХарактеристику);

	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции //ПроверитьХарактеристикуПоПараметрам()

// Получает характеристику с аналогичными параметрами по данным регистра сведений
// "ПараметрыХарактеристик"
//
Функция ПолучитьХарактеристикуПоПараметрам(Владелец, ТаблицаСвойствЗначений) Экспорт
	
	Если ТипЗнч(ТаблицаСвойствЗначений) = Тип("ТаблицаЗначений") Тогда
		
	Иначе
		
		ТаблицаСвойствЗначений = ТаблицаСвойствЗначений.Выгрузить();
		
	КонецЕсли; 
	
	Сч = 0;
	Для каждого стрРеквизит Из ТаблицаСвойствЗначений Цикл
		Если ЗначениеЗаполнено(стрРеквизит) Тогда
			Сч = Сч + 1;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода) Тогда
			Порода = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт) Тогда
			Сорт = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина) Тогда
			Длина = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение) Тогда
			Сечение = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность) Тогда
			Влажность = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Поверхность) Тогда
			Поверхность = стрРеквизит.Значение;	
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыХарактеристик.Характеристика
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК ПараметрыХарактеристик
	|ГДЕ
	|	ПараметрыХарактеристик.Порода = &Порода
	|	И ПараметрыХарактеристик.Сорт = &Сорт
	|	И ПараметрыХарактеристик.Длина = &Длина
	|	И ПараметрыХарактеристик.Сечение = &Сечение
	|	И ПараметрыХарактеристик.Влажность = &Влажность
	|	И ПараметрыХарактеристик.Характеристика.Владелец = &Владелец
	|	И ПараметрыХарактеристик.КоличествоРеквизитов = &КоличествоРеквизитов
	|	И ПараметрыХарактеристик.Поверхность = &Поверхность";
	
	Запрос.УстановитьПараметр("Порода",    ?(Порода <> Неопределено, Порода, Справочники.Породы.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Сорт",      ?(Сорт <> Неопределено, Сорт, Справочники.Сорта.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Длина",     ?(Длина <> Неопределено, Длина, Справочники.Длины.ПустаяСсылка()));	
	Запрос.УстановитьПараметр("Сечение",   ?(Сечение <> Неопределено, Сечение, Справочники.РазмерСечения.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Влажность", ?(Влажность <> Неопределено, Влажность, Справочники.Влажность.ПустаяСсылка()));  
	Запрос.УстановитьПараметр("Поверхность", ?(Поверхность <> Неопределено, Поверхность, Справочники.Поверхности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Владелец",  Владелец);
	Запрос.УстановитьПараметр("КоличествоРеквизитов",  Сч);

	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать(); Выборка.Следующий();
		Возврат Выборка.Характеристика;
	Иначе
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции //ПолучитьХарактеристикуПоПараметрам()

Процедура ЗапретРедактированияПередЗаписью(Источник, Отказ) Экспорт
	
	Если Не РольДоступна("Администратор_РФП") Тогда
		Отказ = АлгоритмыСвойстваИХарактеристики.ПроверитьХарактеристикуПоПараметрам(Источник.Владелец, Источник.ДополнительныеРеквизиты.Выгрузить());		
	КонецЕсли; 	
	
КонецПроцедуры


#Область ФиксированныеДополнительныеРеквизиты

Функция ПараметрыХарактеристики(Характеристика) Экспорт
	
	СтруктураПараметров = Новый Структура("Порода, Сорт, Длина, Сечение, Влажность, Поверхность", 
	Справочники.Породы.ПустаяСсылка(),
	Справочники.Сорта.ПустаяСсылка(),
	Справочники.Длины.ПустаяСсылка(),
	Справочники.РазмерСечения.ПустаяСсылка(),
	Справочники.Влажность.ПустаяСсылка(),
	Справочники.Поверхности.ПустаяСсылка());
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыХарактеристик.Порода,
		|	ПараметрыХарактеристик.Сорт,
		|	ПараметрыХарактеристик.Длина,
		|	ПараметрыХарактеристик.Сечение,
		|	ПараметрыХарактеристик.Влажность,
		|	ПараметрыХарактеристик.Поверхность
		|ИЗ
		|	РегистрСведений.алк_ПараметрыХарактеристик КАК ПараметрыХарактеристик
		|ГДЕ
		|	ПараметрыХарактеристик.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);	
	КонецЕсли; 	
	
	Возврат СтруктураПараметров;
КонецФункции

	
#КонецОбласти 


// ************************** Подписки **************************

// Процедура записвыет дополнительные реквизиты характеристики в регистр сведений
// "ПараметрыХарактеристик"
//
Процедура ЗаполнитьПараметрыХарактеристикиПриЗаписи(Источник, Отказ) Экспорт
	
	НаборЗаписей = РегистрыСведений.алк_ПараметрыХарактеристик.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Характеристика.Установить(Источник.Ссылка);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Характеристика = Источник.Ссылка;
	Для каждого стрРеквизит Из Источник.ДополнительныеРеквизиты Цикл
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода) Тогда
			НоваяЗапись.Порода = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт) Тогда
			НоваяЗапись.Сорт = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина) Тогда
			НоваяЗапись.Длина = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение) Тогда
			НоваяЗапись.Сечение = стрРеквизит.Значение;	
		КонецЕсли;
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Влажность) Тогда
			НоваяЗапись.Влажность = стрРеквизит.Значение;	
		КонецЕсли; 
		Если стрРеквизит.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Поверхность) Тогда
			НоваяЗапись.Поверхность = стрРеквизит.Значение;	
		КонецЕсли;
	КонецЦикла; 
	НаборЗаписей.Записать();

КонецПроцедуры

// Процедура записвыет дополнительные реквизиты характеристики в регистр сведений
// "алк_ПарметрыСерийныхНомеров"
//
Процедура ЗаполнитьПараметрыСерийногоНомераПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не НоменклатураСервер.НаименованиеСоответствуетГодовомуШаблону(Источник) Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли; 
	
	НаборЗаписей = РегистрыСведений.алк_ПараметрыСерийныхНомеров.СоздатьНаборЗаписей();
	
	НомерСерии  = НоменклатураСервер.НомерСерии(Источник.Ссылка);
	ПериодСерии = НоменклатураСервер.ПериодСерии(Источник.Ссылка);
	
	НаборЗаписей.Отбор.СерийныйНомер.Установить(Источник.Ссылка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Номенклатура = Источник.Владелец;
	НоваяЗапись.НомерСерии   = НомерСерии;
	НоваяЗапись.ПериодСерии  = ПериодСерии;
	
	НоваяЗапись.СерийныйНомер = Источник.Ссылка;
	
	НаборЗаписей.Записать();

КонецПроцедуры



