
&НаСервере
Процедура ШаблонОТКПриИзмененииНаСервере()
	
	Объект.Номенклатура = Объект.ШаблонОТК.Номенклатура;	
	СформироватьСписокДефектовПоШаблону();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОТКОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
		ДопПараметры = Новый Структура("ТекущееЗначениеЭлемента", Объект.ШаблонОТК);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСменеШаблона", ЭтотОбъект, ДопПараметры);	
	 
	    ПоказатьВопрос(Оповещение,
	        "При смене шаблона текущие данные будут очищены. Вы уверены?",
	        РежимДиалогаВопрос.ДаНет,
	        0, // таймаут в секундах
	        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	        "Смена шаблона" // (необ.) заголовок
	    );

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСменеШаблона(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Пакеты.Очистить();	
		ШаблонОТКПриИзмененииНаСервере();
   	Иначе	   
		Объект.ШаблонОТК =  Параметры.ТекущееЗначениеЭлемента;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если ЗначениеЗаполнено(Объект.ШаблонОТК) Тогда
		СформироватьСписокДефектовПоШаблону();	
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() И ПроверкаЗапрещеныИзменения() Тогда
		ЭтаФорма.Доступность = Ложь;
		Сообщить("Документ открыт только для просмотра. Изменять акты прошлых смен запрещено");
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСписокДефектовПоШаблону()
	МассивДефектов = Объект.ШаблонОТК.Строки.ВыгрузитьКолонку("Строка");
	Элементы.ПакетыДеффект.СписокВыбора.ЗагрузитьЗначения(МассивДефектов);
КонецПроцедуры

Функция ПроверкаЗапрещеныИзменения()
	Если НЕ РольДоступна("алк_ОТК_Администратор") И НЕ РольДоступна("ПолныеПрава") И НЕ РфпСервер.ТекущаяСмена(Объект.Дата, Объект.Смена, Объект.Участок) Тогда	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПакетыСерийныйНомерПриИзменении(Элемент)
	
	РезультатПроверкиСН = ПроверитьНаДефектыСН(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.СерийныйНомер);	
	
	Если РезультатПроверкиСН.Количество() > 0 Тогда
		Для Каждого Стр Из РезультатПроверкиСН Цикл
			Сообщить(СтрШаблон("ВНИМАНИЕ! По пакету с номером %1 уже был оформлен акт %2 с дефектом: %3", Стр.СерийныйНомер, Стр.Регистратор, Стр.Дефект));	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНаДефектыСН(СерийныйНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ДанныеАктаОТК.СерийныйНомер,
		|	алк_ДанныеАктаОТК.Строка КАК Дефект,
		|	алк_ДанныеАктаОТК.Регистратор
		|ИЗ
		|	РегистрНакопления.алк_ДанныеАктаОТК КАК алк_ДанныеАктаОТК
		|ГДЕ
		|	алк_ДанныеАктаОТК.СерийныйНомер = &СерийныйНомер";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Дефект = Новый Структура;
		Дефект.Вставить("СерийныйНомер", ВыборкаДетальныеЗаписи.СерийныйНомер);
		Дефект.Вставить("Дефект", ВыборкаДетальныеЗаписи.Дефект); 
		Дефект.Вставить("Регистратор", ВыборкаДетальныеЗаписи.Регистратор);
		Результат.Добавить(Дефект);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

