
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ПроизводствоДГ_Операторы");
	ПараметрыФормы.Вставить("ОтборДляОператоровДГ");
	ПараметрыФормы.Вставить("КлючПользовательскихНастроек", Новый УникальныйИдентификатор);
	
	ОткрытьФорму("Документ.алк_СборкаЗапасов.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
