
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Вариант, Направление, КатегорияНоменклатуры"
		, 9
		, ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.МалоеЛесопиление")
		, ПолучитьКатегорийНоменклатуры());

	ОткрытьФорму("Обработка.алк_РабочееМестоОператораЦЛП.Форма.ФормаИнициализации", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере

Функция ПолучитьКатегорийНоменклатуры()

	Возврат Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000006"); //Побочная продукция (кат)

КонецФункции // ПолучитьКатегорийНоменклатуры()
 