

#Область ДанныеРегистра_ПараметрыПакетов

Функция ПараметрыПакетаНоменклатурыПоСерийныйНомер_СтарыеРегистры(СерийныйНомерСсылка) Экспорт
	
	ПараметрыПакета = Новый Структура(); 
	
	ПараметрыПакета.Вставить("Идентифицирован",			Ложь);
	ПараметрыПакета.Вставить("СерийныйНомер",			СерийныйНомерСсылка);
	ПараметрыПакета.Вставить("НомерПакета",				0);
	ПараметрыПакета.Вставить("ПериодПакета",			Дата(1,1,1));
	ПараметрыПакета.Вставить("Характеристика",			Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	ПараметрыПакета.Вставить("Объем",					0);
	ПараметрыПакета.Вставить("КоличествоСостав",		0);
	ПараметрыПакета.Вставить("ВесНетто",				0);
	ПараметрыПакета.Вставить("ВесБрутто",				0);
	ПараметрыПакета.Вставить("Сертификат",         		Справочники.СертификатыНаПродукцию.ПустаяСсылка());
	ПараметрыПакета.Вставить("СертификатFSC",      		ложь);
	ПараметрыПакета.Вставить("БоковаяДоска",      		ложь);
	ПараметрыПакета.Вставить("Сухой",      				ложь);
	ПараметрыПакета.Вставить("ОбъемТаможня",       		0);
	ПараметрыПакета.Вставить("ВесНеттоТаможня",    		0);
	ПараметрыПакета.Вставить("ВесБруттоТаможня",   		0);
	ПараметрыПакета.Вставить("ПериодУпаковки",     		Дата(1,1,1));
	ПараметрыПакета.Вставить("Смена", 		    		Справочники.алк_Смены.ПустаяСсылка());
	ПараметрыПакета.Вставить("КатегорияНоменклатуры",  	Справочники.КатегорииНоменклатуры.ПустаяСсылка());
	ПараметрыПакета.Вставить("Габарит", 		    	Перечисления.алк_ГабаритПакета.Габаритный);
	ПараметрыПакета.Вставить("КатегорияНоменклатурыПЭО",Справочники.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка());
	ПараметрыПакета.Вставить("Припуск",					Справочники.алк_ВариантыПрипуска.ПустаяСсылка());
	
	Если СерийныйНомерСсылка = Справочники.СерийныеНомера.ПустаяСсылка() Тогда
		Возврат ПараметрыПакета;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК Идентифицирован,
	|	алк_ПараметрыПакетовСрезПоследних.Объем,
	|	&СерийныйНомер КАК СерийныйНомер,
	|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня,
	|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня,
	|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня,
	|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
	|	алк_ПараметрыПакетовСрезПоследних.ПериодПакета,
	|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
	|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки,
	|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
	|	алк_ПараметрыПакетовСрезПоследних.Регистратор.Смена КАК Смена,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец) = ТИП(Справочник.КатегорииНоменклатуры)
	|			ТОГДА алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец
	|		ИНАЧЕ алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец.КатегорияНоменклатуры
	|	КОНЕЦ КАК КатегорияНоменклатуры,
	|	алк_ПараметрыПакетовСрезПоследних.Габарит,
	|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО,
	|	алк_ПараметрыПакетовСрезПоследних.Сухой,
	|	алк_ПараметрыПакетовСрезПоследних.Припуск,
	|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(&ДатаСреза, СерийныйНомер = &СерийныйНомер) КАК алк_ПараметрыПакетовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());  
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомерСсылка);
	РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
		ВыборкаДетальныеЗаписи.Следующий();
		ЗаполнитьЗначенияСвойств(ПараметрыПакета, ВыборкаДетальныеЗаписи); 		
	КонецЕсли; 
	
	Возврат ПараметрыПакета;
	
КонецФункции // ПараметрыПакетаНоменклатурыПоСерийныйНомер()
 
Функция ПараметрыПакетаНоменклатурыПоСерийныйНомер(СерийныйНомерСсылка) Экспорт
	
	ПараметрыПакета = Новый Структура(); 
	
	ПараметрыПакета.Вставить("Идентифицирован",			Ложь);
	ПараметрыПакета.Вставить("СерийныйНомер",			СерийныйНомерСсылка);
	ПараметрыПакета.Вставить("НомерПакета",				0);
	ПараметрыПакета.Вставить("ПериодПакета",			Дата(1,1,1));
	ПараметрыПакета.Вставить("Характеристика",			Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	ПараметрыПакета.Вставить("Объем",					0);
	ПараметрыПакета.Вставить("КоличествоСостав",		0);
	ПараметрыПакета.Вставить("ВесНетто",				0);
	ПараметрыПакета.Вставить("ВесБрутто",				0);
	ПараметрыПакета.Вставить("Сертификат",         		Справочники.СертификатыНаПродукцию.ПустаяСсылка());
	ПараметрыПакета.Вставить("СертификатFSC",      		ложь);
	ПараметрыПакета.Вставить("БоковаяДоска",      		ложь);
	ПараметрыПакета.Вставить("Сухой",      				ложь);
	ПараметрыПакета.Вставить("ОбъемТаможня",       		0);
	ПараметрыПакета.Вставить("ВесНеттоТаможня",    		0);
	ПараметрыПакета.Вставить("ВесБруттоТаможня",   		0);
	ПараметрыПакета.Вставить("ПериодУпаковки",     		Дата(1,1,1));
	ПараметрыПакета.Вставить("Смена", 		    		Справочники.алк_Смены.ПустаяСсылка());
	ПараметрыПакета.Вставить("КатегорияНоменклатуры",  	Справочники.КатегорииНоменклатуры.ПустаяСсылка());
	ПараметрыПакета.Вставить("Габарит", 		    	Перечисления.алк_ГабаритПакета.Габаритный);
	ПараметрыПакета.Вставить("КатегорияНоменклатурыПЭО",Справочники.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка());
	ПараметрыПакета.Вставить("Припуск",					Справочники.алк_ВариантыПрипуска.ПустаяСсылка());
	
	Если СерийныйНомерСсылка = Справочники.СерийныеНомера.ПустаяСсылка() Тогда
		Возврат ПараметрыПакета;
	КонецЕсли; 
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК Пакет,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
		|	алк_ОстаткиЗапасовОбороты.Сертификат КАК Сертификат,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура КАК Номенклатура,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск КАК Припуск,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.УчастокВыпуска КАК УчастокВыпуска,
		|	СРЕДНЕЕ(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Объем,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(алк_БоковаяДоскаСрезПоследних.Сечение, ЗНАЧЕНИЕ(Справочник.РазмерСечения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.РазмерСечения.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК БоковаяДоска,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК СечениеШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК СечениеТолщинаММ,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоШирине КАК ПрипускПрипускПоШирине,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоТолщине КАК ПрипускПрипускПоТолщине,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоДлине КАК ПрипускПрипускПоДлине,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
		|				ТОГДА ОКР(алк_ОстаткиЗапасовОбороты.КоличествоПриход)
		|			ИНАЧЕ ОКР(алк_ОстаткиЗапасовОбороты.КоличествоПриход / алк_ПараметрыХарактеристик.Объем)
		|		КОНЕЦ) КАК КоличествоСостав,
		|	МАКСИМУМ(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО) КАК КатегорияНоменклатурыПЭО,
		|	МИНИМУМ(алк_ОстаткиЗапасовОбороты.Период) КАК Период,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА алк_ОстаткиЗапасовОбороты.Номенклатура.Код В (""ПБ-00000012"")
		|				ТОГДА ВЫБОР
		|						КОГДА алк_ОстаткиЗапасовОбороты.СтруктурнаяЕдиница.Код В (""ПБ-000097"", ""ПБ-000095"", ""ПБ-000098"", ""00-000008"")
		|							ТОГДА алк_ОстаткиЗапасовОбороты.Период
		|					КОНЕЦ
		|		КОНЕЦ) КАК Сухой,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Габарит КАК Габарит
		|ПОМЕСТИТЬ ВТ_Обороты
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Регистратор, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_БоковаяДоска.СрезПоследних КАК алк_БоковаяДоскаСрезПоследних
		|			ПО алк_ПараметрыХарактеристик.Сечение = алк_БоковаяДоскаСрезПоследних.Сечение
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(, СерийныйНомер = &СерийныйНомер) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО алк_ОстаткиЗапасовОбороты.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.УчастокВыпуска,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ОстаткиЗапасовОбороты.Сертификат,
		|	алк_ПараметрыХарактеристик.Влажность,
		|	алк_ПараметрыХарактеристик.Сечение,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура,
		|	алк_ПараметрыХарактеристик.Сорт,
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоШирине,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоТолщине,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоДлине,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Габарит,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(алк_БоковаяДоскаСрезПоследних.Сечение, ЗНАЧЕНИЕ(Справочник.РазмерСечения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.РазмерСечения.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Обороты.Пакет КАК Пакет,
		|	ВТ_Обороты.Период КАК ПериодУпаковки,
		|	ВТ_Обороты.Характеристика КАК Характеристика,
		|	ВТ_Обороты.Номенклатура КАК Номенклатура,
		|	ВТ_Обороты.Порода КАК Порода,
		|	ВТ_Обороты.Сорт КАК Сорт,
		|	ВТ_Обороты.Длина КАК Длина,
		|	ВТ_Обороты.Сечение КАК Сечение,
		|	ВТ_Обороты.Влажность КАК Влажность,
		|	ВТ_Обороты.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Обороты.КоличествоСостав КАК КоличествоСостав,
		|	ВТ_Обороты.Сертификат КАК Сертификат,
		|	ВТ_Обороты.Припуск КАК Припуск,
		|	ВТ_Обороты.Объем КАК Объем,
		|	СРЕДНЕЕ(ОКР((ВТ_Обороты.ДлинаДлинаММ + ВТ_Обороты.ПрипускПрипускПоДлине) * (ВТ_Обороты.СечениеШиринаММ + ВТ_Обороты.ПрипускПрипускПоШирине) * (ВТ_Обороты.СечениеТолщинаММ + ВТ_Обороты.ПрипускПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000, 3)) КАК ОбъемТаможня,
		|	СРЕДНЕЕ(ОКР(алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3 * (ВТ_Обороты.ДлинаДлинаММ + ВТ_Обороты.ПрипускПрипускПоДлине) * (ВТ_Обороты.СечениеШиринаММ + ВТ_Обороты.ПрипускПрипускПоШирине) * (ВТ_Обороты.СечениеТолщинаММ + ВТ_Обороты.ПрипускПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000000, 3)) КАК ВесНеттоТаможня,
		|	СРЕДНЕЕ(ОКР(алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг / 1000 + алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3 * (ВТ_Обороты.ДлинаДлинаММ + ВТ_Обороты.ПрипускПрипускПоДлине) * (ВТ_Обороты.СечениеШиринаММ + ВТ_Обороты.ПрипускПрипускПоШирине) * (ВТ_Обороты.СечениеТолщинаММ + ВТ_Обороты.ПрипускПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000000, 3)) КАК ВесБруттоТаможня,
		|	ВТ_Обороты.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО,
		|	СРЕДНЕЕ(1) КАК Порядок,
		|	ВТ_Обороты.Сухой КАК Сухой,
		|	ВТ_Обороты.Габарит КАК Габарит
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТ_Обороты КАК ВТ_Обороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних КАК алк_ПлотностьНоменклатурыСрезПоследних
		|		ПО ВТ_Обороты.Номенклатура = алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура
		|			И ВТ_Обороты.Порода = алк_ПлотностьНоменклатурыСрезПоследних.Порода
		|			И ВТ_Обороты.Влажность = алк_ПлотностьНоменклатурыСрезПоследних.Влажность
		|			И ВТ_Обороты.БоковаяДоска = алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Обороты.Пакет,
		|	ВТ_Обороты.Характеристика,
		|	ВТ_Обороты.Порода,
		|	ВТ_Обороты.Сорт,
		|	ВТ_Обороты.Длина,
		|	ВТ_Обороты.Сечение,
		|	ВТ_Обороты.Влажность,
		|	ВТ_Обороты.Сертификат,
		|	ВТ_Обороты.Номенклатура,
		|	ВТ_Обороты.Припуск,
		|	ВТ_Обороты.Объем,
		|	ВТ_Обороты.КоличествоСостав,
		|	ВТ_Обороты.Период,
		|	ВТ_Обороты.БоковаяДоска,
		|	ВТ_Обороты.КатегорияНоменклатурыПЭО,
		|	ВТ_Обороты.Сухой,
		|	ВТ_Обороты.Габарит
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК Пакет,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ПериодУпаковки,
		|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
		|	СерийныеНомера.Владелец КАК Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
		|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска КАК БоковаяДоска,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
		|	алк_ПараметрыПакетовСрезПоследних.Припуск КАК Припуск,
		|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня КАК ОбъемТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНеттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО,
		|	2 КАК Порядок,
		|	алк_ПараметрыПакетовСрезПоследних.Габарит КАК Габарит
		|ПОМЕСТИТЬ ВТ_ПоПараметрамПакетов
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, СерийныйНомер.Ссылка = &СерийныйНомер) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Пакет КАК Пакет,
		|	ВТ.ПериодУпаковки КАК ПериодУпаковки,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Порода КАК Порода,
		|	ВТ.Сорт КАК Сорт,
		|	ВТ.Длина КАК Длина,
		|	ВТ.Сечение КАК Сечение,
		|	ВТ.Влажность КАК Влажность,
		|	ВТ.БоковаяДоска КАК БоковаяДоска,
		|	ВТ.КоличествоСостав КАК КоличествоСостав,
		|	ВТ.Сертификат КАК Сертификат,
		|	ВТ.Припуск КАК Припуск,
		|	ВТ.Объем КАК Объем,
		|	ВТ.ОбъемТаможня КАК ОбъемТаможня,
		|	ВТ.ВесНеттоТаможня КАК ВесНеттоТаможня,
		|	ВТ.ВесБруттоТаможня КАК ВесБруттоТаможня,
		|	ВТ.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО,
		|	ВТ.Сухой КАК Сухой,
		|	ВТ.Порядок КАК Порядок,
		|	ВТ.Габарит КАК Габарит
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ КАК ВТ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПоПараметрамПакетов.Пакет,
		|	ВТ_ПоПараметрамПакетов.ПериодУпаковки,
		|	ВТ_ПоПараметрамПакетов.Характеристика,
		|	ВТ_ПоПараметрамПакетов.Номенклатура,
		|	ВТ_ПоПараметрамПакетов.Порода,
		|	ВТ_ПоПараметрамПакетов.Сорт,
		|	ВТ_ПоПараметрамПакетов.Длина,
		|	ВТ_ПоПараметрамПакетов.Сечение,
		|	ВТ_ПоПараметрамПакетов.Влажность,
		|	ВТ_ПоПараметрамПакетов.БоковаяДоска,
		|	ВТ_ПоПараметрамПакетов.КоличествоСостав,
		|	ВТ_ПоПараметрамПакетов.Сертификат,
		|	ВТ_ПоПараметрамПакетов.Припуск,
		|	ВТ_ПоПараметрамПакетов.Объем,
		|	ВТ_ПоПараметрамПакетов.ОбъемТаможня,
		|	ВТ_ПоПараметрамПакетов.ВесНеттоТаможня,
		|	ВТ_ПоПараметрамПакетов.ВесБруттоТаможня,
		|	ВТ_ПоПараметрамПакетов.КатегорияНоменклатурыПЭО,
		|	NULL,
		|	ВТ_ПоПараметрамПакетов.Порядок,
		|	NULL
		|ИЗ
		|	ВТ_ПоПараметрамПакетов КАК ВТ_ПоПараметрамПакетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Итог.Пакет КАК Пакет,
		|	ВТ_Итог.ПериодУпаковки КАК ПериодУпаковки,
		|	ВТ_Итог.Характеристика КАК Характеристика,
		|	ВТ_Итог.Номенклатура КАК Номенклатура,
		|	ВТ_Итог.Порода КАК Порода,
		|	ВТ_Итог.Сорт КАК Сорт,
		|	ВТ_Итог.Длина КАК Длина,
		|	ВТ_Итог.Сечение КАК Сечение,
		|	ВТ_Итог.Влажность КАК Влажность,
		|	ВТ_Итог.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Итог.КоличествоСостав КАК КоличествоСостав,
		|	ВТ_Итог.Сертификат КАК Сертификат,
		|	ВТ_Итог.Припуск КАК Припуск,
		|	ВТ_Итог.Объем КАК Объем,
		|	ВТ_Итог.ОбъемТаможня КАК ОбъемТаможня,
		|	ВТ_Итог.ВесНеттоТаможня КАК ВесНеттоТаможня,
		|	ВТ_Итог.ВесБруттоТаможня КАК ВесБруттоТаможня,
		|	ВТ_Итог.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО,
		|	ВТ_Итог.Сухой КАК Сухой,
		|	ВТ_Итог.Габарит КАК Габарит,
		|	ВТ_Итог.Порядок КАК Порядок
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомерСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПакета, ВыборкаДетальныеЗаписи);
	КонецЦикла;	
		
	Возврат ПараметрыПакета;
	
КонецФункции // ПараметрыПакетаНоменклатурыПоСерийныйНомер()


// Возвращает параметры пакета из РСВ "ПараметрыПакета"
// Свойства структуры соответствуют ресурсам регистра
//
Функция ПараметрыПакетаНоменклатуры(Номенклатура, НомерПакета, Период = Неопределено, Маска = "") Экспорт
	
	ПараметрыПакета = Новый Структура("Идентифицирован, СерийныйНомер, НомерПакета, ПериодПакета, Характеристика, Объем, Количество, КоличествоСостав, ВесНетто, ВесБрутто, Сертификат, ОбъемТаможня, ВесНеттоТаможня, ВесБруттоТаможня", 
	Ложь,
	Справочники.СерийныеНомера.ПустаяСсылка(),
	НомерПакета,
	Дата(1,1,1),
	Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),
	0, 0, 0, 0, 0,
	"", 0, 0, 0); 
	
	Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат ПараметрыПакета;	
	КонецЕсли;
	
	СерийныйНомерСсылка = ПолучитьСерийныйНомер(Номенклатура, НомерПакета, Период, Маска);
	Если СерийныйНомерСсылка = Справочники.СерийныеНомера.ПустаяСсылка() Тогда
		Возврат ПараметрыПакета;
	КонецЕсли; 
	
	СтруктураПараметров = ПолучитьПараметрыПакетаПоОстаткам(СерийныйНомерСсылка); 
		
	Если ЗначениеЗаполнено(СтруктураПараметров.СерийныйНомер) Тогда 		
		ПараметрыПакета.Вставить("СерийныйНомер", СтруктураПараметров.СерийныйНомер);	
	КонецЕсли;
			
	Если ЗначениеЗаполнено(СтруктураПараметров.Характеристика) Тогда 		
		ПараметрыПакета.Вставить("Характеристика", СтруктураПараметров.Характеристика);	
	КонецЕсли;

	Если ЗначениеЗаполнено(СтруктураПараметров.Объем) Тогда 		
		ПараметрыПакета.Вставить("Объем", СтруктураПараметров.Объем);
		ПараметрыПакета.Вставить("Количество", СтруктураПараметров.Объем);	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(СтруктураПараметров.КоличествоСостав) Тогда 		
		ПараметрыПакета.Вставить("КоличествоСостав", СтруктураПараметров.КоличествоСостав);	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ВесНетто) Тогда 		
		ПараметрыПакета.Вставить("ВесНетто", СтруктураПараметров.ВесНетто);	 
		ПараметрыПакета.Вставить("ВесНеттоТаможня", СтруктураПараметров.ВесНетто);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ВесБрутто) Тогда 		
		ПараметрыПакета.Вставить("ВесБрутто", СтруктураПараметров.ВесБрутто);
		ПараметрыПакета.Вставить("ВесБруттоТаможня", СтруктураПараметров.ВесБрутто)	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Сертификат) Тогда 		
		ПараметрыПакета.Вставить("Сертификат", СтруктураПараметров.Сертификат);	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СтруктураПараметров.ОбъемТаможня) Тогда 		
		ПараметрыПакета.Вставить("ОбъемТаможня", СтруктураПараметров.ОбъемТаможня);	
	КонецЕсли; 
	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ИСТИНА КАК Идентифицирован,
	//|	алк_ПараметрыПакетовСрезПоследних.Объем,
	//|	&СерийныйНомер КАК СерийныйНомер,
	//|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
	//|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	//|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня,
	//|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня,
	//|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня,
	//|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Количество
	//|ИЗ
	//|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, СерийныйНомер = &СерийныйНомер) КАК алк_ПараметрыПакетовСрезПоследних";
	//
	//Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомерСсылка);
	//РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	//
	//Если Не РезультатЗапроса.Пустой() Тогда
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
	//	ЗаполнитьЗначенияСвойств(ПараметрыПакета, ВыборкаДетальныеЗаписи);
	//	
	//КонецЕсли; 
	
	
	
	//Запрос.УстановитьПараметр("Период", Дата(1,1,1)); // В любом случае получаем срез последних
	//
	//Если Период <> Неопределено Тогда
	//	// интересует не самый свежий пакет, а какой-то из прошлых периодов
	//	
	//	Запрос.УстановитьПараметр("ЛюбойПериод", Ложь);
	//	Периодичность = ПериодичностьНумерации(Номенклатура, Период);
	//	Если Периодичность = Перечисления.ПериодыНумерации.Год Тогда
	//		Запрос.УстановитьПараметр("ПериодПакета", НачалоГода(Период));
	//	ИначеЕсли Периодичность = Перечисления.ПериодыНумерации.Месяц Тогда 
	//		Запрос.УстановитьПараметр("ПериодПакета", НачалоМесяца(Период));
	//	ИначеЕсли Периодичность = Перечисления.ПериодыНумерации.Месяц Тогда 
	//		Запрос.УстановитьПараметр("ПериодПакета", НачалоДня(Период));
	//	Иначе
	//		Сообщить("Не указана периодичность нумерации пакета в регистре ""Периодичность нумерации пакетов номенклатуры""");
	//		Запрос.УстановитьПараметр("ПериодПакета", Дата(2015, 11, 09));
	//		Запрос.УстановитьПараметр("ЛюбойПериод", Истина);
	//	КонецЕсли; 	
	//Иначе
	//	// получим все пакеты (по всем периодам) и возьмем самый свежий
	//	Запрос.УстановитьПараметр("ПериодПакета", Дата(2015, 11, 09));
	//	Запрос.УстановитьПараметр("ЛюбойПериод", Истина);
	//КонецЕсли; 
	
	Возврат ПараметрыПакета;
	
КонецФункции // ПараметрыПакетаНоменклатуры()



Функция ПолучитьПараметрыПакетаПоОстаткам(СерийныйНомер)  Экспорт	
	
	Запрос = Новый Запрос;
	Если Не СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000040") Тогда //Фанера ИД
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК Пакет,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
		|	алк_ОстаткиЗапасовОбороты.Сертификат КАК Сертификат,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.КоличествоПриход КАК Объем,
		|	ЕСТЬNULL(алк_БоковаяДоскаСрезПоследних.Сечение = алк_ПараметрыХарактеристик.Сечение, ЛОЖЬ) КАК БоковаяДоска,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) КАК ДлинаММ,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК ШиринаММ,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ТолщинаММ,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоШирине, 0) КАК ПрипускПоШирине,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоТолщине, 0) КАК ПрипускПоТолщине,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоДлине, 0) КАК ПрипускПоДлине,
		|	ОКР(алк_ОстаткиЗапасовОбороты.КоличествоПриход / алк_ПараметрыХарактеристик.Объем, 0) КАК КоличествоСостав,
		|	алк_ОстаткиЗапасовОбороты.Период КАК Период,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.ЕдиницаИзмерения.Код = ""168"" КАК УчетПоВесу
		|ПОМЕСТИТЬ ВТ_Обороты
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Регистратор, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_БоковаяДоска.СрезПоследних КАК алк_БоковаяДоскаСрезПоследних
		|			ПО алк_ПараметрыХарактеристик.Сечение = алк_БоковаяДоскаСрезПоследних.Сечение
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(, СерийныйНомер = &СерийныйНомер) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО алк_ОстаткиЗапасовОбороты.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Порода КАК Порода,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность КАК Влажность,
		|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска КАК БоковаяДоска,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Сорт КАК Сорт,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3 КАК ПлотностьКгМ3,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг КАК ВесТарыКг,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ВТ_Плотность
		|ИЗ
		|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
		|			,
		|			(Характеристика, БоковаяДоска) В
		|				(ВЫБРАТЬ
		|					ВТ_Обороты.Характеристика,
		|					ВТ_Обороты.БоковаяДоска
		|				ИЗ
		|					ВТ_Обороты КАК ВТ_Обороты)) КАК алк_ПлотностьНоменклатурыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
		|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Сорт,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
		|	2
		|ИЗ
		|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
		|			,
		|			Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|				И (Номенклатура, Порода, Влажность, БоковаяДоска) В
		|					(ВЫБРАТЬ
		|						ВТ_Обороты.Номенклатура,
		|						ВТ_Обороты.Порода,
		|						ВТ_Обороты.Влажность,
		|						ВТ_Обороты.БоковаяДоска
		|					ИЗ
		|						ВТ_Обороты КАК ВТ_Обороты)) КАК алк_ПлотностьНоменклатурыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
		|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Сорт,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
		|	3
		|ИЗ
		|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
		|			,
		|			Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|				И (Номенклатура, Порода, БоковаяДоска) В
		|					(ВЫБРАТЬ
		|						ВТ_Обороты.Номенклатура,
		|						ВТ_Обороты.Порода,
		|						ВТ_Обороты.БоковаяДоска
		|					ИЗ
		|						ВТ_Обороты КАК ВТ_Обороты)) КАК алк_ПлотностьНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВТ_Плотность.Номенклатура КАК Номенклатура,
		|	ВТ_Плотность.Порода КАК Порода,
		|	ВТ_Плотность.Влажность КАК Влажность,
		|	ВТ_Плотность.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Плотность.Характеристика КАК Характеристика,
		|	ВТ_Плотность.Сорт КАК Сорт,
		|	ВТ_Плотность.ПлотностьКгМ3 КАК ПлотностьКгМ3,
		|	ВТ_Плотность.ВесТарыКг КАК ВесТарыКг,
		|	ВТ_Плотность.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ ВТ_ПлотностьИтог
		|ИЗ
		|	ВТ_Плотность КАК ВТ_Плотность
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Обороты.Пакет КАК Пакет,
		|	ВТ_Обороты.Характеристика КАК Характеристика,
		|	ВТ_Обороты.Номенклатура КАК Номенклатура,
		|	ВТ_Обороты.Порода КАК Порода,
		|	ВТ_Обороты.Сорт КАК Сорт,
		|	ВТ_Обороты.Длина КАК Длина,
		|	ВТ_Обороты.Сечение КАК Сечение,
		|	ВТ_Обороты.Влажность КАК Влажность,
		|	ВТ_Обороты.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Обороты.КоличествоСостав КАК КоличествоСостав,
		|	ВТ_Обороты.Сертификат КАК Сертификат,
		|	ВЫБОР
		|		КОГДА ВТ_Обороты.УчетПоВесу
		|			ТОГДА ОКР(ВТ_Обороты.Объем * 1000 / ВТ_ПлотностьИтог.ПлотностьКгМ3, 3)
		|		ИНАЧЕ ВТ_Обороты.Объем
		|	КОНЕЦ КАК Объем,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ВТ_Обороты.УчетПоВесу
		|				ТОГДА ОКР(ВТ_Обороты.Объем * 1000 / ВТ_ПлотностьИтог.ПлотностьКгМ3, 2)
		|			ИНАЧЕ ОКР((ВТ_Обороты.ДлинаММ + ВТ_Обороты.ПрипускПоДлине) * (ВТ_Обороты.ШиринаММ + ВТ_Обороты.ПрипускПоШирине) * (ВТ_Обороты.ТолщинаММ + ВТ_Обороты.ПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000, 3)
		|		КОНЕЦ) КАК ОбъемТаможня,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ВТ_Обороты.УчетПоВесу
		|				ТОГДА ВТ_Обороты.Объем
		|			ИНАЧЕ ОКР(ВТ_ПлотностьИтог.ПлотностьКгМ3 * (ВТ_Обороты.ДлинаММ + ВТ_Обороты.ПрипускПоДлине) * (ВТ_Обороты.ШиринаММ + ВТ_Обороты.ПрипускПоШирине) * (ВТ_Обороты.ТолщинаММ + ВТ_Обороты.ПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000000, 3)
		|		КОНЕЦ) КАК ВесНеттоТаможня,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ВТ_Обороты.УчетПоВесу
		|				ТОГДА ОКР(ВТ_ПлотностьИтог.ВесТарыКг / 1000 + ВТ_Обороты.Объем, 3)
		|			ИНАЧЕ ОКР(ВТ_ПлотностьИтог.ВесТарыКг / 1000 + ВТ_ПлотностьИтог.ПлотностьКгМ3 * (ВТ_Обороты.ДлинаММ + ВТ_Обороты.ПрипускПоДлине) * (ВТ_Обороты.ШиринаММ + ВТ_Обороты.ПрипускПоШирине) * (ВТ_Обороты.ТолщинаММ + ВТ_Обороты.ПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000000, 3)
		|		КОНЕЦ) КАК ВесБруттоТаможня,
		|	СРЕДНЕЕ(1) КАК Порядок,
		|	ВТ_Обороты.Период КАК Период,
		|	ВТ_ПлотностьИтог.ПлотностьКгМ3 КАК ПлотностьКгМ3,
		|	ВТ_ПлотностьИтог.ВесТарыКг КАК ВесТарыКг
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТ_Обороты КАК ВТ_Обороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлотностьИтог КАК ВТ_ПлотностьИтог
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Обороты.Пакет,
		|	ВТ_Обороты.Характеристика,
		|	ВТ_Обороты.Порода,
		|	ВТ_Обороты.Сорт,
		|	ВТ_Обороты.Длина,
		|	ВТ_Обороты.Сечение,
		|	ВТ_Обороты.Влажность,
		|	ВТ_Обороты.Сертификат,
		|	ВТ_Обороты.Номенклатура,
		|	ВТ_Обороты.КоличествоСостав,
		|	ВТ_Обороты.БоковаяДоска,
		|	ВТ_Обороты.Период,
		|	ВТ_ПлотностьИтог.ПлотностьКгМ3,
		|	ВТ_ПлотностьИтог.ВесТарыКг,
		|	ВЫБОР
		|		КОГДА ВТ_Обороты.УчетПоВесу
		|			ТОГДА ОКР(ВТ_Обороты.Объем * 1000 / ВТ_ПлотностьИтог.ПлотностьКгМ3, 3)
		|		ИНАЧЕ ВТ_Обороты.Объем
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СерийныеНомера.Ссылка КАК Пакет,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ПериодУпаковки,
		|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
		|	СерийныеНомера.Владелец КАК Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
		|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска КАК БоковаяДоска,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
		|	алк_ПараметрыПакетовСрезПоследних.Припуск КАК Припуск,
		|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня КАК ОбъемТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНеттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО,
		|	2 КАК Порядок,
		|	алк_ПараметрыПакетовСрезПоследних.Габарит КАК Габарит,
		|	алк_ПараметрыПакетовСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ПоПараметрамПакетов
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, СерийныйНомер.Ссылка = &СерийныйНомер) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Пакет КАК Пакет,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Порода КАК Порода,
		|	ВТ.Сорт КАК Сорт,
		|	ВТ.Длина КАК Длина,
		|	ВТ.Сечение КАК Сечение,
		|	ВТ.Влажность КАК Влажность,
		|	ВТ.БоковаяДоска КАК БоковаяДоска,
		|	ВТ.КоличествоСостав КАК КоличествоСостав,
		|	ВТ.Сертификат КАК Сертификат,
		|	ВТ.Объем КАК Объем,
		|	ВТ.ОбъемТаможня КАК ОбъемТаможня,
		|	ВТ.ВесНеттоТаможня КАК ВесНеттоТаможня,
		|	ВТ.ВесБруттоТаможня КАК ВесБруттоТаможня,
		|	ВТ.Порядок КАК Порядок,
		|	ВТ.Период КАК Период,
		|	ВТ.ПлотностьКгМ3 / 1000 КАК Плотность,
		|	ВТ.ВесТарыКг / 1000 КАК ВесТары
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ КАК ВТ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПоПараметрамПакетов.Пакет,
		|	ВТ_ПоПараметрамПакетов.Характеристика,
		|	ВТ_ПоПараметрамПакетов.Номенклатура,
		|	ВТ_ПоПараметрамПакетов.Порода,
		|	ВТ_ПоПараметрамПакетов.Сорт,
		|	ВТ_ПоПараметрамПакетов.Длина,
		|	ВТ_ПоПараметрамПакетов.Сечение,
		|	ВТ_ПоПараметрамПакетов.Влажность,
		|	ВТ_ПоПараметрамПакетов.БоковаяДоска,
		|	ВТ_ПоПараметрамПакетов.КоличествоСостав,
		|	ВТ_ПоПараметрамПакетов.Сертификат,
		|	ВТ_ПоПараметрамПакетов.Объем,
		|	ВТ_ПоПараметрамПакетов.ОбъемТаможня,
		|	ВТ_ПоПараметрамПакетов.ВесНеттоТаможня,
		|	ВТ_ПоПараметрамПакетов.ВесБруттоТаможня,
		|	ВТ_ПоПараметрамПакетов.Порядок,
		|	ВТ_ПоПараметрамПакетов.Период,
		|	NULL,
		|	NULL
		|ИЗ
		|	ВТ_ПоПараметрамПакетов КАК ВТ_ПоПараметрамПакетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВТ_Итог.Номенклатура КАК Номенклатура,
		|	ВТ_Итог.Характеристика КАК Характеристика,
		|	ВТ_Итог.Пакет КАК СерийныйНомер,
		|	ВТ_Итог.Объем КАК Объем,
		|	ВТ_Итог.КоличествоСостав КАК КоличествоСостав,
		|	ВТ_Итог.Сертификат КАК Сертификат,
		|	ВТ_Итог.ВесНеттоТаможня КАК ВесНетто,
		|	ВТ_Итог.ВесБруттоТаможня КАК ВесБрутто,
		|	ВТ_Итог.ОбъемТаможня КАК ОбъемТаможня,
		|	ВТ_Итог.Порода КАК Порода,
		|	ВТ_Итог.Сорт КАК Сорт,
		|	ВТ_Итог.Длина КАК Длина,
		|	ВТ_Итог.Сечение КАК Сечение,
		|	ВТ_Итог.Влажность КАК Влажность,
		|	ВТ_Итог.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Итог.Порядок КАК Порядок,
		|	ВТ_Итог.Плотность КАК Плотность,
		|	ВТ_Итог.ВесТары КАК ВесТары
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	ВТ_Итог.Период УБЫВ"; 
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК Пакет,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасовОбороты.Сертификат КАК Сертификат,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.КоличествоПриход КАК Объем,
		|	алк_ОстаткиЗапасовОбороты.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(алк_ОстаткиЗапасовОбороты.КоличествоПриход / алк_ПараметрыХарактеристик.Объем)
		|	КОНЕЦ КАК КоличествоЛистов,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность КАК Поверхность
		|ПОМЕСТИТЬ ВТ_Обороты
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Регистратор, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТ_Обороты.Период) КАК Период
		|ПОМЕСТИТЬ МинПериод
		|ИЗ
		|	ВТ_Обороты КАК ВТ_Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МинПериод.Период КАК Период,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.Плотность, 0) КАК Плотность,
		|	алк_НормыРасходаИВыпуска.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ НормыРасходаИВыпуска
		|ИЗ
		|	МинПериод КАК МинПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_НормыРасходаИВыпуска КАК алк_НормыРасходаИВыпуска
		|		ПО МинПериод.Период >= алк_НормыРасходаИВыпуска.ДатаНачалаДействия
		|			И МинПериод.Период <= алк_НормыРасходаИВыпуска.ДатаОкончанияДействия
		|ГДЕ
		|	алк_НормыРасходаИВыпуска.Проведен
		|	И алк_НормыРасходаИВыпуска.Операция = &Операция
		|	И алк_НормыРасходаИВыпуска.Характеристика В
		|			(ВЫБРАТЬ
		|				ВТ_Обороты.Характеристика КАК Характеристика
		|			ИЗ
		|				ВТ_Обороты КАК ВТ_Обороты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормыРасходаИВыпуска.Период КАК Период,
		|	ВТ_Обороты.Номенклатура КАК Номенклатура,
		|	ВТ_Обороты.Характеристика КАК Характеристика,
		|	ВТ_Обороты.Пакет КАК СерийныйНомер,
		|	ВТ_Обороты.Сертификат КАК Сертификат,
		|	ВТ_Обороты.Объем КАК Объем,
		|	ВТ_Обороты.КоличествоЛистов КАК КоличествоСостав,
		|	ВТ_Обороты.Объем КАК ОбъемТаможня,
		|	ОКР(ВТ_Обороты.Объем * НормыРасходаИВыпуска.Плотность / 1000, 3) КАК ВесНетто,
		|	ОКР(ВТ_Обороты.Объем * НормыРасходаИВыпуска.Плотность / 1000 + 0.01, 3) КАК ВесБрутто,
		|	НормыРасходаИВыпуска.Плотность КАК Плотность,
		|	ЕСТЬNULL(НормыРасходаИВыпуска.Ссылка, ЗНАЧЕНИЕ(Документ.алк_НормыРасходаИВыпуска.ПустаяСсылка)) КАК Норма,
		|	10 КАК ВесТары
		|ИЗ
		|	ВТ_Обороты КАК ВТ_Обороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НормыРасходаИВыпуска КАК НормыРасходаИВыпуска
		|		ПО ВТ_Обороты.Период = НормыРасходаИВыпуска.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Обороты.Пакет,
		|	ВТ_Обороты.Характеристика,
		|	ВТ_Обороты.Сертификат,
		|	ВТ_Обороты.Номенклатура,
		|	ВТ_Обороты.Объем,
		|	ВТ_Обороты.КоличествоЛистов,
		|	ОКР(ВТ_Обороты.Объем * НормыРасходаИВыпуска.Плотность / 1000, 3),
		|	ОКР(ВТ_Обороты.Объем * НормыРасходаИВыпуска.Плотность / 1000 + 0.01, 3),
		|	НормыРасходаИВыпуска.Период,
		|	НормыРасходаИВыпуска.Плотность,
		|	ЕСТЬNULL(НормыРасходаИВыпуска.Ссылка, ЗНАЧЕНИЕ(Документ.алк_НормыРасходаИВыпуска.ПустаяСсылка)),
		|	ВТ_Обороты.Объем"; 
		
		Запрос.УстановитьПараметр("Операция", Справочники.алк_ОперацииПроизводства.УпаковкаФанеры);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураПараметров = новый структура("Номенклатура,Характеристика,СерийныйНомер,Объем,КоличествоСостав,Сертификат,Плотность,ВесТары,ВесНетто,ВесБрутто,ОбъемТаможня");	
	
	Если Не СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000040") Тогда //Фанера ИД
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
	Иначе
		
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить(СтрШаблон("Ошибка! Не найдена норма по пакету %1. Невозможно рассчитать вес. Обратитесь с данным вопросом к технологу ИД",СерийныйНомер));
			Возврат Неопределено; 
		КонецЕсли;
		
		ТЗ = РезультатЗапроса.Выгрузить();  

		Нормы = ТЗ.ВыгрузитьКолонку("Норма");
		СгрупНормы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Нормы);
		
		Если СгрупНормы.Количество() > 1 Тогда 
			
			Сообщить(СтрШаблон("Ошибка! Найдено больше 1 подходящей нормы на пакет %1. Невозможно рассчитать вес. Обратитесь с данным вопросом к технологу ИД",СерийныйНомер));
			
			Для Каждого норма ИЗ СгрупНормы Цикл
				Сообщить(норма);
			КонецЦикла; 
			
			Возврат Неопределено;
			
		Иначе 
			
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, ТЗ[0]);  
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураПараметров; 	

КонецФункции

#КонецОбласти


#Область ДанныеЗаказовПокупателя

Функция ПолучитьАссортиментЗаказаПокупателя(ЗаказПокупателя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Номенклатура,
	|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика
	|ИЗ
	|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	|ГДЕ
	|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции


#КонецОбласти 


#Область ДанныеНоменклатуры

Функция ОсновнаяНоменклатураКатегории(КатегорияНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновнаяНоменклатураКатегорий.Номенклатура
	|ИЗ
	|	РегистрСведений.ОсновнаяНоменклатураКатегорий КАК ОсновнаяНоменклатураКатегорий
	|ГДЕ
	|	ОсновнаяНоменклатураКатегорий.КатегорияНоменклатуры = &КатегорияНоменклатуры";
	
	Запрос.УстановитьПараметр("КатегорияНоменклатуры", КатегорияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Номенклатура;
		
	Иначе
		
		Возврат Справочники.Номенклатура.ПустаяСсылка();
		
	КонецЕсли; 
	
КонецФункции

Функция ШаблонСерийногоНомераНоменклатурыДляПериода(Номенклатура, ПериодСерии, Маска = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ШаблоныСерийныхНомеровНоменклатуры.ШаблонСерийногоНомера
	|ИЗ
	|	РегистрСведений.алк_ШаблоныСерийныхНомеровНоменклатуры КАК алк_ШаблоныСерийныхНомеровНоменклатуры
	|ГДЕ
	|	алк_ШаблоныСерийныхНомеровНоменклатуры.ШаблонСерийногоНомера.Наименование ПОДОБНО &Наименование
	|	И алк_ШаблоныСерийныхНомеровНоменклатуры.Номенклатура = &Номенклатура
	|			И алк_ШаблоныСерийныхНомеровНоменклатуры.ПериодСерии = НАЧАЛОПЕРИОДА(&ПериодСерии, ГОД)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ПериодСерии", ПериодСерии); 
	Запрос.УстановитьПараметр("Наименование", Маска + "%");
	
	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий(); 
		Возврат ВыборкаДетальныеЗаписи.ШаблонСерийногоНомера;
		
	Иначе
		
		Возврат Справочники.ШаблоныСерийныхНомеров.ПустаяСсылка();
		
	КонецЕсли; 
	
КонецФункции // ШаблонСерийногоНомераНоменклатурыДляПериода()

Функция КатегорияНоменклатурыНаСервере(Номенклатура) Экспорт
	
	Возврат Номенклатура.КатегорияНоменклатуры;
	
КонецФункции

Функция ПолучитьКатегорииНаправления(Направление) Экспорт
	
	СписокКатегорий = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_НаправленияКатегорий.КатегорияНоменклатуры
	|ИЗ
	|	Справочник.алк_НаправленияКатегорий КАК алк_НаправленияКатегорий
	|ГДЕ
	|	алк_НаправленияКатегорий.НаправленияДеятельности.Направление = &Направление
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_НаправленияКатегорий.КатегорияНоменклатуры";
	
	Запрос.УстановитьПараметр("Направление", Направление);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СписокКатегорий.Добавить(ВыборкаДетальныеЗаписи.КатегорияНоменклатуры);
		
	КонецЦикла;
	
	Возврат СписокКатегорий;
	
КонецФункции

#КонецОбласти 


#Область ВспомогательныеДанные

// Возвращает данные из регистра сведений "Основные объекты"
// ВидОбъекта - элемент справочника "Виды объектов" - как правило предопределенное значение
// Функция позволяет получить объекты предметной области без использования "НайтиПоКоду", "НайтиПоНаименованию" и т.п.
//
Функция ОбъектДанных(ВидОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОсновныеОбъекты.Значение
	|ИЗ
	|	РегистрСведений.алк_ОсновныеОбъекты КАК алк_ОсновныеОбъекты
	|ГДЕ
	|	алк_ОсновныеОбъекты.ВидОбъекта = &ВидОбъекта";
	
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВДЗ = РезультатЗапроса.Выбрать(); ВДЗ.Следующий();
		
		Возврат ВДЗ.Значение;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 	
	
КонецФункции

Функция АнглийскоеНаименование(Ссылка) Экспорт
	
	НаименованиеАнгл = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_НаменованияАнгл.НаименованиеАнгл
	|ИЗ
	|	РегистрСведений.алк_НаменованияАнгл КАК алк_НаменованияАнгл
	|ГДЕ
	|	алк_НаменованияАнгл.ОбъектДанных = &ОбъектДанных";
	
	Запрос.УстановитьПараметр("ОбъектДанных", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
	
	НаименованиеАнгл = ВыборкаДетальныеЗаписи.НаименованиеАнгл;
	
	Возврат НаименованиеАнгл;
	
КонецФункции

Функция АнглийскоеНаименованиеАдрес(Ссылка) Экспорт
	
	НаименованиеАнгл = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_НаменованияАнгл.НаименованиеАнгл,
	|	алк_НаменованияАнгл.АдресАнгл
	|ИЗ
	|	РегистрСведений.алк_НаменованияАнгл КАК алк_НаменованияАнгл
	|ГДЕ
	|	алк_НаменованияАнгл.ОбъектДанных = &ОбъектДанных";
	
	Запрос.УстановитьПараметр("ОбъектДанных", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
	
	НаименованиеАнгл = "" + ВыборкаДетальныеЗаписи.НаименованиеАнгл + " " + ВыборкаДетальныеЗаписи.АдресАнгл;
	
	Возврат НаименованиеАнгл;
	
КонецФункции

Функция ПолучитьКонтрагентаПоСтруктурнойЕд(СтруктурнаяЕдиница, НаДату = Неопределено) Экспорт
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СтруктурныеЕдиницыКонтрагентовСрезПоследних.Контрагент
	|ИЗ
	|	РегистрСведений.алк_СтруктурныеЕдиницыКонтрагентов.СрезПоследних(&Период, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_СтруктурныеЕдиницыКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ?(НаДату = Неопределено, '00010101', НаДату));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		
	КонецЦикла;
	
	Возврат Контрагент;
	
КонецФункции

Функция ПолучитьКоличествоСоставаКонстантные(Номенклатура, Характеристика, Период) Экспорт 
	
	КоличествоСостав = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_КонстантныеКоличестваСоставаПакетовСрезПоследних.Количество
	|ИЗ
	|	РегистрСведений.алк_КонстантныеКоличестваСоставаПакетов.СрезПоследних(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК алк_КонстантныеКоличестваСоставаПакетовСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		КоличествоСостав = ВыборкаДетальныеЗаписи.Количество;	
		
	КонецЦикла;
	
	Возврат КоличествоСостав;
	
КонецФункции

// Функция - Получить параметры смены по дате. Начало смены записано в элементе справочника алк_Смены.
//		Дата смены относится к началу смены, смена начинается в 8:00 и 20:00 текущего дня
//
// Параметры:
//  Участок		 - Справочник.алк_Участки - Участок, необходим для отбора по типу смены 
//  ДатаВремя	 - ДатаВремя - Дата, на которую требуется получить дату смены и смену. Может быть пустая дата, расчитаем от текущей даты
// 
// Возвращаемое значение:
//  Структура("Смена, ДатаСмены") - Возвращается структура с ключами Смена и ДатаСмены
// Дубоделов Э.А
Функция ПолучитьПараметрыСменыПоДате(Участок, Знач ДатаВремя = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаВремя) тогда
		ДатаВремя = ТекущаяДата();
	КонецЕсли;
	
	ТипСмены = РфпСервер.ПолучитьТипСмены(Участок, ДатаВремя);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_Смены.Ссылка КАК Смена,
	|	алк_Смены.НачалоСмены КАК НачалоСмены,
	|	ДОБАВИТЬКДАТЕ(алк_Смены.НачалоСмены, СЕКУНДА, ВЫБОР
	|			КОГДА алк_Смены.НачалоСмены > алк_Смены.КонецСмены
	|				ТОГДА РАЗНОСТЬДАТ(алк_Смены.КонецСмены, алк_Смены.НачалоСмены, СЕКУНДА) - 2
	|			ИНАЧЕ РАЗНОСТЬДАТ(алк_Смены.НачалоСмены, алк_Смены.КонецСмены, СЕКУНДА)
	|		КОНЕЦ) КАК КонецСмены,
	|	алк_Смены.ТипСмен
	|ПОМЕСТИТЬ ВТ_Смены
	|ИЗ
	|	Справочник.алк_Смены КАК алк_Смены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Смены.Смена,
	|	ВТ_Смены.НачалоСмены,
	|	ВТ_Смены.КонецСмены,
	|	ВТ_Смены.ТипСмен,
	|	ВЫБОР
	|		КОГДА НЕ(&ДатаВремя МЕЖДУ ВТ_Смены.НачалоСмены И ВТ_Смены.КонецСмены)
	|				ИЛИ ВТ_Смены.Смена.СменаПрошлыхСуток
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаПрошлыхСуток
	|ИЗ
	|	ВТ_Смены КАК ВТ_Смены
	|ГДЕ
	|	ВТ_Смены.ТипСмен = &ТипСмены
	|	И (&ДатаВремя МЕЖДУ ВТ_Смены.НачалоСмены И ВТ_Смены.КонецСмены
	|			ИЛИ ДОБАВИТЬКДАТЕ(&ДатаВремя, ДЕНЬ, 1) МЕЖДУ ВТ_Смены.НачалоСмены И ВТ_Смены.КонецСмены)";
	
	Запрос.УстановитьПараметр("ДатаВремя", Дата(1,1,1) + (ДатаВремя-НачалоДня(ДатаВремя))); //Получаем текущее время с нулевой датой
	Запрос.УстановитьПараметр("ТипСмены", ТипСмены);
	
	ТаблицаСмен = Запрос.Выполнить().Выбрать();
	
	Если ТаблицаСмен.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Тип смены участка не установлен.";
		Сообщение.Сообщить();
		Возврат NULL;
	КонецЕсли;
	
	Результат = Новый Структура("ДатаСмены, Смена");
	
	Пока ТаблицаСмен.Следующий() Цикл
		
		Результат.Смена = ТаблицаСмен.Смена;
		
		Если ТаблицаСмен.СменаПрошлыхСуток Тогда
			Результат.ДатаСмены = НачалоДня(ДатаВремя) - 24*60*60; 
		Иначе
			Результат.ДатаСмены = НачалоДня(ДатаВремя);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти 


#Область РасчетОбъемов

Функция ПлотностьНоменклатуры(Номенклатура, Характеристика) Экспорт
	
	Период = '0001-01-01';
	
	ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Характеристика);
	
	ОтборРегистра = Новый Структура("Номенклатура, Порода", Номенклатура, ПараметрыХ["Порода"]); 
	
	ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
	
	Если ТЗПлотность.Количество() <> 0 Тогда
		Плотность = ТЗПлотность[0].ПлотностьКгМ3;
	Иначе
		Плотность = 0;
	КонецЕсли;
	
	Возврат Плотность;
	
КонецФункции

Функция ОбъемПоКубатурнику(Характеристика, ТипКубатурника = "") Экспорт
	
	Объем = 0;
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		
		Возврат Объем;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 1000 КАК Сечение
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатХарактеристика = Запрос.Выполнить();
	
	Если Не РезультатХарактеристика.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатХарактеристика.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Длина   = ВыборкаДетальныеЗаписи.Длина;
		Сечение = ВыборкаДетальныеЗаписи.Сечение;
		
	Иначе 
		
		Возврат Объем;
		
	КонецЕсли; 
	
	Если ТипКубатурника = "" Тогда
		ТипКубатурника = Перечисления.алк_ТипыКубатурников.ГОСТ_270875;	
	КонецЕсли; 
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_КубатурникКруглогоЛеса.Объем
	|ИЗ
	|	РегистрСведений.алк_КубатурникКруглогоЛеса КАК алк_КубатурникКруглогоЛеса
	|ГДЕ
	|	алк_КубатурникКруглогоЛеса.ДлинаМ = &Длина
	|	И алк_КубатурникКруглогоЛеса.СечениеМ = &Сечение
	|	И алк_КубатурникКруглогоЛеса.ТипКубатурника = &ТипКубатурника";
	
	Запрос.УстановитьПараметр("Сечение", Сечение);
	Запрос.УстановитьПараметр("Длина", Длина);
	Запрос.УстановитьПараметр("ТипКубатурника", ТипКубатурника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Объем = ВыборкаДетальныеЗаписи.Объем;
		
	КонецЕсли; 
	
	
	Возврат Объем;
	
КонецФункции  // ОбъемПоКубатурнику()

// Длина, Сечение - Ссылки на справочники
//
Функция ОбъемПоКубатурникуПоСвойствам(Длина, Сечение, ТипКубатурника = "") Экспорт
	
	Объем = 0;
	
	Если ТипЗнч(Длина) <> Тип("СправочникСсылка.Длины") ИЛИ ТипЗнч(Сечение) <> Тип("СправочникСсылка.РазмерСечения") Тогда
		
		Возврат Объем;
		
	КонецЕсли;
	
	
	Если ТипКубатурника = "" Тогда
		ТипКубатурника = Перечисления.алк_ТипыКубатурников.ГОСТ_270875;	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_КубатурникКруглогоЛеса.Объем
	|ИЗ
	|	РегистрСведений.алк_КубатурникКруглогоЛеса КАК алк_КубатурникКруглогоЛеса
	|ГДЕ
	|	алк_КубатурникКруглогоЛеса.ДлинаМ = &Длина
	|	И алк_КубатурникКруглогоЛеса.СечениеМ = &Сечение
	|	И алк_КубатурникКруглогоЛеса.ТипКубатурника = &ТипКубатурника";
	
	Запрос.УстановитьПараметр("Длина", Длина.ДлинаММ/1000);
	Запрос.УстановитьПараметр("Сечение", Сечение.ДиаметрММ/1000);
	Запрос.УстановитьПараметр("ТипКубатурника", ТипКубатурника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Объем = ВыборкаДетальныеЗаписи.Объем;
		
	КонецЕсли; 
	
	Возврат Объем;
	
КонецФункции

Функция ОбъемПоХарактеристике(Характеристика) Экспорт
	
	Объем = 0;
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		
		Возврат Объем;
		
	КонецЕсли;	
	
	Если ТипЗнч(Характеристика.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		КатегорияНоменклатуры = Характеристика.Владелец.КатегорияНоменклатуры;
		
	Иначе
		
		КатегорияНоменклатуры = Характеристика.Владелец;
		
	КонецЕсли; 
	
	
	Если КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиломатериал Тогда
		
		Объем = ОбъемКвадрата(Характеристика);
		
	КонецЕсли; 
	
	Возврат Объем;
	
КонецФункции

Функция ОбъемКвадрата(Характеристика)
	
	ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Характеристика);
	
	Объем = ПараметрыХ["Длина"].ДлинаММ/1000 * ПараметрыХ["Сечение"].ШиринаММ/1000 * ПараметрыХ["Сечение"].ТолщинаММ/1000; 
	
	Возврат Объем;
	
КонецФункции // ОбъемКвадрата

Функция ОбъемПрипуска(Припуск) Экспорт  
	
	Возврат РфпСервер.ПолучитьПараметрыПрипуска(Припуск);	

КонецФункции // ОбъемПрипуска()   

Функция ПараметрыХарактеристики(Характеристика)Экспорт  
	
	ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Характеристика);
	
	ПараметрыММ = Новый Структура;
	
	ПараметрыММ.Вставить("ДлинаММ",ПараметрыХ["Длина"].ДлинаММ);
	ПараметрыММ.Вставить("ШиринаММ",ПараметрыХ["Сечение"].ШиринаММ);
	ПараметрыММ.Вставить("ТолщинаММ",ПараметрыХ["Сечение"].ТолщинаММ);
	
	Возврат ПараметрыММ;

КонецФункции // ПараметрыХарактеристики()



#КонецОбласти 


#Область СинхронизацияОбменов

Функция ПородаДлина_по_рфпПорода(рфпПорода) Экспорт
	
	ПородаДлина = Новый Структура("Порода, Длина", Справочники.Породы.ПустаяСсылка(), Справочники.Длины.ПустаяСсылка()); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_СинхронзацияОпербазПорода.Порода,
	|	алк_СинхронзацияОпербазПорода.Длина
	|ИЗ
	|	РегистрСведений.алк_СинхронзацияОпербазПорода КАК алк_СинхронзацияОпербазПорода
	|ГДЕ
	|	алк_СинхронзацияОпербазПорода.рфпПорода = &рфпПорода";
	
	Запрос.УстановитьПараметр("рфпПорода", рфпПорода);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		
		ПородаДлина.Порода = ВыборкаДетальныеЗаписи.Порода;
		ПородаДлина.Длина  = ВыборкаДетальныеЗаписи.Длина;
		
	КонецЕсли; 
	
	Возврат ПородаДлина;
	
КонецФункции

Функция Сорт_по_рфпСорт(рфпСорт) Экспорт
	
	Сорт = Справочники.Сорта.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_СинхронзацияОпербазСорт.Сорт
	|ИЗ
	|	РегистрСведений.алк_СинхронзацияОпербазСорт КАК алк_СинхронзацияОпербазСорт
	|ГДЕ
	|	алк_СинхронзацияОпербазСорт.рфпСорт = &рфпСорт";
	
	Запрос.УстановитьПараметр("рфпСорт", рфпСорт);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		
		Сорт = ВыборкаДетальныеЗаписи.Сорт;
		
	КонецЕсли; 
	
	Возврат Сорт;
	
КонецФункции

Функция Производитель_по_рфпПроизводитель(рфпПроизводитель) Экспорт
	
	Производитель = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_СинхронизацияОпербазПроизводитель.Производитель
	|ИЗ
	|	РегистрСведений.алк_СинхронизацияОпербазПроизводитель КАК алк_СинхронизацияОпербазПроизводитель
	|ГДЕ
	|	алк_СинхронизацияОпербазПроизводитель.рфпПроизводитель = &рфпПроизводитель";
	
	Запрос.УстановитьПараметр("рфпПроизводитель", рфпПроизводитель);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		
		Производитель = ВыборкаДетальныеЗаписи.Производитель;
		
	КонецЕсли; 
	
	Возврат Производитель;
	
	
КонецФункции // Производитель_по_рфпПроизводитель


#КонецОбласти 


#Область ДанныйСоответствийСортировки

Функция ПородаПоСортировке(ДанныеФайла) Экспорт
	
	Порода = Справочники.Породы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПородаСортировка.Порода
	|ИЗ
	|	РегистрСведений.алк_ПородаСортировка КАК алк_ПородаСортировка
	|ГДЕ
	|	алк_ПородаСортировка.ПородаФайл = &ПородаФайл";
	
	Запрос.УстановитьПараметр("ПородаФайл", ДанныеФайла);
	//Запрос.УстановитьПараметр("ПородаФайл", НРег(СокрЛП(ДанныеФайла)));
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Порода = ВыборкаДетальныеЗаписи.Порода;
		
	КонецЕсли; 
	
	Возврат Порода;
	
КонецФункции

Функция СортПоСортировке(ДанныеФайла) Экспорт
	
	Сорт = Справочники.Сорта.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СортСортировка.Сорт
	|ИЗ
	|	РегистрСведений.алк_СортСортировка КАК алк_СортСортировка
	|ГДЕ
	|	алк_СортСортировка.СортФайл = &СортФайл";
	
	Запрос.УстановитьПараметр("СортФайл", ДанныеФайла);
	//Запрос.УстановитьПараметр("ПородаФайл", НРег(СокрЛП(ДанныеФайла)));
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Сорт = ВыборкаДетальныеЗаписи.Сорт;
		
	КонецЕсли; 
	
	Возврат Сорт;
	
КонецФункции

#КонецОбласти 


#Область КонвертацияСортировкиВ_ГОСТ

Функция ПривестиСечениеКГост(ДиаметрВершиныФакт, НаДату = Неопределено, БезВычетаНаКору = Ложь) Экспорт
	
	Если БезВычетаНаКору Тогда		
		СечениеБезКоры = ДиаметрВершиныФакт; 	
	Иначе	                                		
		СечениеБезКоры = ДиаметрВершиныФакт - ПолучитьВычетНаКору(ДиаметрВершиныФакт, ?(НаДату = Неопределено, '00010101', НаДату));	
	КонецЕсли; 
		
	СечениеГОСТ = ПолучитьСечениеГОСТ(СечениеБезКоры, НаДату);
	
	Возврат СечениеГОСТ;
	
КонецФункции

Функция ПривестиСечениеКОУ(ДиаметрВершиныФакт, НаДату = Неопределено, БезВычетаНаКору = Ложь) Экспорт
	
	Если БезВычетаНаКору Тогда		
		СечениеБезКоры = ДиаметрВершиныФакт; 	
	Иначе	                                		
		СечениеБезКоры = ДиаметрВершиныФакт - ПолучитьВычетНаКору(ДиаметрВершиныФакт, ?(НаДату = Неопределено, '00010101', НаДату));	
	КонецЕсли;
	
	СечениеОУ = ПолучитьСечениеОУ(СечениеБезКоры, ?(НаДату = Неопределено, '00010101', НаДату));
	
	Возврат СечениеОУ;
	
КонецФункции

Функция ПолучитьВычетНаКору(Диаметр, НаДату)
	
	ВычетНаКору = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	алк_ВычетНаКоруСрезПоследних.ВычетКоры,
	|	алк_ВычетНаКоруСрезПоследних.СечениеОт,
	|	алк_ВычетНаКоруСрезПоследних.СечениеДо,
	|	алк_ВычетНаКоруСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.алк_ВычетНаКору.СрезПоследних(&НаДату, ) КАК алк_ВычетНаКоруСрезПоследних
	|ГДЕ
	|	алк_ВычетНаКоруСрезПоследних.СечениеОт <= &Сечение
	|	И алк_ВычетНаКоруСрезПоследних.СечениеДо > &Сечение
	|	И алк_ВычетНаКоруСрезПоследних.Период <= &НаДату
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Сечение", Диаметр);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВычетНаКору = ВыборкаДетальныеЗаписи.ВычетКоры;
		
	КонецЦикла;
	
	Возврат ВычетНаКору;
	
КонецФункции

Функция ПолучитьСечениеГОСТ(СечениеММ, НаДату)
	
	//Сечение = Справочники.РазмерСечения.ПустаяСсылка();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_СечениеВГОСТСрезПоследних.Сечение
	//|ИЗ
	//|	РегистрСведений.алк_СечениеВГОСТ.СрезПоследних(&НаДату, ) КАК алк_СечениеВГОСТСрезПоследних
	//|ГДЕ
	//|	алк_СечениеВГОСТСрезПоследних.СечениеОт <= &СечениеММ
	//|	И алк_СечениеВГОСТСрезПоследних.СечениеДо >= &СечениеММ";
	//
	//Запрос.УстановитьПараметр("СечениеММ", СечениеММ);
	//Запрос.УстановитьПараметр("НаДату", ?(НаДату = Неопределено, '00010101', НаДату));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Сечение = ВыборкаДетальныеЗаписи.Сечение;
	//	
	//КонецЦикла;
	//
	//Возврат Сечение;
	
	Сечение = Справочники.РазмерСечения.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	алк_СечениеВГОСТСрезПоследних.Сечение,
	|	алк_СечениеВГОСТСрезПоследних.Период КАК Период,
	|	алк_СечениеВГОСТСрезПоследних.СечениеОт,
	|	алк_СечениеВГОСТСрезПоследних.СечениеДо
	|ИЗ
	|	РегистрСведений.алк_СечениеВГОСТ.СрезПоследних(&НаДату, ) КАК алк_СечениеВГОСТСрезПоследних
	|ГДЕ
	|	алк_СечениеВГОСТСрезПоследних.СечениеОт <= &СечениеММ
	|	И алк_СечениеВГОСТСрезПоследних.СечениеДо >= &СечениеММ
	|	И алк_СечениеВГОСТСрезПоследних.Период <= &НаДату
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("СечениеММ", СечениеММ);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сечение = ВыборкаДетальныеЗаписи.Сечение;
		
	КонецЦикла;
	
	Возврат Сечение;

	
	
КонецФункции

Функция ПолучитьСечениеОУ(СечениеММ, НаДату)
	
	Сечение = Справочники.РазмерСечения.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	алк_СечениеВОУСрезПоследних.Сечение,
	|	алк_СечениеВОУСрезПоследних.Период КАК Период,
	|	алк_СечениеВОУСрезПоследних.СечениеОт,
	|	алк_СечениеВОУСрезПоследних.СечениеДо
	|ИЗ
	|	РегистрСведений.алк_СечениеВОУ.СрезПоследних(&НаДату, ) КАК алк_СечениеВОУСрезПоследних
	|ГДЕ
	|	алк_СечениеВОУСрезПоследних.СечениеОт <= &СечениеММ
	|	И алк_СечениеВОУСрезПоследних.СечениеДо >= &СечениеММ
	|	И алк_СечениеВОУСрезПоследних.Период <= &НаДату
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("СечениеММ", СечениеММ);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сечение = ВыборкаДетальныеЗаписи.Сечение;
		
	КонецЦикла;
	
	Возврат Сечение;
	
КонецФункции

#КонецОбласти 


#Область ДанныеПользователей

Функция ПолучитьКонтрагентаПользователяПортАгента(ПользовательАгента) Экспорт
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_КонтрагентПользователяПортовогоАгентаСрезПоследних.Контрагент
	|ИЗ
	|	РегистрСведений.алк_КонтрагентПользователяПортовогоАгента.СрезПоследних КАК алк_КонтрагентПользователяПортовогоАгентаСрезПоследних
	|ГДЕ
	|	алк_КонтрагентПользователяПортовогоАгентаСрезПоследних.ПользовательАгента = &ПользовательАгента";
	
	Запрос.УстановитьПараметр("ПользовательАгента", ПользовательАгента);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		
	КонецЦикла;
	
	Возврат Контрагент;
	
КонецФункции

Функция КонтрагентПортовогоАгента() Экспорт
	
	Возврат ПараметрыСеанса.алк_КонтрагентПортовогоАгента;
	
КонецФункции

Функция ПолучитьДополнительныеНастройкиПользователя(Пользователь) Экспорт
	
	Настройки = Новый Структура("ПортовыйАгент, ЛогистическийЦентр_Порт, КонтрагентПользователя, СтруктурнаяЕдиница_ПортовыйСклад", Ложь, Справочники.алк_ЛогистическиеЦентры.ПустаяСсылка(), Справочники.Контрагенты.ПустаяСсылка(), Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_НастройкиПользователейСрезПоследних.КонтрагентПользователя,
	|	алк_НастройкиПользователейСрезПоследних.ЛогистическийЦентр_Порт,
	|	алк_НастройкиПользователейСрезПоследних.ПортовыйАгент,
	|	алк_НастройкиПользователейСрезПоследних.СтруктурнаяЕдиница_ПортовыйСклад
	|ИЗ
	|	РегистрСведений.алк_НастройкиПользователей.СрезПоследних КАК алк_НастройкиПользователейСрезПоследних
	|ГДЕ
	|	алк_НастройкиПользователейСрезПоследних.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		//Настройки.ПортовыйАгент = ВыборкаДетальныеЗаписи.ПортовыйАгент; 
		ЗаполнитьЗначенияСвойств(Настройки, ВыборкаДетальныеЗаписи);
	КонецЕсли; 
	
	Возврат Настройки;
	
КонецФункции

Функция ПараметрыСеанса() Экспорт
	
	Возврат Новый Структура("алк_КонтрагентПортовогоАгента, алк_СеансПортовогоАгента", ПараметрыСеанса.алк_КонтрагентПортовогоАгента, ПараметрыСеанса.алк_СеансПортовогоАгента) 
	
КонецФункции

// Функция возвращает значение по умолчанию для передаваемого пользователя и настройки.
//
// Параметры:
//  Пользователь - текущий пользователь программы
//  Наименование - Наименование настройки, для которого возвращается значение по умолчанию
//
// Возвращаемое значение:
//  Значение по умолчанию для настройки.
//
Функция ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, Наименование) Экспорт

	ЗначениеНастройки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиПользователей.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗначениеНастройки = Выборка.Значение;		
	КонецЦикла;
	
	Возврат ЗначениеНастройки;	
	
КонецФункции // ПолучитьЗначениеПоУмолчаниюПользователя()



#КонецОбласти 


#Область Цены

Функция ПолучитьЦенуСПредставлениемПоЗаказу(Организация, Заказ, Номенклатура, Характеристика) Экспорт
	
	ЦенаПредставление = Новый Структура("Цена, ПредставлениеТовара", 0, ""); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ЦеныПродукцииСрезПоследних.Организация,
	|	алк_ЦеныПродукцииСрезПоследних.Заказ,
	|	алк_ЦеныПродукцииСрезПоследних.Номенклатура,
	|	алк_ЦеныПродукцииСрезПоследних.Характеристика,
	|	алк_ЦеныПродукцииСрезПоследних.Цена,
	|	алк_ЦеныПродукцииСрезПоследних.ПредставлениеТовара
	|ИЗ
	|	РегистрСведений.алк_ЦеныПродукции.СрезПоследних(
	|			,
	|			Организация = &Организзация
	|				И Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Заказ = &Заказ) КАК алк_ЦеныПродукцииСрезПоследних";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организзация", Организация);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		ЦенаПредставление.Цена = ВыборкаДетальныеЗаписи.Цена;
		ЦенаПредставление.ПредставлениеТовара = ВыборкаДетальныеЗаписи.ПредставлениеТовара;
		
	КонецЕсли; 
	
	
	Возврат ЦенаПредставление;		
	
КонецФункции

Функция ПредставлениеАссортиментнойГруппы(ВладелецИД, ИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_АссортиментныеГруппыПредставление.ПредставлениеГруппы
	|ИЗ
	|	РегистрСведений.алк_АссортиментныеГруппыПредставление КАК алк_АссортиментныеГруппыПредставление
	|ГДЕ
	|	алк_АссортиментныеГруппыПредставление.ИД = &ИД
	|	И алк_АссортиментныеГруппыПредставление.ВладелецИД = &ВладелецИД";
	
	Запрос.УстановитьПараметр("ВладелецИД", ВладелецИД);
	Запрос.УстановитьПараметр("ИД", ИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ПредставлениеГруппы;
	Иначе
		Возврат "";
	КонецЕсли; 
	
КонецФункции

Функция ПредставлениеОбъемнойГруппы(ВладелецИД, ИД) Экспорт
	
	ПредставлениеОГ = Новый Структура("ПредставлениеГруппы, ПредставлениеСорта", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОбъемныеГруппыПредставление.ПредставлениеГруппы,
	|	алк_ОбъемныеГруппыПредставление.ПредставлениеСорта
	|ИЗ
	|	РегистрСведений.алк_ОбъемныеГруппыПредставление КАК алк_ОбъемныеГруппыПредставление
	|ГДЕ
	|	алк_ОбъемныеГруппыПредставление.ИД = &ИД
	|	И алк_ОбъемныеГруппыПредставление.ВладелецИД = &ВладелецИД";
	
	Запрос.УстановитьПараметр("ВладелецИД", ВладелецИД);
	Запрос.УстановитьПараметр("ИД", ИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
		ПредставлениеОГ.ПредставлениеГруппы =  ВыборкаДетальныеЗаписи.ПредставлениеГруппы;
		ПредставлениеОГ.ПредставлениеСорта  =  ВыборкаДетальныеЗаписи.ПредставлениеСорта;
		
	КонецЕсли; 
	
	Возврат ПредставлениеОГ;
	
КонецФункции




#КонецОбласти 


#Область ЗапретРедактирования

Функция ЗапретРедактированияБиржа(Объект) экспорт
	
	//Результат  = Ложь;
	
	//если не РольДоступна("РФП_Полные") и не РольДоступна("РФП_Технолог") тогда
	//	//	рез = Документ.Исполнитель <> ПараметрыСеанса.ТекущийПользователь;
	//конецесли;
	
	Возврат  не (Началодня(Объект.Дата) >= НачалоДня(Константы.алк_ДатаЗапретаРедактированияБиржа.Получить()));
	
КонецФункции


#КонецОбласти 


Функция ПолучитьПараметрыПакета(НомерПакета, Период = Неопределено) Экспорт
	
	
	ПараметрыПакета = Новый Структура("Период, Порода, Сорт, Длина, Сечение, Заказ, Объем, ВесНетто, ВесБрутто", 
	Справочники.Породы.ПустаяСсылка(),
	Справочники.Сорта.ПустаяСсылка(),
	Справочники.Длины.ПустаяСсылка(),
	Справочники.РазмерСечения.ПустаяСсылка(),
	Справочники.ЗаказыПроизводство.ПустаяСсылка(),
	0, 0, 0); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникПараметрыПакетаСрезПоследних.Порода,
	|	ИсточникПараметрыПакетаСрезПоследних.Сорт,
	|	ИсточникПараметрыПакетаСрезПоследних.Длина,
	|	ИсточникПараметрыПакетаСрезПоследних.Сечение,
	|	ИсточникПараметрыПакетаСрезПоследних.Заказ,
	|	ИсточникПараметрыПакетаСрезПоследних.Объем,
	|	ИсточникПараметрыПакетаСрезПоследних.ВесНетто,
	|	ИсточникПараметрыПакетаСрезПоследних.ВесБрутто,
	|	ИсточникПараметрыПакетаСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ИсточникПараметрыПакета.СрезПоследних(&Период, Номер = &НомерПакета) КАК ИсточникПараметрыПакетаСрезПоследних";
	
	Запрос.УстановитьПараметр("НомерПакета", НомерПакета);
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, Дата(1,1,1), Период));
	
	РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПакета, ВыборкаДетальныеЗаписи);	
	КонецЕсли; 
	
	Возврат ПараметрыПакета;
	
КонецФункции

Функция ПолучитьДислокациюПакета(Номенклатура, НомерПакета, ПериодПакета, Период = Неопределено) Экспорт
	Дислокация = Перечисления.ВидыДислокации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДислокацияПродукцииСрезПоследних.Дислокация
	|ИЗ
	|	РегистрСведений.ДислокацияПродукции.СрезПоследних(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И НомерПакета = &НомерПакета
	|				И ПериодПакета = НАЧАЛОПЕРИОДА(&ПериодПакета, ГОД)) КАК ДислокацияПродукцииСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, Дата(1,1,1), Период));	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерПакета", НомерПакета);
	Запрос.УстановитьПараметр("ПериодПакета", ПериодПакета);
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Дислокация = ВыборкаДетальныеЗаписи.Дислокация;	
	КонецЕсли; 
	
	Возврат Дислокация;
КонецФункции

Функция ПолучитьКоличествоПакетовНаСкладе(Номенклатура, НомерПакета, ПериодПакета, Склад, Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоПакетовОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И НомерПакета = &НомерПакета
	|				И ПериодПакета = &ПериодПакета
	|				И СтруктурнаяЕдиница = &Склад) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерПакета", НомерПакета);
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено, Дата(1,1,1), Период));
	Запрос.УстановитьПараметр("ПериодПакета", ПериодПакета);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.КоличествоПакетовОстаток;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции


Функция ПериодичностьНумерации(Номенклатура, Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПериодичностьНумерацииПакетовНоменклатурыСрезПоследних.Периодичность
	|ИЗ
	|	РегистрСведений.ПериодичностьНумерацииПакетовНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ПериодичностьНумерацииПакетовНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", ?(Период=Неопределено, Дата(1,1,1), Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Периодичность = ВыборкаДетальныеЗаписи.Периодичность;
	Иначе
		Периодичность = Перечисления.ПериодыНумерации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Периодичность;
	
КонецФункции


// Возвращает СерийныйНомер (справочник ссылка "СерийныеНомера") по данным
// непериодического регистра сведений "алк_ПараметрыСерийныхНомеров"
//
Функция ПолучитьСерийныйНомер(Номенклатура, НомерСерии, ПериодСерии, Маска = "") Экспорт  
	               
	ПериодСерии = Формат(ПериодСерии, "ДФ=yy"); 
	НомерСерии = Формат(НомерСерии, "ЧЦ=6; ЧВН=; ЧГ=0");	
	НомерСтрокой = "-" + ПериодСерии + "-" + НомерСерии;
	
	СерийныйНомер = Справочники.СерийныеНомера.ПустаяСсылка();  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование ПОДОБНО &Маска
		|	И СерийныеНомера.Наименование ПОДОБНО &НомерСтрокой
		|	И СерийныеНомера.Владелец = &Номенклатура";
	
	Запрос.УстановитьПараметр("Маска", Маска + "%");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерСтрокой", "%" + НомерСтрокой);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СерийныйНомер = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;	
		
	Возврат СерийныйНомер;
	
КонецФункции

//Для возможности вызывать с клиента
Функция ЗначениеРеквизитаОбъекта(ЗНАЧ Ссылка, ЗНАЧ ИмяРеквизита) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
КонецФункции

Процедура Конец()		
КонецПроцедуры

//Агоритм расчета контрольной цифры в идентификаторе контейнера
//Возвращает:
//Истина, если Идентификатор корректен
//Ложь, если в Идентификаторе есть ошибка
//
//Номер контейнера, состоящий из цифр и букв, имеет 11-разрядный формат. 
//Первые три буквы — это идентификатор владельца. Четвертая буква — признак кода контейнера. 
//Шесть символов, находящихся с 5-й по 10-ю позицию, описывают серийный код контейнера. 
//Крайний одиннадцатый разряд представляет собой контрольную цифру, позволяющую проверить корректность номера.
//
//Вх. данные:
//НомерКонтейнера - Строка
&НаСервере
Функция ПроверитьИдентификаторКонтейнераНаСервере(Идентификатор) Экспорт
	
	//Подготовка
	ИдентификаторКонтейнера = ВРег(СтрЗаменить(Идентификатор, " ", ""));//Уберем лишние пробелы в идентификаторе и отобразим все в верхнем регистре
	КонтрольнаяСумма = Число(Прав(ИдентификаторКонтейнера, 1));//Последний символ номера
	ЧистыйИдентификаторКонтейнера = Лев(ИдентификаторКонтейнера, СтрДлина(ИдентификаторКонтейнера) - 1);//Получим идентификатор без последнего (контрольного) символа
	
	//\\ Получим структуру цифровых эквивалентов	
	СтруктураЦифровыхЭквивалентов = Новый Структура;
	
	ЦифровойЭквивалент = 10;
	КодСимвола = 65;//Код символа "A"
	Пока КодСимвола <= 90 Цикл	
		Если ЦифровойЭквивалент % 11 = 0 Тогда //эквивалента, который делится на 11 без остатка быть не должно, поэтому пропускаем его
			ЦифровойЭквивалент = ЦифровойЭквивалент + 1;
		КонецЕсли;	
		СтруктураЦифровыхЭквивалентов.Вставить(Символ(КодСимвола), ЦифровойЭквивалент);	
		КодСимвола = КодСимвола + 1;
		ЦифровойЭквивалент = ЦифровойЭквивалент + 1;			
    КонецЦикла;
	//\\
	
	//Аглоритм
	ПроверочнаяСумма = 0;
	
	Для НомерРазрядаИдентификатора = 1 По СтрДлина(ЧистыйИдентификаторКонтейнера) Цикл //Переберем каждый символ в идентификаторе
		
		СимволИдентификатора = Сред(ЧистыйИдентификаторКонтейнера, НомерРазрядаИдентификатора, 1);
		//Проверяем на число
		Если СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СимволИдентификатора) = Неопределено Тогда //Если не число то присваиваем числовой эквивалент
			СимволИдентификатора = СтруктураЦифровыхЭквивалентов[СимволИдентификатора];
		КонецЕсли;
		
		ПроверочнаяСумма = ПроверочнаяСумма + (СимволИдентификатора * Pow(2, НомерРазрядаИдентификатора - 1));		
		
	КонецЦикла;
	
	Если ПроверочнаяСумма % 11 = КонтрольнаяСумма Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	 
КонецФункции

Функция ЗначенияРеквизитовОбъекта(ЗНАЧ Ссылка, ЗНАЧ Реквизиты) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
КонецФункции

Функция СоответствиеСНАддендуму(СерийныйНомер, Аддендум) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Сорт,
		|	алк_ПараметрыХарактеристик.Сечение,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Характеристика
		|ПОМЕСТИТЬ втПакетСПарХар
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_АддендумыСоставТоваров.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_АддендумыСоставТоваров.ШиринаОт КАК ШиринаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ШиринаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ШиринаДо
		|	КОНЕЦ КАК ШиринаДо,
		|	алк_АддендумыСоставТоваров.ТолщинаОт КАК ТолщинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ТолщинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ТолщинаДо
		|	КОНЕЦ КАК ТолщинаДо,
		|	алк_АддендумыСоставТоваров.ДлинаОт КАК ДлинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ДлинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ДлинаДо
		|	КОНЕЦ КАК ДлинаДо,
		|	алк_АддендумыСоставТоваров.Порода КАК Порода,
		|	алк_АддендумыСоставТоваров.Сорт КАК Сорт
		|ПОМЕСТИТЬ втСостав
		|ИЗ
		|	Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
		|ГДЕ
		|	алк_АддендумыСоставТоваров.Ссылка = &Аддендум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПакетСПарХар.СерийныйНомер,
		|	втПакетСПарХар.Характеристика,
		|	втСостав.ИдентификаторТовара
		|ИЗ
		|	втПакетСПарХар КАК втПакетСПарХар
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСостав КАК втСостав
		|		ПО (втСостав.Порода = втПакетСПарХар.Порода)
		|			И (втСостав.Сорт = втПакетСПарХар.Сорт)
		|			И (втСостав.ШиринаОт <= втПакетСПарХар.Сечение.ШиринаММ)
		|			И (втСостав.ШиринаДо >= втПакетСПарХар.Сечение.ШиринаММ)
		|			И (втСостав.ТолщинаОт <= втПакетСПарХар.Сечение.ТолщинаММ)
		|			И (втСостав.ТолщинаДо >= втПакетСПарХар.Сечение.ТолщинаММ)
		|			И (втСостав.ДлинаОт <= втПакетСПарХар.Длина.ДлинаММ)
		|			И (втСостав.ДлинаДо >= втПакетСПарХар.Длина.ДлинаММ)";
	
	Запрос.УстановитьПараметр("Аддендум", Аддендум);
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
		
КонецФункции
