
&НаКлиенте
Процедура ВыражениеПриращенияПриИзменении(Элемент)
			
	Если ЕстьБуквы(Элемент.ТекстРедактирования) Тогда 		
		Сообщить("Не допустим ввод букв!"); 	
	Иначе                                  	
		Запись.Приращение = Вычислить(Элемент.ТекстРедактирования);		
	КонецЕсли; 
	
КонецПроцедуры 


&НаКлиенте
Функция ЕстьБуквы(Знач ИсходнаяСтрока) 
	
	КириллическиеСимволы 	= "АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЬьЫыЪъЭэЮюЯя";
    ЛатинскиеСимволы		= "AaBbCcDdEeFfGgHhIiJjKkLlMmNnOoPpQqRrSsTtUuVvWwXxYyZz";
	
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	
	Если СтрДлина(ИсходнаяСтрока)>0 Тогда
		
		Для Сч = 1 по СтрДлина(ИсходнаяСтрока) Цикл
			
			Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1));
			
			Если Найти(КириллическиеСимволы + ЛатинскиеСимволы, Символ) Тогда
				
				Возврат Истина; 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь; 
	
КонецФункции
