
Функция InventoryTransferAction(Запрос)    
	
	// задача выгружать перемещения за месяц из АЛК и грузить их в один документ перемещения в ЕРП  	
	// из ЕРП приходит запрос с указанием интервала (месяца) загрузки и типа перемещения 
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();	
	
	Ответ = ПолучитьДанныеПеремещения(СтрокаJSON);
			
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","application/json");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;  

КонецФункции
  
Функция ПолучитьДанныеПеремещения(СтрокаJSON)  
	
	ЧтениеJSON = Новый ЧтениеJSON;
	
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON); 
	
	ПоляДат = Новый Массив;
	ПоляДат.Добавить("DateTime");   
	
	ПараметрыЗапроса = ПрочитатьJSON(ЧтениеJSON,, ПоляДат, ФорматДатыJSON.ISO);
	
	//  Формат получаемых данных:
	//
	//"type":"ПередачаНаМЛП", 
	//"DateTime":"2024-12-04T20:00:00",  
	
	Запись = Новый ЗаписьJSON; 
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);  
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON); 
	
	Возврат ПолучитьДанныеПередачаВПроизводство(ПараметрыЗапроса, Запись);
	
	
КонецФункции // ПолучитьДанныеПеремещения()
	
Функция ПолучитьДанныеПередачаВПроизводство(ПараметрыЗапроса, Запись) 
	
	УстановитьПривилегированныйРежим(Истина);	  
	
	Если ПараметрыЗапроса.type = "ПередачаНаМЛП" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаМЛП();
	ИначеЕсли ПараметрыЗапроса.type = "ПередачаНаЦЛП" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаЦЛП(); 
	ИначеЕсли ПараметрыЗапроса.type = "ПередачаНаЦПШ" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаЦПШ(); 
	ИначеЕсли ПараметрыЗапроса.type = "СписаниеШпонаНаФанеру" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПроизводствоФанеры();
	ИначеЕсли ПараметрыЗапроса.type = "СписаниеШпона" Тогда  		
		ТекстЗапроса = ПолучитьЗапросСписаниеШпона(); 
	ИначеЕсли ПараметрыЗапроса.type = "ПередачаНаСГП_Шпон" Тогда  		
		ТекстЗапроса = ПолучитьЗапросПередачаНаСГП_Шпон(); 
	ИначеЕсли ПараметрыЗапроса.type = "ВозвратССГП_Шпон" Тогда  		
		ТекстЗапроса = ПолучитьЗапросВозвратССГП_Шпон(); 
	Иначе	
		ЗаписатьJSON(Запись, "Тип документа к выгрузке не определен!");  		
		Возврат Запись.Закрыть();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(ПараметрыЗапроса.DateTime) + 8*3600);
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(ПараметрыЗапроса.DateTime) + 8*3600);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Данные = новый Структура("Товары");
	СписокСтрок = новый массив;

	Счетчик = 0;   
	
	НоменклатураШпон 			= Справочники.Номенклатура.НайтиПоКоду("00000000002"); 
	НоменклатураПиломатериал 	= Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
					
		Счетчик = Счетчик + 1;
		
		ДанныеСтроки = Новый Структура("Номер, Номенклатура, Количество, Порода, Сорт, Сечение, Длина, Поверхность, Влажность");
		ДанныеСтроки.номер = Счетчик;
		
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, ВыборкаДетальныеЗаписи);
	    	
		РфпСервер.КонвертироватьТовары(ДанныеСтроки);
		
		СписокСтрок.Добавить(ДанныеСтроки);
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Данные.Товары = СписокСтрок;
	
	Запись = Новый ЗаписьJSON; 
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);  
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON); 	
	ЗаписатьJSON(Запись, Данные);

	Возврат Запись.Закрыть();

КонецФункции // ПолучитьДанныеПередачаНаМЛП()

	
Функция ПолучитьЗапросПередачаНаМЛП() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000060""
		|				И Номенклатура.Код = ""ПБ-00000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ПеремещениеЛесопродукции
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаМЛП()

Функция ПолучитьЗапросПередачаНаЦЛП() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000003""
		|				И Номенклатура.Код = ""ПБ-00000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_ПеремещениеЛесопродукции).ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦЛП)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаЦЛП()

Функция ПолучитьЗапросПередачаНаЦПШ() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000001""
		|				И Номенклатура.Код = ""ПБ-00000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_ПеремещениеЛесопродукции).ВидДокумента = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаЦПШ()

Функция ПолучитьЗапросПроизводствоФанеры() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоРасход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_Производство).Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПроизводствоФанеры)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПроизводствоФанеры()

Функция ПолучитьЗапросСписаниеШпона() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоРасход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_СкладскиеОперации).ВидОперации = ЗНАЧЕНИЕ(Перечисление.алк_ВидыСкладскихОпераций.Списание)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПроизводствоФанеры()

Функция ПолучитьЗапросПередачаНаСГП_Шпон() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоРасход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_Перемещение).СкладПолучатель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаСГП_Шпон()


Функция ПолучитьЗапросВозвратССГП_Шпон() 
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК Количество,
		|	алк_ПараметрыХарактеристик.Порода.Наименование КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.Наименование КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование КАК Сечение,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование КАК Влажность
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Регистратор,
		|			СтруктурнаяЕдиница.Код = ""ПБ-000064""
		|				И Номенклатура.Код = ""00000000002"") КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОбороты.Регистратор КАК Документ.алк_Перемещение).СкладОтправитель.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода.Наименование,
		|	алк_ПараметрыХарактеристик.Сорт.Наименование,
		|	алк_ПараметрыХарактеристик.Длина.Наименование,
		|	алк_ПараметрыХарактеристик.Сечение.Наименование,
		|	алк_ПараметрыХарактеристик.Поверхность.Наименование,
		|	алк_ПараметрыХарактеристик.Влажность.Наименование,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порода,
		|	Длина,
		|	Сорт,
		|	Сечение";

    Возврат ЗапросТекст;
	

КонецФункции // ПолучитьЗапросПередачаНаСГП_Шпон()






























