
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		ДокументОснование = Параметры.ДокументОснование;
	КонецЕсли;	
		
	ЗаполнитьДерево(); 
	
КонецПроцедуры

Процедура ЗаполнитьДерево()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СкладскиеОперации.Ссылка КАК Документ,
		|	алк_СкладскиеОперации.ВидОперации КАК ВидОперации,
		|	алк_СкладскиеОперации.СерийныйНомер
		|ИЗ
		|	Документ.алк_СкладскиеОперации КАК алк_СкладскиеОперации
		|ГДЕ
		|	алк_СкладскиеОперации.ДокументОснование = &ДокументОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидОперации
		|ИТОГИ ПО
		|	ВидОперации";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	ПромДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ПромДерево, "ДеревоСвязанныеДокументы");
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДерево();
КонецПроцедуры
