
Функция ПолучитьХарактеристикиЗаСменуПоЛинии(ДатаСмены,Смена,Линия) Экспорт    
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ФорматКПроизводству.Характеристика
	               |ИЗ
	               |	РегистрСведений.алк_ФорматКПроизводству КАК алк_ФорматКПроизводству
	               |ГДЕ
	               |	алк_ФорматКПроизводству.ДатаСмены = &ДатаСмены
	               |	И алк_ФорматКПроизводству.Смена = &Смена
	               |	И алк_ФорматКПроизводству.Линия = &Линия";
	
	Запрос.УстановитьПараметр("ДатаСмены",ДатаСмены);
	Запрос.УстановитьПараметр("Смена",Смена);
	Запрос.УстановитьПараметр("Линия",Линия);  
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;  
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат.Выгрузить());
	
КонецФункции 

//данные по смене - структура дата смены + смена + линия(участок)
Процедура ДобавитьЗаданиеПоХарактеристикамВРегистр(ДанныеПоСмене, МассивХарактеристик) Экспорт     
	
	НаборЗаписей = РегистрыСведений.алк_ФорматКПроизводству.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ДатаСмены.Установить(ДанныеПоСмене.ДатаСмены);
	
	НаборЗаписей.Отбор.Смена.Установить(ДанныеПоСмене.Смена);
	
	НаборЗаписей.Отбор.Линия.Установить(ДанныеПоСмене.Линия);  
	
	НаборЗаписей.Прочитать();  
	
	НаборЗаписей.Очистить();	
		
	Для Каждого стр ИЗ МассивХарактеристик Цикл  
		
		Запись = НаборЗаписей.Добавить();  
		
		ЗаполнитьЗначенияСвойств(Запись, ДанныеПоСмене);
		
		Запись.Характеристика = стр.Характеристика;
		
		Запись.Номер = стр.НомерСтроки;
				
	КонецЦикла;
	
	НаборЗаписей.Записать(ИСТИНА);	
	
КонецПроцедуры  

//возвращает булево
Функция ХарактеристикаПоЗаданию(ДатаСмены,Смена,Линия,Характеристика) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ФорматКПроизводству.Характеристика
	               |ИЗ
	               |	РегистрСведений.алк_ФорматКПроизводству КАК алк_ФорматКПроизводству
	               |ГДЕ
	               |	алк_ФорматКПроизводству.ДатаСмены = &ДатаСмены
	               |	И алк_ФорматКПроизводству.Смена = &Смена
	               |	И алк_ФорматКПроизводству.Линия = &Линия
	               |	И алк_ФорматКПроизводству.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("ДатаСмены",ДатаСмены);
	Запрос.УстановитьПараметр("Смена",Смена);
	Запрос.УстановитьПараметр("Линия",Линия);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Ложь;
	КонецЕсли;  
	
	Возврат Истина;

КонецФункции