#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиКамерыГТО", МассивРезультатовЗапроса[0].Выгрузить());  
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВремяПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СервисныеПроцедурыИФункции
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка.ДатаНачалаВыгрузки КАК Период,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка КАК Регистратор,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка.Склад КАК СтруктурнаяЕдиница,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка.Камера КАК КамераПропарки,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Порода КАК Порода,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Длина КАК Длина,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Сорт КАК Сотр,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Градация КАК Градация,
		|	алк_ВыгрузкаИзКамерыГТОСостав.Объем КАК Количество,
		|	&ВидДвиженияРасход КАК ВидДвижения
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамерыГТО.Состав КАК алк_ВыгрузкаИзКамерыГТОСостав
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыГТОСостав.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	&НаСервере
	Процедура ЗаполнитьНормативРагрузки(Состав,ДатаНачалаВыгрузки,ДатаОкончанияВыгрузкиНорматив) Экспорт 
		
		Если Состав.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ДатаНачалаВыгрузки) Тогда   
			ДатаОкончанияВыгрузкиНорматив = "";   
			Возврат;
		КонецЕсли;
		
		ГрадацияДокумента = Состав[0].Градация;
		
		Если НЕ ЗначениеЗаполнено(ГрадацияДокумента) Тогда  
			ДатаОкончанияВыгрузкиНорматив = "";
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ПОМЕСТИТЬ ВТ_Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.Градация,
		|	алк_НормативыПропаркиСрезПоследних.Сезон,
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
		|			&ДатаСреза,
		|			Градация В (&ГрадацииДокумента)
		|				И Сезон В
		|					(ВЫБРАТЬ
		|						ВТ_Сезон.Сезон
		|					ИЗ
		|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
		
		Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацияДокумента);
		Запрос.УстановитьПараметр("ДатаСреза", ДатаНачалаВыгрузки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл  
			ДатаОкончанияВыгрузкиНорматив = ДатаНачалаВыгрузки + Выборка.НормативЗагрузки * 3600;  
		КонецЦикла;
		
	КонецПроцедуры
	
#КонецЕсли
