

#Область ОбработчикиСобытий    

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_ЗагрузкаВКамеруГТО") Тогда
		Камера = ДанныеЗаполнения.Камера;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Участок = ДанныеЗаполнения.Участок;  
		Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.Градация = ТекСтрокаСостав.Градация;
			НоваяСтрока.Длина = ТекСтрокаСостав.Длина;
			НоваяСтрока.Номенклатура = ТекСтрокаСостав.Номенклатура;
			НоваяСтрока.Объем = ТекСтрокаСостав.Объем;
			НоваяСтрока.Порода = ТекСтрокаСостав.Порода;
			НоваяСтрока.Сорт = ТекСтрокаСостав.Сорт;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ВыгрузкаИзКамерыГТО.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
	// Отражение в разделах учета  
	РфпСервер.ОтразитьОстаткиКамерыГТО(ДополнительныеСвойства, Движения, Отказ); 
	//РфпСервер.ОтразитьВремяПропарки(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	КонтрольЗаполнения(Отказ)
	
КонецПроцедуры

// проверка     
// - дата выгрузки позднее даты загрузки
Процедура КонтрольЗаполнения(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Сегодня = ТекущаяДата();
	
	//Дата выгрузки позднее даты загрузки     
	Если НЕ ДатаНачалаВыгрузки > ДокументОснование.ДатаНачалаЗагрузки Тогда   
		Сообщить(СтрШаблон("Ошибка! Дата выгрузки из камеры: %1 раньше, чем дата загрузки: %2."
		,ДатаНачалаВыгрузки,ДокументОснование.ДатаНачалаЗагрузки));
		Сообщить(ДокументОснование);
		Отказ = Истина;
	КонецЕсли;
	//\\
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ) 
	
	//добавим запись для пересчета показателей ЕДС
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	Дата,
	Справочники.алк_ОперацииПроизводства.НайтиПоКоду("000000448"),
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);
	//\\
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Документы.алк_ВыгрузкаИзКамерыГТО.ЗаполнитьНормативРагрузки(Состав,ДатаНачалаВыгрузки,ДатаОкончанияВыгрузкиНорматив);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если (ДатаНачалаВыгрузки > ДатаОкончанияВыгрузки И ЗначениеЗаполнено(ДатаОкончанияВыгрузки)) Тогда
			Сообщить("Ошибка!");
			Если ДатаНачалаВыгрузки > ДатаОкончанияВыгрузки Тогда   
				Сообщить("Дата начала выгрузки из камеры больше, чем дата окончания выгрузки.");
			КонецЕсли;
		Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 


