
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПриемкаВПортуКоманда.Видимость = РольДоступна("алк_РаботаВЗакрытомПериоде");
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоНаправлению(); 	
		
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытий

&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Лесопиление);
	КонецЕсли;
	
	Если ОтборНаправлениеОтходы Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Отходы);
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Направление", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры //УстановитьОтборПоНаправлению()

#КонецОбласти


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 

Процедура Конец()
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриемкаВПортуНаСервере(ДокСсылка)
		
	Если Ложь Тогда  	
		ДокСсылка = Документы.алк_ТранспортировкаЗапасов.НайтиПоНомеру("");	
	КонецЕсли; 
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
	ДокОбъект.ПриемкаВПорту = Не ДокОбъект.ПриемкаВПорту;
	
	ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемкаВПорту(Команда) 	
	ПриемкаВПортуНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры



