
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого участок ИЗ ВернутьУчастки() Цикл
		Элементы.ОтборУчасток.СписокВыбора.Добавить(участок.Ссылка);
	КонецЦикла; 
	
	ОтборУчастокУстановлен = (ОтборУчасток.Количество() <> 0); 
	
	Если ОтборУчастокУстановлен Тогда
		УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", ОтборУчасток, ОтборУчастокУстановлен);
	КонецЕсли; 
	
	ОтборНоменклатураУстановлен = (ОтборНоменклатура.Количество() <> 0);
	
	Если НЕ ОтборНоменклатураУстановлен Тогда 
		Возврат;
	КонецЕсли; 
			
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", ОтборНоменклатура, ОтборНоменклатураУстановлен);
КонецПроцедуры 

#КонецОбласти

#Область СобытияЭлементов

&НаКлиенте
Процедура ОтборНаправлениеПриИзменении(Элемент)
	УстановитьОтборПоНаправлению();
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокПриИзменении(Элемент)
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", ОтборУчасток, ОтборУчасток.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборУчасток Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", ОтборНоменклатура, ОтборНоменклатура.Количество() <> 0);	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка) 
	МассивОтбора = Новый Массив; 
	Для Каждого эл ИЗ ОтборНоменклатура Цикл
		МассивОтбора.Добавить(эл.Значение);
	КонецЦикла;   
	МассивОтбора.Добавить(ВыбранноеЗначение);  
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Запасы.Номенклатура", МассивОтбора, МассивОтбора.Количество() <> 0);
КонецПроцедуры


#КонецОбласти 


&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000040")); //СГП ПМ
	КонецЕсли;
	
	//Если ОтборНаправлениеОтходы Тогда
	//	МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду(""));
	//КонецЕсли;
	
	Если ОтборНаправлениеГранулы Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000039")); //СГП ДГ
	КонецЕсли;
	
	Если ОтборНаправлениеШпон Тогда
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000038")); //СГП Шпон
		МассивОтбора.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000043")); //СГП Шпон (Сборка/разборка)
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Участок", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
		
КонецПроцедуры //УстановитьОтборПоНаправлению()

#Область СлужебныеФ 

&НаСервереБезКонтекста
Функция ВернутьУчастки()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Участки.Ссылка
	               |ИЗ
	               |	Справочник.алк_Участки КАК алк_Участки
	               |ГДЕ
	               |	алк_Участки.Цех.Код В (""000000005"")
	               |	И НЕ алк_Участки.ЭтоГруппа";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
КонецФункции

#КонецОбласти


Процедура Конец()
КонецПроцедуры

 