

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отображать = "Все";
	
	Элементы.ЗакрытКоманда.Видимость = РольДоступна("алк_РаботаВЗакрытомПериоде"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоОткрытым();
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	УстановитьОтборПоНаправлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПриИзменении(Элемент)
	
	УстановитьОтборПоОткрытым();	
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытий

&НаСервере
Процедура УстановитьОтборПоНаправлению()
	
	МассивОтбора = Новый Массив;
	Если ОтборНаправлениеЛесопиление Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Лесопиление);
	КонецЕсли;
	
	Если ОтборНаправлениеОтходы Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.Отходы);
	КонецЕсли;
	
	Если ОтборНаправлениеГранулы Тогда
		МассивОтбора.Добавить(Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы);
	КонецЕсли;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Направление", МассивОтбора, ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры //УстановитьОтборПоНаправлению()

&НаСервере
Процедура УстановитьОтборПоОткрытым()
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Закрыт", Ложь, Отображать <> "Все");
	
КонецПроцедуры //УстановитьОтборПоОткрытым()


#КонецОбласти


Процедура Конец()	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакрытНаСервере(ДокСсылка, Дата = "")
	
	Если Ложь Тогда  	
		ДокСсылка = Документы.алк_ЗаказПокупателя.НайтиПоНомеру("");	
	КонецЕсли; 
	
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	
	Если Не Дата = "" Тогда		
		ДокОбъект.ДатаЗакрытия = Дата;	
	КонецЕсли;
	
	ДокОбъект.Закрыт = Не ДокОбъект.Закрыт;
	
	ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(Дата, Параметры) Экспорт
 
    Если Не Дата = Неопределено Тогда
        ЗакрытНаСервере(Элементы.Список.ТекущиеДанные.Ссылка, Дата);		
	КонецЕсли;
	
	Элементы.Список.Обновить();
 
КонецПроцедуры


&НаКлиенте
Процедура Закрыт(Команда)
			
	Если Не Элементы.Список.ТекущиеДанные.Закрыт Тогда 	
		Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект);		
		ПоказатьВводДаты(Оповещение, Элементы.Список.ТекущиеДанные.ДатаЗакрытия,"Введите дату закрытия заказа",ЧастиДаты.Дата); 		
	Иначе                                                                                         		
		ЗакрытНаСервере(Элементы.Список.ТекущиеДанные.Ссылка); 
		Элементы.Список.Обновить(); 
	КонецЕсли; 
		
КонецПроцедуры




