

Процедура ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти) Экспорт
	
	КатегорияНоменклатуры = РфпПолучениеДанныхСервер.КатегорияНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	
	Если КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиловочник") Тогда
		
		СтрокаТабличнойЧасти.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;	
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиломатериал") Тогда 
		
		// получить припуск, вычислить объем, прибавить к объему характеристики. 
				  		 
			
		Если СтрокаТабличнойЧасти.Свойство("Припуск") Тогда		// проверка наличия припуска 		
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Припуск) Тогда    
				
				ПараметрыПрипуска = РфпПолучениеДанныхСервер.ОбъемПрипуска(СтрокаТабличнойЧасти.Припуск);
				
				ПараметрыХ = РфпПолучениеДанныхСервер.ПараметрыХарактеристики(СтрокаТабличнойЧасти.Характеристика);
				
				ДлинаММ 	= ПараметрыХ.ДлинаММ;
				ШиринаММ  	= ПараметрыХ.ШиринаММ;
				ТолщинаММ	= ПараметрыХ.ТолщинаММ;   			
				
				ОбъемПоХарактеристике =  (ДлинаММ + ПараметрыПрипуска.ПрипускПоДлине)/1000 * (ШиринаММ + ПараметрыПрипуска.ПрипускПоШирине)/1000 * (ТолщинаММ + ПараметрыПрипуска.ПрипускПоТолщине)/1000; 
				
				СтрокаТабличнойЧасти.ОбъемСПрипуском = ОбъемПоХарактеристике * СтрокаТабличнойЧасти.Количество;  		
				
			КонецЕсли;			
		КонецЕсли;
	
		СтрокаТабличнойЧасти.Объем =  РфпПолучениеДанныхСервер.ОбъемПоХарактеристике(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;
		
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Окорка")  Тогда 
		
		СтрокаТабличнойЧасти.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПересчитатьОбъемСтрокиФакт(СтрокаТабличнойЧасти) Экспорт
	
	КатегорияНоменклатуры = РфпПолучениеДанныхСервер.КатегорияНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	
	Если КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиловочник") Тогда
		
		СтрокаТабличнойЧасти.ОбъемФакт = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.КоличествоФакт;	
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиломатериал") Тогда 
		
		СтрокаТабличнойЧасти.ОбъемФакт = РфпПолучениеДанныхСервер.ОбъемПоХарактеристике(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.КоличествоФакт;
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Окорка")  Тогда 
		
		СтрокаТабличнойЧасти.ОбъемФакт = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.КоличествоФакт;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПересчитатьОбъемСтрокиПоВесу(СтрокаТабличнойЧасти) Экспорт
	
	Плотность = РфпПолучениеДанныхСервер.ПлотностьНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика);
	
	СтрокаТабличнойЧасти.ОбъемТаможня = ?(Плотность <> 0, СтрокаТабличнойЧасти.ВесНетто * 1000/Плотность, СтрокаТабличнойЧасти.ОбъемТаможня);

КонецПроцедуры

Процедура ПриИзмененииДатыДокумента(ОбъектФормы, ДатаВремя) Экспорт
	Результат = новый структура("Смена, ДатаСмены");
	ЧасДаты = Час(ДатаВремя);
	Результат.ДатаСмены = ?(ЧасДаты >= 8
			, НачалоДня(ДатаВремя), НачалоДня(ДатаВремя - 86400));
	Результат.Смена 	= ?(ЧасДаты >= 8 и ЧасДаты <= 20
			, ПредопределенноеЗначение("Перечисление.Смены.смена_8_20"), ПредопределенноеЗначение("Перечисление.Смены.смена_20_8"));
	ЗаполнитьЗначенияСвойств(ОбъектФормы, Результат, "ДатаСмены,Смена");
КонецПроцедуры


//&НаСервере
//Функция РфпПолучениеДанныхСервер.ПолучитьПараметрыПрипуска(Припуск) 
//	
//	Возврат РфпСервер.ПолучитьПараметрыПрипуска(Припуск);	

//КонецФункции // ПолучитьПараметрыПрипуска()








