
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаПроведения объекта.
	//
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа.
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.алк_ИнвентаризацияШтабелей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		Если ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.ЗапасыОрганизации Тогда
			РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
			
		ИначеЕсли ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииНаОтветхранении Тогда
			РфпСервер.ОтразитьУчетЛесопродукцииНаОтветхранении(ДополнительныеСвойства, Движения, Отказ);
		ИначеЕсли ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.Отходы Тогда
			РфпСервер.ОтразитьОтходы(ДополнительныеСвойства, Движения, Отказ);
			
		ИначеЕсли ВидРегистра = Перечисления.алк_ВидыРегистровИнвентаризации.УчетЛесопродукцииГОСТ Тогда 
			РфпСервер.ОтразитьУчетЛесопродукцииГОСТ(ДополнительныеСвойства, Движения, Отказ); 
			
		КонецЕсли; 
		//Сергеева Г.О. ++
		//РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. --
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();	
		
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
#КонецЕсли


Процедура Конец()	
КонецПроцедуры


