
Процедура ИнициализироватьДанныеДокумента(РучноеИзменениеПараметров, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.НомерПакета,
	|	алк_РучноеИзменениеПараметровПакета.ПериодПакета,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.КоличествоСостав1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.КоличествоСостав
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.КоличествоСостав1
	|	КОНЕЦ КАК КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC КАК СертификатFSC1,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ОбъемТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ОбъемТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ОбъемТаможня1
	|	КОНЕЦ КАК ОбъемТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1
	|	КОНЕЦ КАК ВесНеттоТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1
	|	КОНЕЦ КАК ВесБруттоТаможня,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC1 КАК СертификатFSC,
	|	алк_РучноеИзменениеПараметровПакета.ПериодУпаковки,
	|	&Период,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.Габарит1 КАК Габарит,
	|	алк_РучноеИзменениеПараметровПакета.КатегорияНоменклатурыПЭО1 КАК КатегорияНоменклатурыПЭО,
	|	алк_РучноеИзменениеПараметровПакета.Сухой1 КАК Сухой,
	|	алк_РучноеИзменениеПараметровПакета.Припуск1 КАК Припуск
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница1 КАК СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1.Владелец КАК Номенклатура,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав1 КАК Количество,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка1 КАК Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ) КАК ДатаСмены,
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияРасход,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика.Владелец,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ),
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
	|	алк_ОстаткиЗапасовОстатки.Штабель
	|ПОМЕСТИТЬ ВТ_СкладШтабель
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&Период,
	|			СерийныйНомер В
	|				(ВЫБРАТЬ
	|					алк_РучноеИзменениеПараметровПакета.СерийныйНомер
	|				ИЗ
	|					Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|				ГДЕ
	|					алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка)) КАК алк_ОстаткиЗапасовОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	ВТ_СкладШтабель.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_СкладШтабель.Штабель КАК Штабель,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1.Владелец КАК Номенклатура,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Количество
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладШтабель КАК ВТ_СкладШтабель
	|		ПО алк_РучноеИзменениеПараметровПакета.СерийныйНомер = ВТ_СкладШтабель.СерийныйНомер
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияРасход,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	ВТ_СкладШтабель.СтруктурнаяЕдиница,
	|	ВТ_СкладШтабель.Штабель,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика.Владелец,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.Объем
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладШтабель КАК ВТ_СкладШтабель
	|		ПО алк_РучноеИзменениеПараметровПакета.СерийныйНомер = ВТ_СкладШтабель.СерийныйНомер
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);	
	Запрос.УстановитьПараметр("Ссылка", РучноеИзменениеПараметров);
	Запрос.УстановитьПараметр("Период", РучноеИзменениеПараметров.Дата);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();  // РезультатЗапроса.Выгрузить()
			
	ТабЗапроса = РезультатЗапроса[0].Выгрузить();
	
	//добавляем колонку документ для доп параметры пакетов
	ТабЗапроса.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.алк_РучноеИзменениеПараметровПакета"));
	//\\
		
	Для каждого стрТаб Из ТабЗапроса Цикл
		стрТаб.НомерПакета = НоменклатураСервер.НомерСерии(стрТаб.СерийныйНомер);
		стрТаб.Документ = РучноеИзменениеПараметров; 
	КонецЦикла; 

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов", ТабЗапроса); 
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеПараметрыПакетов", ТабЗапроса);

	Если РучноеИзменениеПараметров.Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", РезультатЗапроса[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", РезультатЗапроса[3].Выгрузить());
	КонецЕсли;
	
	
	
КонецПроцедуры

// не учитывается изменение характеристики
Процедура ИнициализироватьДанныеДокументаДо(РучноеИзменениеПараметров, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	алк_РучноеИзменениеПараметровПакета.СерийныйНомер,
	|	алк_РучноеИзменениеПараметровПакета.НомерПакета,
	|	алк_РучноеИзменениеПараметровПакета.ПериодПакета,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC КАК СертификатFSC1,
	|	алк_РучноеИзменениеПараметровПакета.ОбъемТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесНеттоТаможня1
	|	КОНЕЦ КАК ВесНеттоТаможня,
	|	ВЫБОР
	|		КОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1 = 0
	|			ТОГДА алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня
	|		ИНАЧЕ алк_РучноеИзменениеПараметровПакета.ВесБруттоТаможня1
	|	КОНЕЦ КАК ВесБруттоТаможня,
	|	алк_РучноеИзменениеПараметровПакета.СертификатFSC1 КАК СертификатFSC,
	|	алк_РучноеИзменениеПараметровПакета.ПериодУпаковки,
	|	&Период,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница1 КАК СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1.Владелец КАК Номенклатура,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат1 КАК Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав1 КАК Количество,
	|	алк_РучноеИзменениеПараметровПакета.Объем1 КАК Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика1 КАК Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка1 КАК Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ) КАК ДатаСмены,
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&ВидДвиженияРасход,
	|	алк_РучноеИзменениеПараметровПакета.Организация,
	|	алк_РучноеИзменениеПараметровПакета.СтруктурнаяЕдиница,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика.Владелец,
	|	алк_РучноеИзменениеПараметровПакета.Сертификат,
	|	алк_РучноеИзменениеПараметровПакета.КоличествоСостав,
	|	алк_РучноеИзменениеПараметровПакета.Объем,
	|	алк_РучноеИзменениеПараметровПакета.Характеристика,
	|	алк_РучноеИзменениеПараметровПакета.Ячейка,
	|	НАЧАЛОПЕРИОДА(алк_РучноеИзменениеПараметровПакета.ПериодУпаковки, ДЕНЬ),
	|	алк_РучноеИзменениеПараметровПакета.Смена
	|ИЗ
	|	Документ.алк_РучноеИзменениеПараметровПакета КАК алк_РучноеИзменениеПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеПараметровПакета.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка", РучноеИзменениеПараметров);
	Запрос.УстановитьПараметр("Период", РучноеИзменениеПараметров.Дата);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();  // РезультатЗапроса.Выгрузить()
	
	ТабЗапроса = РезультатЗапроса[0].Выгрузить();
	
	Для каждого стрТаб Из ТабЗапроса Цикл
		стрТаб.НомерПакета = НоменклатураСервер.НомерСерии(стрТаб.СерийныйНомер);	
	КонецЦикла; 

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов", ТабЗапроса);

	Если РучноеИзменениеПараметров.Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", РезультатЗапроса[1].Выгрузить());		
	КонецЕсли;
	
	
КонецПроцедуры





