
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Если Дата > '20190601' Тогда
			Документы.алк_РучноеИзменениеПараметровПакета.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		Иначе
			Документы.алк_РучноеИзменениеПараметровПакета.ИнициализироватьДанныеДокументаДо(Ссылка, ДополнительныеСвойства);
		КонецЕсли; 
				
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		РфпСервер.ОтразитьПараметрыПакетов_Готовые(ДополнительныеСвойства, Движения, Отказ);
		
		Если Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
			РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);		
		КонецЕсли; 	
		
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
				
		// СерийныеНомера
		//УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
		//если припуск не изменился и боковая доска тоже, то не добавлять запись в доп параметры пакетов
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
		Если Припуск = Припуск1 ИЛИ КатегорияНоменклатурыПЭО = КатегорияНоменклатурыПЭО1 Тогда 
			Возврат;
		КонецЕсли;
		
		РфпСервер.ОтразитьДополнительныеПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ);
		//\\
		
	КонецПроцедуры

	Процедура ОбработкаУдаленияПроведения(Отказ)
		
		РегистрыСведений.алк_ДополнительныеПараметрыПакетов.УдалитьЗаписьВРегистре(СерийныйНомер,Ссылка);
		
	КонецПроцедуры

	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)		
		
		ДатаСмены = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата());		
		
		ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
		
		Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя); 	
		
	КонецПроцедуры
	
	
	
	
	#КонецОбласти 
	
#КонецЕсли

