
//Возвращает время конца смены, переписана Дубоделов Э.А 24.03.2023
Функция ПолучитьВремяКонцаСмены(Смена, ДатаСмены) Экспорт

	ВремяОкончанияСмены = Смена.КонецСмены;
	Если ВремяОкончанияСмены < Смена.НачалоСмены Или Смена.СменаПрошлыхСуток Тогда 		
		ДатаВремяОкончанияСмены = НачалоДня(ДатаСмены) + 24*3600 + (ВремяОкончанияСмены - Дата(1,1,1)); 
	Иначе	
		ДатаВремяОкончанияСмены = НачалоДня(ДатаСмены) + (ВремяОкончанияСмены - Дата(1,1,1));
	КонецЕсли;

	Возврат ДатаВремяОкончанияСмены;
	
КонецФункции   



Функция ПолучитьПараметрыСменыПоДате(Дата) Экспорт
	
	// заглушка на открытие документов
	
	Результат = Новый Структура("ДатаСмены, Смена");
	
	Результат.Смена 		=  Справочники.алк_Смены.ПустаяСсылка();
	Результат.ДатаСмены 	= НачалоДня(Дата); 
	
	Возврат Результат;
	

КонецФункции // ПолучитьПараметрыСменыПоДате(Объект.Дата)()
