
&НаСервере
Процедура ОбновитьСтатусыНаСервере()
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СтатусПропаркиСрезПоследних.Период,
		|	алк_СтатусПропаркиСрезПоследних.Регистратор,
		|	алк_СтатусПропаркиСрезПоследних.КамераПропарки КАК Камера,
		|	алк_СтатусПропаркиСрезПоследних.Статус КАК Статус,
		|	алк_СтатусПропаркиСрезПоследних.ВремяНачала,
		|	алк_СтатусПропаркиСрезПоследних.ВремяОкончанияПлан КАК ВремяОкончания
		|ИЗ
		|	РегистрСведений.алк_СтатусПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_СтатусПропаркиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_СтатусПропаркиСрезПоследних.КамераПропарки.Код";
	
	Запрос.УстановитьПараметр("ДатаСреза", ВремяОбновления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтатусыКамер.Загрузить(РезультатЗапроса.Выгрузить());
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
       

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	
	ВремяОбновления = ТекущаяДата();
	
	ОбновитьСтатусыНаСервере();  
		
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьРегистратор(Команда)
	
	Если Не Элементы.СтатусыКамер.ТекущиеДанные = Неопределено Тогда
		ПоказатьЗначение(,Элементы.СтатусыКамер.ТекущиеДанные.Регистратор); 
	Иначе
		Сообщить("Требуется выбрать строку из таблицы.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйСтатус(Команда)  
		
	ОткрытьФорму("Документ.алк_РапортПропарка.Форма.ФормаДокумента");
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусНаДату(Команда)
	
   Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект);	
 
    ПоказатьВводДаты(
        Оповещение,
		ТекущаяДата(),
        "Введите дату и время", 
        ЧастиДаты.ДатаВремя
    );    
   
КонецПроцедуры

  
&НаКлиенте
Процедура ПослеВводаДаты(Дата, Параметры) Экспорт
 
    Если Не Дата = Неопределено Тогда
       ВремяОбновления = Дата;    
	   ОбновитьСтатусыНаСервере();
   КонецЕсли;   
 
КонецПроцедуры
 

































