
//Функция для получения Структуры для заполнения при создании документа 
//
Функция ПолучитьСтруктуруЗаполнения_СоздатьДокумент() Экспорт
	
	СтруктураЗаполнения = Новый Структура;
	
	СтруктураЗаполнения.Вставить("ТипЗаполнения", "НовыйДокумент");
	СтруктураЗаполнения.Вставить("Статус", Перечисления.алк_СтатусыОтчетаПроизводства.ВРаботе);
	СтруктураЗаполнения.Вставить("Операция");
	СтруктураЗаполнения.Вставить("ДатаСмены");
	СтруктураЗаполнения.Вставить("Смена");
	СтруктураЗаполнения.Вставить("Участок");
	
	Возврат СтруктураЗаполнения;
	
КонецФункции

//Функция для получения Структуры для заполнения при добавлении пакета в Продукцию или Списания пакета в Материалы 
//
Функция ПолучитьСтруктуруЗаполнения_ДобавитьСписатьПакет() Экспорт
	
	СтруктураЗаполнения = Новый Структура;
	
	СтруктураЗаполнения.Вставить("ТипЗаполнения");	
	СтруктураЗаполнения.Вставить("Количество");
	СтруктураЗаполнения.Вставить("Номенклатура");
	СтруктураЗаполнения.Вставить("Период");
	СтруктураЗаполнения.Вставить("СерийныйНомер");
	СтруктураЗаполнения.Вставить("Сертификат");
	СтруктураЗаполнения.Вставить("Характеристика");
	СтруктураЗаполнения.Вставить("Склад");
	
	Возврат СтруктураЗаполнения;
	
КонецФункции
