
Функция ЭтоВнешняяОбработкаОтчет() Экспорт
    ПолноеИмяМетаданных = ЭтотОбъект.Метаданные().ПолноеИмя();
    Возврат Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных) = Неопределено
КонецФункции

//УДАЛИТЬ
//Функция СформироватьПечатнуюФормуЭтикетки(МассивОбъектов, ДатаСмены, Смена, ПечатьНаПоловинеСтраницы, ПечатьНаЧетвертиСтраницы) Экспорт   
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	
//	Если ПечатьНаПоловинеСтраницы Или ПечатьНаЧетвертиСтраницы Тогда	
//		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 	
//	КонецЕсли;          
//	  
//	ТабличныйДокумент.АвтоМасштаб  = Истина; 
//	
//	Если МассивОбъектов.Количество() = 1 И (ПечатьНаПоловинеСтраницы Или ПечатьНаЧетвертиСтраницы) Тогда
//		ТабличныйДокумент.АвтоМасштаб  = Ложь; 
//		ТабличныйДокумент.МасштабПечати = 65;	
//	КонецЕсли; 
//	
//	й = 0;

//	Для каждого СерийныйНомер Из МассивОбъектов Цикл
//		
//		Если Не ЗначениеЗаполнено(СерийныйНомер) Тогда
//			Продолжить;	
//		КонецЕсли; 
//		
//		й = й + 1;
//		
//		// Древесные гранулы
//		
//		Макет = ПолучитьМакет("МакетЭтикеткаДГ");
//		
//		Область = Макет.ПолучитьОбласть("Область2");
//		
//		Область.Параметры.ДатаСмены 	= Формат(ДатаСмены, "ДФ=yyyy-MM-dd"); 		
//		Область.Параметры.Смена 		= Смена;
//		
//		// штрихкод
//		
//		РазмерШрифта = 60;
//		Рисунок = Область.Рисунки.ШтрихКод;
//		
//		Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
//		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
//		
//		НаименованиеПакета = "" + СерийныйНомер;
//		
//		ПрефиксЛатиницей = Транслит(Сред(НаименованиеПакета, 1,2));
//		
//		ЗначениеШтрихкода = ПрефиксЛатиницей + Сред(НаименованиеПакета,3); 
//		
//		Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
//			ПараметрыШтрихкода = Новый Структура;
//			ПараметрыШтрихкода.Вставить("Ширина", Рисунок.Ширина / КоличествоМиллиметровВПикселе);
//			ПараметрыШтрихкода.Вставить("Высота", Рисунок.Высота / КоличествоМиллиметровВПикселе);
//			ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеШтрихкода);
//			ПараметрыШтрихкода.Вставить("ТипКода", 99);
//			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
//			ПараметрыШтрихкода.Вставить("РазмерШрифта", ?(РазмерШрифта = 0, 24, РазмерШрифта));
//			Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
//		КонецЕсли; 
//		
//		Если ПечатьНаПоловинеСтраницы Тогда
//			
//			Если й%2 = 0 Тогда   //четное
//				ТабличныйДокумент.Присоединить(Область);  
//				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//			Иначе
//				ТабличныйДокумент.Вывести(Область);								
//			КонецЕсли; 
//			
//		ИначеЕсли ПечатьНаЧетвертиСтраницы Тогда
//			
//			Если й%2 = 0 Тогда   //четное
//				ТабличныйДокумент.Присоединить(Область); 
//				Если й%4 = 0 Тогда
//					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//				КонецЕсли;
//			Иначе
//				ТабличныйДокумент.Вывести(Область);								
//			КонецЕсли;			
//			
//		Иначе			
//			ТабличныйДокумент.Вывести(Область);		
//			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли; 
//		
//		
//		
//	КонецЦикла;
//	
//	Возврат ТабличныйДокумент;
//	
//КонецФункции

//&НаСервере
//Функция Транслит(Вход) 
//    Коды = Новый Соответствие;
//    Коды.Вставить("ё","yo");
//    Коды.Вставить("Ё","Yo");
//    Нач = КодСимвола("А");
//    Англ = "A" "B" "V" "G" "D" "E" "Zh" "Z" "I" "Y" "K" "L" "M" "N" "O" "P" "R" "S" "T" "U" "F" "Kh" "Ts" "Ch" "Sh" "Shch" "" "Y" "" "E" "Yu" "Ya" "a" "b" "v" "g" "d" "e" "zh" "z" "i" "y" "k" "l" "m" "n" "o" "p" "r" "s" "t" "u" "f" "kh" "ts" "ch" "sh" "shch" "" "y" "" "e" "yu" "ya";
//    Для К = Нач по КодСимвола("я") Цикл
//        Коды.Вставить(Символ(К), СтрПолучитьСтроку(Англ, К - Нач + 1));
//    КонецЦикла;
//    Выход = "";
//    Для К=1 по СтрДлина(Вход) Цикл
//        Бкв = Сред(Вход,К,1);
//        Зн = Коды.Получить(Бкв);
//        Выход = Выход + ?(Зн = Неопределено, Бкв, Зн);
//    КонецЦикла;
//    Возврат Выход;
//КонецФункции
//\\