
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыСеансаСтруктура = РфпПолучениеДанныхСервер.ПараметрыСеанса();
	
	Если ПараметрыСеансаСтруктура.алк_СеансПортовогоАгента Тогда
		
		Отбор = Новый Структура("Перевозчик", ?(ЗначениеЗаполнено(ПараметрыСеансаСтруктура.алк_КонтрагентПортовогоАгента), ПараметрыСеансаСтруктура.алк_КонтрагентПортовогоАгента, Неопределено)); 	
		ПараметрыФормы = Новый Структура("Отбор", Отбор);

	Иначе		
		ПараметрыФормы = Новый Структура;
	КонецЕсли; 	
	
		
	ОткрытьФорму("Документ.алк_ТранспортировкаЗапасов.Форма.ФормаСпискаПортовыйАгент", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
