
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьУсловноеОформление();
	РассчитатьСписок();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУсловноеОформление(ВкладкаПодробно = Ложь)
	Элементы.ФормаВернуться.Видимость 			= ВкладкаПодробно;
	Элементы.ФормаПеренестиВДокумент.Видимость 	= ВкладкаПодробно;
	Элементы.ФормаРассчитатьХарактеристики.Видимость = Не ВкладкаПодробно;
	Элементы.Страницы.ТекущаяСтраница = ?(ВкладкаПодробно, Элементы.СтраницаДетально, Элементы.СтраницаГруппировка);
КонецПроцедуры

&НаКлиенте
Процедура Вернуться(Команда)
	УстановитьУсловноеОформление(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъемПриИзменении(Элемент)
	ИтогОбъем = Список.Итог("Объем");
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьХарактеристики(Команда)
	РассчитатьХарактеристикиНаСервере();
	УстановитьУсловноеОформление(Истина);
КонецПроцедуры

&НаСервере
Процедура РассчитатьХарактеристикиНаСервере()
	Запрос = новый запрос(
	"ВЫБРАТЬ
	|	Список.Порода,
	|	Список.Длина,
	|	Список.Сертификат,
	|	Список.Объем
	|ПОМЕСТИТЬ ВТ_Список
	|ИЗ
	|	&Список КАК Список
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Список.Объем КАК ОбъемРаспределить,
	|	ВТ_Список.Сертификат,
	|	ВЗ_Остатки.Порода,
	|	ВЗ_Остатки.Длина,
	|	СУММА(ВЗ_Остатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ВЗ_Остатки.КоличествоШтук) КАК КоличествоШтук,
	|	ВЗ_Остатки.Сорт,
	|	ВЗ_Остатки.Сечение,
	|	ВЗ_Остатки.Характеристика,
	|	ВЗ_Остатки.СечениеДиаметрММ КАК СечениеДиаметрММ,
	|	ВЗ_Остатки.ОбъемШтуки
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_ПараметрыХарактеристик.Порода КАК Порода,
	|		алк_ПараметрыХарактеристик.Длина КАК Длина,
	|		алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|		ВЫБОР
	|			КОГДА алк_ПараметрыХарактеристик.Объем = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(15, 0))
	|		КОНЕЦ КАК КоличествоШтук,
	|		алк_ПараметрыХарактеристик.Сорт КАК Сорт,
	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|		алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
	|		алк_ПараметрыХарактеристик.Сечение.ДиаметрММ КАК СечениеДиаметрММ,
	|		алк_ПараметрыХарактеристик.Объем КАК ОбъемШтуки,
	|		алк_ОстаткиЗапасовОстатки.Сертификат КАК Сертификат
	|	ИЗ
	|		РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|				,
	|				СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	|					И Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)) КАК алк_ОстаткиЗапасовОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|	ГДЕ
	|		(алк_ПараметрыХарактеристик.Порода, алк_ПараметрыХарактеристик.Длина) В
	|				(ВЫБРАТЬ
	|					ВТ.Порода,
	|					ВТ.Длина
	|				ИЗ
	|					ВТ_Список КАК ВТ
	|				ГДЕ
	|					ВТ.Объем > 0)) КАК ВЗ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Список КАК ВТ_Список
	|		ПО ВЗ_Остатки.Порода = ВТ_Список.Порода
	|			И ВЗ_Остатки.Длина = ВТ_Список.Длина
	|			И ВЗ_Остатки.Сертификат = ВТ_Список.Сертификат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Список.Объем,
	|	ВТ_Список.Сертификат,
	|	ВЗ_Остатки.Порода,
	|	ВЗ_Остатки.Длина,
	|	ВЗ_Остатки.Сорт,
	|	ВЗ_Остатки.Сечение,
	|	ВЗ_Остатки.Характеристика,
	|	ВЗ_Остатки.СечениеДиаметрММ,
	|	ВЗ_Остатки.ОбъемШтуки
	|
	|УПОРЯДОЧИТЬ ПО
	|	СечениеДиаметрММ УБЫВ
	|ИТОГИ ПО
	|	ОбъемРаспределить");
	Запрос.УстановитьПараметр("Список", Список.Выгрузить(,"Порода, Длина, Сертификат, Объем"));	
	РезультатГруппировка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МассивРаспределения = новый массив;
	Пока РезультатГруппировка.Следующий() Цикл
		КоличествоРаспределить = РезультатГруппировка.ОбъемРаспределить;
		ДетальныеЗаписи = РезультатГруппировка.Выбрать();
		Пока ДетальныеЗаписи.Следующий() Цикл
			Если КоличествоРаспределить = 0 тогда
				Прервать;	
			КонецЕсли;
			Если КоличествоРаспределить >= ДетальныеЗаписи.КоличествоОстаток тогда
				МассивРаспределения.Добавить(новый структура("Характеристика, Сертификат, Объем, Количество"
					, ДетальныеЗаписи.Характеристика, ДетальныеЗаписи.Сертификат, ДетальныеЗаписи.КоличествоОстаток, ДетальныеЗаписи.КоличествоШтук));
				КоличествоРаспределить = КоличествоРаспределить - ДетальныеЗаписи.КоличествоОстаток;
			ИначеЕсли КоличествоРаспределить < ДетальныеЗаписи.КоличествоОстаток тогда
				ДостаточноеКоличество = Цел(КоличествоРаспределить / ДетальныеЗаписи.ОбъемШтуки);
				Если ДостаточноеКоличество = 0 тогда
					Продолжить;
				КонецЕсли;
				РаспределяемоеКоличество = ДетальныеЗаписи.ОбъемШтуки * ДостаточноеКоличество; 
				МассивРаспределения.Добавить(новый структура("Характеристика, Сертификат, Объем, Количество"
					, ДетальныеЗаписи.Характеристика, ДетальныеЗаписи.Сертификат, РаспределяемоеКоличество, ДостаточноеКоличество));
				КоличествоРаспределить = КоличествоРаспределить - РаспределяемоеКоличество;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоРаспределить > 0 тогда
			Сообщить("Не удалось распределить " + КоличествоРаспределить + "м3. Распределяемый объем сокращен.");
		КонецЕсли;
	КонецЦикла;
	Запрос = новый запрос(
	"ВЫБРАТЬ
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Длина,
	|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК ОбъемОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА алк_ПараметрыХарактеристик.Объем = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(15, 0))
	|		КОНЕЦ) КАК КоличествоОстаток,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|	алк_ОстаткиЗапасовОстатки.Характеристика,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ КАК СечениеДиаметрММ,
	|	алк_ПараметрыХарактеристик.Объем КАК ОбъемШтуки,
	|	алк_ПараметрыХарактеристик.Порода.Код КАК ПородаКод,
	|	алк_ПараметрыХарактеристик.Сорт.Порядок КАК СортПорядок,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
	|	алк_ОстаткиЗапасовОстатки.Сертификат КАК Сертификат
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			,
	|			СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	|				И Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)) КАК алк_ОстаткиЗапасовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ОстаткиЗапасовОстатки.Характеристика,
	|	алк_ПараметрыХарактеристик.Объем,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ,
	|	алк_ПараметрыХарактеристик.Порода.Код,
	|	алк_ПараметрыХарактеристик.Сорт.Порядок,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
	|	алк_ОстаткиЗапасовОстатки.Сертификат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сертификат,
	|	ПородаКод,
	|	СортПорядок,
	|	СечениеДиаметрММ,
	|	ДлинаДлинаММ"); 
	ТаблицаДляПереноса.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого Элемент из МассивРаспределения Цикл
		Строки = ТаблицаДляПереноса.НайтиСтроки(Новый структура("Характеристика,Сертификат", Элемент.Характеристика, Элемент.Сертификат));
		Если Строки.Количество()=0 тогда
			Возврат;
		КонецЕсли;
		Строки[0].Объем = Элемент.Объем;
		Строки[0].Количество = Элемент.Количество;
	КонецЦикла;               
	РассчитатьИтогТаблицыДляПереноса();
	
КонецПроцедуры
 
&НаСервере
Процедура РассчитатьСписок()
	Запрос = новый запрос(
	"ВЫБРАТЬ
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Длина,
	|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК ОбъемОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА алк_ПараметрыХарактеристик.Объем = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(15, 0))
	|		КОНЕЦ) КАК КоличествоШтук,
	|	алк_ПараметрыХарактеристик.Порода.Код КАК ПородаКод,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
	|	алк_ОстаткиЗапасовОстатки.Сертификат КАК Сертификат
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			,
	|			СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.Биржа)
	|				И Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)
	|				И Номенклатура.КатегорияНоменклатуры = ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.Пиловочник)) КАК алк_ОстаткиЗапасовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Порода.Код,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
	|	алк_ОстаткиЗапасовОстатки.Сертификат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сертификат,
	|	ПородаКод,
	|	ДлинаДлинаММ");
	Список.Загрузить(Запрос.Выполнить().Выгрузить()); 
	ИтогОбъемОстаток = Список.Итог("ОбъемОстаток"); 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДляПереносаКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаДляПереноса.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеДанные.Объем = ТекущиеДанные.Количество*ТекущиеДанные.ОбъемШтуки;
	
	РассчитатьИтогТаблицыДляПереноса();
	
КонецПроцедуры

Процедура РассчитатьИтогТаблицыДляПереноса()
	
	ИтогКоличествоДляПереноса 	= ТаблицаДляПереноса.Итог("Количество");
	ИтогОбъемДляПереноса 		= ТаблицаДляПереноса.Итог("Объем");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	МассивВозврата = Новый Массив;
	Для каждого Строка из ТаблицаДляПереноса Цикл
		Если строка.Объем > 0 тогда
			МассивВозврата.Добавить(Новый структура("Номенклатура, Характеристика, Сертификат, КоличествоШтук, Количество", 
				РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Строка.Характеристика,"Владелец"), Строка.Характеристика, Строка.Сертификат, Строка.Количество, Строка.Объем));
		КонецЕсли;
	КонецЦикла;
	ОповеститьОВыборе(МассивВозврата);
КонецПроцедуры


