#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСписанияПорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеПортЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.КоличествоПакетов,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПеремещениеПортЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияПриход,
		|	&Период,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.КоличествоПакетов,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Заказ,
		|	алк_ПеремещениеПортЗапасы.Ссылка.ОрганизацияПолучатель,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	алк_ПеремещениеПортЗапасы.Ссылка.Организация,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_ПеремещениеПортЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	алк_ПеремещениеПортЗапасы.Количество КАК Количество,
		|	алк_ПеремещениеПортЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияПриход,
		|	алк_ПеремещениеПортЗапасы.Ссылка.ОрганизацияПолучатель,
		|	алк_ПеремещениеПортЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
		|	алк_ПеремещениеПортЗапасы.Номенклатура,
		|	алк_ПеремещениеПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_ПеремещениеПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_ПеремещениеПортЗапасы.СерийныйНомер
		|	КОНЕЦ,
		|	алк_ПеремещениеПортЗапасы.Количество,
		|	алк_ПеремещениеПортЗапасы.Ссылка
		|ИЗ
		|	Документ.алк_ПеремещениеПорт.Запасы КАК алк_ПеремещениеПортЗапасы
		|ГДЕ
		|	алк_ПеремещениеПортЗапасы.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСписанияПорт);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаАктСписанияПорт.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[1].Выгрузить());
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли