
#Область СобытияФормы




#КонецОбласти 

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.СерийныйНомер,
	|	ВложенныйЗапрос.КоличествоПакетов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_ЗапасыНаСкладахСерииОстатки.Номенклатура КАК Номенклатура,
	|		алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер КАК СерийныйНомер,
	|		алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов
	|	ИЗ
	|		РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(
	|				,
	|				Организация = &Организация
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					И Номенклатура = &Номенклатура) КАК алк_ЗапасыНаСкладахСерииОстатки) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура,
	|	ВТ.СерийныйНомер,
	|	ВТ.КоличествоПакетов,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	|	ЕСТЬNULL(алк_ПакетыИсторияЗаказовСрезПоследних.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.алк_ЗаказПокупателя.ПустаяСсылка)) КАК ЗаказПокупателя,
	|	алк_ПараметрыПакетовСрезПоследних.Объем
	|ПОМЕСТИТЬ втРезультатПоПараметрам
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ.СерийныйНомер
	|					ИЗ
	|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО (алк_ПараметрыХарактеристик.Характеристика = алк_ПараметрыПакетовСрезПоследних.Характеристика)
	|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ.СерийныйНомер
	|					ИЗ
	|						ВТ КАК ВТ)) КАК алк_ПакетыИсторияЗаказовСрезПоследних
	|		ПО ВТ.СерийныйНомер = алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	(алк_ПараметрыПакетовСрезПоследних.Характеристика = &Характеристика
	|			ИЛИ &ВсеХарактеристика)
	|	И (алк_ПараметрыХарактеристик.Длина = &Длина
	|			ИЛИ &ВсеДлина)
	|	И (алк_ПараметрыХарактеристик.Порода = &Порода
	|			ИЛИ &ВсеПорода)
	|	И (алк_ПараметрыХарактеристик.Сорт В (&Сорт)
	|			ИЛИ &ВсеСорт)
	|	И (алк_ПараметрыХарактеристик.Сечение В (&Сечение)
	|			ИЛИ &ВсеСечение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультатПоПараметрам.Номенклатура,
	|	втРезультатПоПараметрам.СерийныйНомер,
	|	втРезультатПоПараметрам.КоличествоПакетов,
	|	втРезультатПоПараметрам.Характеристика,
	|	втРезультатПоПараметрам.ЗаказПокупателя,
	|	втРезультатПоПараметрам.Объем
	|ИЗ
	|	втРезультатПоПараметрам КАК втРезультатПоПараметрам
	|ГДЕ
	|	втРезультатПоПараметрам.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("Номенклатура", ОтборНоменклатура);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Запрос.УстановитьПараметр("ВсеХарактеристика", ?(ЗначениеЗаполнено(ОтборХарактеристика), Ложь, Истина));
	Запрос.УстановитьПараметр("Характеристика", ОтборХарактеристика);
	Запрос.УстановитьПараметр("ВсеДлина", ?(ЗначениеЗаполнено(ОтборДлина), Ложь, Истина));
	Запрос.УстановитьПараметр("Длина", ОтборДлина);
	Запрос.УстановитьПараметр("ВсеПорода", ?(ЗначениеЗаполнено(ОтборПорода), Ложь, Истина));
	Запрос.УстановитьПараметр("Порода", ОтборПорода);
	Запрос.УстановитьПараметр("ВсеСорт", ?(ЗначениеЗаполнено(ОтборСорт), Ложь, Истина));
	Запрос.УстановитьПараметр("Сорт", ОтборСорт);
	Запрос.УстановитьПараметр("ВсеСечение", ?(ЗначениеЗаполнено(ОтборСечение), Ложь, Истина));
	Запрос.УстановитьПараметр("Сечение", ОтборСечение);
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ?(ОтборБезЗаказа, Документы.алк_ЗаказПокупателя.ПустаяСсылка(), ОтборЗаказПокупателя));
	
	РезультатЗапроса = Запрос.Выполнить();   //  РезультатЗапроса.Выгрузить()
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ЗаполнитьПоОстаткамНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСортНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Номенклатура", ОтборНоменклатура); 
	ПараметрыФормы.Вставить("СтрокаКоманды", "Справочник.Сорта.ФормаВыбора");
	Форма = ОткрытьФорму("Обработка.алк_ПодборВСписки.Форма.ФормаПодборИзПодчинСпр", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСечениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Номенклатура", ОтборНоменклатура); 
	ПараметрыФормы.Вставить("СтрокаКоманды", "Справочник.РазмерСечения.ФормаВыбора");
	Форма = ОткрытьФорму("Обработка.алк_ПодборВСписки.Форма.ФормаПодборИзПодчинСпр", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСерийныйНомерПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.СерийныйНомер) Тогда
		Возврат;
	Иначе
				
		ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(СтрокаТабличнойЧасти.СерийныйНомер);
		
		СтрокаТабличнойЧасти.Характеристика 	= ПараметрыПакета.Характеристика;
		СтрокаТабличнойЧасти.КоличествоПакетов 	= 1;
		СтрокаТабличнойЧасти.Объем 				= ПараметрыПакета.Объем;
		
		СтрокаТабличнойЧасти.ТекущийЗаказ =  ПолучитьТекущийЗаказ(СтрокаТабличнойЧасти.СерийныйНомер, Объект.Дата);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийЗаказ(СерийныйНомер, ДатаСреза)

	ТекущийЗаказ = Документы.алк_ЗаказПокупателя.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПакетыИсторияЗаказовСрезПоследних.ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(&ДатаСреза, СерийныйНомер = &СерийныйНомер) КАК алк_ПакетыИсторияЗаказовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ДатаСреза); 
	Запрос.УстановитьПараметр("СерийныйНомер", 	СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущийЗаказ = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
	КонецЦикла;
	
	Возврат ТекущийЗаказ;


КонецФункции // ПолучитьТекущийЗаказ()

&НаСервере
Процедура ОбновитьТекущийЗаказ()
	
	Для каждого Стр Из Объект.Запасы Цикл                                                             		
		Стр.ТекущийЗаказ = ПолучитьТекущийЗаказ(Стр.СерийныйНомер, Объект.Дата);	
	КонецЦикла;
	
КонецПроцедуры
 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТекущийЗаказ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьТекущийЗаказ();	
	
КонецПроцедуры
 




