
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Тогда
		возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		возврат;
	КонецЕсли;
	
	//Переход на указание сертификата справочником из флажка
	СертFSC = Справочники.СертификатыНаПродукцию.НайтиПоРеквизиту("НомерСертификата","SGS-COC-009678");
	Если СертFSC = Справочники.СертификатыНаПродукцию.ПустаяСсылка() Тогда
		возврат;
	КонецЕсли;
	
	Проводки = ЭтотОбъект;
	
	Для каждого проводка из проводки цикл
		Если проводка.СертификатFSC И не ЗначениеЗаполнено(проводка.Сертификат) Тогда
			проводка.Сертификат = СертFSC;
			проводка.СертификатFSC = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
