
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИспользоватьАддендумы", ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы"));
		
	//Установить индентификаторы товара из заказа
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И ДополнительныеСвойства.ИспользоватьАддендумы = Истина тогда
		Документы.алк_ЗагрузкаКонтейнера.УстановитьИдентификаторыТоваровАддендумов(ЭтотОбъект, Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";	
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры               


Процедура ПриКопировании(ОбъектКопирования)
	Запасы.Очистить();
	Ответственный = Пользователи.ТекущийПользователь();
	ОбъемДокумента = 0;
	КоличествоДокумента = 0;
	ПараметрыСмены = алк_ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыСменыПоДате(ТекущаяДата());
	ДатаСмены = ПараметрыСмены.ДатаСмены;
	СменаУдалить = ПараметрыСмены.Смена;
КонецПроцедуры


//02.02.2023 Дубоделов Э.А Выдавал ошибку при создании с установленным отбором
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	ПроверитьДанныеСтруктуры(ДанныеЗаполнения);
	
	Для Каждого Элемент Из ДанныеЗаполнения Цикл
		ЭтотОбъект[Элемент.Ключ] = Элемент.Значение;	
	КонецЦикла;
	
КонецПроцедуры


Процедура ПроверитьДанныеСтруктуры(ДанныеЗаполнения)
	 
	Если ДанныеЗаполнения.Свойство("Номер") Тогда
		ДанныеЗаполнения.Удалить("Номер")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Дата") Тогда
		ДанныеЗаполнения.Удалить("Дата")
	КонецЕсли;	
	
	Если ДанныеЗаполнения.Свойство("ДатаСмены") Тогда
		ДанныеЗаполнения.Удалить("ДатаСмены")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПометкаУдаления") Тогда
		ДанныеЗаполнения.Удалить("ПометкаУдаления")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Проведен") Тогда
		ДанныеЗаполнения.Удалить("Проведен")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Ссылка") Тогда
		ДанныеЗаполнения.Удалить("Ссылка")
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Ответственный") Тогда
		ДанныеЗаполнения.Удалить("Ответственный")
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
	КонецЕсли;
		
КонецПроцедуры
//02.02.2023 Дубоделов Э.А  