
&НаСервере
Процедура ПрибылНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл);
КонецПроцедуры

&НаКлиенте
Процедура Прибыл(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		ПрибылНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазгруженСиламиПодрядчикаНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РазгруженСиламиПодрядчика(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		РазгруженСиламиПодрядчикаНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РазгруженСобственнымиСиламиНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РазгруженСобственнымиСилами(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		РазгруженСобственнымиСиламиНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПринятНаСервере(ДокументСсылка)
	Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(ДокументСсылка, Перечисления.алк_СтатусыВходящейОтгрузки.Принят);
КонецПроцедуры

&НаКлиенте
Процедура Принят(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено тогда
		Сообщить("Выделите документ в списке");
	Иначе
		ПринятНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры
