
&НаСервере
Процедура ВыгрузитьНаСервере()
	
		
	// Нач мод [Пакушев И.С.] [19.03.2018] 
	// Обращение № [0000000000] [ТекстЗаявки]  // закоментировал в модуле обработки 

	// Было
	
	//ДокОбъект = РеквизитФормыВЗначение("Объект");
	//ДокОбъект.ВыгрузитьОтгрузки();

	// Стало
	РфпСерверРегламентные.алк_ВыгрузкаОтгрузок(СДаты); 
	// Кон мод [Пакушев И.С.] [19.03.2018]
	
		
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПриемкуЛП(Команда)  	
	
	ВыгрузитьПриемкуЛПНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьПриемкуЛПНаСервере()
	
	// Нач мод [Пакушев И.С.] [21.06.2018] 
	// Обращение № [0000000000] [ТекстЗаявки]
	// Стало 
	
	РфпСерверРегламентные.алк_ВыгрузкаПриемкиЛП();
	
	// Было
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Номер,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Партия.Номер КАК НомерОгрузки,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата,
	//|	НАЧАЛОПЕРИОДА(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата, ДЕНЬ) КАК Дата2,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.ДатаОтгрузки,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель) КАК Производитель,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерНакладной,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерВагона,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СтанцияОтправления) КАК СтанцияОтправления,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СертификатПроизводителя.НомерСертификата КАК Сертификат,
	//|	ВЫБОР
	//|		КОГДА алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Несоответствие
	//|			ТОГДА ""несоответствие""
	//|		ИНАЧЕ ""основной склад""
	//|	КОНЕЦ КАК Штабель,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сорт) КАК Сорт,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Длина,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение.ДиаметрММ,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ГрадацииСечений.Градация) КАК Градация,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Количество,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем,
	//|	0 КАК ОбъемСПрипуском,
	//|	ИСТИНА КАК МылкиЛП,
	//|	ВЫБОР
	//|		КОГДА алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
	//|			ТОГДА ""Автомобиль""
	//|		ИНАЧЕ ""Вагон""
	//|	КОНЕЦ КАК Транспорт,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Ссылка
	//|ИЗ
	//|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
	//|		ПО алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение = алк_ГрадацииСечений.Сечение
	//|ГДЕ
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Проведен
	//|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата >= &ДатаОт
	//|	И НЕ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Основная";
	//
	//
	//Если ЗначениеЗаполнено(СДаты) Тогда
	//	Запрос.УстановитьПараметр("ДатаОт", СДаты);	
	//Иначе
	//	Запрос.УстановитьПараметр("ДатаОт", ТекущаяДата() - 3600*24*30);
	//КонецЕсли; 
	//
	//РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить()
	//
	//ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	//ТаблицаРезультат.Колонки.Добавить("Товар");
	//ТаблицаРезультат.Колонки.Добавить("Сечение");
	//
	//Для Каждого стрТаблицы Из ТаблицаРезультат Цикл
	//	
	//	СтрНомер = стрТаблицы.Номер;
	//	
	//	СтрНомер = "ЛК-" + Прав(СтрНомер, СтрДлина(СтрНомер)-3);
	//	
	//	стрТаблицы.Номер = СтрНомер;
	//	стрТаблицы.Товар = стрТаблицы.Порода.СокращенноеНаименование + " " + СтрЗаменить(стрТаблицы.Длина.Наименование, ".", ",");
	//	стрТаблицы.Сечение = Строка(стрТаблицы.СечениеДиаметрММ / 10);
	//	
	//КонецЦикла; 
	//
	//ТаблицаРезультат = ОбозначитьШтРеквизитКакОсновной(ТаблицаРезультат);
	//
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Порода"]);	
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Длина"]);
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Номенклатура"]);
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["СечениеДиаметрММ"]);
	//
	//ЗначениеВФайл("\\rfp04-srv023\exchange\ALK_TD_L.txt", ТаблицаРезультат);
	
	// Кон мод [Пакушев И.С.] [21.06.2018]

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыгрузкаРеализации(Команда)
	
	ОткрытьФорму("Обработка.ВыгрузкаИзАЛогистиК_вТД.Форма.ФормаВыгрузкаРеализации");
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьПриемкуЛП_ТестНаСервере(ВыгружаемыйДокумент)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Номер,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Партия.Номер КАК НомерОгрузки,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата,
	//|	НАЧАЛОПЕРИОДА(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Дата, ДЕНЬ) КАК Дата2,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.ДатаОтгрузки,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Производитель) КАК Производитель,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерНакладной,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.НомерВагона,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СтанцияОтправления) КАК СтанцияОтправления,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.СертификатПроизводителя.НомерСертификата КАК Сертификат,
	//|	ВЫБОР
	//|		КОГДА алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Несоответствие
	//|			ТОГДА ""несоответствие""
	//|		ИНАЧЕ ""основной склад""
	//|	КОНЕЦ КАК Штабель,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сорт) КАК Сорт,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Длина,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение.ДиаметрММ,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ГрадацииСечений.Градация) КАК Градация,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Количество,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем,
	//|	0 КАК ОбъемСПрипуском,
	//|	ИСТИНА КАК МылкиЛП,
	//|	ВЫБОР
	//|		КОГДА алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
	//|			ТОГДА ""Автомобиль""
	//|		ИНАЧЕ ""Вагон""
	//|	КОНЕЦ КАК Транспорт,
	//|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель.Ссылка
	//|ИЗ
	//|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
	//|		ПО алк_ПриемкаЛесопродукцииПиловочникГОСТ.Сечение = алк_ГрадацииСечений.Сечение
	//|ГДЕ
	//|	НЕ алк_ПриемкаЛесопродукцииПиловочникГОСТ.Основная
	//|	И алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка = &Ссылка";
	//
	//
	//Запрос.УстановитьПараметр("Ссылка", ВыгружаемыйДокумент);
	//
	//РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить()
	//
	//ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	//ТаблицаРезультат.Колонки.Добавить("Товар");
	//ТаблицаРезультат.Колонки.Добавить("Сечение");
	//
	//Для Каждого стрТаблицы Из ТаблицаРезультат Цикл
	//	
	//	СтрНомер = стрТаблицы.Номер;
	//	
	//	СтрНомер = "ЛК-" + Прав(СтрНомер, СтрДлина(СтрНомер)-3);
	//	
	//	стрТаблицы.Номер = СтрНомер;
	//	стрТаблицы.Товар = стрТаблицы.Порода.СокращенноеНаименование + " " + СтрЗаменить(стрТаблицы.Длина.Наименование, ".", ",");
	//	стрТаблицы.Сечение = ?(стрТаблицы.СечениеДиаметрММ >= 100, Строка(стрТаблицы.СечениеДиаметрММ / 10), "0" + Строка(стрТаблицы.СечениеДиаметрММ / 10));
	//		
	//КонецЦикла;
	//
	//ТаблицаРезультат = ОбозначитьШтРеквизитКакОсновной(ТаблицаРезультат);
	//
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Порода"]);	
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Длина"]);
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["Номенклатура"]);
	//ТаблицаРезультат.Колонки.Удалить(ТаблицаРезультат.Колонки["СечениеДиаметрММ"]);
	//
	//ЗначениеВФайл("\\rfp04-srv023\exchange\ALK_TD_L_ts.txt", ТаблицаРезультат);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПриемкуЛП_Тест(Команда)
	ВыгрузитьПриемкуЛП_ТестНаСервере(ОбъектВыгрузки);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбозначитьШтРеквизитКакОсновной(ОбрабатываемаяТаблица)
	
	ШтабельРеквизит = Справочники.алк_Штабели.НайтиПоКоду("000000007");

	Для Каждого стрТаблицы Из ОбрабатываемаяТаблица Цикл
		Если стрТаблицы.ШтабельСсылка = ШтабельРеквизит Тогда
			стрТаблицы.Штабель = "основной склад"; 	
		КонецЕсли; 	

	КонецЦикла;
	
	Возврат ОбрабатываемаяТаблица;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьОтгрузку_Тест(Команда)
	ВыгрузитьОтгрузку_ТестНаСервере(ОбъектВыгрузки);	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьОтгрузку_ТестНаСервере(ОбъектВ)
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ВыгрузитьОтгрузки_Объект(ОбъектВ);		
КонецПроцедуры
