
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Владелец) И 
		НЕ Объект.Владелец.ИспользоватьСерийныеНомера Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Для номенклатуры не ведется учет по серийным номерам!
		|Установите флаг ""Использовать серийные номера"" в карточке номенклатуры'");
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "СтраницаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаЗаполнить.Видимость	= Ложь;
		//Элементы.ГруппаПродан.Видимость	= Истина;
	Иначе
		Элементы.ГруппаЗаполнить.Видимость = Истина;
		//Элементы.ГруппаПродан.Видимость	= Ложь;
	КонецЕсли;
	
	Если Объект.Продан Тогда
		ДанныеГарантии = Справочники.СерийныеНомера.СрокДействияГарантии(Объект.Ссылка, ТекущаяДата());
		Если ДанныеГарантии.Количество()>0 Тогда
			ПродажаИнфо = ?(ДанныеГарантии.Гарантия, 
			Строка(ДанныеГарантии.ДокументПродажи)+", гарантийный срок до "+ДанныеГарантии.СрокДействияГарантии,
			Строка(ДанныеГарантии.ДокументПродажи));
			ДокументПродажи = ДанныеГарантии.ДокументПродажи;
		КонецЕсли;
	КонецЕсли;
	
	//Элементы.ГруппаRFIDГИСМ.Видимость = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ВидМаркировки")<>Перечисления.ВидыМаркировки.НеМаркируется);
	
	//рфп+
	Если Не Параметры.Ключ.Пустая() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ПараметрыПакета = Обработки.алк_УправлениеСериями.ВернутьДанныеПоСерийномуНомеру(Объект.Ссылка); //РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(Объект.Ссылка);
		
		Если ПараметрыПакета = Неопределено Тогда
			УстановитьПривилегированныйРежим(Ложь);
			Возврат;  
		КонецЕсли;
		
		Характеристика   = ПараметрыПакета.Характеристика;
		Объем            = ПараметрыПакета.Объем;
		Сертификат 		 = ПараметрыПакета.Сертификат;
		
		Если ЗначениеЗаполнено(Характеристика) Тогда 
			Элементы.Характеристика.Видимость = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объем) Тогда 
			Элементы.Объем.Видимость = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сертификат) Тогда 
			Элементы.Сертификат.Видимость = Истина;
		КонецЕсли;
		
		//Если пилмат
		Если ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001") 
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012")
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000016")    
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017") Тогда
			
			Сухой   = ПараметрыПакета.Сухой; 
			Габарит = ПараметрыПакета.Габарит;
			КоличествоСостав = ПараметрыПакета.КоличествоСостав; 
			ВесНеттоТаможня  = ПараметрыПакета.ВесНеттоТаможня;
			ВесБруттоТаможня = ПараметрыПакета.ВесБруттоТаможня; 
			ПериодУпаковки   = ПараметрыПакета.ПериодУпаковки; 
			КатегорияНоменклатурыПЭО   	= ПараметрыПакета.КатегорияНоменклатурыПЭО; 
			
			Если ЗначениеЗаполнено(Сухой) Тогда 
				Элементы.Сухой.Видимость = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Габарит) Тогда 
				Элементы.Габарит.Видимость = Истина;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ВесНеттоТаможня) Тогда 
				Элементы.ВесНеттоТаможня.Видимость = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВесБруттоТаможня) Тогда 
				Элементы.ВесБруттоТаможня.Видимость = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КатегорияНоменклатурыПЭО) Тогда 
				Элементы.КатегорияНоменклатурыПЭО.Видимость = Истина;
			КонецЕсли;
 		Иначе
			ПериодУпаковки   = ПараметрыПакета.Период; 
		КонецЕсли; 
		//\\
		
		//Если шпон
		Если ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000005")
			ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.Шпон
			//ИЛИ ПараметрыПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000040") 
			Тогда
			КоличествоСостав = ПараметрыПакета.КоличествоЛистов; //когда шпон или фанера ИД - листы 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПериодУпаковки) Тогда 
			Элементы.КоличествоСостав.Видимость = Истина;
		КонецЕсли;
		
		Если НЕ КоличествоСостав = 0 Тогда 
			Элементы.КоличествоСостав.Видимость = Истина;
		КонецЕсли;
		//\\
		
		Движения.Загрузить(Обработки.алк_УправлениеСериями.ВернутьДвиженияПоПакету(Объект.Ссылка));  
		УстановитьПривилегированныйРежим(Ложь);
		
		//Для Каждого стр ИЗ Движения Цикл
		//	Если СтрНайти(Строка(стр.Регистратор),"<Объект не найден>") > 0 Тогда 
		//		Движения.Удалить(стр);
		//	КонецЕсли;
		//КонецЦикла;
		
		Если Движения.Количество() <> 0 Тогда  
			Элементы.Движения.Видимость = Истина;	
		КонецЕсли;
		

	КонецЕсли;  
	//рфп
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства".
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры // ПередЗаписьюНаСервере()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры // Подключаемый_РедактироватьСоставСвойств()

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры // ОбновитьЭлементыДополнительныхРеквизитов()

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ДобавитьСерийныйНомерНаСервере()
	
	Объект.Наименование = РаботаССерийнымиНомерами.ДобавитьСерийныйНомер(Объект.Владелец, ШаблонСерийногоНомера).НовыйНомер;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСерийныйНомер(Команда)  
	
	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда 
		
		Сообщить("Укажите номенклатуру!");
		Возврат;
	
	КонецЕсли;
	
	ДобавитьСерийныйНомерНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажаИнфоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ДокументПродажи) Тогда
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(ДокументПродажи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СокрЛП(Объект.Наименование)="" Тогда
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Серийный номер не заполнен!'");
		Сообщение.Сообщить();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	ТекДанные = Элементы.Движения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ОткрытьЗначениеАсинх(ТекДанные.Регистратор);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
