
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Сертификат.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000008"), "PEFC controlled sources ALK");
	Элементы.Сертификат.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000012"), "100% PEFC RU18/818418718");
	Элементы.Сертификат.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.ПустаяСсылка(), "Без сертификата");
	
		
	Объект.ДатаСмены		= Параметры.ДатаСмены;
	Объект.Смена			= Параметры.Смена;
	Объект.Ответственный	= Параметры.Ответственный;
	Объект.Направление		= Параметры.Направление;
	Объект.Участок			= Параметры.Участок;
	Сертификат				= Параметры.Сертификат;	
	Администрирование		= Параметры.Администрирование;
	//СушильныеПакеты			= Параметры.СушильныеПакеты;
	Вариант					= Параметры.Вариант;
	Объект.ЛинияСортировки = Параметры.ЛинияСортировки;
	
	//СушильныеПакеты = Ложь;
	//Элементы.СушильныеПакеты.Видимость = Ложь;   
	
	УстановитьНастройки(Вариант);  
	
	
	Элементы.Ответственный.ТолькоПросмотр = Не Администрирование;
	Элементы.ШаблонСерийногоНомера.ТолькоПросмотр = Не Администрирование; 
	
	Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюУдалитьПакет.Доступность = Администрирование;  
	
	Если РольДоступна("алк_УдалениеПакетовВСмене") Тогда 
		
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, ТекущаяДата());
		
		Если ПараметрыСменыПоТекущейДате.ДатаСмены = Объект.ДатаСмены и ПараметрыСменыПоТекущейДате.Смена = Объект.Смена Тогда 
			
			Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюУдалитьПакет.Доступность = Истина;		
		
		КонецЕсли; 	
	
	КонецЕсли;
    
	УстановитьЕдиницуИзмеренияКоличества();	
	
	Элементы.Сертификат.СписокВыбора.Очистить(); // с 11.08.2022 - сертификат не используется 
	Элементы.Сертификат.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.ПустаяСсылка(), "Без сертификата");

			
КонецПроцедуры  


&НаСервере
Процедура УстановитьНастройки(Вариант)  
	
	Элементы.ТипПакета.Видимость = Ложь; 
	Элементы.АвтоматическоеЗаполнение.Видимость = Ложь; 
	
	СушильныеПакеты = Ложь;
	Элементы.СушильныеПакеты.Видимость = Ложь;
		
	ПакетНезавершенногоПроизводства = Ложь;
	Элементы.ПакетНезавершенногоПроизводства.Видимость = Ложь;
			
	Если Вариант = 2 Или Вариант = 3 Или Вариант = 8 Тогда 		
		Элементы.ТипПакета.Видимость = Истина;
		Элементы.СписокЗаполнитьДанныеСортировки.Видимость = Истина;   
		Элементы.СписокВвестиНомерПакета.Видимость = Истина;
		Элементы.АвтоматическоеЗаполнение.Видимость = Истина; 
		Элементы.АвтоматическоеЗаполнение.Доступность = Истина;
	КонецЕсли;
	
	МассивНоменклатур = Новый Массив;
	
	//УДАЛИТЬ
	////РМ_СборкаОтходов
	//Если Вариант = 1 Тогда 			
	//	
	//	МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000005")); //Шпон кусковой
	//	МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000006")); //Карандаш
	//	МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000016")); //Оцилиндрованное бревно
	//			
	//	Элементы.Припуск.Видимость			 		= Ложь;
	//	Элементы.КатегорияНоменклатурыПЭО.Видимость = Ложь;
	//	Элементы.Габарит.Видимость 					= Ложь;
	//	Элементы.ПризнакНЗП.Видимость				= Ложь;
	//\\
		
		//РМ_СборкаЛесопиление	  //РМ_СборкаМЛП  	
	Если Вариант = 2 Или Вариант = 6  Тогда 		
				
		МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001")); //Пиломатериал		
				
		Элементы.Припуск.Видимость			 		= Истина;
		Элементы.КатегорияНоменклатурыПЭО.Видимость = Истина;
		Элементы.Габарит.Видимость 					= Истина;
		Элементы.ПризнакНЗП.Видимость				= Ложь;
		
		// РМ_СборкаСушильныхПакетов	          	
	ИначеЕсли Вариант = 3 Или Вариант = 7 Тогда 
		
		МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012")); //Пиломатериал (СП) 
		
		СушильныеПакеты = Истина;
		Элементы.СушильныеПакеты.Видимость = Истина;
		Элементы.СушильныеПакеты.ТолькоПросмотр = Истина; 		
		
		Элементы.Припуск.Видимость			 		= Ложь;
		Элементы.КатегорияНоменклатурыПЭО.Видимость = Ложь;
		Элементы.Габарит.Видимость 					= Ложь;
		Элементы.ПризнакНЗП.Видимость				= Ложь;
			
		//РМ_СборкаОтходовПМ	
	ИначеЕсли Вариант = 4 Или Вариант = 9 Тогда		
		
		МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017")); //Побочная продукция 	 		
		
		Элементы.Припуск.Видимость			 		= Ложь;
		Элементы.КатегорияНоменклатурыПЭО.Видимость = Ложь;
		Элементы.Габарит.Видимость 					= Ложь;
		Элементы.ПризнакНЗП.Видимость				= Ложь;
		
		
		//УДАЛИТЬ			
	//	//РМ_СборкаДревесныеГранулы	
	//ИначеЕсли Вариант = 5 Тогда		
	//	
	//	МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018")); //Пеллеты   			
	//	
	//	//СписокКатегорий.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000007")); //Пилеты (кат)
	//	
	//	Элементы.Припуск.Видимость			 		= Ложь;
	//	Элементы.КатегорияНоменклатурыПЭО.Видимость = Ложь;
	//	Элементы.Габарит.Видимость 					= Ложь;
	//	Элементы.ПризнакНЗП.Видимость				= Ложь;
	//	
	//	Элементы.Сертификат.СписокВыбора.Очистить(); 
	//	Элементы.Сертификат.СписокВыбора.Добавить(Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000014"), "100% PEFC RU20/818419301");  
	//\\
	
		// РМ_СборкаПакетаНезавршенногоПроизводства	
	ИначеЕсли Вариант = 8 Тогда  		
		
		МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001")); //Пиломатериал	
		
		ПакетНезавершенногоПроизводства = Истина;
		Элементы.ПакетНезавершенногоПроизводства.Видимость = Истина; 		
		
		Элементы.Припуск.Видимость			 		= Ложь;
		Элементы.КатегорияНоменклатурыПЭО.Видимость = Ложь;
		Элементы.Габарит.Видимость 					= Ложь;
		Элементы.ПризнакНЗП.Видимость				= Истина;
		Элементы.АвтоматическоеЗаполнение.Доступность = Ложь;
		
		//РМ_СборкаПакетовНаУчасткеМалойПересортировки	
	ИначеЕсли Вариант = 10 Тогда  				
		
		МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001")); //Пиломатериал	
				
		Элементы.Припуск.Видимость			 		= Истина;
		Элементы.КатегорияНоменклатурыПЭО.Видимость = Истина;
		Элементы.Габарит.Видимость 					= Истина;
		Элементы.ПризнакНЗП.Видимость				= Ложь;
		
		//РМ_СборкаСушильныхПакетовНаУчасткеМалойПересортировки	
	ИначеЕсли  Вариант = 11 Тогда 
		
		МассивНоменклатур.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012")); //Пиломатериал (СП) 				
				
		СушильныеПакеты = Истина;
		Элементы.СушильныеПакеты.Видимость = Истина;
		Элементы.СушильныеПакеты.ТолькоПросмотр = Истина; 		
		
		Элементы.Припуск.Видимость			 		= Ложь;
		Элементы.КатегорияНоменклатурыПЭО.Видимость = Ложь;
		Элементы.Габарит.Видимость 					= Ложь;
		Элементы.ПризнакНЗП.Видимость				= Ложь;
		
	КонецЕсли;   
	
	Элементы.Номенклатура.СписокВыбора.Очистить();
	
	Для каждого значение Из МассивНоменклатур Цикл 
		Элементы.Номенклатура.СписокВыбора.Добавить(значение);		
	КонецЦикла;   
	               		

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 	
	
	УстановитьДоступностьДобавитьСН();
	УстановитьДоступностьСформироватьПакет();
	
	ШаблонСерийногоНомера = ПолучитьШаблонСН();
	
	//УстановитьОтборыВСписке(); 
	
	ТипПакетаПриИзменении(Ложь);
	
	ОбновитьСписокИИтоги(); 
	
	УстанавливаемКоличествоЭтикетокПоТипуПакета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	//УстановитьОтборыВСписке(); 
	ОбновитьСписокИИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Элементы.Список.Обновить();		
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиЭлементовФормы

&НаСервере  
Процедура УстановитьКоличествоОбъем()
	
	Если Элементы.КоличествоОбъем.Видимость Тогда
		КоличествоСостав = КоличествоОбъем;
	Иначе 
		КоличествоСостав = КоличествоСостав1;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСоставПриИзменении(Элемент)
	
	УстановитьКоличествоОбъем(); 
	
	КоличествоСоставПриИзмененииНаСервере();
	
	УстановитьДоступностьДобавитьСН();
	
	УстановитьДоступностьСформироватьПакет();
	
	ТекущийЭлемент = Элементы.НомерПакета;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПриИзменении(Элемент)
	
	УстановитьДоступностьДобавитьСН();
	
	УстановитьДоступностьСформироватьПакет();	
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭкземпляровПриИзменении(Элемент)
	
	УстановитьДоступностьСформироватьПакет();
	
КонецПроцедуры


&НаСервере
Процедура КоличествоСоставПриИзмененииНаСервере()
	
	УстановкаРассчетныхПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ШаблонСерийногоНомера = ПолучитьШаблонСН();   	
	                    	
	УстановитьДоступностьДобавитьСН();
	
	//УстановитьОтборыВСписке();
	
	ОбновитьСписокИИтоги();	
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСерийногоНомераПриИзменении(Элемент)
	
	УстановитьДоступностьДобавитьСН();
	
	УстановитьДоступностьСформироватьПакет();
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)   
	
	//УДАЛИТЬ
	//Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы") Тогда 
	//	
	//	ВерхнийДиапазонВесаДГ 	= 0;
	//	НижнийДиапазонВесаДГ 	= 0;
	//	
	//	Если ""+Характеристика = "упаковка 0,65 т." Тогда
	//		
	//		ВерхнийДиапазонВесаДГ 	= 700;
	//		НижнийДиапазонВесаДГ 	= 600;			
	//		
	//	ИначеЕсли ""+Характеристика = "упаковка 1,00 т." Тогда 
	//		
	//		ВерхнийДиапазонВесаДГ 	= 1200;
	//		НижнийДиапазонВесаДГ 	= 701;  		
	//		
	//	Иначе 
	//		
	//		ВерхнийДиапазонВесаДГ 	= 0;
	//		НижнийДиапазонВесаДГ 	= 0; 	
	//		
	//	КонецЕсли; 	
	//	
	//КонецЕсли; 
	//\\
	                        	
	КоличествоСоставКонстанта = РфпПолучениеДанныхСервер.ПолучитьКоличествоСоставаКонстантные(Номенклатура, Характеристика, Объект.ДатаСмены);
	
	КоличествоСостав = ?(КоличествоСоставКонстанта <> 0, КоличествоСоставКонстанта, КоличествоСостав);
	
	УстановитьЕдиницуИзмеренияКоличества();
	
	УстановитьПрипуск();
	
	УстановкаРассчетныхПараметров();

	УстановитьДоступностьДобавитьСН();
	УстановитьДоступностьСформироватьПакет(); 	
	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПакетаПриИзменении(Элемент)	
	
	НомерПакетаПриИзмененииНаСервере();	
	УстановитьДоступностьСформироватьПакет();
	
	ТекущийЭлемент = Элементы.КоличествоСостав;
	
КонецПроцедуры

&НаСервере
Процедура НомерПакетаПриИзмененииНаСервере()
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, СерийныйНомер = &СерийныйНомер) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|ГДЕ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Направление = &Направление
		|	И алк_ПараметрыПакетовОперативныйСрезПоследних.ДатаСмены = &ДатаСмены
		|	И алк_ПараметрыПакетовОперативныйСрезПоследних.Смена = &Смена
		|	И 1 = 1";		
	
	Запрос.Текст = ?(Администрирование, Запрос.Текст, СтрЗаменить(Запрос.Текст, "1 = 1", "алк_ПараметрыПакетовОперативныйСрезПоследних.Ответственный = &Ответственный"));
	Если ЗначениеЗаполнено(ШаблонСерийногоНомера) тогда
		Маска = Лев(ШаблонСерийногоНомера.Наименование, 2);
	   	Запрос.УстановитьПараметр("СерийныйНомер", 	РфпПолучениеДанныхСервер.ПолучитьСерийныйНомер(Номенклатура, НомерПакета, НачалоГода(Объект.ДатаСмены),Маска));
	Иначе
		Запрос.УстановитьПараметр("СерийныйНомер", 	РфпПолучениеДанныхСервер.ПолучитьСерийныйНомер(Номенклатура, НомерПакета, НачалоГода(Объект.ДатаСмены)));
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаСмены", 		Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена",     		Объект.Смена);	
	Запрос.УстановитьПараметр("Направление",   	Объект.Направление);
	Запрос.УстановитьПараметр("Ответственный", 	Объект.Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  		
		Выборка = РезультатЗапроса.Выбрать(); Выборка.Следующий();
		СерийныйНомер = Выборка.СерийныйНомер;  		
	Иначе                  		
		СерийныйНомер = Справочники.СерийныеНомера.ПустаяСсылка();		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(СерийныйНомер) И Вариант = 5 Тогда		
		ПолучитьСвободныеНомераНаСервере();	
	КонецЕсли;    	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСвободныеНомераНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
		|ПОМЕСТИТЬ ВТ_ПакетыВРаботе
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, ПериодПакета = &ПериодПакетаНачалоГода) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|ГДЕ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Направление = &Направление
		|	И НЕ алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность = &Удален
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ПериодПакета = &ПериодПакетаНачалоГода) КАК алк_ПараметрыПакетовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерийныеНомера.Ссылка КАК СерийныйНомер
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	НЕ СерийныеНомера.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ_ПакетыВРаботе.СерийныйНомер
		|				ИЗ
		|					ВТ_ПакетыВРаботе КАК ВТ_ПакетыВРаботе)
		|	И СерийныеНомера.Владелец = &Номенклатура
		|	И СерийныеНомера.Наименование ПОДОБНО ""%-"" + &Год + ""-%"" + &Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерийныеНомера.Наименование";
	
	Запрос.УстановитьПараметр("Год", Формат((Объект.ДатаСмены),"ДФ=yy"));
	Запрос.УстановитьПараметр("Направление", Объект.Направление);
	Запрос.УстановитьПараметр("Удален", Перечисления.алк_ОперативнаяАктуальностьПакетов.Удален);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ПериодПакетаНачалоГода", НачалоГода(Объект.ДатаСмены));
	Запрос.УстановитьПараметр("Номер", ДобавитьНули(НомерПакета, 6));
		
	РезультатЗапроса = Запрос.Выполнить();
		
	Если Не РезультатЗапроса.Пустой() Тогда  		
		Выборка = РезультатЗапроса.Выбрать(); Выборка.Следующий();
		СерийныйНомер = Выборка.СерийныйНомер;  		
	Иначе                  		
		СерийныйНомер = Справочники.СерийныеНомера.ПустаяСсылка();		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьНули(НомерПакета, НужнаяДлинаЗначения)  
	
    Значение = СтрЗаменить(Формат(НомерПакета, "ЧГ="), " ", "");
    НадоНулей = НужнаяДлинаЗначения - СтрДлина(Значение);
    ВедущиеНули = Формат(0,"ЧЦ="+НадоНулей+";ЧН=; ЧВН=; ЧГ=0");
    Возврат ВедущиеНули + Значение;
   
КонецФункции      

#КонецОбласти 


#Область ОбработчикиКомманд

&НаСервере
Функция ДобавитьСерийныйНомерСервер()
	
	СледующийПоПорядкуНомер = ВычислитьМаксимальныйНомерИКоличество()+1;
	Возврат ДобавитьСерийныйНомерПоШаблону(СледующийПоПорядкуНомер);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСерийныйНомер(Команда)
	
	ДобавитьСерийныйНомерПроцедураКоманды();
	
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьСерийныйНомерПроцедураКоманды() 
	
	Если ШаблонСерийногоНомера = ПредопределенноеЗначение("Справочник.ШаблоныСерийныхНомеров.ПустаяСсылка") ИЛИ Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка")    Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	НовыйНомерСтруктура = ДобавитьСерийныйНомерСервер();
	
	СохраненоУспешно = СохранитьВводСерийСервер(НовыйНомерСтруктура);
	
	Если СохраненоУспешно Тогда
		
	КонецЕсли; 
	
	УстановитьДоступностьСформироватьПакет();

КонецПроцедуры

&НаСервере
Функция ЭтоВнешняяОбработкаОтчет()     
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработка.ЭтоВнешняяОбработкаОтчет();
	
КонецФункции

&НаКлиенте
Процедура ДобавитьМассивСерийныхНомеров(Команда)
	
	ОткрытьформуДобавленияМассиваСерийныхНомеров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьформуДобавленияМассиваСерийныхНомеров(МассивВыбранныхПакетов = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Характеристика", Характеристика);
	ПараметрыФормы.Вставить("Смена", Объект.Смена);
	ПараметрыФормы.Вставить("Направление", Объект.Направление);
	ПараметрыФормы.Вставить("ДатаСмены", Объект.ДатаСмены); 
	ПараметрыФормы.Вставить("КоличествоСостав", КоличествоСостав);
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("ШаблонСерийногоНомера", ШаблонСерийногоНомера);
	ПараметрыФормы.Вставить("МассивВыбранныхПакетов", МассивВыбранныхПакетов);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияМассиваСерийныхНомеров", ЭтаФорма,);
	
	Если ЭтоВнешняяОбработкаОтчет() Тогда
		ОткрытьФорму("ВнешняяОбработка.алк_РабочееМестоОператораЦЛП.Форма.ГенерированиеМассиваСерийныхНомеров", ПараметрыФормы, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	Иначе 
		ОткрытьФорму("Обработка.алк_РабочееМестоОператораЦЛП.Форма.ГенерированиеМассиваСерийныхНомеров", ПараметрыФормы, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;    

КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияМассиваСерийныхНомеров(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		КоличествоСостав = Результат.КоличествоСостав;
		Характеристика = Результат.Характеристика;
		
		Для каждого Пакет Из Результат.МассивПакетов Цикл
			
			СерийныйНомер = Пакет;
			НомерПакета = Число(Сред("" + Пакет, 7));
		    СозданыйПакет = СоздатьПакетНаСервере("");
			
			Если Результат.ПечатьЭтикетки Тогда			
				РаспечататьЭтикеткуТекущую(СозданыйПакет);			
			КонецЕсли;
			
		КонецЦикла; 	
	
	КонецЕсли; 
	
	ОбновитьСписокИИтоги(); 
	
КонецПроцедуры

//ТА
&НаКлиенте
Асинх Процедура СоздатьПакет(Команда)
	
	ОчиститьСообщения(); 
	
	//УДАЛИТЬ
	//Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы") Тогда
	//	
	//	Если ВерхнийДиапазонВесаДГ > 0 И НижнийДиапазонВесаДГ > 0 Тогда  
	//		
	//		Если НЕ (КоличествоСостав1 <= ВерхнийДиапазонВесаДГ И КоличествоСостав1 >= НижнийДиапазонВесаДГ) Тогда 
	//			
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "Значение веса выходит из возможного диапазона для данной характеристики!";
	//			Сообщение.Сообщить(); 		
	//			Возврат;			
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;	
	//
	//КонецЕсли;
	//\\
	
	Если Элементы.КатегорияНоменклатурыПЭО.Видимость И Не ЗначениеЗаполнено(КатегорияНоменклатурыПЭО) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установите категорию номенклатуры ПЭО!";
		Сообщение.Сообщить(); 		
		Возврат;
		
	КонецЕсли; 
	
	Если Элементы.Припуск.Видимость И Не ЗначениеЗаполнено(Припуск) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установите припуск номенклатуры !";
		Сообщение.Сообщить(); 		
		Возврат;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(СерийныйНомер) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сгенерируйте номер пакета!";
		Сообщение.Сообщить(); 		
		Возврат;
		
	КонецЕсли; 
	
	Если ПроверитьРегистрациюПакетаНаСервере(СерийныйНомер) Тогда  	
		
		Если ПроверитьДатуПакетаНаСервере(СерийныйНомер) Тогда  
			Сообщить("Дата зарегистрированного пакета с таким номером отличается от текущей даты! Редактирование запрещено!");
			Возврат;		
		КонецЕсли;  
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Пакет с номером: " + СерийныйНомер + " уже зарегистрирован!" + Символы.ПС +
		"Запрещено менять параметры зарегистрированного пакета!";
		Сообщение.Сообщить(); 
		
   	Иначе
		
		Ответ = "";
		
		СозданыйПакет = СоздатьПакетНаСервере(Ответ);  
		
		Если Не Ответ = "" Тогда		
			ВопросАсинх("", РежимДиалогаВопрос.ОК, 3, КодВозвратаДиалога.ОК , Ответ, КодВозвратаДиалога.ОК);  
		КонецЕсли;
		
		
		
		Если ЗапрещеноМенятьДокумент(Объект.Участок,Объект.ДатаСмены,Объект.Смена) Тогда
			Если АвтоматическоеЗаполнение Тогда 
				АвтоматическоеЗаполнение = Ложь;
				ИзменениеНаФормеПриАвтозаполнение(Ложь); //разблокируем поля
				УстановитьАвтоматическуюПечать(); //отключаем обработчик ожидания	
			КонецЕсли; 
			ОбновитьСписокИИтоги();
			Возврат;
		КонецЕсли;
		
		Если Команда.Имя = "СоздатьПакетПечать" ИЛИ АвтоматическоеЗаполнение Тогда			
			РаспечататьЭтикеткуТекущую(СозданыйПакет);			
		КонецЕсли; 
		
		//ТА
		//добавить даннные пакета со сканера
		Если ЗначениеЗаполнено(Параметры.НомерПакетаСоСканера) Тогда 
			
			ДобавитьДанныеПакетаСоСканераВРегистр(Новый Структура("Период,СерийныйНомер,КатегорияПЭО,НомерПакетаНаСортировки,Припуск,Порода,Сорт,Длина,Ширина,Толщина,Влажность,КоличествоСостав,ПФМ,ТипПакета",ТекущаяДата(),СерийныйНомер,Параметры.КатегорияПЭО,Параметры.НомерПакетаСоСканера,Параметры.Припуск,Параметры.Порода,Параметры.Сорт,Параметры.Длина,Параметры.Ширина,Параметры.Толщина,Параметры.Влажность,Параметры.КоличествоСостав,Объект.ЛинияСортировки,Параметры.ТипПакета));
			//\\ 
			
			//ТА
			ОчищаемПараметрыФормы();
		КонецЕсли;
		
		
	КонецЕсли; 
	
	ОбновитьСписокИИтоги();
		
КонецПроцедуры 

&НаСервере
Процедура ОбновитьСписокИИтоги()  
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСмены", Объект.ДатаСмены);
	Список.Параметры.УстановитьЗначениеПараметра("Смена", Объект.Смена);
	Список.Параметры.УстановитьЗначениеПараметра("Участок", Объект.Участок);
	Список.Параметры.УстановитьЗначениеПараметра("ПрефиксНомераПакета", Сред(ЭтаФорма.ШаблонСерийногоНомера, 1, 6));

	Элементы.Список.Обновить();
	
	//Отбор = Новый Структура("ДатаСмены, Смена, Направление, ШаблонСерийногоНомера, Участок", Объект.ДатаСмены, Объект.Смена, Объект.Направление, ШаблонСерийногоНомера,Объект.Участок); 
	Отбор = Новый Структура("ДатаСмены, Смена, Участок,ШаблонСерийногоНомера", Объект.ДатаСмены, Объект.Смена,Объект.Участок,ШаблонСерийногоНомера);
	СтрокаИтоги = ПолучитьИтогПоОтборамСтрока(Отбор); 	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьДанныеПакетаСоСканераВРегистр(СтруктураДанныхЗаполнения) 
	
	Запись = РегистрыСведений.алк_ДанныеСоСканера.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Запись,СтруктураДанныхЗаполнения);
			
	Запись.Записать();
	
КонецФункции

&НаСервере
Функция ПроверитьРегистрациюПакетаНаСервере(СерийныйНомерСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Период,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Ответственный
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(
	|			,
	|			СерийныйНомер = &СерийныйНомер
	|				И НЕ Актуальность = &Удален) КАК алк_ПараметрыПакетовОперативныйСрезПоследних";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомерСсылка);
	Запрос.УстановитьПараметр("Удален", Перечисления.алк_ОперативнаяАктуальностьПакетов.Удален);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли; 
	
КонецФункции 

&НаСервере
Функция ПроверитьДатуПакетаНаСервере(СерийныйНомерСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Период,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.Ответственный,
	|	алк_ПараметрыПакетовОперативныйСрезПоследних.ДатаСмены
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, СерийныйНомер = &СерийныйНомер) КАК алк_ПараметрыПакетовОперативныйСрезПоследних";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомерСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаРезультат = РезультатЗапроса.Выбрать();  		
		ВыборкаРезультат.Следующий();
							
		Если НачалоДня(ВыборкаРезультат.ДатаСмены) = НачалоДня(ТекущаяДата())
			//изменил перечисление на справочник Дубоделов ЭА 23.03.2023
			Или ((Объект.Смена = Справочники.алк_Смены.Ночь_2 ИЛИ Объект.Смена = Справочники.алк_Смены.Ночь_3)
				И НачалоДня(ВыборкаРезультат.ДатаСмены) = НачалоДня(ТекущаяДата()) - 24*60*60)
			Или РольДоступна("ПолныеПрава")  
			Или РольДоступна("алк_ДобавлениеИзменениеПодсистемыТоп") 
			Или РольДоступна("алк_РаботаВЗакрытомПериоде") Тогда 
			Возврат Ложь; 
		Иначе
			Возврат Истина;			
		КонецЕсли;		
	КонецЕсли; 
	
	
КонецФункции 

&НаСервере
Функция ПолучитьПараметрыПрипуска1()

	ПараметрыПрипуска = Новый Структура;
	
	ПараметрыПрипуска.Вставить("ПрипускПоШирине", 0);
	ПараметрыПрипуска.Вставить("ПрипускПоТолщине", 0);
	ПараметрыПрипуска.Вставить("ПрипускПоДлине", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВариантыПрипуска.Ссылка,
		|	алк_ВариантыПрипуска.ПрипускПоШирине,
		|	алк_ВариантыПрипуска.ПрипускПоТолщине,
		|	алк_ВариантыПрипуска.ПрипускПоДлине
		|ИЗ
		|	Справочник.алк_ВариантыПрипуска КАК алк_ВариантыПрипуска
		|ГДЕ
		|	алк_ВариантыПрипуска.Ссылка = &Припуск";
	
	Запрос.УстановитьПараметр("Припуск", Припуск);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                                                		
		ПараметрыПрипуска.Вставить("ПрипускПоШирине", 	ВыборкаДетальныеЗаписи.ПрипускПоШирине);
		ПараметрыПрипуска.Вставить("ПрипускПоТолщине", 	ВыборкаДетальныеЗаписи.ПрипускПоТолщине);
		ПараметрыПрипуска.Вставить("ПрипускПоДлине", 	ВыборкаДетальныеЗаписи.ПрипускПоДлине); 		
	КонецЦикла;
	
	Возврат  ПараметрыПрипуска; 

КонецФункции // ПолучитьПараметрыПрипуска()

Функция ПолучитьПериодТаблицы(Участок)
	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Участок);
	Если ПараметрыСменыПоТекущейДате.Смена = Объект.Смена И НачалоДня(ПараметрыСменыПоТекущейДате.ДатаСмены) = Объект.ДатаСмены Тогда  	
		Возврат ТекущаяДата();
	Иначе
		Возврат алк_ОбщегоНазначенияКлиентСервер.ПолучитьВремяКонцаСмены(Объект.Смена, Объект.ДатаСмены);	
	КонецЕсли;	
КонецФункции

&НаСервере
Функция СоздатьПакетНаСервере(Ответ)
	
	ТекущаяДата = ТекущаяДата();

	стрПакет = Новый Структура("Номенклатура, Характеристика, КоличествоСостав, Объем, ОбъемТаможня", Номенклатура, Характеристика, КоличествоСостав, Объем, ОбъемТаможня); 
	ПараметрыПрипуска = РфпСервер.ПолучитьПараметрыПрипуска(Припуск);
	РассчетныеПараметры = РфпСервер.ЗаполнитьСтруктуруПараметровПакета(стрПакет, ТекущаяДата, ПараметрыПрипуска);	
	
	Если Номенклатура <> РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ПиломатериалСП) Тогда			
		Если РассчетныеПараметры.ВесНеттоТаможня = 0 Тогда                                                                      				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Невозможно рассчитать вес пакета по данным параметрам!";
			Сообщение.Сообщить(); 			
			Возврат Справочники.СерийныеНомера.ПустаяСсылка();   				
		КонецЕсли;                                         			
	КонецЕсли;   
	
	// добавляем создание пакетов новыми документами, с проверкой ствтуса создания, если ошибка создания, то не записываем в регистр. 
	// создаем пакет в новом документе
	
	СоздатьПакетНаСервере_Производство(Ответ, 
		Объект.Участок, 
		Справочники.алк_ОперацииПроизводства.Упаковка, 
		Объект.ДатаСмены, 
		Объект.Смена,
		СерийныйНомер,
		РассчетныеПараметры); 

	Если Не (Ответ = "" Или Ответ = "Успешно") Тогда  	// отменяе создание пакета в оперативном регистре. 	
		Возврат СерийныйНомер;                                      		
	КонецЕсли;  
	
	// привязка пакета к аддендуму
	// создается документ привязки и выводится представление привязанного аддендума и сколько осталось привязать 
	УстановитьПривилегированныйРежим(Истина);
	ВыполнтьПривязкуПакетаКАддендому(); 
	УстановитьПривилегированныйРежим(Ложь);
	//\\
	
	НаборЗаписей = РегистрыСведений.алк_ПараметрыПакетовОперативный.СоздатьНаборЗаписей(); 	
		
	НаборЗаписей.Отбор.СерийныйНомер.Установить(СерийныйНомер);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл  			
		Запись.Актуальность = Перечисления.алк_ОперативнаяАктуальностьПакетов.Изменен; 			
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.алк_ПараметрыПакетовОперативный.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СерийныйНомер.Установить(СерийныйНомер);
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата);
	НаборЗаписей.Отбор.Актуальность.Установить(Перечисления.алк_ОперативнаяАктуальностьПакетов.Актуален); 
		
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.СерийныйНомер    			= СерийныйНомер;
	НоваяЗапись.НомерПакета      			= НомерПакета;
	НоваяЗапись.ПериодПакета     			= НачалоГода(ТекущаяДата);
	НоваяЗапись.КоличествоСостав 			= КоличествоСостав;
	НоваяЗапись.Объем            			= РассчетныеПараметры.Объем;
	НоваяЗапись.ОбъемТаможня     			= РассчетныеПараметры.ОбъемТаможня;
	НоваяЗапись.Характеристика   			= Характеристика;
	НоваяЗапись.СертификатFSC    			= "";//Истина;
	НоваяЗапись.Сертификат		 			= Сертификат;
	НоваяЗапись.ВесНеттоТаможня  			= РассчетныеПараметры.ВесНеттоТаможня;
	НоваяЗапись.ВесБруттоТаможня 			= РассчетныеПараметры.ВесБруттоТаможня;
	НоваяЗапись.ЗаказНаПроизводство 		= ЗаказНаПроизводство;
	НоваяЗапись.ДопАналитика     			= "";
	НоваяЗапись.Направление     		 	= Объект.Направление;
	НоваяЗапись.Габарит			 			= Габарит;
	НоваяЗапись.КатегорияНоменклатурыПЭО	= КатегорияНоменклатурыПЭО;   
	НоваяЗапись.Припуск						= Припуск;	
	НоваяЗапись.ПризнакНЗП					= ПризнакНЗП;
	НоваяЗапись.Участок					    = Объект.Участок;
	
	НоваяЗапись.Период           = ТекущаяДата;
	НоваяЗапись.Актуальность     = Перечисления.алк_ОперативнаяАктуальностьПакетов.Актуален;
	
	НоваяЗапись.ДатаСмены        = Объект.ДатаСмены;
	НоваяЗапись.Смена            = Объект.Смена;
	НоваяЗапись.Ответственный    = Объект.Ответственный;
	
	НаборЗаписей.Записать();
	
	
	//прокерка объемов по заказу порупателя
	
	
	МассивИзЗаказаПокупателя = Объект.МассивИзЗаказаПокупателя.Выгрузить();
	
	Если МассивИзЗаказаПокупателя.Количество() > 0 Тогда
		
		// проверка соответствия характеристики и категории ПЭО пакета характеристике и категории ПЭО заказа
		
		Отбор = Новый Структура();
		Отбор.Вставить("Характеристика", Характеристика);
		
		СтрокиХарактеристики = МассивИзЗаказаПокупателя.НайтиСтроки(Отбор);
		
		Отбор = Новый Структура();
		Отбор.Вставить("КатегорияНоменклатурыПЭО", КатегорияНоменклатурыПЭО);
		
		СтрокиКатегорияПЭО = МассивИзЗаказаПокупателя.НайтиСтроки(Отбор);
		
		Отбор.Вставить("Характеристика", Характеристика);
		
		СтрокиХарактеристикиИКатегорияПЭО = МассивИзЗаказаПокупателя.НайтиСтроки(Отбор); 
			
		Если СтрокиХарактеристики.Количество() = 0 Тогда  
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Характеристика номенклатуры текущего пакета не удовлетворяют требованиям заказа покуптеля!";
			Сообщение.Поле = "Характеристика";			
			Сообщение.Сообщить();		
					
		ИначеЕсли  СтрокиКатегорияПЭО.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Категория номенклатуры ПЭО текущего пакета не удовлетворяют требованиям заказа покуптеля!";
			Сообщение.Поле = "КатегорияНоменклатурыПЭО";			
			Сообщение.Сообщить(); 
			
		ИначеЕсли  СтрокиХарактеристикиИКатегорияПЭО.Количество() = 0 Тогда				
						
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Категория номенклатуры ПЭО и характеристика номенклатуры текущего пакета в разных объемных группах заказа покуптеля!";
			Сообщение.Поле = "КатегорияНоменклатурыПЭО";			
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
				
		// проверка привышения объема
		
		Если Вариант = 2 Или Вариант = 3 Тогда  //РМ_СборкаЛесопиление или РМ_СборкаСушильныхПакетов
		       	
		МассивОбъемов = МассивИзЗаказаПокупателя.Скопировать(СтрокиХарактеристики);
		
		МассивОбъемов.Свернуть("ИдентификаторГруппы, Объем", ""); // уникальность объема по группе
		ОбъемПоЗаказу = МассивОбъемов.Итог("Объем"); 
		
		ХарактеристикиВГруппе = Новый Массив;
		
		Для каждого Стр1 Из МассивОбъемов Цикл 				
			Для каждого Стр2 Из МассивИзЗаказаПокупателя Цикл 					
				Если Стр1.ИдентификаторГруппы = Стр2.ИдентификаторГруппы Тогда 
					ХарактеристикиВГруппе.Добавить(Стр2.Характеристика);					
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла;  		
		
		// выбираем уже созданные пакеты по заказу и подходящие группе
		// и получаем объем
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Объем
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|ГДЕ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Характеристика В(&ХарактеристикиВГруппе)
		|	И алк_ПараметрыПакетовОперативныйСрезПоследних.ЗаказНаПроизводство = &ЗаказНаПроизводство
		|	И алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность <> &Актуальность
		|	И алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер <> &СерийныйНомер";
		
		Запрос.УстановитьПараметр("Актуальность", 			Перечисления.алк_ОперативнаяАктуальностьПакетов.Удален);
		Запрос.УстановитьПараметр("ЗаказНаПроизводство", 	ЗаказНаПроизводство);
		Запрос.УстановитьПараметр("ХарактеристикиВГруппе",	ХарактеристикиВГруппе);
		Запрос.УстановитьПараметр("СерийныйНомер",			СерийныйНомер);
		
		УжеИмеющийсяОбъем = Запрос.Выполнить().Выгрузить().Итог("Объем");
		
		ОбъемСУчетСоздоваемогоПакета = УжеИмеющийсяОбъем + Объем;
		
		Сообщить(	"Уже создано: " + УжеИмеющийсяОбъем + 
					", текущий пакет: " + СерийныйНомер + 
					" - " + Объем + ", объем по группам заказа: " + 
					ОбъемПоЗаказу + ", осталось: " + (ОбъемПоЗаказу - ОбъемСУчетСоздоваемогоПакета)); 
		
		Если ОбъемСУчетСоздоваемогоПакета > ОбъемПоЗаказу Тогда
			                      			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Внимание! Объем по пакету: " + СерийныйНомер + " превышает объем группы заказа покупателя!";
			Сообщение.Поле = "КоличествоСостав";			
			Сообщение.Сообщить(); 		
						
		КонецЕсли; 
		
		КонецЕсли; 
		
	КонецЕсли;  
		
	Возврат СерийныйНомер;
	
КонецФункции  


Процедура СоздатьПакетНаСервере_Производство(Ответ, Участок, Операция, ДатаСмены, Смена, СерийныйНомер, РассчетныеПараметры) 
	
	
	Если Участок.Код = "000000004"              // УЧАСТОК ПФМ (1 ЛИНИЯ)
		Или Участок.Код = "000000026" 		 	// УЧАСТОК ПФМ (2 ЛИНИЯ)
		Или Участок.Код = "000000046" Тогда		// Участок малой пересортировки
		ПараметрНастройки = "ДатаПерехода_ЦЛП";	 	
	ИначеЕсли Участок.Код = "000000044" Тогда      						// МЛП   
		ПараметрНастройки = "ДатаПерехода_МЛП";  
	Иначе                                        	
		ПараметрНастройки = "Заглушка";          
	КонецЕсли;
		
	СтруктураНастроек = Новый Структура("Параметр", ПараметрНастройки);
	ПолучитьДатуВвода = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
	ДатаВвода = Дата("23001201");
	Если ПолучитьДатуВвода.Количество() > 0 Тогда
		ДатаВвода = ПолучитьДатуВвода[0].Дата;
	КонецЕсли;

	Если ДатаВвода > ДатаСмены Тогда  
		Ответ = "";
		Возврат;
	КонецЕсли;
			
	//Получим документ производства
	ПараметрыПроизводства = Документы.алк_Производство.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
	ПараметрыПроизводства.Участок = Участок;
	ПараметрыПроизводства.Операция = Операция;
	ПараметрыПроизводства.ДатаСмены = ДатаСмены;
	ПараметрыПроизводства.Смена = Смена;
	
	ДокументТекущегоПроизводства = алк_ПроизводствоСервер.ПолучитьДокументПроизводстваТекущейСмены(ПараметрыПроизводства, Истина); 
		
		
	//Проверим его статус
	Если ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Закрыт Тогда
		Ответ = "Ошибка! Смена закрыта мастером. Создание новых пакетов запрещено в закрытой смене. Возможно неверно заполнены реквизиты смены. Проверьте реквизиты смены или обратитесь в мастеру";
		Возврат;
	ИначеЕсли ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Заблокирован Тогда
		Ответ = "Ошибка! Мастер заблокировал документ. Дождитесь разблокировки или обратитесь в мастеру";
		Возврат;
	КонецЕсли;
 	
	//Добавим пакет в документ производства	
	ПериодПакета = ТекущаяДата();	
	
	ПараметрыПакета = Документы.алк_Производство.ПолучитьСтруктуруЗаполнения_ДобавитьСписатьПакет();
	ПараметрыПакета.ТипЗаполнения = "ДобавитьПакет";
	ПараметрыПакета.Количество = РассчетныеПараметры.Объем;
	ПараметрыПакета.Номенклатура = Номенклатура;
	//Если создают пакеты с прошлой смены, то надо период ставить не текущим числом
	ПараметрыПакета.Период = ПолучитьПериодТаблицы(Участок);  //ПериодПакета; 
	//\\
	ПараметрыПакета.СерийныйНомер = СерийныйНомер;
	ПараметрыПакета.Сертификат = Справочники.СертификатыНаПродукцию.ПустаяСсылка();
	ПараметрыПакета.Характеристика = Характеристика;  
	СкладВыпуска = ПолучитьСкладВыпуска(Номенклатура,Участок); //по новой схеме;
	Если НЕ ЗначениеЗаполнено(СкладВыпуска) Тогда 
		СкладВыпуска = Участок.СкладВыпуска; //по старой схеме; 
	КонецЕсли;
	ПараметрыПакета.Склад = СкладВыпуска; 
	
	ОбъектДокументПроизводства = ДокументТекущегоПроизводства.Ссылка.ПолучитьОбъект();
	ОбъектДокументПроизводства.Заполнить(ПараметрыПакета);
	
	Попытка
		ОбъектДокументПроизводства.Записать(РежимЗаписиДокумента.Проведение);
		
		//Сделаем движения в регистр ДополнительныеПараметрыПакетов
		МенеджерЗаписи = РегистрыСведений.алк_ДополнительныеПараметрыПакетов.СоздатьМенеджерЗаписи();		
		МенеджерЗаписи.СерийныйНомер = СерийныйНомер; 	
		МенеджерЗаписи.Припуск = Припуск;
		МенеджерЗаписи.Период = ПериодПакета;		
		МенеджерЗаписи.КатегорияНоменклатурыПЭО = КатегорияНоменклатурыПЭО;  
		МенеджерЗаписи.Габарит = Габарит;  
		МенеджерЗаписи.БоковаяДоска = ПолучитьПризнакБоковойДоски(Характеристика);  
		МенеджерЗаписи.Документ = ОбъектДокументПроизводства.Ссылка;  
		МенеджерЗаписи.Записать();
	Исключение
		Ответ = "Ошибка проведения документа производства!"; 
		Возврат;
	КонецПопытки; 
	
	Ответ = "Успешно";

		
КонецПроцедуры

&НаСервере
Процедура ВыполнтьПривязкуПакетаКАддендому() 
	
	
	// проверка настроек
	
	СтруктураОтбора = Новый Структура("Параметр", "АвтоматическаяПривязкаКАддендуму");
	НастройкаПривязки = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураОтбора);
	
	ПривязкаВключена = Ложь;
	
	Если НастройкаПривязки.Количество() > 0 Тогда
		ПривязкаВключена = НастройкаПривязки[0].Булево;
	КонецЕсли;
	
	Если Не ПривязкаВключена  Тогда  	
		СтрокаОсталосьПроизвести = " - ";		
		Возврат;
	КонецЕсли; 
	
	// 
	
	ПараметрыПривязки = ПолучитьПараметрыПривязки();
	
	Если Не ЗначениеЗаполнено(ПараметрыПривязки.Аддендум) Тогда  	
		СтрокаОсталосьПроизвести = " - ";		
		Возврат;
	КонецЕсли; 
	
	ДокПривязка = Документы.алк_ПривязкаПакетовКАддендуму.СоздатьДокумент(); 
	
	ДокПривязка.ДатаСмены  		= Объект.ДатаСмены;
	ДокПривязка.Смена			= Объект.Смена;
	ДокПривязка.Участок         = Объект.Участок;
	ДокПривязка.Ответственный 	= Объект.Ответственный;	
	ДокПривязка.Организация		= Объект.Участок.Организация;
	ДокПривязка.Производство	= Истина;
	ДокПривязка.СерийныйНомер  	= СерийныйНомер;
	ДокПривязка.АддендумНовый  	= ПараметрыПривязки.Аддендум;
    ДокПривязка.ИдентификаторТовараНовый = ПараметрыПривязки.ИдентификаторТовара;
	
	ДокПривязка.Записать(РежимЗаписиДокумента.Проведение); 
	
	
	СтрокаОсталосьПроизвести = "Осталось произвести: " + ПараметрыПривязки.ОсталосьПроизвести + " м3 по адд: " + ПараметрыПривязки.Аддендум;

КонецПроцедуры  

&НаСервере
Функция ПолучитьПараметрыПривязки()  
	
	ПараметрыПривязки = Новый Структура; 
	
	ПараметрыПривязки.Вставить("Аддендум", "");
	ПараметрыПривязки.Вставить("ИдентификаторТовара", "");
	ПараметрыПривязки.Вставить("ОсталосьПроизвести", 0);
		
	Запрос = Новый Запрос; 
	
	#Область ТекстЗапросаСтарый
			
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности КАК ВлажностьЗначение,
		|	алк_КатегорияНоменклатурыПЭО.Ссылка КАК КатегорияПЭО,
		|	алк_ВариантыПрипуска.Ссылка КАК Припуск,
		|	&ОбъемПакета КАК ОбъемПакета
		|ПОМЕСТИТЬ ВТ_ПараметрыОтбора
		|ИЗ
		|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик,
		|	Справочник.алк_КатегорияНоменклатурыПЭО КАК алк_КатегорияНоменклатурыПЭО,
		|	Справочник.алк_ВариантыПрипуска КАК алк_ВариантыПрипуска
		|ГДЕ
		|	алк_КатегорияНоменклатурыПЭО.Ссылка = &КатегорияПЭО
		|	И алк_ПараметрыХарактеристик.Характеристика = &Характеристика
		|	И алк_ВариантыПрипуска.Ссылка = &Припуск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_АддендумыТовары.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_АддендумыВРаботе
		|ИЗ
		|	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|ГДЕ
		|	алк_АддендумыТовары.Номенклатура = &Номенклатура
		|	И алк_АддендумыТовары.Ссылка.Статус = &Статус
		|	И алк_АддендумыТовары.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_АддендумыСоставТоваров.Ссылка КАК Ссылка,
		|	алк_АддендумыСоставТоваров.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_АддендумыСоставТоваров.Порода КАК Порода,
		|	алк_АддендумыСоставТоваров.Сорт КАК Сорт,
		|	алк_АддендумыСоставТоваров.ШиринаОт КАК ШиринаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ШиринаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ШиринаДо
		|	КОНЕЦ КАК ШиринаДо,
		|	алк_АддендумыСоставТоваров.ТолщинаОт КАК ТолщинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ТолщинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ТолщинаДо
		|	КОНЕЦ КАК ТолщинаДо,
		|	алк_АддендумыСоставТоваров.ДлинаОт КАК ДлинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ДлинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ДлинаДо
		|	КОНЕЦ КАК ДлинаДо,
		|	алк_АддендумыСоставТоваров.ВлажностьОт КАК ВлажностьОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ВлажностьДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ВлажностьДо
		|	КОНЕЦ КАК ВлажностьДо,
		|	алк_АддендумыСоставТоваров.ВариантПрипуска КАК ВариантПрипуска,
		|	алк_АддендумыТовары.КатегорияПЭО КАК КатегорияПЭО,
		|	алк_АддендумыСоставТоваров.Характеристика КАК Характеристика,
		|	алк_АддендумыТовары.Номенклатура КАК Номенклатура,
		|	алк_АддендумыТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_СоставАддендума
		|ИЗ
		|	Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|		ПО алк_АддендумыСоставТоваров.Ссылка = алк_АддендумыТовары.Ссылка
		|			И алк_АддендумыСоставТоваров.ИдентификаторТовара = алк_АддендумыТовары.ИдентификаторТовара
		|ГДЕ
		|	алк_АддендумыСоставТоваров.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_АддендумыВРаботе.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_АддендумыВРаботе КАК ВТ_АддендумыВРаботе)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СоставАддендума.Ссылка КАК Ссылка,
		|	ВТ_СоставАддендума.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ_СоставАддендума.Порода КАК Порода,
		|	ВТ_СоставАддендума.Сорт КАК Сорт,
		|	ВТ_СоставАддендума.ШиринаОт КАК ШиринаОт,
		|	ВТ_СоставАддендума.ШиринаДо КАК ШиринаДо,
		|	ВТ_СоставАддендума.ТолщинаОт КАК ТолщинаОт,
		|	ВТ_СоставАддендума.ТолщинаДо КАК ТолщинаДо,
		|	ВТ_СоставАддендума.ДлинаОт КАК ДлинаОт,
		|	ВТ_СоставАддендума.ДлинаДо КАК ДлинаДо,
		|	ВТ_СоставАддендума.ВлажностьОт КАК ВлажностьОт,
		|	ВТ_СоставАддендума.ВлажностьДо КАК ВлажностьДо,
		|	ВТ_СоставАддендума.ВариантПрипуска КАК ВариантПрипуска,
		|	ВТ_СоставАддендума.КатегорияПЭО КАК КатегорияПЭО,
		|	ВТ_СоставАддендума.Характеристика КАК Характеристика,
		|	ВТ_СоставАддендума.Номенклатура КАК Номенклатура,
		|	ВТ_ПараметрыОтбора.Характеристика КАК ХарактеристикаОтбор,
		|	ВТ_ПараметрыОтбора.КатегорияПЭО КАК КатегорияПЭООтбор,
		|	ВТ_СоставАддендума.Количество КАК Количество,
		|	ВТ_ПараметрыОтбора.ОбъемПакета КАК ОбъемПакета
		|ПОМЕСТИТЬ ВТ_ПодходящиеАдд
		|ИЗ
		|	ВТ_ПараметрыОтбора КАК ВТ_ПараметрыОтбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставАддендума КАК ВТ_СоставАддендума
		|		ПО (ВТ_ПараметрыОтбора.Порода = ВТ_СоставАддендума.Порода
		|				ИЛИ ВТ_СоставАддендума.Порода = ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка))
		|			И (ВТ_ПараметрыОтбора.Сорт = ВТ_СоставАддендума.Сорт
		|				ИЛИ ВТ_СоставАддендума.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка))
		|			И (ВТ_ПараметрыОтбора.КатегорияПЭО = ВТ_СоставАддендума.КатегорияПЭО
		|				ИЛИ ВТ_СоставАддендума.КатегорияПЭО = ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка))
		|			И (ВТ_ПараметрыОтбора.Припуск = ВТ_СоставАддендума.ВариантПрипуска
		|				ИЛИ ВТ_СоставАддендума.ВариантПрипуска = ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка))
		|			И ВТ_ПараметрыОтбора.ДлинаММ >= ВТ_СоставАддендума.ДлинаОт
		|			И ВТ_ПараметрыОтбора.ДлинаММ <= ВТ_СоставАддендума.ДлинаДо
		|			И ВТ_ПараметрыОтбора.ШиринаММ >= ВТ_СоставАддендума.ШиринаОт
		|			И ВТ_ПараметрыОтбора.ШиринаММ <= ВТ_СоставАддендума.ШиринаДо
		|			И ВТ_ПараметрыОтбора.ТолщинаММ >= ВТ_СоставАддендума.ТолщинаОт
		|			И ВТ_ПараметрыОтбора.ТолщинаММ <= ВТ_СоставАддендума.ТолщинаДо
		|			И ВТ_ПараметрыОтбора.ВлажностьЗначение >= ВТ_СоставАддендума.ВлажностьОт
		|			И ВТ_ПараметрыОтбора.ВлажностьЗначение <= ВТ_СоставАддендума.ВлажностьДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_АддендумыОстатки.Аддендум КАК Аддендум,
		|	алк_АддендумыОстатки.ИдентификаторТовара КАК ИдентификаторТовара,
		|	СУММА(алк_АддендумыОстатки.КПроизводствуОстаток) КАК КПроизводствуОстаток,
		|	СУММА(алк_АддендумыОстатки.ПроизведеноОстаток) КАК ПроизведеноОстаток,
		|	СУММА(алк_АддендумыОстатки.КОтгрузкеОстаток) КАК КОтгрузкеОстаток
		|ПОМЕСТИТЬ Вт_Остатики
		|ИЗ
		|	РегистрНакопления.алк_Аддендумы.Остатки(
		|			&ДатаОстатков,
		|			(Аддендум, ИдентификаторТовара) В
		|				(ВЫБРАТЬ
		|					ВТ_ПодходящиеАдд.Ссылка КАК Ссылка,
		|					ВТ_ПодходящиеАдд.ИдентификаторТовара КАК ИдентификаторТовара
		|				ИЗ
		|					ВТ_ПодходящиеАдд КАК ВТ_ПодходящиеАдд)) КАК алк_АддендумыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_АддендумыОстатки.Аддендум,
		|	алк_АддендумыОстатки.ИдентификаторТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодходящиеАдд.Ссылка КАК Ссылка,
		|	ВТ_ПодходящиеАдд.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ_ПодходящиеАдд.Порода КАК Порода,
		|	ВТ_ПодходящиеАдд.Сорт КАК Сорт,
		|	ВТ_ПодходящиеАдд.ШиринаОт КАК ШиринаОт,
		|	ВТ_ПодходящиеАдд.ШиринаДо КАК ШиринаДо,
		|	ВТ_ПодходящиеАдд.ТолщинаОт КАК ТолщинаОт,
		|	ВТ_ПодходящиеАдд.ТолщинаДо КАК ТолщинаДо,
		|	ВТ_ПодходящиеАдд.ДлинаОт КАК ДлинаОт,
		|	ВТ_ПодходящиеАдд.ДлинаДо КАК ДлинаДо,
		|	ВТ_ПодходящиеАдд.ВлажностьОт КАК ВлажностьОт,
		|	ВТ_ПодходящиеАдд.ВлажностьДо КАК ВлажностьДо,
		|	ВТ_ПодходящиеАдд.ВариантПрипуска КАК ВариантПрипуска,
		|	ВТ_ПодходящиеАдд.КатегорияПЭО КАК КатегорияПЭО,
		|	ВТ_ПодходящиеАдд.Характеристика КАК Характеристика,
		|	ВТ_ПодходящиеАдд.Номенклатура КАК Номенклатура,
		|	ВТ_ПодходящиеАдд.ХарактеристикаОтбор КАК ХарактеристикаОтбор,
		|	ВТ_ПодходящиеАдд.КатегорияПЭООтбор КАК КатегорияПЭООтбор,
		|	ВТ_ПодходящиеАдд.Количество КАК Количество,
		|	ЕСТЬNULL(Вт_Остатики.КПроизводствуОстаток, 0) КАК КПроизводствуОстаток,
		|	ЕСТЬNULL(Вт_Остатики.ПроизведеноОстаток, 0) КАК ПроизведеноОстаток,
		|	ЕСТЬNULL(Вт_Остатики.КОтгрузкеОстаток, 0) КАК КОтгрузкеОстаток,
		|	ВТ_ПодходящиеАдд.ОбъемПакета КАК ОбъемПакета
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ПодходящиеАдд КАК ВТ_ПодходящиеАдд
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_Остатики КАК Вт_Остатики
		|		ПО ВТ_ПодходящиеАдд.Ссылка = Вт_Остатики.Аддендум
		|			И ВТ_ПодходящиеАдд.ИдентификаторТовара = Вт_Остатики.ИдентификаторТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Итог.Ссылка КАК Аддендум,
		|	ВТ_Итог.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ_Итог.Количество КАК Количество,
		|	ВТ_Итог.ПроизведеноОстаток КАК ПроизведеноОстаток,
		|	ВТ_Итог.ОбъемПакета КАК ОбъемПакета,
		|	ВТ_Итог.Количество - ВТ_Итог.ПроизведеноОстаток - ВТ_Итог.ОбъемПакета КАК ОсталосьПроизвести
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Количество - ВТ_Итог.ПроизведеноОстаток >= ВТ_Итог.ОбъемПакета"; 
	
	#КонецОбласти
	
			
	#Область ТекстЗапроса
			
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности КАК ВлажностьЗначение,
		|	&КатегорияПЭО КАК КатегорияПЭО,
		|	&Припуск КАК Припуск,
		|	&ОбъемПакета КАК ОбъемПакета
		|ПОМЕСТИТЬ ВТ_ПараметрыОтбора
		|ИЗ
		|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|ГДЕ
		|	алк_ПараметрыХарактеристик.Характеристика = &Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗаказНаПроизводствоАддендумы.НомерСтроки КАК НомерСтроки,
		|	алк_ЗаказНаПроизводствоАддендумы.Аддендум КАК Аддендум,
		|	алк_ЗаказНаПроизводствоАддендумы.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_ЗаказНаПроизводствоАддендумы.ОбщийОбъем КАК ОбщийОбъем,
		|	алк_ЗаказНаПроизводствоАддендумы.КоличествоВПроизводство КАК КоличествоВПроизводство,
		|	алк_ЗаказНаПроизводствоАддендумы.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ЗаказНаПроизводство
		|ИЗ
		|	Документ.алк_ЗаказНаПроизводство.Аддендумы КАК алк_ЗаказНаПроизводствоАддендумы
		|ГДЕ
		|	алк_ЗаказНаПроизводствоАддендумы.Ссылка.Проведен
		|	И алк_ЗаказНаПроизводствоАддендумы.Ссылка.ДатаНачалаДействия <= &ДатаОстатков
		|	И алк_ЗаказНаПроизводствоАддендумы.Ссылка.ДатаОкончанияДействия >= &ДатаОстатков
		|	И алк_ЗаказНаПроизводствоАддендумы.Аддендум.Статус = &Статус
		|	И алк_ЗаказНаПроизводствоАддендумы.Аддендум.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_АддендумыСоставТоваров.Ссылка КАК Ссылка,
		|	алк_АддендумыСоставТоваров.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_АддендумыСоставТоваров.Порода КАК Порода,
		|	алк_АддендумыСоставТоваров.Сорт КАК Сорт,
		|	алк_АддендумыСоставТоваров.ШиринаОт КАК ШиринаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ШиринаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ШиринаДо
		|	КОНЕЦ КАК ШиринаДо,
		|	алк_АддендумыСоставТоваров.ТолщинаОт КАК ТолщинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ТолщинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ТолщинаДо
		|	КОНЕЦ КАК ТолщинаДо,
		|	алк_АддендумыСоставТоваров.ДлинаОт КАК ДлинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ДлинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ДлинаДо
		|	КОНЕЦ КАК ДлинаДо,
		|	алк_АддендумыСоставТоваров.ВлажностьОт КАК ВлажностьОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ВлажностьДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ВлажностьДо
		|	КОНЕЦ КАК ВлажностьДо,
		|	алк_АддендумыСоставТоваров.ВариантПрипуска КАК ВариантПрипуска,
		|	алк_АддендумыТовары.КатегорияПЭО КАК КатегорияПЭО,
		|	алк_АддендумыСоставТоваров.Характеристика КАК Характеристика,
		|	алк_АддендумыТовары.Номенклатура КАК Номенклатура,
		|	алк_АддендумыТовары.Количество КАК Количество,
		|	ВТ_ЗаказНаПроизводство.ОбщийОбъем КАК ОбщийОбъем,
		|	ВТ_ЗаказНаПроизводство.КоличествоВПроизводство КАК КоличествоВПроизводство,
		|	ВТ_ЗаказНаПроизводство.НомерСтроки КАК НомерСтроки,
		|	ВТ_ЗаказНаПроизводство.Дата КАК ДатаЗаказНаПроизводсво
		|ПОМЕСТИТЬ ВТ_СоставАддендума
		|ИЗ
		|	ВТ_ЗаказНаПроизводство КАК ВТ_ЗаказНаПроизводство
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|			ПО алк_АддендумыСоставТоваров.Ссылка = алк_АддендумыТовары.Ссылка
		|				И алк_АддендумыСоставТоваров.ИдентификаторТовара = алк_АддендумыТовары.ИдентификаторТовара
		|		ПО (алк_АддендумыСоставТоваров.Ссылка = ВТ_ЗаказНаПроизводство.Аддендум)
		|			И (алк_АддендумыСоставТоваров.ИдентификаторТовара = ВТ_ЗаказНаПроизводство.ИдентификаторТовара)
		|ГДЕ
		|	алк_АддендумыСоставТоваров.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказНаПроизводство.Аддендум КАК Аддендум
		|			ИЗ
		|				ВТ_ЗаказНаПроизводство КАК ВТ_ЗаказНаПроизводство)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СоставАддендума.Ссылка КАК Ссылка,
		|	ВТ_СоставАддендума.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ_СоставАддендума.Порода КАК Порода,
		|	ВТ_СоставАддендума.Сорт КАК Сорт,
		|	ВТ_СоставАддендума.ШиринаОт КАК ШиринаОт,
		|	ВТ_СоставАддендума.ШиринаДо КАК ШиринаДо,
		|	ВТ_СоставАддендума.ТолщинаОт КАК ТолщинаОт,
		|	ВТ_СоставАддендума.ТолщинаДо КАК ТолщинаДо,
		|	ВТ_СоставАддендума.ДлинаОт КАК ДлинаОт,
		|	ВТ_СоставАддендума.ДлинаДо КАК ДлинаДо,
		|	ВТ_СоставАддендума.ВлажностьОт КАК ВлажностьОт,
		|	ВТ_СоставАддендума.ВлажностьДо КАК ВлажностьДо,
		|	ВТ_СоставАддендума.ВариантПрипуска КАК ВариантПрипуска,
		|	ВТ_СоставАддендума.КатегорияПЭО КАК КатегорияПЭО,
		|	ВТ_СоставАддендума.Характеристика КАК Характеристика,
		|	ВТ_СоставАддендума.Номенклатура КАК Номенклатура,
		|	ВТ_ПараметрыОтбора.Характеристика КАК ХарактеристикаОтбор,
		|	ВТ_ПараметрыОтбора.КатегорияПЭО КАК КатегорияПЭООтбор,
		|	ВТ_СоставАддендума.Количество КАК Количество,
		|	ВТ_ПараметрыОтбора.ОбъемПакета КАК ОбъемПакета,
		|	ВТ_СоставАддендума.ОбщийОбъем КАК ОбщийОбъем,
		|	ВТ_СоставАддендума.КоличествоВПроизводство КАК КоличествоВПроизводство,
		|	ВТ_СоставАддендума.НомерСтроки КАК НомерСтроки,
		|	ВТ_СоставАддендума.ДатаЗаказНаПроизводсво КАК ДатаЗаказНаПроизводсво
		|ПОМЕСТИТЬ ВТ_ПодходящиеАдд
		|ИЗ
		|	ВТ_ПараметрыОтбора КАК ВТ_ПараметрыОтбора
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставАддендума КАК ВТ_СоставАддендума
		|		ПО (ВТ_ПараметрыОтбора.Порода = ВТ_СоставАддендума.Порода
		|				ИЛИ ВТ_СоставАддендума.Порода = ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка))
		|			И (ВТ_ПараметрыОтбора.Сорт = ВТ_СоставАддендума.Сорт
		|				ИЛИ ВТ_СоставАддендума.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка))
		|			И (ВТ_ПараметрыОтбора.КатегорияПЭО = ВТ_СоставАддендума.КатегорияПЭО
		|				ИЛИ ВТ_СоставАддендума.КатегорияПЭО = ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка))
		|			И (ВТ_ПараметрыОтбора.Припуск = ВТ_СоставАддендума.ВариантПрипуска
		|				ИЛИ ВТ_СоставАддендума.ВариантПрипуска = ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка))
		|			И ВТ_ПараметрыОтбора.ДлинаММ >= ВТ_СоставАддендума.ДлинаОт
		|			И ВТ_ПараметрыОтбора.ДлинаММ <= ВТ_СоставАддендума.ДлинаДо
		|			И ВТ_ПараметрыОтбора.ШиринаММ >= ВТ_СоставАддендума.ШиринаОт
		|			И ВТ_ПараметрыОтбора.ШиринаММ <= ВТ_СоставАддендума.ШиринаДо
		|			И ВТ_ПараметрыОтбора.ТолщинаММ >= ВТ_СоставАддендума.ТолщинаОт
		|			И ВТ_ПараметрыОтбора.ТолщинаММ <= ВТ_СоставАддендума.ТолщинаДо
		|			И ВТ_ПараметрыОтбора.ВлажностьЗначение >= ВТ_СоставАддендума.ВлажностьОт
		|			И ВТ_ПараметрыОтбора.ВлажностьЗначение <= ВТ_СоставАддендума.ВлажностьДо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_АддендумыОстатки.Аддендум КАК Аддендум,
		|	алк_АддендумыОстатки.ИдентификаторТовара КАК ИдентификаторТовара,
		|	СУММА(алк_АддендумыОстатки.КПроизводствуОстаток) КАК КПроизводствуОстаток,
		|	СУММА(алк_АддендумыОстатки.ПроизведеноОстаток) КАК ПроизведеноОстаток,
		|	СУММА(алк_АддендумыОстатки.КОтгрузкеОстаток) КАК КОтгрузкеОстаток
		|ПОМЕСТИТЬ Вт_Остатики
		|ИЗ
		|	РегистрНакопления.алк_Аддендумы.Остатки(
		|			&ДатаОстатков,
		|			(Аддендум, ИдентификаторТовара) В
		|				(ВЫБРАТЬ
		|					ВТ_ПодходящиеАдд.Ссылка КАК Ссылка,
		|					ВТ_ПодходящиеАдд.ИдентификаторТовара КАК ИдентификаторТовара
		|				ИЗ
		|					ВТ_ПодходящиеАдд КАК ВТ_ПодходящиеАдд)) КАК алк_АддендумыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_АддендумыОстатки.Аддендум,
		|	алк_АддендумыОстатки.ИдентификаторТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодходящиеАдд.Ссылка КАК Ссылка,
		|	ВТ_ПодходящиеАдд.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ_ПодходящиеАдд.Порода КАК Порода,
		|	ВТ_ПодходящиеАдд.Сорт КАК Сорт,
		|	ВТ_ПодходящиеАдд.ШиринаОт КАК ШиринаОт,
		|	ВТ_ПодходящиеАдд.ШиринаДо КАК ШиринаДо,
		|	ВТ_ПодходящиеАдд.ТолщинаОт КАК ТолщинаОт,
		|	ВТ_ПодходящиеАдд.ТолщинаДо КАК ТолщинаДо,
		|	ВТ_ПодходящиеАдд.ДлинаОт КАК ДлинаОт,
		|	ВТ_ПодходящиеАдд.ДлинаДо КАК ДлинаДо,
		|	ВТ_ПодходящиеАдд.ВлажностьОт КАК ВлажностьОт,
		|	ВТ_ПодходящиеАдд.ВлажностьДо КАК ВлажностьДо,
		|	ВТ_ПодходящиеАдд.ВариантПрипуска КАК ВариантПрипуска,
		|	ВТ_ПодходящиеАдд.КатегорияПЭО КАК КатегорияПЭО,
		|	ВТ_ПодходящиеАдд.Характеристика КАК Характеристика,
		|	ВТ_ПодходящиеАдд.Номенклатура КАК Номенклатура,
		|	ВТ_ПодходящиеАдд.ХарактеристикаОтбор КАК ХарактеристикаОтбор,
		|	ВТ_ПодходящиеАдд.КатегорияПЭООтбор КАК КатегорияПЭООтбор,
		|	ВТ_ПодходящиеАдд.Количество КАК Количество,
		|	ЕСТЬNULL(Вт_Остатики.КПроизводствуОстаток, 0) КАК КПроизводствуОстаток,
		|	ЕСТЬNULL(Вт_Остатики.ПроизведеноОстаток, 0) КАК ПроизведеноОстаток,
		|	ЕСТЬNULL(Вт_Остатики.КОтгрузкеОстаток, 0) КАК КОтгрузкеОстаток,
		|	ВТ_ПодходящиеАдд.ОбъемПакета КАК ОбъемПакета,
		|	ВТ_ПодходящиеАдд.ОбщийОбъем КАК ОбщийОбъем,
		|	ВТ_ПодходящиеАдд.КоличествоВПроизводство КАК КоличествоВПроизводство,
		|	ВТ_ПодходящиеАдд.НомерСтроки КАК НомерСтроки,
		|	ВТ_ПодходящиеАдд.ДатаЗаказНаПроизводсво КАК ДатаЗаказНаПроизводсво
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ПодходящиеАдд КАК ВТ_ПодходящиеАдд
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_Остатики КАК Вт_Остатики
		|		ПО ВТ_ПодходящиеАдд.Ссылка = Вт_Остатики.Аддендум
		|			И ВТ_ПодходящиеАдд.ИдентификаторТовара = Вт_Остатики.ИдентификаторТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Итог.Ссылка КАК Аддендум,
		|	ВТ_Итог.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ_Итог.Количество КАК Количество,
		|	ВТ_Итог.ПроизведеноОстаток КАК ПроизведеноОстаток,
		|	ВТ_Итог.ОбъемПакета КАК ОбъемПакета,
		|	ВТ_Итог.КоличествоВПроизводство - ВТ_Итог.ПроизведеноОстаток - ВТ_Итог.ОбъемПакета КАК ОсталосьПроизвести,
		|	ВТ_Итог.ОбщийОбъем КАК ОбщийОбъем,
		|	ВТ_Итог.КоличествоВПроизводство КАК КоличествоВПроизводство
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.КоличествоВПроизводство - ВТ_Итог.ПроизведеноОстаток - ВТ_Итог.ОбъемПакета > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_Итог.ДатаЗаказНаПроизводсво,
		|	ВТ_Итог.НомерСтроки"; 
	
	#КонецОбласти
    

	Запрос.УстановитьПараметр("ДатаОстатков", 	ТекущаяДата());
	Запрос.УстановитьПараметр("КатегорияПЭО", 	КатегорияНоменклатурыПЭО);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("ОбъемПакета", 	Объем);
	Запрос.УстановитьПараметр("Припуск", 		Припуск);
	Запрос.УстановитьПараметр("Статус", 		Перечисления.алк_СтатусыАддендума.ВРаботе);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		ПараметрыПривязки.Вставить("Аддендум", 				ВыборкаДетальныеЗаписи.Аддендум);
		ПараметрыПривязки.Вставить("ИдентификаторТовара", 	ВыборкаДетальныеЗаписи.ИдентификаторТовара);
		ПараметрыПривязки.Вставить("ОсталосьПроизвести", 	ВыборкаДетальныеЗаписи.ОсталосьПроизвести);
		
	КонецЦикла;
	
	Возврат ПараметрыПривязки;	

КонецФункции // ПолучитьПараметрыПривязки()
   
Функция ПолучитьХарактеристикиВГруппе(мВлажность, мДлина, мПорода, мСечение, мСорт)

	Запрос = Новый Запрос;  					
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ХарактеристикиВГруппе КАК ХарактеристикиВГруппе,
	|	ВложенныйЗапрос.Сорт КАК Сорт,
	|	ВложенныйЗапрос.Длина КАК Длина,
	|	ВложенныйЗапрос.Порода КАК Порода,
	|	ВложенныйЗапрос.Сечение КАК Сечение,
	|	ВложенныйЗапрос.Влажность КАК Влажность
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВложенныйЗапрос.ХарактеристикиВГруппе КАК ХарактеристикиВГруппе,
	|		МАКСИМУМ(ВложенныйЗапрос.Сорт) КАК Сорт,
	|		МАКСИМУМ(ВложенныйЗапрос.Длина) КАК Длина,
	|		МАКСИМУМ(ВложенныйЗапрос.Порода) КАК Порода,
	|		МАКСИМУМ(ВложенныйЗапрос.Сечение) КАК Сечение,
	|		МАКСИМУМ(ВложенныйЗапрос.Влажность) КАК Влажность
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК ХарактеристикиВГруппе,
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Сорт,
	|			NULL КАК Длина,
	|			NULL КАК Порода,
	|			NULL КАК Сечение,
	|			NULL КАК Влажность
	|		ИЗ
	|			Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ГДЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок ПОДОБНО ""Сорт""
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|			NULL,
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|			NULL,
	|			NULL,
	|			NULL
	|		ИЗ
	|			Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ГДЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок ПОДОБНО ""Длина""
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|			NULL,
	|			NULL,
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|			NULL,
	|			NULL
	|		ИЗ
	|			Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ГДЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок ПОДОБНО ""Порода""
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|			NULL,
	|			NULL,
	|			NULL,
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение,
	|			NULL
	|		ИЗ
	|			Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ГДЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок ПОДОБНО ""Сечение""
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
	|		ИЗ
	|			Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|		ГДЕ
	|			ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок ПОДОБНО ""Влажность"") КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ХарактеристикиВГруппе) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Сорт В(&Сорт)
	|	И ВложенныйЗапрос.Длина В(&Длина)
	|	И ВложенныйЗапрос.Порода В(&Порода)
	|	И ВложенныйЗапрос.Сечение В(&Сечение)
	|	И ВложенныйЗапрос.Влажность В(&Влажность)";
	
	Запрос.УстановитьПараметр("Влажность", 	мВлажность);
	Запрос.УстановитьПараметр("Длина", 		мДлина);
	Запрос.УстановитьПараметр("Порода", 	мПорода);
	Запрос.УстановитьПараметр("Сечение", 	мСечение);
	Запрос.УстановитьПараметр("Сорт", 		мСорт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ХарактеристикиВГруппе");	

КонецФункции // ПолучитьХарактеристикиВГруппе()

&НаКлиенте
Процедура ПакетУжеЗарегистрированЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	// Механизм ввода пакета с новыми параметрами
	СозданыйПакет = СоздатьПакетНаСервере("");
	
	ОбновитьСписокИИтоги();	
		
	Если ДополнительныеПараметры.ИмяКоманды = "СоздатьПакетПечать" Тогда
		
		РаспечататьЭтикеткуТекущую(СозданыйПакет);
		
	КонецЕсли; 
	
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПакетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	УдалитьПакетНаСервере(ДополнительныеПараметры.ТекДанные);	
	
	ОбновитьСписокИИтоги();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПакетНаСервере(ТекущиеДанные)
	
	НаборЗаписей = РегистрыСведений.алк_ПараметрыПакетовОперативный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.СерийныйНомер.Установить(ТекущиеДанные.СерийныйНомер);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Запись.Актуальность = Перечисления.алк_ОперативнаяАктуальностьПакетов.Удален;
		
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПакет(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ТекДанные.Актуальность = ПредопределенноеЗначение("Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален") Тогда
		
		ТекстВопроса = "Пакет с номером: " + ТекДанные.СерийныйНомер + " будет удален!" + Символы.ПС +
		"Продолжить выполнение операции?";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УдалениеПакетаЗавершение", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные));
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура РаспечататьЭтикеткуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ПолучитьНомераВыбранныхПакетов(МассивВыбранныхСтрок)
	
	МассивСерийныхНомеров = Новый Массив;
	
	Для каждого Стр Из МассивВыбранныхСтрок Цикл		
		МассивСерийныхНомеров.Добавить(Стр.СерийныйНомер); 		
	КонецЦикла; 
	
	Возврат МассивСерийныхНомеров;
		
КонецФункции // ПолучитьНомераВыбранныхПакетов()
 
&НаКлиенте
Процедура РаспечататьЭтикетку(Команда)
	
	//УДАЛИТЬ
	//Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы") Тогда
	//	
	//	МассивСтрок = Элементы.Список.ВыделенныеСтроки;				
	//	
	//	МассивВыбранныхПакетов  = ПолучитьНомераВыбранныхПакетов(МассивСтрок);
	//				
	//	ОткрытьформуДобавленияМассиваСерийныхНомеров(МассивВыбранныхПакетов);
	//	
	//	Возврат;
	//
	//КонецЕсли; 
	//\\
		
	Если КоличествоЭкземпляров = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установите количество экземпляров этикеток!";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли; 
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если Право_ЦЛП() тогда 
			Этикетки = СформироватьЭтикеткиНаСервере(ТекДанные);
			
			Если Номенклатура_ПиломатериалСП() Тогда 
				Этикетки.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 	
			Иначе 
				Этикетки.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
			КонецЕсли;
			
			Этикетки.КоличествоЭкземпляров = КоличествоЭкземпляров;
			
			Если СразуНаПринтер Тогда
				Этикетки.Напечатать();	
			Иначе
				Этикетки.Показать();
			КонецЕсли; 
		Иначе
			Сообщить("У пользователя недостаточно прав для печати этикеток.");
		КонецЕсли;
		
		
	КонецЕсли; 
	    		
КонецПроцедуры

Функция Право_ЦЛП()
	
	Если РольДоступна("алк_ДобавлениеИзменениеПодсистемыПроизводствоЦЛП")тогда 
		Возврат Истина;
	ИначеЕсли  РольДоступна("алк_ДополнительныеПраваТехнолог") тогда 
		Возврат Истина;
	ИначеЕсли  РольДоступна("алк_ОператорПФМ") тогда 
		Возврат Истина; 
	ИначеЕсли  РольДоступна("алк_КонтролерМЛП") тогда 
		Возврат Истина;
	ИначеЕсли  РольДоступна("алк_ДоступКПечатиЭтикетокДляМастеров") тогда 
		Возврат Истина;
	ИначеЕсли РольДоступна("ПолныеПрава") Тогда 
		Возврат Истина
	Иначе  Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура РаспечататьЭтикеткуТекущую(Пакет)
	
	Если КоличествоЭкземпляров = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Установите количество экземпляров этикеток!";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли; 
	
	ТекДанные = Новый Структура("СерийныйНомер", Пакет); 
	
	Если ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда
		
		Если Право_ЦЛП() тогда
			
			Этикетки = СформироватьЭтикеткиНаСервере(ТекДанные);
			Если Номенклатура_ПиломатериалСП() Тогда 
				Этикетки.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 	
			Иначе 
				Этикетки.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
			КонецЕсли;
			Этикетки.КоличествоЭкземпляров = КоличествоЭкземпляров;
			
			Если СразуНаПринтер Тогда
				Этикетки.Напечатать();	
			Иначе
				Этикетки.Показать();
			КонецЕсли;
			
		Иначе
			Сообщить("У пользователя недостаточно прав для печати этикеток.");
		КонецЕсли;
		
	КонецЕсли; 
	
		
КонецПроцедуры

Функция Номенклатура_ПиломатериалСП() 
	Возврат Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012");
КонецФункции

&НаКлиенте
Процедура ПоказатьОтчетОперативныйВыпуск(Команда)
	
	Отбор = Новый Структура("Направление, Актуальность, ДатаСмены, Смена", 
	Объект.Направление, ПредопределенноеЗначение("Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален"), Объект.ДатаСмены, Объект.Смена); 
	
	//УДАЛИТЬ
	//Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы") Тогда
	//	ВарианОтчета = "Основной1"
	//Иначе
	//	ВарианОтчета = "Основной"
	//КонецЕсли; 
	//\\
	
	ВарианОтчета = "Основной";
	
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, Отбор, КлючВарианта", Истина, Отбор, ВарианОтчета);
	ОткрытьФорму("Отчет.алк_ВыпускПродукцииОперативный.Форма", ПараметрыФормы, , , ,);
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедуры

&НаСервере
Функция СохранитьВводСерийСервер(СтруктураНомераСерии)
	
	СправочникОбъект                = Справочники.СерийныеНомера.СоздатьЭлемент();
	СправочникОбъект.Владелец		= Номенклатура;
	СправочникОбъект.Наименование	= СтруктураНомераСерии.НовыйНомер;
	
	Попытка
		СправочникОбъект.Записать();	
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	СерийныйНомер = СправочникОбъект.Ссылка;
	НомерПакета   = СтруктураНомераСерии.НовыйНомерЧисло;
	
	Возврат Истина;
	
КонецФункции // СохранитьВводСерийСервер()	

&НаСервере
Функция ВычислитьМаксимальныйНомерИКоличество()
	
	МаксимальныйНомерИзСправочника = Справочники.СерийныеНомера.ВычислитьМаксимальныйНомерСерии_ПоШаблону(Номенклатура, ШаблонСерийногоНомера);
	
	Номер = МаксимальныйНомерИзСправочника;
	
	Возврат Номер;
	
КонецФункции

&НаСервере
Функция ДобавитьСерийныйНомерПоШаблону(ТекущийМаксимальныйНомер)
	
	НомерЧисло = ТекущийМаксимальныйНомер;
	
	Если ЗначениеЗаполнено(ШаблонСерийногоНомера) Тогда
		//Длина цифровой части номера - не более 13 символов
		ЦифрВШаблоне = СтрЧислоВхождений(ШаблонСерийногоНомера, РаботаССерийнымиНомерамиКлиентСервер.СимволЧисла());
		ЧислоСимволовСН = Макс(ЦифрВШаблоне, СтрДлина(НомерЧисло));
		НомерСНулями = Формат(НомерЧисло, "ЧЦ="+ЦифрВШаблоне+"; ЧВН=; ЧГ=");
		
		НовыйНомерПоШаблону = "";
		НомерСимволаСН = 1;
		//Заполняем шаблон
		Для н=1 По СтрДлина(ШаблонСерийногоНомера) Цикл
			симв = Сред(ШаблонСерийногоНомера,н,1);
			Если симв=РаботаССерийнымиНомерамиКлиентСервер.СимволЧисла() Тогда
				НовыйНомерПоШаблону = НовыйНомерПоШаблону+Сред(НомерСНулями,НомерСимволаСН,1);
				НомерСимволаСН = НомерСимволаСН+1;
			Иначе
				НовыйНомерПоШаблону = НовыйНомерПоШаблону+симв;
			КонецЕсли;
		КонецЦикла;
		НовыйНомер = НовыйНомерПоШаблону;
	Иначе
		НовыйНомер = Формат(НомерЧисло, "ЧЦ=8; ЧВН=; ЧГ=");
	КонецЕсли;
	
	возврат Новый Структура("НовыйНомер, НовыйНомерЧисло", НовыйНомер, НомерЧисло);
	
	
КонецФункции // ДобавитьСерийныйНомерПоШаблону()

&НаСервере
Процедура УстановкаРассчетныхПараметров()
	
	Объемы = РфпСервер.ОбъемыПакета(Характеристика, КоличествоСостав, , РфпСервер.ПолучитьПараметрыПрипуска(Припуск));
	
	Объем = Объемы.Объем;
	ОбъемТаможня = Объемы.ОбъемТаможня;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

//&НаКлиенте
&НаСервере
Функция ПолучитьШаблонСН()
		
	Если Вариант = 6 Тогда
		Маска = "МЛ";
	ИначеЕсли Вариант = 7 Тогда
		Маска = "МС";
	ИначеЕсли Вариант = 8 Тогда
		Маска = "НЗ";
	ИначеЕсли Вариант = 4 Тогда
		Маска = "ПП";   // Маска = "ОТ";		
	ИначеЕсли Вариант = 9 Тогда
		Маска = "МП";   // Маска = "ОМ";
	Иначе 
		Маска = "";
	КонецЕсли; 	  	
	
	Возврат  РфпПолучениеДанныхСервер.ШаблонСерийногоНомераНоменклатурыДляПериода(Номенклатура, НачалоГода(Объект.ДатаСмены), Маска);
	
КонецФункции

&НаСервере
Функция СформироватьЭтикеткиНаСервере(ТекДанные)
	
	РегистрыСведений.РФП_ПечатьЭтикеток.СформироватьЗаписьРегистраСведений(ТекДанные.СерийныйНомер);
	
	МассивСерийныхНомеров = Новый Массив;
	МассивСерийныхНомеров.Добавить(ТекДанные.СерийныйНомер);
	
	Этикетки = Обработки.алк_ПечатьЭтикеток.СформироватьПечатнуюФормуЭтикетки_Оперативно(МассивСерийныхНомеров);		
	
	Возврат Этикетки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИтогПоОтборамСтрока(Отбор)
	
	КоличествоПакетов = 0;
	ОбъемПакетов      = 0;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СУММА(1) КАК КоличествоПакетов,
	//|	СУММА(алк_ПараметрыПакетовОперативныйСрезПоследних.Объем) КАК Объем,
	//|	СУММА(алк_ПараметрыПакетовОперативныйСрезПоследних.ВесНеттоТаможня) КАК Вес
	//|ИЗ
	//|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(
	//|			,
	//|			Направление = &Направление
	//|				И Актуальность = &Актуальность
	//|				И ДатаСмены = &ДатаСмены
	//|				И Смена = &Смена
	//|				И СерийныйНомер.Наименование ПОДОБНО &ПрефиксНомераПакета + ""%""
	//|				И Участок = &Участок) КАК алк_ПараметрыПакетовОперативныйСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Актуальность", Перечисления.алк_ОперативнаяАктуальностьПакетов.Актуален);
	//Запрос.УстановитьПараметр("ДатаСмены", Отбор.ДатаСмены);
	//Запрос.УстановитьПараметр("Направление", Отбор.Направление);
	//Запрос.УстановитьПараметр("Смена", Отбор.Смена);
	//Запрос.УстановитьПараметр("ПрефиксНомераПакета", Сред(Отбор.ШаблонСерийногоНомера, 1,6)); 
	//Запрос.УстановитьПараметр("Участок", Отбор.Участок);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	КоличествоПакетов 	= ВыборкаДетальныеЗаписи.КоличествоПакетов;
	//	ОбъемПакетов      	= ВыборкаДетальныеЗаписи.Объем;
	//	ВесПакетов 			= ВыборкаДетальныеЗаписи.Вес;
	//	
	//КонецЦикла;
	//
	//Если Отбор.Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы  Тогда
	//	СтрокаИтог = "Пакетов: " + КоличествоПакетов + "; Вес: " + ВесПакетов;
	//Иначе
	//	СтрокаИтог = "Пакетов: " + КоличествоПакетов + "; Объем: " + ОбъемПакетов;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ПроизводствоОборотОбороты.СерийныйНомер) КАК КоличествоПакетов,
	|	СУММА(алк_ПроизводствоОборотОбороты.КоличествоОборот) КАК Объем
	|ИЗ
	|	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	|			,
	|			,
	|			,
	|			ДатаСмены = &ДатаСмены
	|				И Смена = &Смена
	|				И Участок = &Участок
	|				И СерийныйНомер.Наименование ПОДОБНО &ПрефиксНомераПакета + ""%""
	|				И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка)
	|				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)) КАК алк_ПроизводствоОборотОбороты";
	
	Запрос.УстановитьПараметр("ДатаСмены", Отбор.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Отбор.Смена); 
	Запрос.УстановитьПараметр("Участок", Отбор.Участок);  
	Запрос.УстановитьПараметр("ПрефиксНомераПакета", Сред(Отбор.ШаблонСерийногоНомера, 1,6));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		КоличествоПакетов 	= ВыборкаДетальныеЗаписи.КоличествоПакетов;
		ОбъемПакетов      	= ВыборкаДетальныеЗаписи.Объем;
		
	КонецЦикла;
	
	СтрокаИтог = "Пакетов: " + КоличествоПакетов + "; Объем: " + ОбъемПакетов;
	
	Возврат СтрокаИтог;
	
КонецФункции //ПолучитьИтогПоОтборамСтрока

#КонецОбласти 


#Область ИнтерфейсныеПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСформироватьПакет()
	
	Если ЗначениеЗаполнено(Характеристика) 
		// И ЗначениеЗаполнено(Сертификат)
		И ЗначениеЗаполнено(СерийныйНомер) 
		И (ЗначениеЗаполнено(Объем) или КоличествоСостав > 0) Тогда
		
		Элементы.СписокСоздатьПакет.Доступность = Истина;
		
		Если КоличествоЭкземпляров <> 0 Тогда
			Элементы.СписокСоздатьПакетПечать.Доступность = Истина;	
		Иначе
			Элементы.СписокСоздатьПакетПечать.Доступность = Ложь;
		КонецЕсли; 
		
	Иначе
		
		Элементы.СписокСоздатьПакет.Доступность = Ложь;
		Элементы.СписокСоздатьПакетПечать.Доступность = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте    
Процедура УстановитьДоступностьДобавитьСН()
	
	Если ЗначениеЗаполнено(ШаблонСерийногоНомера) 
		И ЗначениеЗаполнено(Номенклатура)
		// И ЗначениеЗаполнено(Сертификат)
		И (ЗначениеЗаполнено(Объем) или ЗначениеЗаполнено(КоличествоСостав)) тогда
		Элементы.ДобавитьСерийныйНомер.Доступность = Истина;
		Элементы.ДобавитьМассивСерийныхНомеров.Доступность = Истина;
		
		Элементы.ГруппаГенерацияНомеров.ОтображатьЗаголовок = Ложь;
				
	Иначе
		Элементы.ДобавитьСерийныйНомер.Доступность = Ложь;
		Элементы.ДобавитьМассивСерийныхНомеров.Доступность = Ложь;
		
		Элементы.ГруппаГенерацияНомеров.ОтображатьЗаголовок = Истина; 
		
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура УстановитьОтборыВСписке()
//	
//	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор;
//	
//	//смена
//	ОтборПоСмене = Неопределено;
//	ПолеСмена = Новый ПолеКомпоновкиДанных("Смена");
//	Для каждого ЭлементОтбора Из Отбор.Элементы  Цикл
//		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И
//			ЭлементОтбора.ЛевоеЗначение = ПолеСмена Тогда
//			ОтборПоСмене = ЭлементОтбора;
//			Прервать;
//		КонецЕсли; 	
//	КонецЦикла; 
//	
//	ОтборПоСмене.ПравоеЗначение = ?(Параметры.Свойство("Смена"), Параметры.Смена, Объект.Смена);
//	ОтборПоСмене.Использование = Истина;
//	
//	//дата смены
//	ОтборПоДатаСмены = Неопределено;
//	ПолеДатаСмены = Новый ПолеКомпоновкиДанных("ДатаСмены");
//	Для каждого ЭлементОтбора Из Отбор.Элементы  Цикл
//		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И
//			ЭлементОтбора.ЛевоеЗначение = ПолеДатаСмены Тогда
//			ОтборПоДатаСмены = ЭлементОтбора;
//			Прервать;
//		КонецЕсли; 	
//	КонецЦикла; 
//	
//	ОтборПоДатаСмены.ПравоеЗначение = ?(Параметры.Свойство("ДатаСмены"), Параметры.ДатаСмены, Объект.ДатаСмены);
//	ОтборПоДатаСмены.Использование = Истина;
//	
//	// направление
//	ОтборПоНаправление = Неопределено;
//	ПолеНаправление = Новый ПолеКомпоновкиДанных("Направление");
//	Для каждого ЭлементОтбора Из Отбор.Элементы  Цикл
//		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И
//			ЭлементОтбора.ЛевоеЗначение = ПолеНаправление Тогда
//			ОтборПоНаправление = ЭлементОтбора;
//			Прервать;
//		КонецЕсли; 	
//	КонецЦикла; 
//	
//	ОтборПоНаправление.ПравоеЗначение = ?(Параметры.Свойство("Направление"), Параметры.Направление, Объект.Направление);
//	ОтборПоНаправление.Использование = Истина;
//	
//	// ответственный
//	ОтборПоОтветственный = Неопределено;
//	ПолеОтветственный = Новый ПолеКомпоновкиДанных("Ответственный");
//	Для каждого ЭлементОтбора Из Отбор.Элементы  Цикл
//		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И
//			ЭлементОтбора.ЛевоеЗначение = ПолеОтветственный Тогда
//			ОтборПоОтветственный = ЭлементОтбора;
//			Прервать;
//		КонецЕсли; 	
//	КонецЦикла; 
//	
//	ОтборПоОтветственный.ПравоеЗначение = ?(Параметры.Свойство("Ответственный"), Параметры.Ответственный, Объект.Ответственный);
//		
//	Если Не Администрирование Тогда
//		ОтборПоОтветственный.Использование = Истина;
//	Иначе
//		ОтборПоОтветственный.Использование = Ложь;
//	КонецЕсли;  
//	
//	// шаблон номера
//	ОтборПоСерийныйНомер = Неопределено;
//	ПолеСерийныйНомер = Новый ПолеКомпоновкиДанных("СерийныйНомер.Наименование");
//	Для каждого ЭлементОтбора Из Отбор.Элементы  Цикл
//		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И
//			ЭлементОтбора.ЛевоеЗначение = ПолеСерийныйНомер Тогда
//			ОтборПоСерийныйНомер = ЭлементОтбора;
//			Прервать;
//		КонецЕсли; 	
//	КонецЦикла; 
//	
//	ОтборПоСерийныйНомер.ПравоеЗначение = Сред(ЭтаФорма.ШаблонСерийногоНомера, 1, 6);
//	ОтборПоСерийныйНомер.Использование = Истина; 
//	
//	//участок
//	ОтборПоУчастку = Неопределено;
//	ПолеУчасток = Новый ПолеКомпоновкиДанных("Участок");
//	Для каждого ЭлементОтбора Из Отбор.Элементы  Цикл
//		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И
//			ЭлементОтбора.ЛевоеЗначение = ПолеУчасток Тогда
//			ОтборПоУчастку = ЭлементОтбора;
//			Прервать;
//		КонецЕсли; 	
//	КонецЦикла; 
//	
//	ОтборПоУчастку.ПравоеЗначение = ?(Параметры.Свойство("Участок"), Параметры.Участок, Объект.Участок);
//	ОтборПоУчастку.Использование = Истина; 
//				
//КонецПроцедуры // УстановитьОтборыВСписке()

&НаСервере
Процедура УстановитьЕдиницуИзмеренияКоличества()
	
	КоличествоСостав = 0;
	Объем = 0;
	
	Если Вариант = 5 Тогда // Древесные гранулы		
		Элементы.ДекорацияЕдИзм.Заголовок = "в КГ";	
		Элементы.КоличествоСостав.Видимость = Истина;
		Элементы.КоличествоОбъем.Видимость = Ложь;	
		УстановитьКоличествоОбъем();
		Возврат;	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		Возврат;	
	КонецЕсли; 

	ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Характеристика);	
	
	//УДАЛИТЬ
	//Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Карандаши И ПараметрыХ["Сечение"].ДиаметрММ = 0 
	//			Или Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000005") Тогда    //Чурак оцилиндрованный (кат)
	//	Элементы.ДекорацияЕдИзм.Заголовок = "в КГ";	
	//	Элементы.КоличествоСостав.Видимость = Истина;
	//	Элементы.КоличествоОбъем.Видимость = Ложь;
	//\\
	
	Если  Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000006") Тогда //Побочная продукция
		Элементы.ДекорацияЕдИзм.Заголовок = "в м.куб.";
		Элементы.КоличествоСостав.Видимость = Ложь;
		Элементы.КоличествоОбъем.Видимость = Истина;  
	Иначе	
		Элементы.ДекорацияЕдИзм.Заголовок = "";	
		Элементы.КоличествоСостав.Видимость = Истина;
		Элементы.КоличествоОбъем.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьКоличествоОбъем();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПрипуск() 
	
	Если Не ЗначениеЗаполнено(Объект.МассивИзЗаказаПокупателя) Тогда		
		Возврат;	
	КонецЕсли;   
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Характеристика", Характеристика);
	НайденныеСтроки = Объект.МассивИзЗаказаПокупателя.НайтиСтроки(ПараметрыОтбора); 
	
		
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Припуск = НайденныеСтроки[0].Припуск;
		
		КатегорияНоменклатурыПЭО = НайденныеСтроки[0].КатегорияНоменклатурыПЭО;
		
	Иначе
		
		Сообщить("Характеристика не соответствует заказу!");	
	
	КонецЕсли; 
		
КонецПроцедуры
 
#КонецОбласти 

&НаСервере
Процедура ЗаказНаПроизводствоПриИзмененииНаСервере()
		
	Объект.МассивИзЗаказаПокупателя.Очистить();

	Если ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗаказПокупателяЗапасы.Ссылка,
		|	алк_ЗаказПокупателяЗапасы.Номенклатура,
		|	СУММА(алк_ЗаказПокупателяЗапасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОбъемЗаказа
		|ИЗ
		|	Документ.алк_ЗаказПокупателя.Запасы КАК алк_ЗаказПокупателяЗапасы
		|ГДЕ
		|	алк_ЗаказПокупателяЗапасы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ЗаказПокупателяЗапасы.Номенклатура,
		|	алк_ЗаказПокупателяЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка,
		|	алк_ЗаказПокупателяОбъемныеГруппы.Объем,
		|	алк_ЗаказПокупателяОбъемныеГруппы.ИдентификаторГруппы,
		|	ЕСТЬNULL(алк_КатегорияНоменклатурыПЭО.Ссылка, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)) КАК КатегорияНоменклатурыПЭО
		|ПОМЕСТИТЬ ВО_ОбъемГруппы
		|ИЗ
		|	Справочник.алк_КатегорияНоменклатурыПЭО КАК алк_КатегорияНоменклатурыПЭО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_ЗаказПокупателя.ОбъемныеГруппы КАК алк_ЗаказПокупателяОбъемныеГруппы
		|		ПО (алк_ЗаказПокупателяОбъемныеГруппы.стрНомераКатегорияПЭО ПОДОБНО ""%"" + алк_КатегорияНоменклатурыПЭО.Код + ""%"")
		|ГДЕ
		|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка,
		|	СУММА(алк_ЗаказПокупателяОбъемныеГруппы.Объем) КАК Объем
		|ПОМЕСТИТЬ ВО_ОбъемГруппыЗаполненный
		|ИЗ
		|	Документ.алк_ЗаказПокупателя.ОбъемныеГруппы КАК алк_ЗаказПокупателяОбъемныеГруппы
		|ГДЕ
		|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика КАК Характеристика,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы,
		|	ВО_ОбъемГруппы.КатегорияНоменклатурыПЭО,
		|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск,
		|	ВЫБОР
		|		КОГДА ВО_ОбъемГруппы.Объем = 0
		|			ТОГДА ВТ_ОбъемЗаказа.Количество - ВО_ОбъемГруппыЗаполненный.Объем
		|		ИНАЧЕ ВО_ОбъемГруппы.Объем
		|	КОНЕЦ КАК Объем
		|ИЗ
		|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемЗаказа КАК ВТ_ОбъемЗаказа
		|		ПО алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = ВТ_ОбъемЗаказа.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВО_ОбъемГруппы КАК ВО_ОбъемГруппы
		|		ПО алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = ВО_ОбъемГруппы.Ссылка
		|			И алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы = ВО_ОбъемГруппы.ИдентификаторГруппы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВО_ОбъемГруппыЗаполненный КАК ВО_ОбъемГруппыЗаполненный
		|		ПО алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = ВО_ОбъемГруппыЗаполненный.Ссылка
		|ГДЕ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЗаказНаПроизводство.ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 			
			НоваяСтр = Объект.МассивИзЗаказаПокупателя.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаДетальныеЗаписи); 			
		КонецЦикла;  	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаПроизводствоПриИзменении(Элемент)
	ЗаказНаПроизводствоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабДок(ТабличныйДокумент)
	
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбрОбъект.ПолучитьМакет("МакетСписокКСборке"); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");

	
	ОбластьШапка.Параметры.ДатаСмены 		= Формат(Объект.ДатаСмены, "ДФ=dd.MM.yyyy");	
	ОбластьШапка.Параметры.Смена 			= Объект.Смена;  
	ОбластьШапка.Параметры.Ответственный 	= Объект.Ответственный;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер КАК Пакет
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(
		|			,
		|			Направление = &Направление
		|				И Актуальность = &Актуальность
		|				И ДатаСмены = &ДатаСмены
		|				И Смена = &Смена) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|ГДЕ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.КоличествоСостав = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер";
	
	Запрос.УстановитьПараметр("Актуальность", 	Перечисления.алк_ОперативнаяАктуальностьПакетов.Актуален);
	Запрос.УстановитьПараметр("ДатаСмены", 		Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Направление", 	Объект.Направление);
	Запрос.УстановитьПараметр("Смена", 			Объект.Смена);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	             	             	
	Для каждого Стр Из ТЗ Цикл
	    ОбластьСтрока.Параметры.Пакет = Стр.Пакет;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокПакетовКСборке(Команда)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПолучитьТабДок(ТабличныйДокумент);	
	
	ТабличныйДокумент.Показать(); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрипускПриИзменении(Элемент)
	
	УстановкаРассчетныхПараметров();
	
	УстановитьДоступностьДобавитьСН();
	УстановитьДоступностьСформироватьПакет();
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	
	УстановитьДоступностьДобавитьСН();
	УстановитьДоступностьСформироватьПакет();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПризнакБоковойДоски(Характеристика)  
	
	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ПараметрыХарактеристик.Сечение КАК Сечение
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |ГДЕ
	               |	алк_ПараметрыХарактеристик.Характеристика = &Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА алк_БоковаяДоскаСрезПоследних.Сечение ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК БоковаяДоска
	               |ИЗ
	               |	РегистрСведений.алк_БоковаяДоска.СрезПоследних(
	               |			,
	               |			Сечение В
	               |				(ВЫБРАТЬ
	               |					вт.Сечение КАК Сечение
	               |				ИЗ
	               |					вт КАК вт)) КАК алк_БоковаяДоскаСрезПоследних";
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.БоковаяДоска;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСкладВыпуска(Номенклатура,Участок)  
	
	ВидДвижения = Новый Массив;
	ВидДвижения.Добавить(Перечисления.алк_ВидыДвиженияПроизводствоОборот.Оприходовано);
	//ВидДвижения.Добавить(Перечисления.алк_ВидыДвиженияПроизводствоОборот.Отходы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УчасткиДвиженияПроизводства.Склад КАК Склад
		|ИЗ
		|	Справочник.алк_Участки.ДвиженияПроизводства КАК алк_УчасткиДвиженияПроизводства
		|ГДЕ
		|	алк_УчасткиДвиженияПроизводства.Операция В(&Операция)
		|	И алк_УчасткиДвиженияПроизводства.Номенклатура = &Номенклатура
		|	И алк_УчасткиДвиженияПроизводства.Ссылка = &Участок
		|	И алк_УчасткиДвиженияПроизводства.ВидДвижения В(&ВидДвижения)";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Операция", Справочники.алк_ОперацииПроизводства.Упаковка);
	Запрос.УстановитьПараметр("Участок", Участок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Склад;
	КонецЦикла;
	
	Возврат Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	
КонецФункции

/////////////////////Процедуры и функции для сканера///////////////////////////////////////////////////////////////////////////////

//ТА 
//заполняет параметры формы данными из сканера и параметры рабочего места найденные в Алогистик
&НаСервере
Процедура ЗаполнитьДанныеСортировкиНаСервере(ДанныеСоСканера, Категория, ОшибкаПолученияХарактеристики = Ложь)
	
	//очищаем поля       
	Характеристика = "";
	КоличествоСостав = "";
	КоличествоСостав1 = "";
	Припуск = "";
	КатегорияНоменклатурыПЭО = "";
	//\\

	//получаем породу
	ПородаСоСканера = ПолучитьПородуПоКоду(ДанныеСоСканера.ПородаИД);
	//\\
			
	//получаем сорт   
	СортСоСканера = ПолучитьСортПоКоду(ДанныеСоСканера.СортИД,ДанныеСоСканера.ТипПакета);
	//\\
	
	//поиск длины
	Если ДанныеСоСканера.Длина = NULL Тогда
		ДлинаСоСканера = Справочники.Длины.ПустаяСсылка();
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(Длины.Ссылка, ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)) КАК Ссылка
		               |ИЗ
		               |	Справочник.Длины КАК Длины
		               |ГДЕ
		               |	Длины.ДлинаММ = &ДлинаММ
		               |	И Длины.Владелец = &Владелец";
		Запрос.УстановитьПараметр("ДлинаММ",ДанныеСоСканера.Длина);
		Запрос.УстановитьПараметр("Владелец",Категория); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДлинаСоСканера = Выборка.Ссылка;	
		КонецЦикла;
	КонецЕсли;
	//\\
	
	//получаем ширину
	Если ДанныеСоСканера.Ширина = NULL Тогда
		ШиринаСоСканера = 0;
	Иначе
		ШиринаСоСканера = ДанныеСоСканера.Ширина;
	КонецЕсли;
	//\\  
	
	//получаем толщину
	Если ДанныеСоСканера.Толщина = NULL Тогда
		ТолщинаСоСканера = 0;
	Иначе
		ТолщинаСоСканера = ДанныеСоСканера.Толщина;
	КонецЕсли;
	//\\
	
	//получаем сечение
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(РазмерСечения.Ссылка, ЗНАЧЕНИЕ(Справочник.РазмерСечения.ПустаяСсылка)) КАК Сечение
	|ИЗ
	|	Справочник.РазмерСечения КАК РазмерСечения
	|ГДЕ
	|	РазмерСечения.ШиринаММ = &ШиринаММ
	|	И РазмерСечения.ТолщинаММ = &ТолщинаММ
	|	И РазмерСечения.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("ШиринаММ",ШиринаСоСканера);
	Запрос.УстановитьПараметр("ТолщинаММ",ТолщинаСоСканера);
	Запрос.УстановитьПараметр("Владелец",Категория);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СечениеСоСканера = Выборка.Сечение;
	КонецЦикла;
	//\\
	
	//поиск влажности
	Если ДанныеСоСканера.Влажность = NULL ИЛИ ДанныеСоСканера.ТипПакета = "СП"   Тогда 
		ВлажностьСоСканера = Справочники.Влажность.ПустаяСсылка();
	Иначе
		ВлажностьСоСканера = ПолучитьВлажностьПоКоду(ДанныеСоСканера.Влажность);
	КонецЕсли;
	//\\
	
	//соотносим и получаем характеристику
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Порода = &Порода
	|	И алк_ПараметрыХарактеристик.Сорт = &Сорт
	|	И алк_ПараметрыХарактеристик.Длина = &Длина
	|	И алк_ПараметрыХарактеристик.Сечение = &Сечение
	|	И алк_ПараметрыХарактеристик.Влажность = &Влажность";
	
	Запрос.УстановитьПараметр("Порода",ПородаСоСканера);
	Запрос.УстановитьПараметр("Сорт",СортСоСканера);
	Запрос.УстановитьПараметр("Длина",ДлинаСоСканера); 
	Запрос.УстановитьПараметр("Сечение",СечениеСоСканера);
	Запрос.УстановитьПараметр("Влажность", ВлажностьСоСканера); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ХарактеристикаСоСканера = Выборка.Характеристика;
	КонецЦикла;
	//\\
	
	//получаем припуск
	Если ДанныеСоСканера.Припуск = NULL Тогда
		ПрипускСоСканера = Справочники.алк_ВариантыПрипуска.ПустаяСсылка();
	Иначе 
		ПрипускСоСканера = Справочники.алк_ВариантыПрипуска.НайтиПоНаименованию(ДанныеСоСканера.Припуск); 
	КонецЕсли;
	//\\  
	
	//получаем категорию ПЭО
	Если ДанныеСоСканера.КатегорияПЭО = NULL Тогда
		КатегорияПЭОСоСканера = Справочники.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка();
	Иначе 
		КатегорияПЭОСоСканера = Справочники.алк_КатегорияНоменклатурыПЭО.НайтиПоНаименованию(ДанныеСоСканера.КатегорияПЭО); 
	КонецЕсли;
	//\\ 
	
	//получаем количество состав 
	Если ДанныеСоСканера.КоличествоСостав = NULL Тогда
		КоличествоСоставСоСканера = 0;
	Иначе 
		КоличествоСоставСоСканера = ДанныеСоСканера.КоличествоСостав; 
	КонецЕсли;
	//\\
	
	//БЛОК ПРОВЕРКА 
	
	//проверка получения данных (получение характеристики)
	Если Не ЗначениеЗаполнено(ХарактеристикаСоСканера) Тогда  
		
		Если ЗначениеЗаполнено(ПородаСоСканера) 
			И (Не ЗначениеЗаполнено(СортСоСканера) И ДанныеСоСканера.ТипПакета = "СП" ИЛИ ЗначениеЗаполнено(СортСоСканера)) 
			И ЗначениеЗаполнено(ДлинаСоСканера) 
			И ЗначениеЗаполнено(СечениеСоСканера) 
			И (Не ЗначениеЗаполнено(ВлажностьСоСканера) И ДанныеСоСканера.ТипПакета = "СП" ИЛИ ЗначениеЗаполнено(ВлажностьСоСканера)) Тогда 
			
			ОшибкаПолученияХарактеристики = Истина;
			
			Сообщить("Данной характеристики нет в Алогистике!");  
			
			Сообщить(СтрШаблон("%1 %2 %3 %4 %5", ПородаСоСканера,СортСоСканера,ДлинаСоСканера,СечениеСоСканера,ВлажностьСоСканера ));
						
		Иначе 
			
			ОшибкаПолученияХарактеристики = Истина;
			
			Сообщить("Ошибка в получение данных со сканера!");
			
			Если Не ЗначениеЗаполнено(ПородаСоСканера) Тогда 
				Сообщить("Не удалось получить породу!");
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(СортСоСканера) И ДанныеСоСканера.ТипПакета <> "СП" Тогда 
				Сообщить("Не удалось получить сорт!");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДлинаСоСканера) Тогда 
				Сообщить("Не удалось получить длину!");
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(СечениеСоСканера) Тогда 
				Сообщить("Не удалось получить сечение!");
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(ВлажностьСоСканера) И ДанныеСоСканера.ТипПакета <> "СП" Тогда 
				Сообщить("Не удалось получить влажность!");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;   
	//\\ 
	
	//проверка получения данных (получение категории ПЭО)
	Если Не ЗначениеЗаполнено(КатегорияПЭОСоСканера) И ДанныеСоСканера.ТипПакета <> "СП"  Тогда 
		ОшибкаПолученияХарактеристики = Истина;
		Сообщить("Не удалось получить Категорию ПЭО!");
	КонецЕсли;
	//\\  
	
	//проверка получения данных (получение количество состава)
	Если КоличествоСоставСоСканера = 0 Тогда
		ОшибкаПолученияХарактеристики = Истина;
		Сообщить("Не удалось получить количество состав!");
	КонецЕсли;
	//\\  
	
	//проверка получения данных (получение припуска)
	Если Не ЗначениеЗаполнено(ПрипускСоСканера) И ДанныеСоСканера.ТипПакета <> "СП"  Тогда 
		ОшибкаПолученияХарактеристики = Истина;
		Сообщить("Не удалось получить припуск пакета!");
	КонецЕсли;
	//\\  
	
	//\\ КОНЕЦ БЛОКА ПРОВЕРКИ
	
	//заполняем шапку
	Характеристика = ХарактеристикаСоСканера;
	Припуск = ПрипускСоСканера;
	КатегорияНоменклатурыПЭО = КатегорияПЭОСоСканера;
	КоличествоСостав1 = КоличествоСоставСоСканера;  
	КоличествоСостав = КоличествоСостав1;
	Габарит = ДанныеСоСканера.Габарит.Для1с;
	//\\ 
	
	//заполняем параметры 
	Параметры.Влажность = Строка(ДанныеСоСканера.Влажность); 
	Параметры.Длина = Строка(ДанныеСоСканера.Длина); 
	Параметры.КоличествоСостав = Строка(ДанныеСоСканера.КоличествоСостав); 
	Параметры.Порода = Строка(ДанныеСоСканера.ПородаИД); 
	Параметры.Припуск = Строка(ДанныеСоСканера.Припуск); 
	Параметры.Сорт = Строка(ДанныеСоСканера.СортИД); 
	Параметры.Толщина = Строка(ДанныеСоСканера.Толщина); 
	Параметры.Ширина = Строка(ДанныеСоСканера.Ширина);
	Параметры.НомерПакетаСоСканера = Строка(ДанныеСоСканера.НомерПакетаСоСканера);
	Параметры.КатегорияПЭО = Строка(ДанныеСоСканера.КатегорияПЭО); 
	Параметры.ТипПакета = Строка(ДанныеСоСканера.Габарит.ДляСканера);
	//\\	
			
КонецПроцедуры
//ТА
&НаКлиенте
Процедура ЗаполнитьДанныеСортировки(Команда)
		
	ЗаполнитьДаннымиСоСканера();
	
КонецПроцедуры
//отдельно для подключения обработчика ожидания
&НаКлиенте
Процедура ЗаполнитьДаннымиСоСканера() 
	
	Если АвтоматическоеЗаполнение И ЗапрещеноМенятьДокумент(Объект.Участок,Объект.ДатаСмены,Объект.Смена) Тогда 
		АвтоматическоеЗаполнение = Ложь;
		ИзменениеНаФормеПриАвтозаполнение(Ложь); //разблокируем поля
		УстановитьАвтоматическуюПечать(); //отключаем обработчик ожидания
		
		Возврат;
	КонецЕсли;

	Если АвтоматическоеЗаполнение И КоличествоЭкземпляров = 0 Тогда 
		
		Если КоличествоЭкземпляров = 0 Тогда 
			Сообщить("Заполните количество этикеток!");
		КонецЕсли;    
		
		АвтоматическоеЗаполнение = Ложь;
		ИзменениеНаФормеПриАвтозаполнение(Ложь); //разблокируем поля
		УстановитьАвтоматическуюПечать(); //отключаем обработчик ожидания
		
		Возврат; 
		
	КонецЕсли; 
	
	//получаем структуру пакета
	ДанныеСоСканера = ПолучитьСтруктуруПакета(Объект.ЛинияСортировки);
		
	//проверка пакета
	Если Не ПрошелПакетПроверкуПередЗаполнениемРМ(ДанныеСоСканера) Тогда
		Если Не АвтоматическоеЗаполнение Тогда 
			УстановитьДоступностьДобавитьСН();
		КонецЕсли;
		УстановитьАвтоматическуюПечать();
		Возврат;
	КонецЕсли;
	//\\                                                 
	
	Ошибка = Ложь;
	
	//получаем структуру, состоящую из данных со сканера и соотнесенных параметров в Алогистик 
  	ЗаполнитьДанныеСортировкиНаСервере(ДанныеСоСканера, ПолучитьКатегориюПоНоменклатуре(Номенклатура),Ошибка);  
	//\\
	
	УстановкаРассчетныхПараметров();
	
	//доступность генерировать серийный номер
	УстановитьДоступностьДобавитьСН(); 
	//\\  
	
	ОбновитьСписокИИтоги();
	
	Если НЕ АвтоматическоеЗаполнение Тогда 
		Возврат;
	КонецЕсли;
	
	
	//Если (НЕ ДанныеСоСканера.ОдноСечение ИЛИ Ошибка) И АвтоматическоеЗаполнение Тогда 
	//	Если НЕ ДанныеСоСканера.ОдноСечение  Тогда 
	//		СообщениеОбАвтоПечати = "Данный пакет имеет несколько длин, необходимо указывать данные вручную!";
	//	КонецЕсли;
	
	Если Ошибка Тогда 
		АвтоматическоеЗаполнение = Ложь;
		ИзменениеНаФормеПриАвтозаполнение(Ложь); 
		УстановитьАвтоматическуюПечать();
		Возврат;
	КонецЕсли;
	
	//заполняем серийный номер
	ДобавитьСерийныйНомерПроцедураКоманды();
	//\\ 
	
	Команда = Новый Структура;
	Команда.Вставить("Имя", "ЗаполнитьДанныеСортировки"); 
	
	//добавляем пакет в ТЧ
	СоздатьПакет(Команда);
	//\\ 
	
	ИзменениеНаФормеПриАвтозаполнение(Ложь); 
	
	СообщениеОбАвтоПечати = "Этикетка пакета " + Строка(СерийныйНомер) + " распечаталась!";  
	
КонецПроцедуры 

//ТА
&НаКлиенте
Процедура ЗавершениеВводаНомера(Результат, ДополнительныеПараметры) Экспорт  
		
	Если Результат = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
			
	//получаем пакет по номеру
	ДанныеПакета = ПолучитьСтруктуруПакета(Объект.ЛинияСортировки,Результат);
	//\\   
	
	// проверка
	Если Не ПрошелПакетПроверкуПередЗаполнениемРМ(ДанныеПакета) Тогда 
		УстановитьДоступностьДобавитьСН();
		Возврат;
	КонецЕсли; 
	//\\
	
	//заполнение рабочего места данными со сканера
	ЗаполнитьДанныеСортировкиНаСервере(ДанныеПакета, ПолучитьКатегориюПоНоменклатуре(Номенклатура)); 
	//\\

	УстановкаРассчетныхПараметров();
	
	//доступность генерировать серийный номер
	УстановитьДоступностьДобавитьСН(); 
	//\\ 
	
	ОбновитьСписокИИтоги(); 
		
КонецПроцедуры
//ТА
&НаКлиенте
Процедура ЗаполнениеЧерезНомерПакета(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВводаНомера", ЭтаФорма);
	
	ПоказатьВводЗначения(ОписаниеОповещения,"", "Введите номер пакета со сканера", Тип("Число")); 
	
КонецПроцедуры 
//ТА
&НаСервереБезКонтекста
Функция ПолучитьКатегориюПоНоменклатуре(Номенклатура)
		
	Возврат Номенклатура.КатегорияНоменклатуры;

КонецФункции
//ТА
//получаем структуру пакета 
&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПакета(ЛинияСортировки,НомерПакета=0)
		
	Если ЛинияСортировки = "ПФМ1 (сухой)" Тогда 
		ЛинияСортировкиПредставление = "ПФМ_ПМ_Сухой"; 
	Иначе
		ЛинияСортировкиПредставление = "ПФМ_ПМ_Сырой";
	КонецЕсли; 
	
	ДанныеПакета = алк_ВнешниеИсточникиДанныхСервер.ПолучитьДанныеСоСканераПФМ(ЛинияСортировкиПредставление,НомерПакета);
	
	Если ДанныеПакета = Неопределено Тогда 
		Возврат Неопределено;
	Иначе 
		//если несколько строк в запросе, значит отличаюся длины
		Если ДанныеПакета.Количество() > 1 Тогда  
			ОдноСечение = Ложь;
		Иначе
			ОдноСечение = Истина;
		КонецЕсли;  
		
		ДанныеПакета = ДанныеПакета[0];
	КонецЕсли; 
	
	Габарит = УстановитьГабаритПоДаннымИзСканера(ДанныеПакета.TextPileTypes);
	
	СтруктураПакета = Новый Структура;
	
	СтруктураПакета.Вставить("Влажность", ДанныеПакета.Humidity);
	СтруктураПакета.Вставить("Длина", ДанныеПакета.Ln);
	СтруктураПакета.Вставить("КоличествоСостав", ДанныеПакета.BoardsQuantity);
	СтруктураПакета.Вставить("ПородаИД", ДанныеПакета.BreedID);  
	СтруктураПакета.Вставить("Припуск", ДанныеПакета.Allowance);
	СтруктураПакета.Вставить("СортИД", ДанныеПакета.QualityID);
	СтруктураПакета.Вставить("Толщина", ДанныеПакета.Hn);
	СтруктураПакета.Вставить("Ширина", ДанныеПакета.Wn);   
	СтруктураПакета.Вставить("НомерПакетаСоСканера", ДанныеПакета.PileNr);
	СтруктураПакета.Вставить("КатегорияПЭО", ДанныеПакета.LumberCategor);
	СтруктураПакета.Вставить("ТипПакета", ДанныеПакета.TextPileTypes); //сушильный или нет
	СтруктураПакета.Вставить("Номенклатура", ПолучитьНоменклатуруИзСканера(ДанныеПакета.TextPileTypes)); //для проверки, что пакет со сканера совпадает с пакетом из рабочего места 
	СтруктураПакета.Вставить("Габарит", Габарит); //составной как в Алогистике представление + в сканере
	СтруктураПакета.Вставить("ОдноСечение", ОдноСечение); 
	
	Возврат СтруктураПакета;   
	
КонецФункции  

&НаСервереБезКонтекста
Функция  УстановитьГабаритПоДаннымИзСканера(ГабаритСоСканера)
	
	ДанныеПоГабариту = Новый Структура;
	
	ДанныеПоГабариту.Вставить("ДляСканера", ГабаритСоСканера);
	
	ГабаритДляАлогистик = Неопределено;
	
	Если ГабаритСоСканера = "KD 1.2" ИЛИ ГабаритСоСканера = "KD 1.1" ИЛИ ГабаритСоСканера = "KD 0.9" Тогда
		ГабаритДляАлогистик = Перечисления.алк_ГабаритПакета.Контейнерный;
	КонецЕсли; 
	
	Если ГабаритСоСканера = "ТП 1.2" Тогда
		ГабаритДляАлогистик = Перечисления.алк_ГабаритПакета.Габаритный;
	КонецЕсли;
	
	Если ГабаритСоСканера = "ТП 0.9" Тогда
		ГабаритДляАлогистик = Перечисления.алк_ГабаритПакета.Шапочный;
	КонецЕсли;
	
	Если ГабаритСоСканера = "СП" Тогда
		ГабаритДляАлогистик = ""; // у СП пакетов нет габарита
	КонецЕсли;
	
	Если ГабаритДляАлогистик = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеПоГабариту.Вставить("Для1с", ГабаритДляАлогистик);
	
	Возврат ДанныеПоГабариту;

КонецФункции

//ид в сканере (для породы)
&НаСервереБезКонтекста
Функция ПолучитьПородуПоКоду(ИД)
	
	
	Если ИД = 2 Тогда 
		Возврат Справочники.Породы.НайтиПоКоду("000000001"); //Ель
	КонецЕсли;
	
	Если ИД = 3 Тогда 
		Возврат Справочники.Породы.НайтиПоКоду("000000004"); //Лиственница
	КонецЕсли;
	
	Если ИД = 4 Тогда 
		Возврат Справочники.Породы.НайтиПоКоду("000000003"); //Пихта
	КонецЕсли; 
	
	Возврат  Справочники.Породы.ПустаяСсылка();
			
КонецФункции
//ид в сканере (для сорта)
&НаСервереБезКонтекста
Функция ПолучитьСортПоКоду(ИД,ТипПакета)
	
	Если ТипПакета = "СП" Тогда
		Возврат Справочники.Сорта.ПустаяСсылка();
	КонецЕсли;
		
	Если ИД = 1 Тогда 
		Возврат Справочники.Сорта.НайтиПоКоду("000000005"); //1-3 сорт
	КонецЕсли;
	
	Если ИД = 2 Тогда 
		Возврат Справочники.Сорта.НайтиПоКоду("000000001"); //1-4 сорт
	КонецЕсли;
	
	Если ИД = 3 Тогда 
		Возврат Справочники.Сорта.НайтиПоКоду("000000016"); //1-5 сорт
	КонецЕсли; 
	
	Если ИД = 4 Тогда 
		Возврат Справочники.Сорта.НайтиПоКоду("000000006"); //4 сорт
	КонецЕсли; 
	
	Если ИД = 5 Тогда 
		Возврат Справочники.Сорта.НайтиПоКоду("000000002"); //5 сорт
	КонецЕсли;  
	
	Если ИД = 8 ИЛИ ИД = 9 Тогда  
		Возврат Справочники.Сорта.НайтиПоКоду("000000009"); //5к
	КонецЕсли;  
		
	Если ИД = 10 Тогда 
		Возврат Справочники.Сорта.НайтиПоКоду("000000022"); //5 ОТ
	КонецЕсли; 
	
	Возврат Справочники.Сорта.ПустаяСсылка();
		
КонецФункции
//соотносим номенклатуру из сканера с Алогистиком
&НаСервереБезКонтекста
Функция  ПолучитьНоменклатуруИзСканера(ТипПакета)
	
	Если Не ЗначениеЗаполнено(ТипПакета) Тогда 
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипПакета = "СП" Тогда
		Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012"); //ПМ СП   
	Иначе
		Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"); //ПМ   
	КонецЕсли;
		
КонецФункции
//проверка пакета на корректность получения данных перед заполнением РМ
&НаСервере
Функция ПрошелПакетПроверкуПередЗаполнениемРМ(ДанныеПакета)
	
	//Характеристика = "";
	//КоличествоСостав = "";
	//КоличествоСостав1 = ""; 
	
	НеобходимоПроверятьПослеИзмененияНоменклатурыВАвтоРежиме = Ложь;
	
	//проверяем на ошибку получения данных (если запрос пустой)
	Если ДанныеПакета = Неопределено Тогда
		Если АвтоматическоеЗаполнение Тогда
			АвтоматическоеЗаполнение = Ложь;
			ИзменениеНаФормеПриАвтозаполнение(Истина); //очищаем поля прошлого пакета 
		КонецЕсли;
		Сообщить("Ошибка получения данных!");
		Возврат Ложь;
	КонецЕсли;
	//\\

	//тип пакета не был заполнен
	Если Не ЗначениеЗаполнено(ДанныеПакета.Номенклатура) Тогда 
		Если АвтоматическоеЗаполнение Тогда
			АвтоматическоеЗаполнение = Ложь;
			ИзменениеНаФормеПриАвтозаполнение(Истина); //очищаем поля прошлого пакета
		КонецЕсли;
		Сообщить("Ошибка получения данных! Не указан тип пакета в базе сканера.");
		Возврат Ложь;
	КонецЕсли;
	
	//совпадает ли номенклатура со сканера с номенклатурой в рм 
	Если Номенклатура <> ДанныеПакета.Номенклатура Тогда 
		Если АвтоматическоеЗаполнение Тогда 
			Если ДанныеПакета.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001") Тогда 
				Вариант = 2;
			Иначе 
				Вариант = 3;
			КонецЕсли; 
			//при изменение типа пакета
			ТипПакетаПриИзмененииНаСервере(); 
			//\\
			//АвтоматическоеЗаполнение = Ложь;
			//ИзменениеНаФормеПриАвтозаполнение(Истина); //очищаем поля прошлого пакета
			НеобходимоПроверятьПослеИзмененияНоменклатурыВАвтоРежиме = Истина;
		КонецЕсли; 
		Если Не НеобходимоПроверятьПослеИзмененияНоменклатурыВАвтоРежиме Тогда 
			Сообщить("Номенклатура пакета, указанная в рабочем месте не совпадает с номенклатурой, полученной из сканера!");
			Возврат Ложь; 
		КонецЕсли;
	КонецЕсли;  
	//\\ 
	
	СерийныйНомерВБазе = ВозвратСерийногоНомераПоНомеруПакетаИзСканера(Строка(ДанныеПакета.НомерПакетаСоСканера),Объект.ЛинияСортировки);
	
	Если СерийныйНомерВБазе <> Неопределено Тогда
		Если АвтоматическоеЗаполнение Тогда
			Возврат Ложь;  
		КонецЕсли;
		Сообщить(СтрШаблон("По пакету сканера %1 уже заполнен пакет %2!",ДанныеПакета.НомерПакетаСоСканера,СерийныйНомерВБазе));  
		ИзменениеНаФормеПриАвтозаполнение(Истина); 
		Возврат Ложь;
	КонецЕсли;
	
	//пакет из сканера без габарита
	Если ДанныеПакета.Габарит = Неопределено Тогда
		Если АвтоматическоеЗаполнение Тогда
			АвтоматическоеЗаполнение = Ложь;
			ИзменениеНаФормеПриАвтозаполнение(Истина); //очищаем поля прошлого пакета
		КонецЕсли;
		Сообщить("Не найден подходящий габарит для данного пакета!");
		Возврат Ложь;
	КонецЕсли;  
	//\\ 
			
	Возврат Истина;
	
КонецФункции
//ид в сканере (для влажности)
&НаСервереБезКонтекста
Функция ПолучитьВлажностьПоКоду(ИД)
	
	Если ИД = 1 Тогда 
		Возврат Справочники.Влажность.НайтиПоКоду("000000002"); //12%
	КонецЕсли;
	
	Если ИД = 2 Тогда 
		Возврат Справочники.Влажность.НайтиПоКоду("000000003"); //18%
	КонецЕсли;
	
	Если ИД = 3 Тогда 
		Возврат Справочники.Влажность.НайтиПоКоду("000000001"); //Gr
	КонецЕсли; 
	
	Возврат  Справочники.Влажность.ПустаяСсылка();
			
КонецФункции

&НаСервереБезКонтекста
Функция ВозвратСерийногоНомераПоНомеруПакетаИзСканера(НомерПакета,ЛинияСортировки)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ДанныеСоСканераСрезПоследних.СерийныйНомер
	               |ИЗ
	               |	РегистрСведений.алк_ДанныеСоСканера.СрезПоследних(
	               |			,
	               |			ПФМ = &ПФМ
	               |				И НомерПакетаНаСортировки = &НомерПакетаНаСортировки) КАК алк_ДанныеСоСканераСрезПоследних";
	
	Запрос.УстановитьПараметр("НомерПакетаНаСортировки", НомерПакета);
	Запрос.УстановитьПараметр("ПФМ", ЛинияСортировки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.СерийныйНомер;
	КонецЦикла;
	
	Возврат Неопределено;
			
КонецФункции

&НаКлиенте
Процедура ТипПакетаПриИзменении(Элемент)
	
	ТипПакетаПриИзмененииНаСервере(); 
	
	//очищаем все поля
	Характеристика = ""; 
	Припуск = ""; 
	КатегорияНоменклатурыПЭО = "";  
	КоличествоСостав = "";
	КоличествоСостав1 = "";
	Габарит = "";
	СерийныйНомер = "";
	НомерПакета = "";
	ОбъемТаможня = "";
	Объем = "";
	СообщениеОбАвтоПечати = "";
	Габарит = "";
	
	Элементы.ДобавитьСерийныйНомер.Доступность = Ложь;  
	Элементы.ДобавитьМассивСерийныхНомеров.Доступность = Ложь;
	//\\
	
КонецПроцедуры

&НаСервере
Процедура ТипПакетаПриИзмененииНаСервере()  
	
	УстановитьНастройки(Вариант);
	  
	СписокВыбораН = Элементы.Номенклатура.СписокВыбора;
	
	Если НЕ СписокВыбораН.Количество() = 0 Тогда 
		Номенклатура = Элементы.Номенклатура.СписокВыбора[0].Значение; 
	КонецЕсли;
	
	ШаблонСерийногоНомера = ПолучитьШаблонСН(); 
	
	//УстановитьОтборыВСписке(); //ТА при изменении типа пакета нужно, чтобы отбор по сн в тч поменялся
	ОбновитьСписокИИтоги();
	
	УстанавливаемКоличествоЭтикетокПоТипуПакета();

КонецПроцедуры

&НаСервере
Процедура УстанавливаемКоличествоЭтикетокПоТипуПакета()
	
	//установим кол-о этикеток
	Если Вариант = 2 Тогда 
		КоличествоЭкземпляров = 4;
	ИначеЕсли Вариант = 3 Тогда 
		КоличествоЭкземпляров = 1;
	ИначеЕсли Вариант = 8 Тогда 
		КоличествоЭкземпляров = 4;
	КонецЕсли;
	//\\
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписокИИтоги();
КонецПроцедуры

//заблокировать или очистить поля при смены автозаполнение 
&НаСервере
Процедура ИзменениеНаФормеПриАвтозаполнение(РучноеИзменениеЗначенияАвтозаполнения)
	

	Если АвтоматическоеЗаполнение Тогда 
		
		Элементы.Номенклатура.Доступность = Ложь; 
		Элементы.Характеристика.Доступность = Ложь; 
		Элементы.Припуск.Доступность = Ложь;
		Элементы.КатегорияНоменклатурыПЭО.Доступность = Ложь; 
		Элементы.КоличествоСостав.Доступность = Ложь;     
		Элементы.Габарит.Доступность = Ложь; 
		Элементы.ТипПакета.Доступность = Ложь;
		
		Элементы.ДобавитьСерийныйНомер.Доступность = Ложь;  
		Элементы.ДобавитьМассивСерийныхНомеров.Доступность = Ложь; 
		Элементы.СписокСоздатьПакет.Доступность = Ложь;
		Элементы.СписокСоздатьПакетПечать.Доступность = Ложь; 
		Элементы.СписокЗаполнитьДанныеСортировки.Доступность = Ложь;
		Элементы.СписокВвестиНомерПакета.Доступность = Ложь; 
		
		Элементы.Фон.ЦветФона = Новый Цвет(193, 255, 181);
			
	Иначе 		
		
		//отменяем блокировку
		Элементы.Номенклатура.Доступность = Истина; 
		Элементы.Характеристика.Доступность = Истина; 
		Элементы.Припуск.Доступность = Истина;
		Элементы.КатегорияНоменклатурыПЭО.Доступность = Истина; 
		Элементы.КоличествоСостав.Доступность = Истина; 
		Элементы.Габарит.Доступность = Истина; 
		Элементы.ТипПакета.Доступность = Истина;
	
		Элементы.СписокСоздатьПакет.Доступность = Истина;
		Элементы.СписокСоздатьПакетПечать.Доступность = Истина;
		Элементы.ДобавитьСерийныйНомер.Доступность = Истина;  
		Элементы.ДобавитьМассивСерийныхНомеров.Доступность = Истина;
		Элементы.СписокЗаполнитьДанныеСортировки.Доступность = Истина;
		Элементы.СписокВвестиНомерПакета.Доступность = Истина;
		//\\
		
		Если РучноеИзменениеЗначенияАвтозаполнения Тогда  
			//очищаем 
			Характеристика = ""; 
			Припуск = ""; 
			КатегорияНоменклатурыПЭО = "";  
			КоличествоСостав = "";
			КоличествоСостав1 = "";
			Габарит = "";
			СерийныйНомер = "";
			НомерПакета = "";
			ОбъемТаможня = "";
			Объем = "";
			СообщениеОбАвтоПечати = "";
			Габарит = "";
			//\\ 
			
			//чистим параметры
			ОчищаемПараметрыФормы();
			//\\
			
			Элементы.ДобавитьСерийныйНомер.Доступность = Ложь;  
			Элементы.ДобавитьМассивСерийныхНомеров.Доступность = Ложь;
		КонецЕсли;  
		
		Элементы.Фон.ЦветФона = Новый Цвет(255, 255, 255);
				
	КонецЕсли;
		
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАвтоматическуюПечать()
	
	Если АвтоматическоеЗаполнение Тогда 
		ПодключитьОбработчикОжидания("ЗаполнитьДаннымиСоСканера",10,Ложь);
	Иначе
		ОтключитьОбработчикОжидания("ЗаполнитьДаннымиСоСканера");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеЗаполнениеПриИзменении(Элемент)
	
	ИзменениеНаФормеПриАвтозаполнение(Истина); 
	
	УстановитьАвтоматическуюПечать();
	
КонецПроцедуры

&НаСервере
Процедура ОчищаемПараметрыФормы() 
	//очищаем параметры 
	Параметры.Влажность = "";
	Параметры.Длина = "";
	Параметры.КоличествоСостав = "";
	Параметры.Порода = "";
	Параметры.Припуск = "";
	Параметры.Сорт = "";
	Параметры.Толщина = "";
	Параметры.Ширина = ""; 
	Параметры.НомерПакетаСоСканера = "";
	Параметры.КатегорияПЭО = "";
	Параметры.ТипПакета = "";
	//\\
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//смена либо закрыта, либо заблокирована
Функция ЗапрещеноМенятьДокумент(Участок,ДатаСмены,Смена) 
	
	//Получим документ производства
	ПараметрыПроизводства = Документы.алк_Производство.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
	ПараметрыПроизводства.Участок = Участок;
	ПараметрыПроизводства.Операция = ПредопределенноеЗначение("Справочник.алк_ОперацииПроизводства.Упаковка");
	ПараметрыПроизводства.ДатаСмены = ДатаСмены;
	ПараметрыПроизводства.Смена = Смена;
	
	ДокументТекущегоПроизводства = алк_ПроизводствоСервер.ПолучитьДокументПроизводстваТекущейСмены(ПараметрыПроизводства, Истина); 
	
	//Проверим его статус
	Если ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Закрыт Тогда
		Сообщить("Ошибка! Смена закрыта мастером. Создание новых пакетов запрещено в закрытой смене. Возможно неверно заполнены реквизиты смены. Проверьте реквизиты смены или обратитесь к мастеру.");
		Возврат Истина;
	ИначеЕсли ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Заблокирован Тогда
		Сообщить("Ошибка! Мастер заблокировал документ. Дождитесь разблокировки или обратитесь к мастеру.");
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

