
&НаКлиенте
Процедура ПерерисоватьЧасы()

	Ч1 = Цел((Время - Дата('0001.01.01'))/36000);
	Ч2 = Цел((Время - Дата('0001.01.01'))/3600)- Ч1*10;
	
	М = Формат(Время, "ДФ=mm");
	М1 = Лев(М, 1);
	М2 = Прав(М, 1);

КонецПроцедуры

&НаКлиенте
Процедура Плюс1(Команда)
	
	Время = Время + 60; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Плюс10(Команда)
	
	Время = Время + 600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Плюс60(Команда)
	
	Время = Время + 3600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Минус1(Команда)
	
	Время = Время - 60; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Минус10(Команда)
	
	Время = Время - 600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура Минус60(Команда)
	
	Время = Время - 3600; 	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПриИзменении(Элемент)
	
	ПерерисоватьЧасы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВремя(Команда)
	
	ЭтаФорма.Закрыть(Время);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВремяНачала") и Параметры.Свойство("ВремяЗавершения") Тогда
		Если Параметры.ВремяНачала > Параметры.ВремяЗавершения Тогда
			Параметры.ВремяНачала 		= Параметры.ВремяНачала + 8*3600;
			Параметры.ВремяЗавершения 	= Параметры.ВремяЗавершения + 8*3600;	
		КонецЕсли;
		ЭтаФорма.Время = Дата('0001.01.01') + (Параметры.ВремяЗавершения - Параметры.ВремяНачала); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПерерисоватьЧасы();
КонецПроцедуры





