#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПогрузкаСудовыхПартий, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура,
		|	алк_ПогрузкаСудовыхПартийЗапасы.КоличествоПакетов,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Организация,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
		|ГДЕ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Дата КАК ДатаСобытия,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Дата КАК Период,
		|	алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Судно) КАК Операция,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|ИЗ
		|	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Организация,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_ПогрузкаСудовыхПартийЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА алк_ПогрузкаСудовыхПартийЗапасы.ВесНетто
		|		ИНАЧЕ алк_ПогрузкаСудовыхПартийЗапасы.ОбъемТаможня
		|	КОНЕЦ КАК Количество,
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
		|ГДЕ
		|	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка = &Ссылка
		|	И алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = ""ПБ-00000018""";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПогрузкаСудовыхПартий);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаПогрузкаСудовыхПартий.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[2].Выгрузить());   // Только для пеллет: алк_ПогрузкаСудовыхПартийЗапасы.Номенклатура.Код = "ПБ-00000018"
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли