
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);  
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

///////////////////////////////// ТП "Т_Распилено" ////////////////////////////////////

&НаКлиенте
Процедура Т_РаспиленоКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Распилено.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Распилено.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрРаспилено Из Объект.Т_Распилено Цикл
			
			МассивКлючей.Добавить(стрРаспилено.КлючСвязи);
			
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.КлючСвязи = МаксЭлемент.Значение + 1;
			
		Иначе
			
			Элемент.ТекущиеДанные.КлючСвязи = 1;
			
		КонецЕсли; 
		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Т_Распилено.ТекущиеДанные = Неопределено Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элементы.Т_Распилено.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.Т_Выход.ТекущиеДанные.КлючСвязи    = Элементы.Т_Распилено.ТекущиеДанные.КлючСвязи;
		
		УстановитьОтборТаблицы(Элемент);
		
	Иначе
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборТаблицы(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПередУдалением(Элемент, Отказ)
	
	КлючКУдалению = Элемент.ТекущиеДанные.КлючСвязи;
	
	Индекс = Объект.Т_Выход.Количество() - 1; 
	
	Пока Индекс >= 0 Цикл 
		
		Если Объект.Т_Выход[Индекс].КлючСвязи = КлючКУдалению Тогда 
			Объект.Т_Выход.Удалить(Индекс); 
		КонецЕсли; 
		
		Индекс = Индекс - 1; 
		
	КонецЦикла;	

КонецПроцедуры

///////////////////////////////// ТП "Т_Выход" ////////////////////////////////////

&НаКлиенте
Процедура Т_ВыходКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Выход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Выход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);

КонецПроцедуры

#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ЗаполнитьРапортНаСервере()
	
	ЗаполнитьДанныеУпаковкаНаСервере();

	//ЗаполнитьДанныеОтходыНаСервере();
	//ЗаполнитьДанныеСГПНаСервере();
	//ЗаполнитьДанныеУпаковкаНаСервере();
	//ЗаполнитьДанныеСырьеНаСервере();
	//ЗаполнитьДанныеСортировкаНаСервере();
	//ЗаполнитьДанныеПриемкаСырьяНаСервере();
	//ЗаполнитьДанныеПереупаковкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРапорт(Команда)
	ЗаполнитьРапортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеУпаковкаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеРегистры.Организация,
	|	РабочиеРегистры.Номенклатура,
	|	РабочиеРегистры.Характеристика,
	|	РабочиеРегистры.ЗаказПокупателя,
	|	РабочиеРегистры.СерийныйНомер,
	|	РабочиеРегистры.ДатаСмены,
	|	РабочиеРегистры.Смена,
	|	РабочиеРегистры.КоличествоПакетовОборот,
	|	РабочиеРегистры.ПериодУпаковки,
	|	РабочиеРегистры.КоличествоСостав,
	|	РабочиеРегистры.Объем,
	|	РабочиеРегистры.СертификатFSC,
	|	РабочиеРегистры.ОбъемТаможня,
	|	РабочиеРегистры.ВесНеттоТаможня,
	|	РабочиеРегистры.ВесБруттоТаможня,
	|	ОперативныйРегистр.ДопАналитика КАК ДопАналитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_ВыпускПродукцииСерииОбороты.Организация КАК Организация,
	|		алк_ВыпускПродукцииСерииОбороты.Номенклатура КАК Номенклатура,
	|		алк_ВыпускПродукцииСерииОбороты.Характеристика КАК Характеристика,
	|		алк_ВыпускПродукцииСерииОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|		алк_ВыпускПродукцииСерииОбороты.СерийныйНомер КАК СерийныйНомер,
	|		алк_ВыпускПродукцииСерииОбороты.ДатаСмены КАК ДатаСмены,
	|		алк_ВыпускПродукцииСерииОбороты.Смена КАК Смена,
	|		алк_ВыпускПродукцииСерииОбороты.КоличествоПакетовОборот КАК КоличествоПакетовОборот,
	|		алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ПериодУпаковки,
	|		алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК КоличествоСостав,
	|		алк_ПараметрыПакетовСрезПоследних.Объем КАК Объем,
	|		алк_ПараметрыПакетовСрезПоследних.СертификатFSC КАК СертификатFSC,
	|		алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня КАК ОбъемТаможня,
	|		алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНеттоТаможня,
	|		алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоТаможня
	|	ИЗ
	|		РегистрНакопления.алк_ВыпускПродукцииСерии.Обороты(
	|				,
	|				,
	|				Запись,
	|				ДатаСмены = &ДатаСмены
	|					И Смена = &Смена
	|					И Номенклатура.КатегорияНоменклатуры В (&спКатегорияОтходы)) КАК алк_ВыпускПродукцииСерииОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|				ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ПО алк_ВыпускПродукцииСерииОбороты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер) КАК РабочиеРегистры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	|			алк_ПараметрыПакетовОперативныйСрезПоследних.ДопАналитика КАК ДопАналитика
	|		ИЗ
	|			РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(
	|					,
	|					Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)
	|						И ДатаСмены = &ДатаСмены
	|						И Смена = &Смена) КАК алк_ПараметрыПакетовОперативныйСрезПоследних) КАК ОперативныйРегистр
	|		ПО РабочиеРегистры.СерийныйНомер = ОперативныйРегистр.СерийныйНомер";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	спКатегорияОтходы = Новый СписокЗначений;
	спКатегорияОтходы.Добавить(Справочники.КатегорииНоменклатуры.ШпонКусковой);
	спКатегорияОтходы.Добавить(Справочники.КатегорииНоменклатуры.Карандаши);
	спКатегорияОтходы.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000005")); //Чурак оцилиндрованный (кат)
	
	Запрос.УстановитьПараметр("спКатегорияОтходы", спКатегорияОтходы);

	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Объект.ДанныеУпаковка.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеУпаковка(Команда)
	
	ПроверитьЗаполениеРеквизитовСмены();
	ЗаполнитьДанныеУпаковкаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСГПНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ЗапасыНаСкладахСерии.Организация,
	|	алк_ЗапасыНаСкладахСерии.СтруктурнаяЕдиница,
	|	алк_ЗапасыНаСкладахСерии.Ячейка,
	|	алк_ЗапасыНаСкладахСерии.Номенклатура,
	|	алк_ЗапасыНаСкладахСерии.СерийныйНомер,
	|	алк_ЗапасыНаСкладахСерии.ЗаказПокупателя,
	|	алк_ЗапасыНаСкладахСерии.КоличествоПакетов,
	|	алк_ЗапасыНаСкладахСерии.ДатаСмены,
	|	алк_ЗапасыНаСкладахСерии.Смена
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыНаСкладахСерии КАК алк_ЗапасыНаСкладахСерии
	|ГДЕ
	|	алк_ЗапасыНаСкладахСерии.Активность
	|	И алк_ЗапасыНаСкладахСерии.СтруктурнаяЕдиница = &СГП
	|	И алк_ЗапасыНаСкладахСерии.ДатаСмены = &ДатаСмены
	|	И алк_ЗапасыНаСкладахСерии.Смена = &Смена
	|	И алк_ЗапасыНаСкладахСерии.Операция = ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства)
	|	И алк_ЗапасыНаСкладахСерии.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("СГП", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.СГП));
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ПередачаНаСГП.Загрузить(РезультатЗапроса.Выгрузить());
	
	ТекстЗапроса = Запрос.Текст;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПередачаИзПроизводства", "ВозвратНаПроизводство");
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ВозвратС_СГП.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСГП(Команда)
	
	ПроверитьЗаполениеРеквизитовСмены();
	ЗаполнитьДанныеСГПНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСырьеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ЗапасыОрганизации.Организация,
	|	алк_ЗапасыОрганизации.СтруктурнаяЕдиница,
	|	алк_ЗапасыОрганизации.Ячейка,
	|	алк_ЗапасыОрганизации.Номенклатура,
	|	алк_ЗапасыОрганизации.ДатаСмены,
	|	алк_ЗапасыОрганизации.Смена,
	|	алк_ЗапасыОрганизации.Количество,
	|	алк_ЗапасыОрганизации.Объем,
	|	алк_ЗапасыОрганизации.Характеристика
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации КАК алк_ЗапасыОрганизации
	|ГДЕ
	|	алк_ЗапасыОрганизации.Активность
	|	И алк_ЗапасыОрганизации.СтруктурнаяЕдиница = &Участок
	|	И алк_ЗапасыОрганизации.ДатаСмены = &ДатаСмены
	|	И алк_ЗапасыОрганизации.Смена = &Смена
	|	И алк_ЗапасыОрганизации.Операция = ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПроизводство)
	|	И алк_ЗапасыОрганизации.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Участок", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ПереданоСырьяВПроизводство.Загрузить(РезультатЗапроса.Выгрузить());
	
	ТекстЗапроса = Запрос.Текст;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПередачаНаПроизводство", "ВозвратИзПроизводства");
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	//Объект.ВозвратС_СГП.Загрузить(РезультатЗапроса.Выгрузить());	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСырье(Команда)
	ЗаполнитьДанныеСырьеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСортировкаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СортировкаЛесопродукцииОбороты.Номенклатура,
	|	алк_СортировкаЛесопродукцииОбороты.Партия,
	|	алк_СортировкаЛесопродукцииОбороты.Порода,
	|	алк_СортировкаЛесопродукцииОбороты.Сорт,
	|	алк_СортировкаЛесопродукцииОбороты.Длина,
	|	алк_СортировкаЛесопродукцииОбороты.Сечение,
	|	алк_СортировкаЛесопродукцииОбороты.КоличествоОборот КАК Количество,
	|	алк_СортировкаЛесопродукцииОбороты.ОбъемОборот КАК Объем
	|ИЗ
	|	РегистрНакопления.алк_СортировкаЛесопродукции.Обороты КАК алк_СортировкаЛесопродукцииОбороты
	|ГДЕ
	|	алк_СортировкаЛесопродукцииОбороты.ДатаСмены = &ДатаСмены
	|	И алк_СортировкаЛесопродукцииОбороты.Смена = &Смена";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.Сортировка.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСортировка(Команда)
	ЗаполнитьДанныеСортировкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПриемкаСырьяНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(алк_ЗапасыОрганизацииОбороты.КоличествоПриход) КАК Количество,
	|	СУММА(алк_ЗапасыОрганизацииОбороты.ОбъемПриход) КАК Объем,
	|	алк_ЗапасыОрганизацииОбороты.Номенклатура,
	|	алк_ЗапасыОрганизацииОбороты.Характеристика,
	|	алк_ЗапасыОрганизацииОбороты.Регистратор.ВидТранспортировки КАК ВидТранспортировки,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка КАК Штабель
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДатаСмены = &ДатаСмены
	|				И Смена = &Смена
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_ЗапасыОрганизацииОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ЗапасыОрганизацииОбороты.Номенклатура,
	|	алк_ЗапасыОрганизацииОбороты.Регистратор.ВидТранспортировки,
	|	алк_ЗапасыОрганизацииОбороты.Характеристика,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ПринятоСырьяУСЛ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПриемкаСырья(Команда)
	ЗаполнитьДанныеПриемкаСырьяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПереупаковкаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПереупаковка(Команда)
	ЗаполнитьДанныеПереупаковкаНаСервере();
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполениеРеквизитовСмены()
	
	Если Не ЗначениеЗаполнено(Объект.ДатаСмены) ИЛИ Не ЗначениеЗаполнено(Объект.Смена) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните реквизиты смены!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 


#Область ИнтерфейсныеПроцедуры

&НаКлиенте
Процедура УстановитьОтборТаблицы(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", Элемент.ТекущиеДанные.КлючСвязи);
		
		Элементы.Т_Выход.ОтборСтрок = СтруктураОтбора;
		
	Иначе
		
		Элементы.Т_Выход.ОтборСтрок = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьОтборТаблицы

	
#КонецОбласти 


Процедура Конец()	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры








