
&НаСервере
Процедура ПроблемыПриИзмененииНаСервере() 	
	
	РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.ЗаписатьДопСведения(Объект.ДатаСмены, Объект.Смена,
		Справочники.алк_Участки.ПустаяСсылка(), Объект.Проблемы.Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура ПроблемыПриИзменении(Элемент)
	ПроблемыПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ДатаСменыПриИзмененииНаСервере()
	//Заполняем проблемы участка	
	Объект.Проблемы.Загрузить(РегистрыСведений.алк_ДополнительныеСведенияПоУчасткам.ВернутьПроблемыУчастка(Объект.ДатаСмены
			,Объект.Смена, Справочники.алк_Участки.ПустаяСсылка()));   
	//\\
КонецПроцедуры


&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ДатаСменыПриИзмененииНаСервере();
КонецПроцедуры

