

#Область УправлениеПроведением

// Выполняет движения регистра сведений алк_ПараметрыПакетов.
//
Процедура ОтразитьПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Пиломатериал = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Пиломатериал);
	
	ТаблицаПараметрыПакетов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПараметрыПакетов;
	
	Если Отказ
		ИЛИ ТаблицаПараметрыПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Нач мод [Пакушев И.С.] [15.07.2019] 
	// Обращение № [0000110988] [при упаковке пакетов пиломатериалов в программе мы видим один объем, на этикетке распечатывается другой]
	// Было
	//Если ДополнительныеСвойства.ДляПроведения.Ссылка.Направление = Перечисления.алк_НаправленияДеятельности.Лесопиление Тогда 		
	//	ТаблицаПараметрыПакетов.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));  	
	//Иначе                                                                                                                 		
	//	ТаблицаПараметрыПакетов.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));  		
	//КонецЕсли;
	//ТаблицаПараметрыПакетов.Колонки.Добавить("ОбъемТаможня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	// Стало
	Если ТаблицаПараметрыПакетов.Колонки.Найти("Объем") = Неопределено Тогда
		ТаблицаПараметрыПакетов.Колонки.Добавить("Объем", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	Если ТаблицаПараметрыПакетов.Колонки.Найти("ОбъемТаможня") = Неопределено Тогда
		ТаблицаПараметрыПакетов.Колонки.Добавить("ОбъемТаможня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	КонецЕсли; 
		
	// Кон мод [Пакушев И.С.] [15.07.2019]
	Если ТаблицаПараметрыПакетов.Колонки.Найти("ВесНеттоТаможня") = Неопределено Тогда                                          
		ТаблицаПараметрыПакетов.Колонки.Добавить("ВесНеттоТаможня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	КонецЕсли; 
	
	Если ТаблицаПараметрыПакетов.Колонки.Найти("ВесБруттоТаможня") = Неопределено Тогда
		ТаблицаПараметрыПакетов.Колонки.Добавить("ВесБруттоТаможня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	КонецЕсли; 
	
	Если ТаблицаПараметрыПакетов.Колонки.Найти("БоковаяДоска") = Неопределено Тогда
		ТаблицаПараметрыПакетов.Колонки.Добавить("БоковаяДоска", Новый ОписаниеТипов("Булево"));
	КонецЕсли; 
	
	Если ТаблицаПараметрыПакетов.Колонки.Найти("Припуск") = Неопределено Тогда
		ТаблицаПараметрыПакетов.Колонки.Добавить("Припуск", Новый ОписаниеТипов("СправочникСсылка.алк_ВариантыПрипуска"));
	КонецЕсли; 
	
	
	Для каждого стрПакет Из ТаблицаПараметрыПакетов Цикл
		
		Если Не стрПакет.Номенклатура.КатегорияНоменклатуры.Код = "ПБ-000006" Тогда  // для прочей продукции используются данные регистра ПараметрыПакетовОперативный
		   	  
			РассчетныеПараметры = ЗаполнитьСтруктуруПараметровПакета(стрПакет, ДополнительныеСвойства.ДляПроведения.Дата, ПолучитьПараметрыПрипуска(стрПакет.Припуск));		
			ЗаполнитьЗначенияСвойств(стрПакет, РассчетныеПараметры);
			
		КонецЕсли; 
		
	КонецЦикла; 	
	
	ДвиженияПараметрыПакетов = Движения.алк_ПараметрыПакетов;
	ДвиженияПараметрыПакетов.Записывать = Истина;
	ДвиженияПараметрыПакетов.Загрузить(ТаблицаПараметрыПакетов);
	
КонецПроцедуры //ОтразитьПараметрыПакетов() 

//Выполняет движения регистра сведений алк_ДополнительныеПараметрыПакетов.
Процедура ОтразитьДополнительныеПараметрыПакетов(ДополнительныеСвойства, Движения, Отказ) Экспорт
		
	ТаблицаДополнительныеПараметрыПакетов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДополнительныеПараметрыПакетов;
	
	Если Отказ
		ИЛИ ТаблицаДополнительныеПараметрыПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ТаблицаДополнительныеПараметрыПакетов.Колонки.Найти("Припуск") = Неопределено Тогда
		ТаблицаДополнительныеПараметрыПакетов.Колонки.Добавить("Припуск", Новый ОписаниеТипов("СправочникСсылка.алк_ВариантыПрипуска"));
	КонецЕсли; 
	
	
	Для Каждого стр ИЗ ТаблицаДополнительныеПараметрыПакетов Цикл
		
		Если ЗначениеЗаполнено(стр.Припуск) ИЛИ ЗначениеЗаполнено(стр.КатегорияНоменклатурыПЭО) ИЛИ ЗначениеЗаполнено(стр.Габарит)
			ИЛИ ЗначениеЗаполнено(стр.ВидШпона) ИЛИ ЗначениеЗаполнено(стр.СлойДревесины) Тогда  
			
			МенеджерЗаписи = РегистрыСведений.алк_ДополнительныеПараметрыПакетов.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,стр);  
						
			МенеджерЗаписи.Записать(); 
			
		КонецЕсли;     
		
	КонецЦикла;

КонецПроцедуры //ОтразитьДополнительныеПараметрыПакетов() 

// Выполняет движения регистра сведений алк_ПараметрыПакетов.
//
Процедура ОтразитьПараметрыПакетов_Готовые(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПараметрыПакетов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПараметрыПакетов;
	
	Если Отказ
		ИЛИ ТаблицаПараметрыПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПараметрыПакетов = Движения.алк_ПараметрыПакетов;
	ДвиженияПараметрыПакетов.Записывать = Истина;
	ДвиженияПараметрыПакетов.Загрузить(ТаблицаПараметрыПакетов);
	
КонецПроцедуры //ОтразитьПараметрыПакетов_Готовые()

// Выполняет движения регистра сведений ПакетыИсторияЗаказов.
//
Процедура ОтразитьПакетыИсторияЗаказов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПакетыИсторияЗаказов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПакетыИсторияЗаказов;
	
	Если Отказ
		ИЛИ ТаблицаПакетыИсторияЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПакетыИсторияЗаказов = Движения.алк_ПакетыИсторияЗаказов;
	ДвиженияПакетыИсторияЗаказов.Записывать = Истина;
	ДвиженияПакетыИсторияЗаказов.Загрузить(ТаблицаПакетыИсторияЗаказов);
	
КонецПроцедуры //ОтразитьПараметрыПакетов()

// Выполняет движения регистра накопления алк_ЗапасыКПоступлениюНаСкладыСерии.
//
Процедура ОтразитьЗапасыКПоступлениюНаСкладыСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗапасыКПоступлениюНаСкладыСерии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыКПоступлениюНаСкладыСерии;
	
	Если Отказ
		ИЛИ ТаблицаЗапасыКПоступлениюНаСкладыСерии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыКПоступлениюНаСкладыСерии = Движения.алк_ЗапасыКПоступлениюНаСкладыСерии;
	ДвиженияЗапасыКПоступлениюНаСкладыСерии.Записывать = Истина;
	ДвиженияЗапасыКПоступлениюНаСкладыСерии.Загрузить(ТаблицаЗапасыКПоступлениюНаСкладыСерии);
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ЗапасыНаСкладахСерии.
//
Процедура ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗапасыНаСкладахСерии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии;
	
	Если Отказ
		ИЛИ ТаблицаЗапасыНаСкладахСерии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыНаСкладахСерии = Движения.алк_ЗапасыНаСкладахСерии;
	ДвиженияЗапасыНаСкладахСерии.Записывать = Истина;
	ДвиженияЗапасыНаСкладахСерии.Загрузить(ТаблицаЗапасыНаСкладахСерии);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_УчетВременныхДеклараций.
//
Процедура УчетВременныхДеклараций(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУчетВременныхДеклараций = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетВременныхДеклараций;
	
	Если Отказ
		ИЛИ ТаблицаУчетВременныхДеклараций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУчетВременныхДеклараций = Движения.алк_УчетВременныхДеклараций;
	ДвиженияУчетВременныхДеклараций.Записывать = Истина;
	ДвиженияУчетВременныхДеклараций.Загрузить(ТаблицаУчетВременныхДеклараций);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПредварительныеПартииСерии.
//
Процедура ОтразитьПредварительныеПартииСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПредварительныеПартииСерии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПредварительныеПартииСерии;
	
	Если Отказ
		ИЛИ ТаблицаПредварительныеПартииСерии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПредваритеьныеПартииСерии = Движения.алк_ПредварительныеПартииСерии;
	ДвиженияПредваритеьныеПартииСерии.Записывать = Истина;
	ДвиженияПредваритеьныеПартииСерии.Загрузить(ТаблицаПредварительныеПартииСерии);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ЗапасыНаВнешнихСкладахСерии.
//
Процедура ОтразитьЗапасыНаВнешнихСкладахСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗапасыНаВнСкладахСерии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаВнСкладахСерии;
	
	Если Отказ
		ИЛИ ТаблицаЗапасыНаВнСкладахСерии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыНаВнСкладахСерии = Движения.алк_ЗапасыНаВнешнихСкладахСерии;
	ДвиженияЗапасыНаВнСкладахСерии.Записывать = Истина;
	ДвиженияЗапасыНаВнСкладахСерии.Загрузить(ТаблицаЗапасыНаВнСкладахСерии);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ЦеныПродукции.
//
Процедура ОтразитьЦеныПродукции(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЦеныПродукции = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЦеныПродукции;
	
	Если Отказ
		ИЛИ ТаблицаЦеныПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЦеныПродукции = Движения.алк_ЦеныПродукции;
	ДвиженияЦеныПродукции.Записывать = Истина;
	ДвиженияЦеныПродукции.Загрузить(ТаблицаЦеныПродукции);	
	
КонецПроцедуры

// Выполняет движения регистра сведений алк_ПриемкаОтгрузок.
//
Процедура ОтразитьПриемкаОтгрузок(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПриемкаОтгрузок = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПриемкаОтгрузок;
	
	Если Отказ
		ИЛИ ТаблицаПриемкаОтгрузок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПриемкаОтгрузок = Движения.алк_ПриемкаОтгрузок;
	ДвиженияПриемкаОтгрузок.Записывать = Истина;
	ДвиженияПриемкаОтгрузок.Загрузить(ТаблицаПриемкаОтгрузок);	
	
КонецПроцедуры

// Выполняет движения регистра сведений алк_ОбъемныеГруппыПредставление.
//
Процедура ОтразитьОбъемныеГруппыПредставление(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПредставление = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПредставлениеОГ;
	
	Если Отказ
		ИЛИ ТаблицаПредставление.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПредставление = Движения.алк_ОбъемныеГруппыПредставление;
	ДвиженияПредставление.Записывать = Истина;
	ДвиженияПредставление.Загрузить(ТаблицаПредставление);	
	
КонецПроцедуры

// Выполняет движения регистра сведений алк_АссортиментныеГруппыПредставление.
//
Процедура ОтразитьАссортиментныеГруппыПредставление(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПредставление = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПредставлениеАГ;
	
	Если Отказ
		ИЛИ ТаблицаПредставление.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПредставление = Движения.алк_АссортиментныеГруппыПредставление;
	ДвиженияПредставление.Записывать = Истина;
	ДвиженияПредставление.Загрузить(ТаблицаПредставление);	
	
КонецПроцедуры

// Выполняет движения регистра сведений алк_ИД_ГруппХарактеристик.
//
Процедура ОтразитьИДентификаторыГруппХарактеристик(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаИД = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаИД_ГруппХарактеристик;
	
	Если Отказ
		ИЛИ ТаблицаИД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияИД_ГруппХарактеристик = Движения.алк_ИД_ГруппХарактеристик;
	ДвиженияИД_ГруппХарактеристик.Записывать = Истина;
	ДвиженияИД_ГруппХарактеристик.Загрузить(ТаблицаИД);	
	
КонецПроцедуры

// Выполняет движения регистра сведений алк_ОтгрузкаРН.
//
Процедура ОтразитьОтгрузкуРН(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОтгрузкаРасходников = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтгрузкаРасходников;
	
	Если Отказ
		ИЛИ ТаблицаОтгрузкаРасходников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОтгрузкаРН = Движения.алк_ОтгрузкаРН;
	ДвиженияОтгрузкаРН.Записывать = Истина;
	ДвиженияОтгрузкаРН.Загрузить(ТаблицаОтгрузкаРасходников);	
	
КонецПроцедуры

// Выполняет движения регистра сведений алк_ПартииТранспортировок.
//
Процедура ОтразитьПартииТранспортировок(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПартииТранспортировок = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТранспортировок;
	
	Если Отказ
		ИЛИ ТаблицаПартииТранспортировок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПартииТранспортировок = Движения.алк_ПартииТранспортировок;
	ДвиженияПартииТранспортировок.Записывать = Истина;
	ДвиженияПартииТранспортировок.Загрузить(ТаблицаПартииТранспортировок);	
	
КонецПроцедуры

// Выполняет движения регистра сведений алк_ТранспортировчныеПартииПакетов.
//
Процедура ОтразитьТранспортировчныеПартииПакетов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаТранспортировочныеПартииПакетов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТранспортировочныеПартииПакетов;
	
	Если Отказ
		ИЛИ ТаблицаТранспортировочныеПартииПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТранспортировочныеПартииПакетов = Движения.алк_ТранспортировчныеПартииПакетов;
	ДвиженияТранспортировочныеПартииПакетов.Записывать = Истина;
	ДвиженияТранспортировочныеПартииПакетов.Загрузить(ТаблицаТранспортировочныеПартииПакетов);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ФинансыПлан.
//
Процедура ОтразитьФинансыПлан(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаФинансыПлан = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаФинансыПлан;
	
	Если Отказ
		ИЛИ ТаблицаФинансыПлан.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияФинансыПлан = Движения.алк_ФинансыПлан;
	ДвиженияФинансыПлан.Записывать = Истина;
	ДвиженияФинансыПлан.Загрузить(ТаблицаФинансыПлан);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ФинансыФакт.
//
Процедура ОтразитьФинансыФакт(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаФинансыФакт = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаФинансыФакт;
	
	Если Отказ
		ИЛИ ТаблицаФинансыФакт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияФинансыФакт = Движения.алк_ФинансыФакт;
	ДвиженияФинансыФакт.Записывать = Истина;
	ДвиженияФинансыФакт.Загрузить(ТаблицаФинансыФакт);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_Взаиморасчеты.
//
Процедура ОтразитьВзаиморасчеты(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВзаиморасчеты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВзаиморасчеты;
	
	Если Отказ
		ИЛИ ТаблицаВзаиморасчеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВзаиморасчеты = Движения.алк_Взаиморасчеты;
	ДвиженияВзаиморасчеты.Записывать = Истина;
	ДвиженияВзаиморасчеты.Загрузить(ТаблицаВзаиморасчеты);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ОтгрузкиПлан.
//
Процедура ОтразитьОтгрузкиПлан(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОтгрузкиПлан = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтгрузкиПлан;
	
	Если Отказ
		ИЛИ ТаблицаОтгрузкиПлан.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОтгрузкиПлан = Движения.алк_ОтгрузкиПлан;
	ДвиженияОтгрузкиПлан.Записывать = Истина;
	ДвиженияОтгрузкиПлан.Загрузить(ТаблицаОтгрузкиПлан);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПроизводствоПлан.
//
Процедура ОтразитьПроизводствоПлан(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПроизводствоПлан = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводствоПлан;
	
	Если Отказ
		ИЛИ ТаблицаПроизводствоПлан.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПроизводствоПлан = Движения.алк_ПроизводствоПлан;
	ДвиженияПроизводствоПлан.Записывать = Истина;
	ДвиженияПроизводствоПлан.Загрузить(ТаблицаПроизводствоПлан);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПроизводствоПланПосменно.
//
Процедура ОтразитьПроизводствоПосменноПлан(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПроизводствоПлан = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводствоПосменноПлан;
	
	Если Отказ
		ИЛИ ТаблицаПроизводствоПлан.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПроизводствоПлан = Движения.алк_ПроизводствоПланПосменно;
	ДвиженияПроизводствоПлан.Записывать = Истина;
	ДвиженияПроизводствоПлан.Загрузить(ТаблицаПроизводствоПлан);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПроизводствоПланПосменноС.
//
Процедура ОтразитьПроизводствоПосменноПланС(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПроизводствоПланС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводствоПосменноПланС;
	
	Если Отказ
		ИЛИ ТаблицаПроизводствоПланС.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПроизводствоПлан = Движения.алк_ПроизводствоПланПосменноС;
	ДвиженияПроизводствоПлан.Записывать = Истина;
	ДвиженияПроизводствоПлан.Загрузить(ТаблицаПроизводствоПланС);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПроизводствоПланПосменноН.
//
Процедура ОтразитьПроизводствоПосменноПланН(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПроизводствоПланН = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводствоПосменноПланН;
	
	Если Отказ
		ИЛИ ТаблицаПроизводствоПланН.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПроизводствоПлан = Движения.алк_ПроизводствоПланПосменноН;
	ДвиженияПроизводствоПлан.Записывать = Истина;
	ДвиженияПроизводствоПлан.Загрузить(ТаблицаПроизводствоПланН);	
	
КонецПроцедуры

Процедура ОтразитьПлановыеПоказатели(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОтразитьПлановыеПоказатели = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтразитьПлановыеПоказатели;
	
	Если Отказ
		ИЛИ ТаблицаОтразитьПлановыеПоказатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПроизводствоПлан = Движения.алк_ПлановыеПоказатели;
	ДвиженияПроизводствоПлан.Записывать = Истина;
	ДвиженияПроизводствоПлан.Загрузить(ТаблицаОтразитьПлановыеПоказатели);	
	
КонецПроцедуры



// Выполняет движения регистра накопления алк_ПередачиСобственныеСерии.
//
Процедура ОтразитьПередачиСобственныеСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПередачиСобственныеСерии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПередачиСобственныеСерии;
	
	Если Отказ
		ИЛИ ТаблицаПередачиСобственныеСерии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПередачиСобственныеСерии = Движения.алк_ПередачиСобственныеСерии;
	ДвиженияПередачиСобственныеСерии.Записывать = Истина;
	ДвиженияПередачиСобственныеСерии.Загрузить(ТаблицаПередачиСобственныеСерии);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ЗапасыОрганизацииСерии.
//
Процедура ОтразитьЗапасыОрганизацииСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗапасыОрганизацииСерии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыОрганизацииСерии;
	
	Если Отказ
		ИЛИ ТаблицаЗапасыОрганизацииСерии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизацииСерии = Движения.алк_ЗапасыОрганизацииСерии;
	ДвиженияЗапасыОрганизацииСерии.Записывать = Истина;
	ДвиженияЗапасыОрганизацииСерии.Загрузить(ТаблицаЗапасыОрганизацииСерии);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ЗапасыОрганизации.
//
Процедура ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗапасыОрганизации = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыОрганизации;
	
	Если Отказ
		ИЛИ ТаблицаЗапасыОрганизации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизации = Движения.алк_ЗапасыОрганизации;
	ДвиженияЗапасыОрганизации.Записывать = Истина;
	ДвиженияЗапасыОрганизации.Загрузить(ТаблицаЗапасыОрганизации);
	
КонецПроцедуры


// Выполняет движения регистра накопления алк_ОстаткиЗапасов.
//
Процедура ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОстаткиЗапасов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиЗапасов;
	
	Если Отказ
		ИЛИ ТаблицаОстаткиЗапасов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизации = Движения.алк_ОстаткиЗапасов;
	ДвиженияЗапасыОрганизации.Записывать = Истина;
	ДвиженияЗапасыОрганизации.Загрузить(ТаблицаОстаткиЗапасов);
	
КонецПроцедуры


Процедура ОтразитьОстаткиНесортированного(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОстаткиНесортированного = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиНесортированного;
	
	Если Отказ
		ИЛИ ТаблицаОстаткиНесортированного.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизации = Движения.алк_ОстаткиНесортированного;
	ДвиженияЗапасыОрганизации.Записывать = Истина;
	ДвиженияЗапасыОрганизации.Загрузить(ТаблицаОстаткиНесортированного);
	
КонецПроцедуры



Процедура ОтразитьОстаткиТоварыВПути(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОстаткиТоварыВПути = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиТоварыВПути;  
	
	Если Отказ ИЛИ ТаблицаОстаткиТоварыВПути.Количество() = 0  Тогда
		Возврат;
	КонецЕсли; 
			
	ДвиженияОборотыПроизводства = Движения.алк_ТоварыВПути;
	ДвиженияОборотыПроизводства.Записывать = Истина;
	ДвиженияОборотыПроизводства.Загрузить(ТаблицаОстаткиТоварыВПути);
	
КонецПроцедуры



//Сергеева Г.О. Оборотный регистр ++
// Выполняет движения регистра накопления оборотного алк_ОборотыПроизводства.
Процедура ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОборотыПроизводства = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОборотыПроизводства;
	
	СтруктураНастроек = Новый Структура("Параметр", "Оперсводка");
	ПолучитьДатуВводаОперсводки = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
	ДатаВвода = Дата("23001201");
	Если ПолучитьДатуВводаОперсводки.Количество() > 0 Тогда
		ДатаВвода = ПолучитьДатуВводаОперсводки[0].Дата;
	КонецЕсли;

	Если Отказ
		ИЛИ ТаблицаОборотыПроизводства.Количество() = 0  ИЛИ ДатаВвода > ТаблицаОборотыПроизводства[0].Период Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборотыПроизводства = Движения.алк_ОборотыПроизводства;
	ДвиженияОборотыПроизводства.Записывать = Истина;
	ДвиженияОборотыПроизводства.Загрузить(ТаблицаОборотыПроизводства);
	
КонецПроцедуры

// Выполняет движения регистра накопления оборотного алк_ОстаткиЛесопродукции.
Процедура ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОстаткиЛесопродукции = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиЛесопродукции;
	СтруктураНастроек = Новый Структура("Параметр", "Оперсводка");
	ПолучитьДатуВводаОперсводки = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
	ДатаВвода = Дата("23001201");
	Если ПолучитьДатуВводаОперсводки.Количество() > 0 Тогда
		ДатаВвода = ПолучитьДатуВводаОперсводки[0].Дата;
	КонецЕсли;
	
	
	Если Отказ
		ИЛИ ТаблицаОстаткиЛесопродукции.Количество() = 0 ИЛИ ДатаВвода > ТаблицаОстаткиЛесопродукции[0].Период Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОборотыПроизводства = Движения.алк_ОстаткиЛесопродукции;
	ДвиженияОборотыПроизводства.Записывать = Истина;
	ДвиженияОборотыПроизводства.Загрузить(ТаблицаОстаткиЛесопродукции);
	
КонецПроцедуры
//Сергеева Г.О. Оборотный регистр --

//Приходует отходы в регистр накопления алк_ЗапасыОрганизации. //добавил Страшко   
Процедура ОтразитьОтходыВЗапасахОрганизации(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОтходыОрганизации = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыпускОтходы;
	
	Если Отказ
		ИЛИ ТаблицаОтходыОрганизации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизации = Движения.алк_ЗапасыОрганизации;
	//ДвиженияЗапасыОрганизации.Прочитать();	
	ДвиженияЗапасыОрганизации.Записывать = Истина;
	Для каждого Запись из ТаблицаОтходыОрганизации цикл
		НоваяЗапись = ДвиженияЗапасыОрганизации.Добавить();
		НоваяЗапись.Организация = Запись.Организация;
		НоваяЗапись.СтруктурнаяЕдиница = Запись.СтруктурнаяЕдиница;
	    НоваяЗапись.Номенклатура = Запись.Номенклатура;
		НоваяЗапись.Характеристика = Запись.Характеристика;
		НоваяЗапись.Объем = Запись.Объем;
		НоваяЗапись.Номенклатура = Запись.Номенклатура;
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Смена = Запись.Смена;
		НоваяЗапись.Период = Запись.Период;
		НоваяЗапись.ДатаСмены = Запись.Период;
		НоваяЗапись.СертификатFSC = Запись.СертификатFSC;   
		НоваяЗапись.Сертификат = Запись.Сертификат;
		
		// Нач мод [Пакушев И.С.] [30.07.2019] 
		// Обращение № [0000000000] [ТекстЗаявки]
		// Было
		// Стало
		Если Запись.Период < '20190630235959' Тогда
			НоваяЗапись.Ячейка = Неопределено;	
		ИначеЕсли Запись.Ячейка = Неопределено Тогда 
			НоваяЗапись.Ячейка = Справочники.Ячейки.ПустаяСсылка();
		Иначе
			НоваяЗапись.Ячейка = Запись.Ячейка;		
		КонецЕсли;		
		// Кон мод [Пакушев И.С.] [30.07.2019]
		
	КонецЦикла;	
КонецПроцедуры


// Выполняет движения регистра накопления алк_УчетЛесопродукцииНаОтветхранении.
//
Процедура ОтразитьУчетЛесопродукцииНаОтветхранении(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУчетОтветхранения = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетОтветхранения;
	
	Если Отказ
		ИЛИ ТаблицаУчетОтветхранения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУчетЛесопродукции = Движения.алк_УчетЛесопродукцииНаОтветхранении;
	ДвиженияУчетЛесопродукции.Записывать = Истина;
	ДвиженияУчетЛесопродукции.Загрузить(ТаблицаУчетОтветхранения);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_СменныйРапорт.
//
Процедура ОтразитьСменныйРапорт(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСменныйРапорт = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСменныйРапорт;
	
	Если Отказ
		ИЛИ ТаблицаСменныйРапорт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСменныйРапорт = Движения.алк_СменныйРапорт;
	ДвиженияСменныйРапорт.Записывать = Истина;
	ДвиженияСменныйРапорт.Загрузить(ТаблицаСменныйРапорт);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_РасчетныйВыход.
//
Процедура ОтразитьРасчетныйВыход(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетныйВыход = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетныйВыход;
	
	Если Отказ
		ИЛИ ТаблицаРасчетныйВыход.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРасчетныйВыход = Движения.алк_РасчетныйВыход;
	ДвиженияРасчетныйВыход.Записывать = Истина;
	ДвиженияРасчетныйВыход.Загрузить(ТаблицаРасчетныйВыход);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ДопАналитикаПакетов.
//
Процедура ОтразитьДопАналитикаПакетов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДопАналитикаПакетов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДопАналитикаПакетов;
	
	Если Отказ
		ИЛИ ТаблицаДопАналитикаПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДопАналитикаПакетов = Движения.алк_ДопАналитикаПакетов;
	ДвиженияДопАналитикаПакетов.Записывать = Истина;
	ДвиженияДопАналитикаПакетов.Загрузить(ТаблицаДопАналитикаПакетов);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_Отходы.
//
Процедура ОтразитьОтходы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОтходы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтходы;
	
	Если Отказ
		ИЛИ ТаблицаОтходы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОтходы = Движения.алк_Отходы;
	ДвиженияОтходы.Записывать = Истина;
	ДвиженияОтходы.Загрузить(ТаблицаОтходы);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ЦеныНаЛесопродукциюТД.
//
Процедура ОтразитьЦеныНаЛесопродукциюТД(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЦеныНаЛесопродукцию = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЦеныНаЛесопродукцию;
	
	Если Отказ
		ИЛИ ТаблицаЦеныНаЛесопродукцию.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЦеныНаЛесопродукцию = Движения.алк_ЦеныНаЛесопродукциюТД;
	ДвиженияЦеныНаЛесопродукцию.Записывать = Истина;
	ДвиженияЦеныНаЛесопродукцию.Загрузить(ТаблицаЦеныНаЛесопродукцию);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_УчетЛесопродукцииГОСТ.
//
Процедура ОтразитьУчетЛесопродукцииГОСТ(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУчетЛесопродукцииГОСТ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетЛесопродукцииГОСТ;
	
	Если Отказ
		ИЛИ ТаблицаУчетЛесопродукцииГОСТ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУчетЛесопродукцииГОСТ = Движения.алк_УчетЛесопродукцииГОСТ;
	ДвиженияУчетЛесопродукцииГОСТ.Записывать = Истина;
	ДвиженияУчетЛесопродукцииГОСТ.Загрузить(ТаблицаУчетЛесопродукцииГОСТ);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_УчетЛесопродукцииТД.
//
Процедура ОтразитьУчетЛесопродукцииТД(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаУчетЛесопродукцииТД = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетЛесопродукцииТД;
	
	Если Отказ
		ИЛИ ТаблицаУчетЛесопродукцииТД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУчетЛесопродукцииТД = Движения.алк_УчетЛесопродукцииТД;
	ДвиженияУчетЛесопродукцииТД.Записывать = Истина;
	ДвиженияУчетЛесопродукцииТД.Загрузить(ТаблицаУчетЛесопродукцииТД);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_МатериалыЗатратыВыпуска.
//
Процедура ОтразитьМатериалыЗатратыВыпуска(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаМатериалыЗатратыВыпуска = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМатериалыЗатратыВыпуска;
	
	Если Отказ
		ИЛИ ТаблицаМатериалыЗатратыВыпуска.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияМатериалыЗатратыВыпуска = Движения.алк_МатериалыЗатратыВыпуска;
	ДвиженияМатериалыЗатратыВыпуска.Записывать = Истина;
	ДвиженияМатериалыЗатратыВыпуска.Загрузить(ТаблицаМатериалыЗатратыВыпуска);
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ВыпускПродукции.
//
Процедура ОтразитьВыпускПродукции(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВыпускПродукции = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыпускПродукции;
	
	Если Отказ
		ИЛИ ТаблицаВыпускПродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыпускПродукции= Движения.алк_ВыпускПродукции;
	ДвиженияВыпускПродукции.Записывать = Истина;
	ДвиженияВыпускПродукции.Загрузить(ТаблицаВыпускПродукции);
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ВыпускОтходы.
//
Процедура ОтразитьВыпускОтходы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВыпускОтходы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыпускОтходы;
	
	Если Отказ
		ИЛИ ТаблицаВыпускОтходы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыпускОтходы = Движения.алк_ВыпускОтходы;
	ДвиженияВыпускОтходы.Записывать = Истина;
	ДвиженияВыпускОтходы.Загрузить(ТаблицаВыпускОтходы);
	
КонецПроцедуры // ОтразитьВыпускОтходы

// Выполняет движения регистра накопления алк_ВыполнениеЗаказовЭтапыСерии.
//
Процедура ОтразитьВыполнениеЗаказовЭтапыСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВыполнениеЗаказов= ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыполнениеЗаказовЭтапыСерии;
	
	Если Отказ
		ИЛИ ТаблицаВыполнениеЗаказов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыполнениеЗаказов= Движения.алк_ВыполнениеЗаказовЭтапыСерии;
	ДвиженияВыполнениеЗаказов.Записывать = Истина;
	ДвиженияВыполнениеЗаказов.Загрузить(ТаблицаВыполнениеЗаказов);
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ВыпускПродукцииСерии.
//
Процедура ОтразитьВыпускПродукцииСерии(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаВыпускПродукцииСерии = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыпускПродукцииСерии;
	
	Если Отказ
		ИЛИ ТаблицаВыпускПродукцииСерии.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыпускПродукции= Движения.алк_ВыпускПродукцииСерии;
	ДвиженияВыпускПродукции.Записывать = Истина;
	ДвиженияВыпускПродукции.Загрузить(ТаблицаВыпускПродукцииСерии);
	
КонецПроцедуры

// Выполняет движения по регистру алк_ЗаказыПокупателей.
//
Процедура ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗаказыПокупателей = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателей;
	
	Если Отказ
		ИЛИ ТаблицаЗаказыПокупателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыПокупателей = Движения.алк_ЗаказыПокупателей;
	ДвиженияЗаказыПокупателей.Записывать = Истина;
	ДвиженияЗаказыПокупателей.Загрузить(ТаблицаЗаказыПокупателей);
	
КонецПроцедуры // ОтразитьЗаказыПокупателей()

// Выполняет движения по регистру алк_ЗаказыПокупателейПоОбъемнымГруппам.
//
Процедура ОтразитьЗаказыПокупателейПоОбъемнымГруппам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗаказыПокупателей = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателейОГ;
	
	Если Отказ
		ИЛИ ТаблицаЗаказыПокупателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыПокупателей = Движения.алк_ЗаказыПокупателейПоОбъемнымГруппам;
	ДвиженияЗаказыПокупателей.Записывать = Истина;
	ДвиженияЗаказыПокупателей.Загрузить(ТаблицаЗаказыПокупателей);
	
КонецПроцедуры // ОтразитьЗаказыПокупателей()

// Выполняет движения регистра накопления алк_СортировкаЛесопродукции.
//
Процедура ОтразитьСортировкаЛесопродукции(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСортировкаЛесопродукции = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСортировкаЛесопродукции;
	
	Если Отказ
		ИЛИ ТаблицаСортировкаЛесопродукции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСортировкаЛесопродукции = Движения.алк_СортировкаЛесопродукции;
	ДвиженияСортировкаЛесопродукции.Записывать = Истина;
	ДвиженияСортировкаЛесопродукции.Загрузить(ТаблицаСортировкаЛесопродукции);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ДокументыПоследовательностиБиржа.
//
Процедура ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыПослБиржа = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДокументыПослБиржа;
	
	Если Отказ
		ИЛИ ТаблицаДокументыПослБиржа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыПослБиржа = Движения.алк_ДокументыПоследовательностиБиржа;
	ДвиженияДокументыПослБиржа.Записывать = Истина;
	ДвиженияДокументыПослБиржа.Загрузить(ТаблицаДокументыПослБиржа);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ДокументыПоследовательностиПродукция.
//
Процедура ОтразитьДокументыПоследовательностиПродукция(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыПослПродукция = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДокументыПослПродукция;
	
	Если Отказ
		ИЛИ ТаблицаДокументыПослПродукция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыПослПродукция = Движения.алк_ДокументыПоследовательностиПродукция;
	ДвиженияДокументыПослПродукция.Записывать = Истина;
	ДвиженияДокументыПослПродукция.Загрузить(ТаблицаДокументыПослПродукция);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПакетыВСушильныхКамерах.
//
Процедура ОтразитьПакетыВСушильныхКамерах(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыПакетыВСушильныхКамерах = ДополнительныеСвойства.ТаблицыДляДвижений.алк_ПакетыВСушильныхКамерах;
	
	Если Отказ
		ИЛИ ТаблицаДокументыПакетыВСушильныхКамерах.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыПакетыВСушильныхКамерах = Движения.алк_ПакетыВСушильныхКамерах;
	ДвиженияДокументыПакетыВСушильныхКамерах.Записывать = Истина;
	ДвиженияДокументыПакетыВСушильныхКамерах.Загрузить(ТаблицаДокументыПакетыВСушильныхКамерах);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПиломатериалыПереданныеНаСушку.
//
Процедура ОтразитьПиломатериалыПереданныеНаСушку(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыПиломатериалыПереданныеНаСушку = ДополнительныеСвойства.ТаблицыДляДвижений.алк_ПиломатериалыПереданныеНаСушку;
	
	Если Отказ
		ИЛИ ТаблицаДокументыПиломатериалыПереданныеНаСушку.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыПиломатериалыПереданныеНаСушку = Движения.алк_ПиломатериалыПереданныеНаСушку;
	ДвиженияДокументыПиломатериалыПереданныеНаСушку.Записывать = Истина;
	ДвиженияДокументыПиломатериалыПереданныеНаСушку.Загрузить(ТаблицаДокументыПиломатериалыПереданныеНаСушку);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ОстаткиВКамерахПропарки.
//
Процедура ОтразитьОстаткиВКамерахПропарки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыОстаткиВКамерахПропарки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиВКамерахПропарки;
	
	Если Отказ
		ИЛИ ТаблицаДокументыОстаткиВКамерахПропарки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыПакетыВСушильныхКамерах = Движения.алк_ОстаткиВКамерахПропарки;
	ДвиженияДокументыПакетыВСушильныхКамерах.Записывать = Истина;
	ДвиженияДокументыПакетыВСушильныхКамерах.Загрузить(ТаблицаДокументыОстаткиВКамерахПропарки);	
	
КонецПроцедуры


// Выполняет движения регистра накопления алк_УчетВремениПропарки.
//
Процедура ОтразитьУчетВремениПропарки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументаУчетВремениПропарки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетВремениПропарки;
	
	Если Отказ
		ИЛИ ТаблицаДокументаУчетВремениПропарки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыПакетыВСушильныхКамерах = Движения.алк_УчетВремениПропарки;
	ДвиженияДокументыПакетыВСушильныхКамерах.Записывать = Истина;
	ДвиженияДокументыПакетыВСушильныхКамерах.Загрузить(ТаблицаДокументаУчетВремениПропарки);	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_УчетВремениПропарки.
//
Процедура ОтразитьОстаткиНезавершенногоПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаОстаткиНезавершенногоПроизводства = Неопределено;
	Если Не Отказ 
		И ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") 
		И ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаОстаткиНезавершенногоПроизводства", ТаблицаОстаткиНезавершенногоПроизводства) тогда
		
		ДвиженияДокументыОстаткиНезавершенногоПроизводства = Движения.алк_ОстаткиНезавершенногоПроизводства;
		ДвиженияДокументыОстаткиНезавершенногоПроизводства.Записывать = Истина;
		ДвиженияДокументыОстаткиНезавершенногоПроизводства.Загрузить(ТаблицаОстаткиНезавершенногоПроизводства);	
	КонецЕсли;
	
КонецПроцедуры


Процедура ОтразитьДвиженияПоОсткамПоЗаказам(ДополнительныеСвойства, Движения, Отказ) Экспорт 	
	
	ТаблицаЗаказыПокупателейОстатки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыПокупателейОстатки;
	
	Если Отказ
		ИЛИ ТаблицаЗаказыПокупателейОстатки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВыполнениеЗаказов = Движения.алк_ОтгрузкиПоЗаказам;
	ДвиженияВыполнениеЗаказов.Записывать = Истина;
	ДвиженияВыполнениеЗаказов.Загрузить(ТаблицаЗаказыПокупателейОстатки); 	
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_Аддендумы.
//
Процедура ОтразитьАддендумы(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаАддендумы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАддендумы;
	
	Если Отказ
		ИЛИ ТаблицаАддендумы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизации = Движения.алк_Аддендумы;
	ДвиженияЗапасыОрганизации.Записывать = Истина;
	ДвиженияЗапасыОрганизации.Загрузить(ТаблицаАддендумы);
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_ПакетыПоАддендумам.
//
Процедура ОтразитьПакетыПоАддендумам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаПакетыПоАддендумам = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПакетыПоАддендумам;
	
	Если Отказ
		ИЛИ ТаблицаПакетыПоАддендумам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗапасыОрганизации = Движения.алк_ПакетыПоАддендумам;
	ДвиженияЗапасыОрганизации.Записывать = Истина;
	ДвиженияЗапасыОрганизации.Загрузить(ТаблицаПакетыПоАддендумам);
	
КонецПроцедуры

Процедура ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	// регистр алк_ПроизводствоОборот 
	Движения.алк_ПроизводствоОборот.Записывать = Истина;
	Если ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") 
		И ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаПроизводствоОборот") тогда
		Движения.алк_ПроизводствоОборот.Загрузить(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПроизводствоОборот);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет движения регистра накопления алк_СтатусПропарки.
//
Процедура ОтразитьСтатусыПропарки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыСтатусыПропарки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСтатусыПропарки;
	
	Если Отказ
		ИЛИ ТаблицаДокументыСтатусыПропарки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыПакетыВСушильныхКамерах = Движения.алк_СтатусПропарки;
	ДвиженияДокументыПакетыВСушильныхКамерах.Записывать = Истина;
	ДвиженияДокументыПакетыВСушильныхКамерах.Загрузить(ТаблицаДокументыСтатусыПропарки);	
	
КонецПроцедуры   

// Выполняет движения регистра накопления алк_ОстаткиКамерыГТО.
//
Процедура ОтразитьОстаткиКамерыГТО(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыОстаткиКамерыГТО = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиКамерыГТО;
	
	Если Отказ
		ИЛИ ТаблицаДокументыОстаткиКамерыГТО.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыОстаткиКамерыГТО = Движения.алк_ОстаткиКамерыГТО;
	ДвиженияДокументыОстаткиКамерыГТО.Записывать = Истина;
	ДвиженияДокументыОстаткиКамерыГТО.Загрузить(ТаблицаДокументыОстаткиКамерыГТО);	
	
КонецПроцедуры   

// Выполняет движения регистра сведений алк_ВремяПропарки.
//
Процедура ОтразитьВремяПропарки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДокументыВремяПропарки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВремяПропарки;
	
	Если Отказ
		ИЛИ ТаблицаДокументыВремяПропарки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияДокументыВремяПропарки = Движения.алк_ВремяПропарки;
	ДвиженияДокументыВремяПропарки.Записывать = Истина;
	ДвиженияДокументыВремяПропарки.Загрузить(ТаблицаДокументыВремяПропарки);	
	
КонецПроцедуры


#КонецОбласти


#Область КонтрольПроведения

Функция КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, КонтролируемыйРегистр) Экспорт
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	#Область РН_алк_ОстаткиЗапасов
	Если КонтролируемыйРегистр = "алк_ОстаткиЗапасов" Тогда
		Запрос = новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасов.Организация,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель,
		|	алк_ОстаткиЗапасов.Номенклатура,
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.Сертификат,
		|	алк_ОстаткиЗапасов.СерийныйНомер,
		|	ВЫБОР
		|		КОГДА &ЭтоПроведение
		|			ТОГДА 0
		|		КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|			ТОГДА алк_ОстаткиЗапасов.Количество
		|		ИНАЧЕ -алк_ОстаткиЗапасов.Количество
		|	КОНЕЦ КАК Приращение
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОстатки.Организация,
		|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасовОстатки.Штабель,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	-(алк_ОстаткиЗапасовОстатки.КоличествоОстаток + втДокТЧ.Приращение) КАК Количество
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			(Организация, СтруктурнаяЕдиница, Штабель, Номенклатура, Характеристика, Сертификат, СерийныйНомер) В
		|				(ВЫБРАТЬ
		|					ВТ.Организация,
		|					ВТ.СтруктурнаяЕдиница,
		|					ВТ.Штабель,
		|					ВТ.Номенклатура,
		|					ВТ.Характеристика,
		|					ВТ.Сертификат,
		|					ВТ.СерийныйНомер
		|				ИЗ
		|					втДокТЧ КАК ВТ)) КАК алк_ОстаткиЗапасовОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДокТЧ КАК втДокТЧ
		|		ПО алк_ОстаткиЗапасовОстатки.Организация = втДокТЧ.Организация
		|			И алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = втДокТЧ.СтруктурнаяЕдиница
		|			И алк_ОстаткиЗапасовОстатки.Штабель = втДокТЧ.Штабель
		|			И алк_ОстаткиЗапасовОстатки.Номенклатура = втДокТЧ.Номенклатура
		|			И алк_ОстаткиЗапасовОстатки.Характеристика = втДокТЧ.Характеристика
		|			И алк_ОстаткиЗапасовОстатки.Сертификат = втДокТЧ.Сертификат
		|			И алк_ОстаткиЗапасовОстатки.СерийныйНомер = втДокТЧ.СерийныйНомер
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток < 0");
		Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Количество() > 0 тогда
			ТекстСообщения = СтрШаблон("При проведении документа %1 обнаружены отрицательные остатки по регистру Остатки запасов:", ДокументСсылка);
			Пока РезультатЗапроса.Следующий() Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + ?(ЗначениеЗаполнено(РезультатЗапроса.СерийныйНомер)
				, СтрШаблон(
					"По организации %1 на складе %2%3 не хватает пакета № %4 объемом %5", 
					РезультатЗапроса.Организация, 
					РезультатЗапроса.СтруктурнаяЕдиница, 
					?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, ""), 
					РезультатЗапроса.СерийныйНомер,
					РезультатЗапроса.Количество)
				, СтрШаблон(
					"По организации %1 на складе %2%3 не хватает номенклатуры %4 / %5%6 в количестве %7",
					РезультатЗапроса.Организация, 
					РезультатЗапроса.СтруктурнаяЕдиница, 
					?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в штабеле " + РезультатЗапроса.Штабель, ""), 
					РезультатЗапроса.Номенклатура,
					РезультатЗапроса.Характеристика,
					?(ЗначениеЗаполнено(РезультатЗапроса.Сертификат), " " + РезультатЗапроса.Сертификат, ""),
					РезультатЗапроса.Количество));
			КонецЦикла;
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
	#Область РН_алк_ЗапасыОрганизации
	Если КонтролируемыйРегистр = "алк_ЗапасыОрганизации" Тогда
		
		//ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыОрганизации;
		
		//ДокТЧ = Новый ТаблицаЗначений;
		//ДокТЧ.Свернуть("Номенклатура, Характеристика, Организация, СтруктурнаяЕдиница, Ячейка, ВидДвижения, Сертификат","Количество, Объем");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗапасыОрганизации.Организация,
		|	алк_ЗапасыОрганизации.СтруктурнаяЕдиница,
		|	алк_ЗапасыОрганизации.Ячейка,
		|	алк_ЗапасыОрганизации.Номенклатура,
		|	алк_ЗапасыОрганизации.Характеристика,
		|	алк_ЗапасыОрганизации.Сертификат,
		|	алк_ЗапасыОрганизации.Количество
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыОрганизации КАК алк_ЗапасыОрганизации
		|ГДЕ
		|	алк_ЗапасыОрганизации.Регистратор = &Регистратор
		|	И алк_ЗапасыОрганизации.ВидДвижения = &ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗапасыОрганизацииОстатки.Номенклатура,
		|	алк_ЗапасыОрганизацииОстатки.Характеристика,
		|	алк_ЗапасыОрганизацииОстатки.СтруктурнаяЕдиница,
		|	алк_ЗапасыОрганизацииОстатки.Ячейка,
		|	алк_ЗапасыОрганизацииОстатки.КоличествоОстаток,
		|	алк_ЗапасыОрганизацииОстатки.ОбъемОстаток
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыОрганизации.Остатки(
		|			&МоментИтогов,
		|			(Номенклатура, Характеристика, Организация, СтруктурнаяЕдиница, Ячейка, Сертификат) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.Характеристика,
		|					ДокТЧ.Организация,
		|					ДокТЧ.СтруктурнаяЕдиница,
		|					ДокТЧ.Ячейка,
		|					ДокТЧ.Сертификат
		|				ИЗ
		|					втДокТЧ КАК ДокТЧ)) КАК алк_ЗапасыОрганизацииОстатки
		|ГДЕ
		|	(алк_ЗапасыОрганизацииОстатки.КоличествоОстаток < 0
		|			ИЛИ алк_ЗапасыОрганизацииОстатки.ОбъемОстаток < 0)";
		
		//Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("Регистратор", ДополнительныеСвойства.ДляПроведения.Ссылка);
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			МоментИтогов = '00010101';
		Иначе
			//МоментИтогов = Новый Граница(МоментВремени(), ВидГраницы.Включая);
			МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.Ячейка = Неопределено Тогда 					
					
					ЯчейкаСтрокой = " ячейка: Неопределено";
					
				ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ячейка) Тогда
					
					Если Тип("СправочникСсылка.алк_Штабели") = ТипЗнч(ВыборкаДетальныеЗаписи.Ячейка) Тогда
						
						ЯчейкаСтрокой = " ячейка: Штабель";
						
					Иначе
						
						ЯчейкаСтрокой = " ячейка: Ячейка";						
						
					КонецЕсли; 				
					
				Иначе					
					
					ЯчейкаСтрокой = " ячейка: " + ВыборкаДетальныеЗаписи.Ячейка;
					
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов Организации: " + ВыборкаДетальныеЗаписи.Номенклатура + " " 
								+ ВыборкаДетальныеЗаписи.Характеристика + " " 
								+ ЯчейкаСтрокой + ", нехватка: " 
								+ ?(ВыборкаДетальныеЗаписи.КоличествоОстаток < 0, "" + (-ВыборкаДетальныеЗаписи.КоличествоОстаток) + " шт,", "")
								+ ?(ВыборкаДетальныеЗаписи.ОбъемОстаток < 0, "" + (-ВыборкаДетальныеЗаписи.ОбъемОстаток) + " м.куб.", "") ;
				Сообщение.Сообщить();	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РН_алк_ПередачиСобственныеСерии
	Если КонтролируемыйРегистр = "алк_ПередачиСобственныеСерии" Тогда
		
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПередачиСобственныеСерии;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.СерийныйНомер
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПередачиСобственныеСерииОстатки.СерийныйНомер,
		|	алк_ПередачиСобственныеСерииОстатки.КоличествоПакетовОстаток
		|ИЗ
		|	РегистрНакопления.алк_ПередачиСобственныеСерии.Остатки(
		|			&МоментИтогов,
		|			(Номенклатура, СерийныйНомер) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.СерийныйНомер
		|				ИЗ
		|					втДокТЧ КАК ДокТЧ)) КАК алк_ПередачиСобственныеСерииОстатки
		|ГДЕ
		|	алк_ПередачиСобственныеСерииОстатки.КоличествоПакетовОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			МоментИтогов = '00010101';
		Иначе
			МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов К передаче, пакет: " + ВыборкаДетальныеЗаписи.СерийныйНомер;
				Сообщение.Сообщить(); 	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РН_алк_ЗапасыОрганизацииСерии
	Если КонтролируемыйРегистр = "алк_ЗапасыОрганизацииСерии" Тогда
		//Внесены изменения 04.04.2022_ Контроль осуществляется на текущую дату, а не на момент времени документа
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыОрганизацииСерии;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.СерийныйНомер,
		|	ДокТЧ.СтруктурнаяЕдиница,
		|	ДокТЧ.Ячейка
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗапасыОрганизацииСерииОстатки.СерийныйНомер,
		|	алк_ЗапасыОрганизацииСерииОстатки.КоличествоПакетовОстаток,
		|	алк_ЗапасыОрганизацииСерииОстатки.СтруктурнаяЕдиница,
		|	алк_ЗапасыОрганизацииСерииОстатки.Ячейка
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыОрганизацииСерии.Остатки(
		|			,
		|			(Номенклатура, СерийныйНомер, СтруктурнаяЕдиница, Ячейка) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.СерийныйНомер,
		|					ДокТЧ.СтруктурнаяЕдиница,
		|					ДокТЧ.Ячейка
		|				ИЗ
		|					втДокТЧ КАК ДокТЧ)) КАК алк_ЗапасыОрганизацииСерииОстатки
		|ГДЕ
		|	алк_ЗапасыОрганизацииСерииОстатки.КоличествоПакетовОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		
		//Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		//	МоментИтогов = '00010101';
		//Иначе
		//	МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		//КонецЕсли; 
		//
		//Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов, пакет: " + ВыборкаДетальныеЗаписи.СерийныйНомер + " на " + ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
				Сообщение.Сообщить(); 	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РН_алк_ЗапасыНаСкладахСерии
	Если КонтролируемыйРегистр = "алк_ЗапасыНаСкладахСерии" Тогда
		//Добавлено 04.04.2022_ Контроль осуществляется на текущую дату, а не на момент времени документа
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗапасыНаСкладахСерии;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.СерийныйНомер,
		|	ДокТЧ.СтруктурнаяЕдиница,
		|	ДокТЧ.Ячейка
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер,
		|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток,
		|	алк_ЗапасыНаСкладахСерииОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ЗапасыНаСкладахСерииОстатки.Ячейка
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(
		|			,
		|			(Номенклатура, СерийныйНомер, СтруктурнаяЕдиница, Ячейка) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.СерийныйНомер,
		|					ДокТЧ.СтруктурнаяЕдиница,
		|					ДокТЧ.Ячейка
		|				ИЗ
		|					втДокТЧ КАК ДокТЧ)) КАК алк_ЗапасыНаСкладахСерииОстатки
		|ГДЕ
		|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		
		//Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		//	МоментИтогов = '00010101';
		//Иначе
		//	МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		//КонецЕсли; 
		//
		//Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов с складах, пакет: " + ВыборкаДетальныеЗаписи.СерийныйНомер + " на " + ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
				Сообщение.Сообщить(); 	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РН_алк_УчетЛесопродукцииНаОтветхранении
	Если КонтролируемыйРегистр = "алк_УчетЛесопродукцииНаОтветхранении" Тогда
		
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетОтветхранения;
		//ДокТЧ = Новый ТаблицаЗначений;
		ДокТЧ.Свернуть("Номенклатура, Характеристика, Организация, СтруктурнаяЕдиница, Штабель, Сертификат, ВидДвижения, Контрагент","Количество");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.Характеристика,
		|	ДокТЧ.Организация,
		|	ДокТЧ.СтруктурнаяЕдиница,
		|	ДокТЧ.Штабель,
		|	ДокТЧ.Количество,
		|	ДокТЧ.ВидДвижения,
		|	ДокТЧ.Сертификат,
		|	ДокТЧ.Контрагент
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокТЧ.Номенклатура,
		|	втДокТЧ.Характеристика,
		|	втДокТЧ.Организация,
		|	втДокТЧ.СтруктурнаяЕдиница,
		|	втДокТЧ.Штабель,
		|	СУММА(втДокТЧ.Количество) КАК Количество,
		|	втДокТЧ.Сертификат,
		|	втДокТЧ.Контрагент
		|ПОМЕСТИТЬ втДокТЧ_Гр
		|ИЗ
		|	втДокТЧ КАК втДокТЧ
		|ГДЕ
		|	втДокТЧ.ВидДвижения = &ВидДвижения
		|
		|СГРУППИРОВАТЬ ПО
		|	втДокТЧ.Номенклатура,
		|	втДокТЧ.Характеристика,
		|	втДокТЧ.Организация,
		|	втДокТЧ.СтруктурнаяЕдиница,
		|	втДокТЧ.Штабель,
		|	втДокТЧ.Сертификат,
		|	втДокТЧ.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.СтруктурнаяЕдиница,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Контрагент
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(
		|			&МоментИтогов,
		|			(Номенклатура, Характеристика, Организация, СтруктурнаяЕдиница, Сертификат, Штабель, Контрагент) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.Характеристика,
		|					ДокТЧ.Организация,
		|					ДокТЧ.СтруктурнаяЕдиница,
		|					ДокТЧ.Сертификат,
		|					ДокТЧ.Штабель,
		|					ДокТЧ.Контрагент
		|				ИЗ
		|					втДокТЧ_Гр КАК ДокТЧ)) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
		|ГДЕ
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
		
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			МоментИтогов = '00010101';
		Иначе
			//МоментИтогов = Новый Граница(МоментВремени(), ВидГраницы.Включая);
			МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов на ответхренении: " + ВыборкаДетальныеЗаписи.Характеристика + " , нехватка: " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток);
				Сообщение.Сообщить();	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область ОТКЛЮЧЕНО_алк_УчетЛесопродукцииНаОтветхранении_ОтменаПроведения
	Если КонтролируемыйРегистр = "ОТКЛЮЧЕНО_алк_УчетЛесопродукцииНаОтветхранении_ОтменаПроведения" Тогда
		
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетОтветхранения;
		//ДокТЧ = Новый ТаблицаЗначений;
		ДокТЧ.Свернуть("Номенклатура, Характеристика, Организация, СтруктурнаяЕдиница, Штабель, Сертификат, ВидДвижения, Контрагент","Количество");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.Характеристика,
		|	ДокТЧ.Организация,
		|	ДокТЧ.СтруктурнаяЕдиница,
		|	ДокТЧ.Штабель,
		|	ДокТЧ.Количество,
		|	ДокТЧ.ВидДвижения,
		|	ДокТЧ.Сертификат,
		|	ДокТЧ.Контрагент
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокТЧ.Номенклатура,
		|	втДокТЧ.Характеристика,
		|	втДокТЧ.Организация,
		|	втДокТЧ.СтруктурнаяЕдиница,
		|	втДокТЧ.Штабель,
		|	СУММА(втДокТЧ.Количество) КАК Количество,
		|	втДокТЧ.Сертификат,
		|	втДокТЧ.Контрагент
		|ПОМЕСТИТЬ втДокТЧ_Гр
		|ИЗ
		|	втДокТЧ КАК втДокТЧ
		|ГДЕ
		|	втДокТЧ.ВидДвижения = &ВидДвижения
		|
		|СГРУППИРОВАТЬ ПО
		|	втДокТЧ.Номенклатура,
		|	втДокТЧ.Характеристика,
		|	втДокТЧ.Организация,
		|	втДокТЧ.СтруктурнаяЕдиница,
		|	втДокТЧ.Штабель,
		|	втДокТЧ.Сертификат,
		|	втДокТЧ.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Номенклатура,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Характеристика,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.СтруктурнаяЕдиница,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Штабель,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.Контрагент,
		|	алк_УчетЛесопродукцииНаОтветхраненииОстатки.КоличествоОстаток
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииНаОтветхранении.Остатки(
		|			&МоментИтогов,
		|			(Номенклатура, Характеристика, Организация, СтруктурнаяЕдиница, Сертификат, Штабель, Контрагент) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.Характеристика,
		|					ДокТЧ.Организация,
		|					ДокТЧ.СтруктурнаяЕдиница,
		|					ДокТЧ.Сертификат,
		|					ДокТЧ.Штабель,
		|					ДокТЧ.Контрагент
		|				ИЗ
		|					втДокТЧ_Гр КАК ДокТЧ)) КАК алк_УчетЛесопродукцииНаОтветхраненииОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втДокТЧ_Гр.Номенклатура,
		|	втДокТЧ_Гр.Характеристика,
		|	втДокТЧ_Гр.СтруктурнаяЕдиница,
		|	втДокТЧ_Гр.Штабель,
		|	втДокТЧ_Гр.Контрагент,
		|	-втДокТЧ_Гр.Количество
		|ИЗ
		|	втДокТЧ_Гр КАК втДокТЧ_Гр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура,
		|	ВТ.Характеристика,
		|	ВТ.СтруктурнаяЕдиница,
		|	ВТ.Штабель,
		|	ВТ.Контрагент,
		|	СУММА(ВТ.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Номенклатура,
		|	ВТ.Характеристика,
		|	ВТ.СтруктурнаяЕдиница,
		|	ВТ.Штабель,
		|	ВТ.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_2.Номенклатура,
		|	ВТ_2.Характеристика,
		|	ВТ_2.СтруктурнаяЕдиница,
		|	ВТ_2.Штабель,
		|	ВТ_2.Контрагент,
		|	ВТ_2.КоличествоОстаток
		|ИЗ
		|	ВТ_2 КАК ВТ_2
		|ГДЕ
		|	ВТ_2.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
		
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			МоментИтогов = '00010101';
		Иначе
			//МоментИтогов = Новый Граница(МоментВремени(), ВидГраницы.Включая);
			МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов на ответ хренении: " + ВыборкаДетальныеЗаписи.Характеристика + " , нехватка: " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток);
				Сообщение.Сообщить();	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РН_алк_УчетВременныхДеклараций
	Если КонтролируемыйРегистр = "алк_УчетВременныхДеклараций" Тогда
		
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУчетВременныхДеклараций;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.Характеристика,
		|	ДокТЧ.ВТД
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_УчетВременныхДекларацийОстатки.Характеристика,
		|	алк_УчетВременныхДекларацийОстатки.ОбъемТаможняОстаток
		|ИЗ
		|	РегистрНакопления.алк_УчетВременныхДеклараций.Остатки(
		|			&МоментИтогов,
		|			(Номенклатура, Характеристика, ВТД) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.Характеристика,
		|					ДокТЧ.ВТД
		|				ИЗ
		|					втДокТЧ КАК ДокТЧ)) КАК алк_УчетВременныхДекларацийОстатки
		|ГДЕ
		|	алк_УчетВременныхДекларацийОстатки.ВесНеттоОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			МоментИтогов = '00010101';
		Иначе
			МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает задекларированного объема!";		
				Сообщение.Сообщить(); 	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	#КонецОбласти
	
	#Область РН_алк_Отходы
	Если КонтролируемыйРегистр = "алк_Отходы" Тогда
		
		ДокТЧ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОтходы;
		
		//ДокТЧ = Новый ТаблицаЗначений;
		ДокТЧ.Свернуть("Номенклатура, Характеристика, ВидДвижения","Объем");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокТЧ.Номенклатура,
		|	ДокТЧ.Характеристика,
		|	ДокТЧ.Объем,
		|	ДокТЧ.ВидДвижения
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	&ДокТЧ КАК ДокТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокТЧ.Номенклатура,
		|	втДокТЧ.Характеристика,
		|	СУММА(втДокТЧ.Объем) КАК Объем
		|ПОМЕСТИТЬ втДокТЧ_Гр
		|ИЗ
		|	втДокТЧ КАК втДокТЧ
		|ГДЕ
		|	втДокТЧ.ВидДвижения = &ВидДвижения
		|
		|СГРУППИРОВАТЬ ПО
		|	втДокТЧ.Номенклатура,
		|	втДокТЧ.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ОтходыОстатки.Номенклатура,
		|	алк_ОтходыОстатки.Характеристика,
		|	алк_ОтходыОстатки.ОбъемОстаток
		|ИЗ
		|	РегистрНакопления.алк_Отходы.Остатки(
		|			&МоментИтогов,
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					ДокТЧ.Номенклатура,
		|					ДокТЧ.Характеристика
		|				ИЗ
		|					втДокТЧ_Гр КАК ДокТЧ)) КАК алк_ОтходыОстатки
		|ГДЕ
		|	алк_ОтходыОстатки.ОбъемОстаток < 0";
		
		Запрос.УстановитьПараметр("ДокТЧ", ДокТЧ);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
		
		
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			МоментИтогов = '00010101';
		Иначе
			//МоментИтогов = Новый Граница(МоментВремени(), ВидГраницы.Включая);
			МоментИтогов = Новый Граница(ДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая);
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("МоментИтогов", МоментИтогов);
		
		РезультатПоОстаткам = Запрос.Выполнить();  // РезультатПоОстаткам.Выгрузить()
		
		Если НЕ РезультатПоОстаткам.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатПоОстаткам.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
							
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не хватает запасов: " + ВыборкаДетальныеЗаписи.Номенклатура + " " 
								+ ВыборкаДетальныеЗаписи.Характеристика + " " 
								+ ", нехватка: " 
								+ ?(ВыборкаДетальныеЗаписи.ОбъемОстаток < 0, "" + (-ВыборкаДетальныеЗаписи.ОбъемОстаток) + " м.куб.", "") ;
				Сообщение.Сообщить();	
				
			КонецЦикла;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
	Возврат Ложь;
	
КонецФункции

Процедура ВыполнитьКонтрольОстатков(ДополнительныеСвойства, КонтролируемыйРегистр, Отказ, РежимЗаписи=Неопределено, ИспользоватьТЗИзДопСвойств = Ложь) Экспорт

	Если ДополнительныеСвойства.Свойство("НеКонтролироватьОстаткиЗапасов") Тогда 
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи=Неопределено тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	ДокументСсылка = ДополнительныеСвойства.ДляПроведения.Ссылка;
	
	#Область РН_алк_ОстаткиЗапасов
	Если КонтролируемыйРегистр = "алк_ОстаткиЗапасов" Тогда
		Запрос = новый Запрос(
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК СерийныйНомер
		|ПОМЕСТИТЬ втСНДоЗаписи
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Ссылка В(&МассивСНДоЗаписи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧХарактеристикДоЗаписи.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТЧХарактеристикДоЗаписи.Штабель КАК Штабель,
		|	ТЧХарактеристикДоЗаписи.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ втХарактеристикиДоЗаписи
		|ИЗ
		|	&ТЧХарактеристикДоЗаписи КАК ТЧХарактеристикДоЗаписи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасов.Организация КАК Организация,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель КАК Штабель,
		|	алк_ОстаткиЗапасов.Номенклатура КАК Номенклатура,
		|	алк_ОстаткиЗапасов.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасов.Сертификат КАК Сертификат,
		|	алк_ОстаткиЗапасов.СерийныйНомер КАК СерийныйНомер,
		|	СУММА(ВЫБОР
		|			КОГДА &ЭтоПроведение
		|				ТОГДА 0
		|			КОГДА алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА алк_ОстаткиЗапасов.Количество
		|			ИНАЧЕ -алк_ОстаткиЗапасов.Количество
		|		КОНЕЦ) КАК Приращение,
		|	ВЫБОР
		|		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
		|				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И &ЭтоПроведение
		|			ТОГДА ЛОЖЬ
		|		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
		|				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ &ЭтоПроведение
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Использовать
		|ПОМЕСТИТЬ втДокТЧ
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасов.Организация,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель,
		|	алк_ОстаткиЗапасов.Номенклатура,
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.Сертификат,
		|	алк_ОстаткиЗапасов.СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
		|				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				И &ЭтоПроведение
		|			ТОГДА ЛОЖЬ
		|		КОГДА алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Перемещение
		|				И алк_ОстаткиЗапасов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И НЕ &ЭтоПроведение
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Организация, втДокТЧ.Организация) КАК Организация,
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница, втДокТЧ.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница,
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Штабель, втДокТЧ.Штабель) КАК Штабель,
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Номенклатура, втДокТЧ.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Характеристика, втДокТЧ.Характеристика) КАК Характеристика,
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Сертификат, втДокТЧ.Сертификат) КАК Сертификат,
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.СерийныйНомер, втДокТЧ.СерийныйНомер) КАК СерийныйНомер,
		|	-(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втДокТЧ.Приращение, 0)) КАК Количество,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыХарактеристик.Объем = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(-(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втДокТЧ.Приращение, 0)) / алк_ПараметрыХарактеристик.Объем, 0)
		|	КОНЕЦ КАК КоличествоСостав,
		|	1 КАК КодОшибки
		|ПОМЕСТИТЬ втРезультатБезСортировки
		|ИЗ
		|	втДокТЧ КАК втДокТЧ
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|				,
		|				(Номенклатура, СерийныйНомер, Организация, Сертификат, СтруктурнаяЕдиница, Характеристика, Штабель) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура,
		|						ВТ.СерийныйНомер,
		|						ВТ.Организация,
		|						ВТ.Сертификат,
		|						ВТ.СтруктурнаяЕдиница,
		|						ВТ.Характеристика,
		|						ВТ.Штабель
		|					ИЗ
		|						втДокТЧ КАК ВТ)) КАК алк_ОстаткиЗапасовОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО (алк_ОстаткиЗапасовОстатки.Организация = втДокТЧ.Организация)
		|			И (алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = втДокТЧ.СтруктурнаяЕдиница)
		|			И (алк_ОстаткиЗапасовОстатки.Штабель = втДокТЧ.Штабель)
		|			И (алк_ОстаткиЗапасовОстатки.Номенклатура = втДокТЧ.Номенклатура)
		|			И (алк_ОстаткиЗапасовОстатки.Характеристика = втДокТЧ.Характеристика)
		|			И (алк_ОстаткиЗапасовОстатки.Сертификат = втДокТЧ.Сертификат)
		|			И (алк_ОстаткиЗапасовОстатки.СерийныйНомер = втДокТЧ.СерийныйНомер)
		|ГДЕ
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втДокТЧ.Приращение, 0) < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Организация,
		|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасовОстатки.Штабель,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток,
		|	NULL,
		|	2
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер
		|				ИЗ
		|					РегистрНакопления.алк_ОстаткиЗапасов.Остатки(, СерийныйНомер В
		|						(ВЫБРАТЬ
		|							ВТ.СерийныйНомер
		|						ИЗ
		|							втДокТЧ КАК ВТ)) КАК алк_ОстаткиЗапасовОстатки
		|				ГДЕ
		|					алк_ОстаткиЗапасовОстатки.СерийныйНомер <> ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|				СГРУППИРОВАТЬ ПО
		|					алк_ОстаткиЗапасовОстатки.СерийныйНомер
		|				ИМЕЮЩИЕ
		|					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница) > 1
		|						ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.Организация) > 1
		|						ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.Штабель) > 1
		|						ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.Сертификат) > 1)) КАК алк_ОстаткиЗапасовОстатки
		|ГДЕ
		|	&ЭтоПроведение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Организация,
		|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасовОстатки.Штабель,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	-алк_ОстаткиЗапасовОстатки.КоличествоОстаток,
		|	NULL,
		|	3
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ДоЗаписи.СерийныйНомер
		|				ИЗ
		|					втСНДоЗаписи КАК ДоЗаписи)) КАК алк_ОстаткиЗапасовОстатки
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Организация,
		|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасовОстатки.Штабель,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	-алк_ОстаткиЗапасовОстатки.КоличествоОстаток,
		|	NULL,
		|	3
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			(Характеристика, СтруктурнаяЕдиница, Штабель) В
		|				(ВЫБРАТЬ
		|					втХарактеристикиДоЗаписи.Характеристика,
		|					втХарактеристикиДоЗаписи.СтруктурнаяЕдиница,
		|					втХарактеристикиДоЗаписи.Штабель
		|				ИЗ
		|					втХарактеристикиДоЗаписи КАК втХарактеристикиДоЗаписи)) КАК алк_ОстаткиЗапасовОстатки
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Организация, втДокТЧ.Организация),
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница, втДокТЧ.СтруктурнаяЕдиница),
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Штабель, втДокТЧ.Штабель),
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Номенклатура, втДокТЧ.Номенклатура),
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Характеристика, втДокТЧ.Характеристика),
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.Сертификат, втДокТЧ.Сертификат),
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.СерийныйНомер, втДокТЧ.СерийныйНомер),
		|	-(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втДокТЧ.Приращение, 0)),
		|	ВЫБОР
		|		КОГДА алк_ПараметрыХарактеристик.Объем = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(-(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втДокТЧ.Приращение, 0)) / алк_ПараметрыХарактеристик.Объем, 0)
		|	КОНЕЦ,
		|	1.1
		|ИЗ
		|	втДокТЧ КАК втДокТЧ
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|				&КонецСмены,
		|				(Номенклатура, СерийныйНомер, Организация, Сертификат, СтруктурнаяЕдиница, Характеристика, Штабель) В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура,
		|						ВТ.СерийныйНомер,
		|						ВТ.Организация,
		|						ВТ.Сертификат,
		|						ВТ.СтруктурнаяЕдиница,
		|						ВТ.Характеристика,
		|						ВТ.Штабель
		|					ИЗ
		|						втДокТЧ КАК ВТ)) КАК алк_ОстаткиЗапасовОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО (алк_ОстаткиЗапасовОстатки.Организация = втДокТЧ.Организация)
		|			И (алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = втДокТЧ.СтруктурнаяЕдиница)
		|			И (алк_ОстаткиЗапасовОстатки.Штабель = втДокТЧ.Штабель)
		|			И (алк_ОстаткиЗапасовОстатки.Номенклатура = втДокТЧ.Номенклатура)
		|			И (алк_ОстаткиЗапасовОстатки.Характеристика = втДокТЧ.Характеристика)
		|			И (алк_ОстаткиЗапасовОстатки.Сертификат = втДокТЧ.Сертификат)
		|			И (алк_ОстаткиЗапасовОстатки.СерийныйНомер = втДокТЧ.СерийныйНомер)
		|ГДЕ
		|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втДокТЧ.Приращение, 0) < 0
		|	И &КонтролироватьОстаткиНаДатуДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Организация,
		|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасовОстатки.Штабель,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток,
		|	NULL,
		|	2.1
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&КонецСмены,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер
		|				ИЗ
		|					РегистрНакопления.алк_ОстаткиЗапасов.Остатки(, СерийныйНомер В
		|						(ВЫБРАТЬ
		|							ВТ.СерийныйНомер
		|						ИЗ
		|							втДокТЧ КАК ВТ)) КАК алк_ОстаткиЗапасовОстатки
		|				ГДЕ
		|					алк_ОстаткиЗапасовОстатки.СерийныйНомер <> ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|				СГРУППИРОВАТЬ ПО
		|					алк_ОстаткиЗапасовОстатки.СерийныйНомер
		|				ИМЕЮЩИЕ
		|					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница) > 1
		|						ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.Организация) > 1
		|						ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.Штабель) > 1
		|						ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.Сертификат) > 1)) КАК алк_ОстаткиЗапасовОстатки
		|ГДЕ
		|	&ЭтоПроведение
		|	И &КонтролироватьОстаткиНаДатуДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Организация,
		|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасовОстатки.Штабель,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	-алк_ОстаткиЗапасовОстатки.КоличествоОстаток,
		|	NULL,
		|	3.1
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&КонецСмены,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ДоЗаписи.СерийныйНомер
		|				ИЗ
		|					втСНДоЗаписи КАК ДоЗаписи)) КАК алк_ОстаткиЗапасовОстатки
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток < 0
		|	И &КонтролироватьОстаткиНаДатуДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Организация,
		|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасовОстатки.Штабель,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	-алк_ОстаткиЗапасовОстатки.КоличествоОстаток,
		|	NULL,
		|	3.1
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&КонецСмены,
		|			(Характеристика, СтруктурнаяЕдиница, Штабель) В
		|				(ВЫБРАТЬ
		|					втХарактеристикиДоЗаписи.Характеристика,
		|					втХарактеристикиДоЗаписи.СтруктурнаяЕдиница,
		|					втХарактеристикиДоЗаписи.Штабель
		|				ИЗ
		|					втХарактеристикиДоЗаписи КАК втХарактеристикиДоЗаписи)) КАК алк_ОстаткиЗапасовОстатки
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток < 0
		|	И &КонтролироватьОстаткиНаДатуДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втРезультатБезСортировки.Организация КАК Организация,
		|	втРезультатБезСортировки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	втРезультатБезСортировки.Штабель КАК Штабель,
		|	втРезультатБезСортировки.Номенклатура КАК Номенклатура,
		|	втРезультатБезСортировки.Характеристика КАК Характеристика,
		|	втРезультатБезСортировки.Сертификат КАК Сертификат,
		|	втРезультатБезСортировки.СерийныйНомер КАК СерийныйНомер,
		|	втРезультатБезСортировки.Количество КАК Количество,
		|	втРезультатБезСортировки.КоличествоСостав КАК КоличествоСостав,
		|	втРезультатБезСортировки.КодОшибки КАК КодОшибки
		|ИЗ
		|	втРезультатБезСортировки КАК втРезультатБезСортировки");
		
		ОбъектМетаДанных = ДокументСсылка.МетаДанные();
		ЕстьДатаСмены = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаСмены", ОбъектМетаДанных);
		ЕстьСмена = ОбщегоНазначения.ЕстьРеквизитОбъекта("Смена", ОбъектМетаДанных);
		
		Если ЕстьДатаСмены И ЕстьСмена Тогда
			КонецСмены = алк_ОбщегоНазначенияКлиентСервер.ПолучитьВремяКонцаСмены(ДокументСсылка.Смена, ДокументСсылка.ДатаСмены);
			Если КонецСмены = Неопределено Тогда 
				КонецСмены = ДокументСсылка.Дата; 
			КонецЕсли;
		Иначе
			КонецСмены = ДокументСсылка.Дата;	
		КонецЕсли;
		
		Если КонтролироватьОстаткиНаДатуДокумента() Тогда 
			КонтролироватьОстаткиНаДатуДокумента = Истина;  
			Если ДополнительныеСвойства.Свойство("КонтролироватьОстаткиНаДатуДокумента") Тогда  
				КонтролироватьОстаткиНаДатуДокумента = ДополнительныеСвойства.КонтролироватьОстаткиНаДатуДокумента; 
			КонецЕсли; 
		Иначе
			КонтролироватьОстаткиНаДатуДокумента = Ложь; 
		КонецЕсли;
		 
		Если ДополнительныеСвойства.Свойство("ТЧХарактеристикДоЗаписи") Тогда 
			ТЧХарактеристикДоЗаписи = ДополнительныеСвойства.ТЧХарактеристикДоЗаписи; 
		Иначе
			ТЧХарактеристикДоЗаписи = Новый ТаблицаЗначений; 
			
			ТЧХарактеристикДоЗаписи.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			ТЧХарактеристикДоЗаписи.Колонки.Добавить("СтруктурнаяЕдиница",Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
			ТЧХарактеристикДоЗаписи.Колонки.Добавить("Штабель",Новый ОписаниеТипов("СправочникСсылка.алк_Штабели"));	
		КонецЕсли;                                                               
					
		Запрос.УстановитьПараметр("Регистратор", ДокументСсылка); 
		Запрос.УстановитьПараметр("КонецСмены", КонецСмены);
		Запрос.УстановитьПараметр("ЭтоПроведение", РежимЗаписи = РежимЗаписиДокумента.Проведение);
		Запрос.УстановитьПараметр("МассивСНДоЗаписи", ?(ДополнительныеСвойства.Свойство("МассивСНДоЗаписи"), ДополнительныеСвойства.МассивСНДоЗаписи, Новый Массив));    
		Запрос.УстановитьПараметр("КонтролироватьОстаткиНаДатуДокумента",КонтролироватьОстаткиНаДатуДокумента);
		Запрос.УстановитьПараметр("ТЧХарактеристикДоЗаписи",ТЧХарактеристикДоЗаписи);
	КонецЕсли;
	
	#КонецОбласти
	
	Если Запрос <> Неопределено Тогда
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
				
		Если РезультатЗапроса.Количество() > 0 Тогда
			
			Если КонтролируемыйРегистр = "алк_ОстаткиЗапасов" Тогда //Приводить наверное нужно все результаты к этому шаблону	
				Сообщить(СтрШаблон("При проведении документа %1 обнаружены ошибки:", ДокументСсылка));
				Пока РезультатЗапроса.Следующий() Цикл
					
					Если РезультатЗапроса.КодОшибки = 1 Тогда	
						
						Если ЗначениеЗаполнено(РезультатЗапроса.СерийныйНомер) Тогда
							Сообщить(СтрШаблон("- Остатки запасов: По организации %1 на складе %2%3 обнаружены отрицательные остатки  пакета № %4 объемом %5"
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.СерийныйНомер
							, РезультатЗапроса.Количество));
						Иначе
							Сообщить(СтрШаблон("- Остатки запасов: По организации %1 на складе %2%3 обнаружены отрицательные остатки номенклатуры %4 / %5%6 в объеме %7 и количестве %8"
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в штабеле " + РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.Номенклатура
							, РезультатЗапроса.Характеристика
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Сертификат), " " + РезультатЗапроса.Сертификат, "")
							, РезультатЗапроса.Количество
							, РезультатЗапроса.КоличествоСостав));
						КонецЕсли;
						
					ИначеЕсли РезультатЗапроса.КодОшибки = 2 Тогда
						
						Сообщить(СтрШаблон("- Дублирование пакета: По серийному номеру № %1, определены остатки по организации %2 на складе %3%4 с номенклатурой %5 / %6%7 в количестве %8"
						, РезультатЗапроса.СерийныйНомер
						, РезультатЗапроса.Организация
						, РезультатЗапроса.СтруктурнаяЕдиница
						, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
						, РезультатЗапроса.Номенклатура
						, РезультатЗапроса.Характеристика
						, ?(ЗначениеЗаполнено(РезультатЗапроса.Сертификат), " по сертификату " + РезультатЗапроса.Сертификат, "")
						, РезультатЗапроса.Количество));
						
					ИначеЕсли РезультатЗапроса.КодОшибки = 3 Тогда
						
						Если ЗначениеЗаполнено(РезультатЗапроса.СерийныйНомер) Тогда
							
							Сообщить(СтрШаблон("- Удаленный пакет: По организации %1 на складе %2%3 обнаружены отрицательные остатки  пакета № %4 объемом %5"
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.СерийныйНомер
							, РезультатЗапроса.Количество));   
							
						Иначе  
							
							Сообщить(СтрШаблон("- Удаленная характеристика: По организации %1 на складе %2%3 обнаружены отрицательные остатки характеристики № %4 объемом %5"
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.Характеристика
							, РезультатЗапроса.Количество)); 
							
						КонецЕсли;
						
					ИначеЕсли РезультатЗапроса.КодОшибки = 1.1 Тогда	
						
						Если ЗначениеЗаполнено(РезультатЗапроса.СерийныйНомер) Тогда
							Сообщить(СтрШаблон("- Остатки запасов на %1: По организации %2 на складе %3%4 обнаружены отрицательные остатки  пакета № %5 объемом %6"
							, КонецСмены 
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.СерийныйНомер
							, РезультатЗапроса.Количество));
						Иначе
							Сообщить(СтрШаблон("- Остатки запасов на %1: По организации %2 на складе %3%4 обнаружены отрицательные остатки номенклатуры %5 / %6%7 в объеме %8 и количестве %9"
							, КонецСмены
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в штабеле " + РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.Номенклатура
							, РезультатЗапроса.Характеристика
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Сертификат), " " + РезультатЗапроса.Сертификат, "")
							, РезультатЗапроса.Количество
							, РезультатЗапроса.КоличествоСостав));
						КонецЕсли; 
						
					ИначеЕсли РезультатЗапроса.КодОшибки = 2.1 Тогда
						
						Сообщить(СтрШаблон("- Дублирование пакета на %1: По серийному номеру № %2, определены остатки по организации %3 на складе %4%5 с номенклатурой %6 / %7%8 в количестве %9"
						, КонецСмены
						, РезультатЗапроса.СерийныйНомер
						, РезультатЗапроса.Организация
						, РезультатЗапроса.СтруктурнаяЕдиница
						, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
						, РезультатЗапроса.Номенклатура
						, РезультатЗапроса.Характеристика
						, ?(ЗначениеЗаполнено(РезультатЗапроса.Сертификат), " по сертификату " + РезультатЗапроса.Сертификат, "")
						, РезультатЗапроса.Количество));
						
					ИначеЕсли РезультатЗапроса.КодОшибки = 3.1 Тогда
						
						Если ЗначениеЗаполнено(РезультатЗапроса.СерийныйНомер) Тогда
							
							Сообщить(СтрШаблон("- Удаленный пакет на %1: По организации %2 на складе %3%4 обнаружены отрицательные остатки  пакета № %5 объемом %6"
							, КонецСмены
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.СерийныйНомер
							, РезультатЗапроса.Количество));   
							
						Иначе  
							
							Сообщить(СтрШаблон("- Удаленная характеристика на %1: По организации %2 на складе %3%4 обнаружены отрицательные остатки характеристики № %5 объемом %6"
							, КонецСмены
							, РезультатЗапроса.Организация
							, РезультатЗапроса.СтруктурнаяЕдиница
							, ?(ЗначениеЗаполнено(РезультатЗапроса.Штабель), " в ячейке "+РезультатЗапроса.Штабель, "")
							, РезультатЗапроса.Характеристика
							, РезультатЗапроса.Количество)); 
							
						КонецЕсли;
	
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;	
			//////////////////////////////////////
			Отказ = Истина;	
		КонецЕсли;
	Иначе
		ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка. Неопределен регистр контроля. Общий модуль: РфпСервер, процедура: ВыполнитьКонтрольОстатков. %1", ДокументСсылка), УровеньЖурналаРегистрации.Информация);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область РасчетныеМеханизмы

/////////////////////////// Расчет объемов и весов /////////////////////////////

&НаСервере
Функция ПолучитьПараметрыПрипуска(Припуск) Экспорт

	ПараметрыПрипуска = Новый Структура;
	
	ПараметрыПрипуска.Вставить("ПрипускПоШирине", 0);
	ПараметрыПрипуска.Вставить("ПрипускПоТолщине", 0);
	ПараметрыПрипуска.Вставить("ПрипускПоДлине", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВариантыПрипуска.Ссылка,
		|	алк_ВариантыПрипуска.ПрипускПоШирине,
		|	алк_ВариантыПрипуска.ПрипускПоТолщине,
		|	алк_ВариантыПрипуска.ПрипускПоДлине
		|ИЗ
		|	Справочник.алк_ВариантыПрипуска КАК алк_ВариантыПрипуска
		|ГДЕ
		|	алк_ВариантыПрипуска.Ссылка = &Припуск";
	
	Запрос.УстановитьПараметр("Припуск", Припуск);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                                                		
		ПараметрыПрипуска.Вставить("ПрипускПоШирине", 	ВыборкаДетальныеЗаписи.ПрипускПоШирине);
		ПараметрыПрипуска.Вставить("ПрипускПоТолщине", 	ВыборкаДетальныеЗаписи.ПрипускПоТолщине);
		ПараметрыПрипуска.Вставить("ПрипускПоДлине", 	ВыборкаДетальныеЗаписи.ПрипускПоДлине); 		
	КонецЦикла;
	
	Возврат  ПараметрыПрипуска; 

КонецФункции // ПолучитьПараметрыПрипуска()


Функция ОбъемыПакета(Характеристика, КоличествоСостав, Период = '00010101', ПараметрыПрипуска = Неопределено) Экспорт
	
	Объемы = Новый Структура("Объем, ОбъемТаможня", 0, 0);
	
	Если Характеристика <> Неопределено И ЗначениеЗаполнено(Характеристика) Тогда
		
		ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(Характеристика);
		
		Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиломатериал Тогда
			
			ДлинаММ 	= ПараметрыХ["Длина"].ДлинаММ;
			ШиринаММ  	= ПараметрыХ["Сечение"].ШиринаММ;
			ТолщинаММ	= ПараметрыХ["Сечение"].ТолщинаММ;   			
			
			Объемы.Объем 		= КоличествоСостав * ДлинаММ/1000 * ШиринаММ/1000 * ТолщинаММ/1000; 
			Объемы.ОбъемТаможня = КоличествоСостав * (ДлинаММ + ПараметрыПрипуска.ПрипускПоДлине)/1000 * (ШиринаММ + ПараметрыПрипуска.ПрипускПоШирине)/1000 * (ТолщинаММ + ПараметрыПрипуска.ПрипускПоТолщине)/1000; 
					
		КонецЕсли; 
		
		Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.ПиломатериалСП Тогда
			
			Объем = КоличествоСостав * ПараметрыХ["Длина"].ДлинаММ/1000 * ПараметрыХ["Сечение"].ШиринаММ/1000 * ПараметрыХ["Сечение"].ТолщинаММ/1000; 
			Объемы.Объем = Объем;
			
		КонецЕсли; 
		
		Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.ШпонКусковой Тогда
			
			Объем = КоличествоСостав * ПараметрыХ["Длина"].ДлинаММ/1000 * ПараметрыХ["Сечение"].ШиринаММ/1000 * ПараметрыХ["Сечение"].ТолщинаММ/1000; 
			Объемы.Объем = Объем;
			Объемы.ОбъемТаможня = Объем;
			
		КонецЕсли; 
		
		Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Карандаши Тогда
			
			Если ЗначениеЗаполнено(ПараметрыХ.Сечение) Тогда
				
				PI = ASin(1/2) * 6;	
				Объем = КоличествоСостав * PI * ПараметрыХ["Длина"].ДлинаММ/1000 * Pow((ПараметрыХ["Сечение"].ДиаметрММ/2)/1000, 2);	
				Объемы.Объем = Объем;
				Объемы.ОбъемТаможня = Объем;  				
				
			Иначе
				
				ОтборРегистра = Новый Структура("Номенклатура, Порода, Влажность, БоковаяДоска", Характеристика.Владелец, ПараметрыХ["Порода"], ПараметрыХ["Влажность"], Ложь); 
				
				ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
				Если ТЗПлотность.Количество() = 1 Тогда
					Плотность = ТЗПлотность[0].ПлотностьКгМ3;
				Иначе
					Плотность = 0;
				КонецЕсли;
											
				Объем = Окр(КоличествоСостав/Плотность, 3);	
				Объемы.Объем = Объем;
				Объемы.ОбъемТаможня = Объем;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000005")  Тогда  // Оцилиндрованное бревно (кат)
			
			ОтборРегистра = Новый Структура("Номенклатура, Порода, Влажность, БоковаяДоска", Характеристика.Владелец, ПараметрыХ["Порода"], ПараметрыХ["Влажность"], Ложь); 
			
			ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
			Если ТЗПлотность.Количество() = 1 Тогда
				Плотность = ТЗПлотность[0].ПлотностьКгМ3;
			Иначе
				Плотность = 0;
			КонецЕсли;
			
			Объем = Окр(КоличествоСостав/Плотность, 3);	
			Объемы.Объем = Объем;
			Объемы.ОбъемТаможня = Объем;
			
		КонецЕсли; 
		
		Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000006") Тогда  // Побочная продукция
			
			Объемы.Объем = КоличествоСостав;
			Объемы.ОбъемТаможня = КоличествоСостав;
			
		КонецЕсли; 
		
		Если Характеристика.Владелец.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000007") Тогда  // Пилеты (кат) 
			
			
			ОтборРегистра = Новый Структура("Номенклатура, Характеристика", Характеристика.Владелец, Характеристика); 
			
			ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
			Если ТЗПлотность.Количество() = 1 Тогда
				Плотность = ТЗПлотность[0].ПлотностьКгМ3;
			Иначе
				Плотность = 0;
			КонецЕсли;         
			
			Объем = Окр(КоличествоСостав/Плотность, 3);	
			Объемы.Объем = Объем;
			Объемы.ОбъемТаможня = Объем; 
			
		КонецЕсли;   		
		
	КонецЕсли;
	
	Возврат Объемы;
	
КонецФункции

#КонецОбласти 


#Область ВспомогательныеПроцедуры

Функция СгенерироватьКлючСвязиНаСервере(ДанныеТаблица) Экспорт
	
	Если ТипЗнч(ДанныеТаблица) <> Тип ("ТаблицаЗначений") Тогда
		Возврат 0;	
	КонецЕсли; 
	
	КлючСвязиЧисло = 1;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.КлючСвязи
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втТаблица.КлючСвязи, 0) КАК КлючСвязиЧисло
	|ИЗ
	|	втТаблица КАК втТаблица
	|ИТОГИ
	|	МАКСИМУМ(КлючСвязиЧисло)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Таблица", ДанныеТаблица);
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); Выборка.Следующий();
		КлючСвязиЧисло = Выборка.КлючСвязиЧисло + 1;
	КонецЕсли; 
	
	Возврат КлючСвязиЧисло;	
	
КонецФункции  // СгенерироватьКлючСвязи

// стрПакет - строка таблицы значений, или структура со свойствами:
//
// Характеристика, КоличествоСостав, Номенклатура
//
Функция ЗаполнитьСтруктуруПараметровПакета(стрПакет, Период, ПараметрыПрипуска = Неопределено) Экспорт
	
	СтруктураПараметровПакета = Новый Структура("Объем, ОбъемТаможня, БоковаяДоска, ВесНеттоТаможня, ВесБруттоТаможня", 0, 0, Ложь, 0, 0);
	
	Если стрПакет.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой) Тогда
		// Нач мод [Пакушев И.С.] [20.04.2018] 
		// Обращение № [0000088889] [требуется доработат установку плоности для шпона]
		// Было
		
				
		// Стало
		
		// для шпона плотност привязана к характеристикам
		// связка плотности и характеристики указывается в регистре сведений 
		// если для характеристики не указана плотность выбирается сторка регистра с незаполненной характеристикой для соответствующей номенклатуры
		
		СтруктураПараметровПакета.Объем 		= ОбъемыПакета(стрПакет.Характеристика, стрПакет.КоличествоСостав).Объем;
		СтруктураПараметровПакета.ОбъемТаможня 	= ОбъемыПакета(стрПакет.Характеристика, стрПакет.КоличествоСостав).ОбъемТаможня;
	    СтруктураПараметровПакета.БоковаяДоска 	= Ложь;
		
		ОтборРегистра = Новый Структура("Характеристика", стрПакет.Характеристика); 
		
		ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
		
		Если ТЗПлотность.Количество() = 1 Тогда
			Плотность 	= ТЗПлотность[0].ПлотностьКгМ3;
			ВесПоддона 	= ТЗПлотность[0].ВесПоддона;
		Иначе
			// если нет записи для соответствующей характеристики выбираем запись по номенклатуре но с пустой характеристикой
			
			ОтборРегистра = Новый Структура("Номенклатура, Характеристика", стрПакет.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()); 
			
			ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
			
			Если ТЗПлотность.Количество() = 1 Тогда
				Плотность 	= ТЗПлотность[0].ПлотностьКгМ3;
				ВесПоддона 	= ТЗПлотность[0].ВесПоддона;
			Иначе 			
				Плотность 	= 0;
				ВесПоддона 	= 0;
			КонецЕсли;
			
		КонецЕсли;
		
		// { удалить посте заполнения регистра сведений алк_ПлотностьНоменклатуры даннными плотности по характеристикам
		
		// на время отладки и заполнения регистра оставляем возможность заполнения по старому алгоритму 
		Если Плотность = 0 Тогда
			
			ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(стрПакет.Характеристика);
			
			ТЗБоковая = РегистрыСведений.алк_БоковаяДоска.СрезПоследних(Период, Новый Структура("Сечение", ПараметрыХ["Сечение"]));
			
			Если ТЗБоковая.Количество() <> 0 Тогда			
				ЭтоБоковаяДоска = Истина;  			
			Иначе                         			
				ЭтоБоковаяДоска = Ложь;  			
			КонецЕсли;		 
			
			СтруктураПараметровПакета.БоковаяДоска = ЭтоБоковаяДоска;
			
			//1250х1900х2,5 коэф 0.640 + 28
			П1 = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000000380");
			//955х2300х2,5 коэф 0.690  + 38
			П2 = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000000382");
			//955х1900х2,5 коэф 0.690  + 22
			П3 = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000000381");
			
			ХарактеристикаНоменклатуры = стрПакет.Характеристика;
			
			Если ХарактеристикаНоменклатуры = П1 Тогда
				Плотность = 640;
				ВесПоддона = 0.028;
			ИначеЕсли ХарактеристикаНоменклатуры = П2 Тогда
				Плотность = 690;
				ВесПоддона = 0.038;
			ИначеЕсли ХарактеристикаНоменклатуры = П3 Тогда
				
				// Нач мод [Пакушев И.С.] [20.02.2018] 
				// Обращение № [0000086701] [ТекстЗаявки]
				// Было 
				// Плотность = 690;
				// Стало
				Плотность = 720;
				// Кон мод [Пакушев И.С.] [20.02.2018]  			
				
				ВесПоддона = 0.022;
				
			Иначе
				Плотность = 761.5;	                    	
				ВесПоддона = 0.028;
			КонецЕсли;
		КонецЕсли; 	
		// } удалить посте заполнения регистра сведений алк_ПлотностьНоменклатуры даннными плотности по характеристикам
		
		// Кон мод [Пакушев И.С.] [20.04.2018]
			 		
		СтруктураПараметровПакета.ВесНеттоТаможня = СтруктураПараметровПакета.ОбъемТаможня * Плотность / 1000;
		
		СтруктураПараметровПакета.ВесБруттоТаможня = СтруктураПараметровПакета.ВесНеттоТаможня + ВесПоддона;	
		
	ИначеЕсли стрПакет.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ОтходыПилмат) Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметровПакета, стрПакет, "Объем, ОбъемТаможня");
		
		ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(стрПакет.Характеристика);
		
		ОтборРегистра = Новый Структура("Номенклатура, Порода, Влажность, БоковаяДоска", стрПакет.Номенклатура, ПараметрыХ["Порода"], ПараметрыХ["Влажность"], Ложь); 
		
		ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
		Если ТЗПлотность.Количество() = 1 Тогда
			Плотность = ТЗПлотность[0].ПлотностьКгМ3;
		Иначе
			Плотность = 0;
		КонецЕсли;
		
		СтруктураПараметровПакета.ВесНеттоТаможня = СтруктураПараметровПакета.Объем * Плотность / 1000;
		
		СтруктураПараметровПакета.ВесБруттоТаможня = СтруктураПараметровПакета.ВесНеттоТаможня + 0.001; 
		
	Иначе
		
		ОбъемыПакета = ОбъемыПакета(стрПакет.Характеристика, стрПакет.КоличествоСостав, Период, ПараметрыПрипуска);
		
		СтруктураПараметровПакета.Объем = ОбъемыПакета.Объем;
		СтруктураПараметровПакета.ОбъемТаможня = ОбъемыПакета.ОбъемТаможня;
		
		ПараметрыХ = АлгоритмыСвойстваИХарактеристики.ПараметрыХарактеристики(стрПакет.Характеристика);
		
		ТЗБоковая = РегистрыСведений.алк_БоковаяДоска.СрезПоследних(Период, Новый Структура("Сечение", ПараметрыХ["Сечение"]));
		
		Если ТЗБоковая.Количество() <> 0 Тогда 			
			ЭтоБоковаяДоска = Истина;    			
		Иначе                         			
			ЭтоБоковаяДоска = Ложь;   			
		КонецЕсли; 
		
		СтруктураПараметровПакета.БоковаяДоска = ЭтоБоковаяДоска;
		
		ОтборРегистра = Новый Структура("Номенклатура, Порода, Влажность, БоковаяДоска", стрПакет.Номенклатура, ПараметрыХ["Порода"], ПараметрыХ["Влажность"], ЭтоБоковаяДоска); 
		
		ТЗПлотность = РегистрыСведений.алк_ПлотностьНоменклатуры.СрезПоследних(Период, ОтборРегистра);
		
		Плотность = 0;
		Тара = 0;
		
		Если ТЗПлотность.Количество() = 1 Тогда
			Плотность = ТЗПлотность[0].ПлотностьКгМ3;
			Тара = ТЗПлотность[0].ВесТарыКг;
		Иначе
			Для каждого стрПлотность Из ТЗПлотность Цикл   // для пилет по характеристике
				Если стрПлотность.Характеристика = стрПакет.Характеристика Тогда
					Плотность = стрПлотность.ПлотностьКгМ3;
					Тара = стрПлотность.ВесТарыКг;			
				КонецЕсли;	
			КонецЦикла;		
		КонецЕсли;
		
		СтруктураПараметровПакета.ВесНеттоТаможня = окр(СтруктураПараметровПакета.ОбъемТаможня * Плотность / 1000, 3);		
		СтруктураПараметровПакета.ВесБруттоТаможня = окр(СтруктураПараметровПакета.ВесНеттоТаможня + Тара/1000, 3);
		
		//Если стрПакет.Номенклатура.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.Пиломатериал Тогда
		//	СтруктураПараметровПакета.ВесБруттоТаможня = СтруктураПараметровПакета.ВесНеттоТаможня + (10/1000);		
		//Иначе
		//	СтруктураПараметровПакета.ВесБруттоТаможня = СтруктураПараметровПакета.ВесНеттоТаможня + 0.028;
		//КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СтруктураПараметровПакета;
	
КонецФункции 


Функция ПериодПроведения(ДокументПроводимый) Экспорт 
		
		
	Если ТипЗнч(ДокументПроводимый) = Тип("ДокументСсылка.алк_РасходнаяНакладная") Тогда
					
		Если ДокументПроводимый.Смена = Перечисления.Смены.смена_8_20 
			Или ДокументПроводимый.Смена = Справочники.алк_Смены.День_2 Тогда
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 20 * 3600 - 1;	
			
		ИначеЕсли ДокументПроводимый.Смена = Перечисления.Смены.смена_20_8 
			Или ДокументПроводимый.Смена = Справочники.алк_Смены.Ночь_2 Тогда
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 32 * 3600 - 1;
			
		ИначеЕсли ДокументПроводимый.Смена = Справочники.алк_Смены.День_3 Тогда			
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 16 * 3600 - 1;
			
		ИначеЕсли ДокументПроводимый.Смена = Справочники.алк_Смены.Вечер_3 Тогда			
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 24 * 3600 - 1;
			
		ИначеЕсли ДокументПроводимый.Смена = Справочники.алк_Смены.Ночь_3 Тогда			
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 32 * 3600 - 1;
			
		КонецЕсли; 	
		
	Иначе
		
		Если ДокументПроводимый.Смена = Перечисления.Смены.смена_8_20 
			Или ДокументПроводимый.Смена = Справочники.алк_Смены.День_2 Тогда
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 8 * 3600 + 1;	
			
		ИначеЕсли ДокументПроводимый.Смена = Перечисления.Смены.смена_20_8 
			Или ДокументПроводимый.Смена = Справочники.алк_Смены.Ночь_2 Тогда
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 20 * 3600 + 1;
			
		ИначеЕсли ДокументПроводимый.Смена = Справочники.алк_Смены.День_3 Тогда			
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 8 * 3600 + 1;
			
		ИначеЕсли ДокументПроводимый.Смена = Справочники.алк_Смены.Вечер_3 Тогда			
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 16 * 3600 + 1;
			
		ИначеЕсли ДокументПроводимый.Смена = Справочники.алк_Смены.Ночь_3 Тогда			
			
			Период = НачалоДня(ДокументПроводимый.ДатаСмены) + 24 * 3600 + 1;
			
		КонецЕсли;		
	КонецЕсли; 

	
	Возврат Период;
	
КонецФункции // ПериодПроведения

Функция ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, Имя, ДопПараметры = Неопределено) Экспорт
	
	Период = Дата(1,1,1);
	
	Если ТипЗнч(ПараметрыСмены.Смена) = Тип("СправочникСсылка.алк_Смены") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяПроведенияДокументовСрезПоследних.ИмяМетаданныхДокумента,
		|	ВремяПроведенияДокументовСрезПоследних.Приращение КАК Приращение
		|ИЗ
		|	РегистрСведений.ВремяПроведенияДокументов.СрезПоследних(
		|			&ДатаСреза,
		|			Смена = &Смена
		|				И ИмяМетаданныхДокумента = &ИмяМетаданныхДокумента) КАК ВремяПроведенияДокументовСрезПоследних";
		
		Запрос.УстановитьПараметр("ДатаСреза", ПараметрыСмены.ДатаСмены);
		Запрос.УстановитьПараметр("ИмяМетаданныхДокумента", Имя);
		Запрос.УстановитьПараметр("Смена", ПараметрыСмены.Смена);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Период = НачалоДня(ПараметрыСмены.ДатаСмены) + ВыборкаДетальныеЗаписи.Приращение;  
			
			Если Имя = "алк_ПеремещениеЗапасов"  Тогда
				Период = Дата(1,1,1);
				Если ДопПараметры <> Неопределено Тогда 				
					Если ДопПараметры.Свойство("Дельта") Тогда
						Период = НачалоДня(ПараметрыСмены.ДатаСмены) + ВыборкаДетальныеЗаписи.Приращение + ДопПараметры.Дельта; 						
					КонецЕсли;					
				КонецЕсли;
			КонецЕсли;			
			
		КонецЦикла;
		
	Иначе  	
		
		Если Имя = "алк_ПриемкаЛесопродукции" Тогда
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 8 * 3600 + 1;	
				
			Иначе
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 + 1;
				
			КонецЕсли;
			
		ИначеЕсли Имя = "алк_СборкаЗапасов" Тогда 
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 8 * 3600 + 10;	
				
			Иначе
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 + 10;
				
			КонецЕсли;
			
		ИначеЕсли Имя = "алк_СменныйРапортЦЛП" ИЛИ Имя = "алк_СменныйРапортОтходы" Тогда 
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 - 1;	
				
			Иначе
				
				Период = КонецДня(ПараметрыСмены.ДатаСмены) - 1;
				
			КонецЕсли;
			
		ИначеЕсли Имя = "алк_ПередачаНаОтветхранение" Тогда 
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 8 * 3600 + 5;	
				
			Иначе
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 + 5;
				
			КонецЕсли;
			
		ИначеЕсли Имя = "алк_РасходнаяНакладная" Тогда // Дневная: 19-59-50, ночная: 23-59-50 (день смены)
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 19 * 3600 + 59 * 60 + 50;	
				
			Иначе
				
				Период = КонецДня(ПараметрыСмены.ДатаСмены) - 9;
				
			КонецЕсли;
			
		ИначеЕсли Имя = "алк_ТранспортировкаЗапасов" Тогда // Дневная: 19-59-52, ночная: 23-59-52 (день смены)
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 19 * 3600 + 59 * 60 + 52;	
				
			Иначе
				
				Период = КонецДня(ПараметрыСмены.ДатаСмены) - 7;
				
			КонецЕсли;
			
		ИначеЕсли Имя = "алк_ПеремещениеЗапасов"  Тогда 
			
			Если ДопПараметры <> Неопределено Тогда
				
				Если ДопПараметры.П1 = 1 Тогда
					Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
						Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 8 * 3600 + 15;	
					Иначе
						Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 + 15;
					КонецЕсли;
				КонецЕсли; 
				
			КонецЕсли; 
			
		ИначеЕсли Имя = "алк_УпаковкаНоменклатуры" Тогда 
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 8 * 3600 + 10;	
				
			Иначе
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 + 10;
				
			КонецЕсли;
			
		Иначе
			
			Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 Тогда
				
				Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 - 2 ;	
				
			Иначе
				
				Период = КонецДня(ПараметрыСмены.ДатаСмены) + 8 * 3600 - 2;
				
			КонецЕсли;	
			
		КонецЕсли; 
		
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		
		Если ПараметрыСмены.Смена = Перечисления.Смены.смена_8_20 
			Или ПараметрыСмены.Смена = Справочники.алк_Смены.День_2 Тогда
			
			Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 20 * 3600 - 2;	
			
		ИначеЕсли ПараметрыСмены.Смена = Перечисления.Смены.смена_20_8 
			Или ПараметрыСмены.Смена = Справочники.алк_Смены.Ночь_2 Тогда
			
			Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 32 * 3600 - 2;
			
		ИначеЕсли ПараметрыСмены.Смена = Справочники.алк_Смены.День_3 Тогда			
			
			Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 16 * 3600 - 2;
			
		ИначеЕсли ПараметрыСмены.Смена = Справочники.алк_Смены.Вечер_3 Тогда			
			
			Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 24 * 3600 - 2;
			
		ИначеЕсли ПараметрыСмены.Смена = Справочники.алк_Смены.Ночь_3 Тогда			
			
			Период = НачалоДня(ПараметрыСмены.ДатаСмены) + 32 * 3600 - 2;
			
		КонецЕсли;		
	КонецЕсли; 
	
	Возврат Период;
	
КонецФункции

Функция ПолучитьПоследнийПериодПакета(Регистратор,ДатаДокумента,ДатаСмены,Смена,Склад,Штабель,ТЧСерийныеНомера,Участок) Экспорт   
	
	ПараметрыСмены = ПолучитьДатуВремяНачалоКонецСмены(Смена,ДатаСмены);
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТЧСерийныеНомера.СерийныйНомер КАК СерийныйНомер
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	&ТЧСерийныеНомера КАК ТЧСерийныеНомера
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА алк_ОстаткиЗапасовОбороты.Период МЕЖДУ &ДатаНачалаСмены И &ДатаКонцаСмены
	               |				ТОГДА алк_ОстаткиЗапасовОбороты.Период
	               |			ИНАЧЕ &ДатаДокумента
	               |		КОНЕЦ) КАК Дата,
	               |	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер
	               |ПОМЕСТИТЬ ВТ_ДатыПакетов
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	               |			&ДатаНачалаСмены,
	               |			&ДатаКонцаСмены,
	               |			Регистратор,
	               |			СерийныйНомер В
	               |					(ВЫБРАТЬ
	               |						вт.СерийныйНомер КАК СерийныйНомер
	               |					ИЗ
	               |						вт КАК вт)
	               |				И СтруктурнаяЕдиница = &Склад
	               |				И Штабель = &Штабель) КАК алк_ОстаткиЗапасовОбороты
	               |ГДЕ
	               |	алк_ОстаткиЗапасовОбороты.Регистратор <> &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	алк_ОстаткиЗапасовОбороты.СерийныйНомер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР
	               |		КОГДА ВТ_ДатыПакетов.Дата ЕСТЬ NULL
	               |			ТОГДА &ДатаДокумента
	               |		КОГДА ВТ_ДатыПакетов.Дата = &ДатаКонцаСмены
	               |			ТОГДА ВТ_ДатыПакетов.Дата
	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ДатыПакетов.Дата, СЕКУНДА, 1)
	               |	КОНЕЦ КАК Дата,
	               |	вт.СерийныйНомер КАК СерийныйНомер
	               |ИЗ
	               |	вт КАК вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПакетов КАК ВТ_ДатыПакетов
	               |		ПО вт.СерийныйНомер = ВТ_ДатыПакетов.СерийныйНомер";
	
	Период = ПараметрыСмены.ДатаВремяНачалаСмены + 15;	

	Запрос.УстановитьПараметр("ДатаНачалаСмены",ПараметрыСмены.ДатаВремяНачалаСмены);
	Запрос.УстановитьПараметр("ДатаКонцаСмены",ПараметрыСмены.ДатаВремяКонцаСмены);
	Запрос.УстановитьПараметр("ДатаДокумента",Период);
	Запрос.УстановитьПараметр("ТЧСерийныеНомера",ТЧСерийныеНомера);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Штабель",Штабель);
	Запрос.УстановитьПараметр("Регистратор",Регистратор); 
	
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл 
	//	Возврат Выборка.Дата;
	//КонецЦикла;
	//
	//Возврат Период;
	
	Возврат Запрос.Выполнить().Выгрузить();
			
КонецФункции

// Функция - Получает дату время начало конец смены
//
// Параметры:
//  Смена		Справочник.алк_Смены
//  ДатаСмены	Дата, необязательный 	 Дата смены, если не задан - ТекущаяДата() 
// 
// Возвращаемое значение:
//   Структура:
//		Ключ: ДатаВремяНачалаСмены, Значение: ДатаВремя
//		Ключ: ДатаВремяКонцаСмены, Значение: ДатаВремя
//
// Дубоделов Э.А. 25.05.2023
Функция ПолучитьДатуВремяНачалоКонецСмены(Смена, ДатаСмены = "") Экспорт
	
	Если ДатаСмены = "" Тогда
		ДатаСмены = ТекущаяДата();
	КонецЕсли;
	
	НачалоДняДатаСмены = НачалоДня(ДатаСмены);
	ДатаВремяНачалаКонцаСмены = Новый Структура;
	
	НачалоСмены = Смена.НачалоСмены;
	КонецСмены = Смена.КонецСмены;
	
	ДатаВремяНачалаСмены = НачалоДняДатаСмены + (НачалоСмены - Дата(1,1,1)); 
	ДатаВремяКонцаСмены = НачалоДняДатаСмены + (КонецСмены - Дата(1,1,1));
	ДатаВремяКонцаСмены = ДатаВремяКонцаСмены + ?(КонецСмены <= НачалоСмены,24*60*60, 0);

    ДатаВремяНачалаКонцаСмены.Вставить("ДатаВремяНачалаСмены", ДатаВремяНачалаСмены);
	ДатаВремяНачалаКонцаСмены.Вставить("ДатаВремяКонцаСмены", ДатаВремяКонцаСмены);
	
	Возврат ДатаВремяНачалаКонцаСмены;
	
КонецФункции


Функция КонецДняТекущейСмены(пДата) Экспорт
	
	ТекущийЧасДаты = Час(пДата);
	
	Если ТекущийЧасДаты > 8 И ТекущийЧасДаты < 20 Тогда
		
		Период = НачалоДня(пДата) + 20 * 3600 - 1 ;	
		
	ИначеЕсли ТекущийЧасДаты < 8 И ТекущийЧасДаты > 20 Тогда 
		
		Период = КонецДня(пДата) + 8 * 3600 - 1;
		
	КонецЕсли;
	
	Возврат Период;
КонецФункции


//Сравнивает текущую смену и дату смены со сменой и датой из документа. Возвращает Истина если текущие смены соответствуют, иначе возвращает Ложь
Функция ТекущаяСмена(ДатаСменыДокумента, СменаДокумента, Участок) Экспорт

	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Участок, ТекущаяДата());
	
	Смена = ПараметрыСменыПоТекущейДате.Смена;
	ДатаТекущейСмены = ПараметрыСменыПоТекущейДате.ДатаСмены;
			
	Если НачалоДня(ДатаТекущейСмены) = НачалоДня(ДатаСменыДокумента) И Смена = СменаДокумента Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция получает актуальные сертификаты ТД для печатных форм выставляемых 
// Возвращаемое значение Соответствие с двумя элементами и соответствующими ссылками
// 	- ТД_PEFC
// 	- ТД_PEFCcont
//
Функция ПолучитьСертификатыТД() Экспорт
	
	СписокСертификатов = Новый Соответствие;
	
	СписокСертификатов.Вставить("ТД_PEFC", Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000007").ПредставлениеНаПечать); 	// 100% ТД
	СписокСертификатов.Вставить("ТД_PEFCcont", Справочники.СертификатыНаПродукцию.НайтиПоКоду("000000013").ПредставлениеНаПечать); // PEFC controlled sources ТД
	
	Возврат СписокСертификатов;   
	
КонецФункции // ПолучитьСертификатыТД()
 
Функция ПолучитьОбъемИВесДляТаможни(Пакеты, Заказ, Дата) Экспорт 
	
	//параметры пакетов с получением плотности
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня
		|ПОМЕСТИТЬ ВТ_ХарактеристикаПакета
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(&ДатаСреза, СерийныйНомер В (&Пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПараметрыХарактеристик.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Характеристика.Владелец КАК Номенклатура,
		|	алк_ПараметрыХарактеристик.Влажность,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ
		|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
		|ИЗ
		|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|ГДЕ
		|	алк_ПараметрыХарактеристик.Характеристика В
		|			(ВЫБРАТЬ
		|				ВТ_ХарактеристикаПакета.Характеристика
		|			ИЗ
		|				ВТ_ХарактеристикаПакета КАК ВТ_ХарактеристикаПакета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ХарактеристикаПакета.СерийныйНомер,
		|	ВТ_ПараметрыХарактеристик.Номенклатура,
		|	ВТ_ХарактеристикаПакета.Характеристика,
		|	ВТ_ПараметрыХарактеристик.Порода,
		|	ВТ_ПараметрыХарактеристик.Влажность,
		|	ВТ_ХарактеристикаПакета.БоковаяДоска,
		|	ВТ_ПараметрыХарактеристик.ШиринаММ,
		|	ВТ_ПараметрыХарактеристик.ТолщинаММ,
		|	ВТ_ПараметрыХарактеристик.ДлинаММ,
		|	ВТ_ХарактеристикаПакета.КоличествоСостав,
		|	ВТ_ХарактеристикаПакета.Объем,
		|	ВТ_ХарактеристикаПакета.ОбъемТаможня,
		|	ВТ_ХарактеристикаПакета.ВесНеттоТаможня,
		|	ВТ_ХарактеристикаПакета.ВесБруттоТаможня
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ
		|	ВТ_ХарактеристикаПакета КАК ВТ_ХарактеристикаПакета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
		|		ПО ВТ_ХарактеристикаПакета.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итоговая.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_Итоговая.Характеристика,
		|	ВТ_Итоговая.БоковаяДоска,
		|	ВТ_Итоговая.Порода,
		|	ВТ_Итоговая.Номенклатура,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
		|	ВТ_Итоговая.ШиринаММ,
		|	ВТ_Итоговая.ТолщинаММ,
		|	ВТ_Итоговая.ДлинаММ,
		|	ВТ_Итоговая.Объем,
		|	ВТ_Итоговая.КоличествоСостав,
		|	ВТ_Итоговая.ОбъемТаможня,
		|	ВТ_Итоговая.ВесНеттоТаможня КАК ВесНетто,
		|	ВТ_Итоговая.ВесБруттоТаможня КАК ВесБрутто,
		|	1 КАК КоличествоПакетов,
		|	&Заказ,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесПоддона
		|ИЗ
		|	ВТ_Итоговая КАК ВТ_Итоговая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних КАК алк_ПлотностьНоменклатурыСрезПоследних
		|		ПО ВТ_Итоговая.Номенклатура = алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура
		|			И ВТ_Итоговая.Порода = алк_ПлотностьНоменклатурыСрезПоследних.Порода
		|			И ВТ_Итоговая.Влажность = алк_ПлотностьНоменклатурыСрезПоследних.Влажность
		|			И ВТ_Итоговая.БоковаяДоска = алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска
		|
		|УПОРЯДОЧИТЬ ПО
		|	СерийныйНомер";
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Пакеты", Пакеты);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить(); 	 
	
	///// Для аддендумов берем припуск из доп параметров пакетов
	
	
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоШирине КАК ПрипускПоШирине,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоТолщине КАК ПрипускПоТолщине,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоДлине КАК ПрипускПоДлине
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(, СерийныйНомер В (&Пакеты)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних";
		
		Запрос.УстановитьПараметр("Пакеты", Пакеты);
		
	Иначе
		
		// ассортимент из заказа - для связи припуска и характетистики 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
		|	алк_ЗаказПокупателяЗапасыАссортимент.Припуск,
		|	ЕСТЬNULL(алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоШирине, 0) КАК ПрипускПоШирине,
		|	ЕСТЬNULL(алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоТолщине, 0) КАК ПрипускПоТолщине,
		|	ЕСТЬNULL(алк_ЗаказПокупателяЗапасыАссортимент.Припуск.ПрипускПоДлине, 0) КАК ПрипускПоДлине
		|ИЗ
		|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
		|ГДЕ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Ссылка
		|	И алк_ЗаказПокупателяЗапасыАссортимент.Характеристика В(&Характеристики)";
		
		Запрос.УстановитьПараметр("Ссылка", Заказ);
		Запрос.УстановитьПараметр("Характеристики", ТЗ.ВыгрузитьКолонку("Характеристика")); 	
		
	КонецЕсли; 
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Ассортимент = РезультатЗапроса.Выгрузить();
	
	НоменклатураПМ = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001");  //Пиломатериал
	
	Для каждого Стр Из ТЗ Цикл
		
		Если Не Стр.Номенклатура = НоменклатураПМ Тогда 		
			Прервать;
		КонецЕсли; 
		
		Отбор = Новый Структура(); 
		
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.алк_Аддендумы") Тогда
			Отбор.Вставить("СерийныйНомер", Стр.СерийныйНомер);
		Иначе
			Отбор.Вставить("Характеристика", Стр.Характеристика);
		КонецЕсли;
		
		АссотриментНайденных = ТЗ_Ассортимент.НайтиСтроки(Отбор);
		
		Если АссотриментНайденных.Количество() = 0 Тогда
			ПрипускПоШирине 	= 0;
		    ПрипускПоТолщине	= 0;
			ПрипускПоДлине		= 0;
		Иначе
			ПрипускПоШирине 	= АссотриментНайденных[0].ПрипускПоШирине;
		    ПрипускПоТолщине	= АссотриментНайденных[0].ПрипускПоТолщине;
			ПрипускПоДлине		= АссотриментНайденных[0].ПрипускПоДлине;	
		КонецЕсли; 
		
		Стр.Объем		 	= Стр.КоличествоСостав * Стр.ШиринаММ * Стр.ТолщинаММ * Стр.ДлинаММ/1000000000;		
		Стр.ОбъемТаможня 	= Стр.КоличествоСостав * (Стр.ШиринаММ + ПрипускПоШирине)*(Стр.ТолщинаММ + ПрипускПоТолщине)*(Стр.ДлинаММ + ПрипускПоДлине)/1000000000;
		Стр.ВесНетто 		= Стр.ОбъемТаможня * Стр.ПлотностьКгМ3 / 1000;
		Стр.ВесБрутто 		= Стр.ВесНетто + Стр.ВесТарыКг/1000 + Стр.ВесПоддона;
		
		Стр.ОбъемТаможня 	= Окр(Стр.ОбъемТаможня, 2);
	
	КонецЦикла;

	Возврат ТЗ;
		

КонецФункции


Функция ПолучитьСкладыДГ(ДатаСреза) Экспорт
	
	СкладыСтруктура =  Новый Структура;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ДополнительныеНастройкиСрезПоследних.Параметр,
		|	алк_ДополнительныеНастройкиСрезПоследних.Строка КАК КодСклада,
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(&ДатаСреза, Параметр ПОДОБНО ""ДГ%"") КАК алк_ДополнительныеНастройкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО алк_ДополнительныеНастройкиСрезПоследних.Строка = СтруктурныеЕдиницы.Код";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		СкладыСтруктура.Вставить(СтрЗаменить(ВыборкаДетальныеЗаписи.Параметр, "КодСклада", ""), ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	Возврат  СкладыСтруктура;


КонецФункции // ПолучитьСкладыДГ()


Функция ПолучитьОтборПоТипуСмены(Участок, ДатаСмены) Экспорт
	
	ТЗ_ТипСмен = РегистрыСведений.алк_ТипСменыУчастка.СрезПоследних(
				?(ЗначениеЗаполнено(ДатаСмены), ДатаСмены, ТекущаяДата()), Новый Структура("Участок", Участок)); 			
				
	Если ТЗ_ТипСмен.Количество() > 0 Тогда
		 ТипСмен = ТЗ_ТипСмен[0].ТипСмены;
	КонецЕсли; 
	 
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(ТипСмен);
	
	НовыеЗначения = Новый ФиксированныйМассив(НовыйМассив);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСмен", НовыеЗначения);
	
	НовыйМассивОтбор = Новый Массив();
	НовыйМассивОтбор.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассивОтбор);

    Возврат НовыеПараметры;
	

КонецФункции //ПолучитьОтборПоТипуСмены()


Функция ПолучитьТипСмены(Участок, ДатаСмены) Экспорт
	
	ТЗ_ТипСмен = РегистрыСведений.алк_ТипСменыУчастка.СрезПоследних(
				?(ЗначениеЗаполнено(ДатаСмены), ДатаСмены, ТекущаяДата()), Новый Структура("Участок", Участок)); 			
				
	Если ТЗ_ТипСмен.Количество() > 0 Тогда
		 ТипСмен = ТЗ_ТипСмен[0].ТипСмены;
	КонецЕсли;
				
	Возврат ТипСмен;
	

КонецФункции //ПолучитьТипСмены()


Процедура ЗарегистрироватьОшибкуВСервисеРегистрацииОшибок(ТекстОшибки, ТекущийПользователь = "") Экспорт
	
	НазваниеБазы = "Алогистик";
	ТекущийПользователь = Строка(ТекущийПользователь);
	ТекущийПользователь = ?(ТекущийПользователь <> "<Не указан>", ТекущийПользователь, ""); 
	
	Сервер = "rfp01-hst020";  
	Ресурс = "/service_rfp/hs/main/raiseError?user=" + ТекущийПользователь + "&error=" + ТекстОшибки + "&base=" + НазваниеБазы;
	
	Соединение  =  Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс);
	Ответ = Соединение.Получить(Запрос);
	
КонецПроцедуры



Функция ТекстЗапросаПоказателейОборудования()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок КАК Участок,
		|	СУММА(алк_ДанныеОборудованияСрезПоследних.Значение / 100) КАК Объем
		|ПОМЕСТИТЬ ВТ_Объем20
		|ИЗ
		|	РегистрСведений.алк_ДанныеОборудования.СрезПоследних(
		|			,
		|			Показатель.ДлинаММ = 2000
		|				И Показатель.Участок = &Участок
		|				И ДатаСмены = &ДатаСмены
		|				И Смена = &Смена
		|				И Показатель.Наименование ПОДОБНО ""Объем 2%"") КАК алк_ДанныеОборудованияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок КАК Участок,
		|	СУММА(алк_ДанныеОборудованияСрезПоследних.Значение / 100) КАК Объем
		|ПОМЕСТИТЬ ВТ_Объем25
		|ИЗ
		|	РегистрСведений.алк_ДанныеОборудования.СрезПоследних(
		|			,
		|			Показатель.ДлинаММ = 2500
		|				И Показатель.Участок = &Участок
		|				И ДатаСмены = &ДатаСмены
		|				И Смена = &Смена
		|				И Показатель.Наименование ПОДОБНО ""Объем 2%"") КАК алк_ДанныеОборудованияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок КАК Участок,
		|	СУММА(ОКР(алк_ДанныеОборудованияСрезПоследних.Значение / 60, 2)) КАК ВремяПростоя
		|ПОМЕСТИТЬ ВТ_ВремяПростоя
		|ИЗ
		|	РегистрСведений.алк_ДанныеОборудования.СрезПоследних(
		|			,
		|			Показатель.Участок = &Участок
		|				И ДатаСмены = &ДатаСмены
		|				И Смена = &Смена
		|				И Показатель.Наименование ПОДОБНО ""Время простоя лущилки №%"") КАК алк_ДанныеОборудованияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок КАК Участок,
		|	СУММА(алк_ДанныеОборудованияСрезПоследних.Значение) КАК КоличествоБревен20
		|ПОМЕСТИТЬ ВТ_КоличествоБревен20
		|ИЗ
		|	РегистрСведений.алк_ДанныеОборудования.СрезПоследних(
		|			,
		|			Показатель.ДлинаММ = 2000
		|				И Показатель.Участок = &Участок
		|				И ДатаСмены = &ДатаСмены
		|				И Смена = &Смена
		|				И Показатель.Наименование ПОДОБНО ""Количество бревен%"") КАК алк_ДанныеОборудованияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок КАК Участок,
		|	СУММА(алк_ДанныеОборудованияСрезПоследних.Значение) КАК КоличествоБревен25
		|ПОМЕСТИТЬ ВТ_КоличествоБревен25
		|ИЗ
		|	РегистрСведений.алк_ДанныеОборудования.СрезПоследних(
		|			,
		|			Показатель.ДлинаММ = 2500
		|				И Показатель.Участок = &Участок
		|				И ДатаСмены = &ДатаСмены
		|				И Смена = &Смена
		|				И Показатель.Наименование ПОДОБНО ""Количество бревен%"") КАК алк_ДанныеОборудованияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ДанныеОборудованияСрезПоследних.Показатель.Участок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Объем20.Участок,
		|	0 КАК ВремяПростоя,
		|	ВТ_Объем20.Объем КАК Объем,
		|	0 КАК КоличествоБревен,
		|	ВТ_Объем20.Объем КАК Объем20,
		|	0 КАК Объем25,
		|	0 КАК КоличествоБревен20,
		|	0 КАК КоличествоБревен25
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТ_Объем20 КАК ВТ_Объем20
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Объем25.Участок,
		|	0,
		|	ВТ_Объем25.Объем,
		|	0,
		|	0,
		|	ВТ_Объем25.Объем,
		|	0,
		|	0
		|ИЗ
		|	ВТ_Объем25 КАК ВТ_Объем25
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ВремяПростоя.Участок,
		|	ВТ_ВремяПростоя.ВремяПростоя,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	ВТ_ВремяПростоя КАК ВТ_ВремяПростоя
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_КоличествоБревен20.Участок,
		|	0,
		|	0,
		|	ВТ_КоличествоБревен20.КоличествоБревен20,
		|	0,
		|	0,
		|	ВТ_КоличествоБревен20.КоличествоБревен20,
		|	0
		|ИЗ
		|	ВТ_КоличествоБревен20 КАК ВТ_КоличествоБревен20
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_КоличествоБревен25.Участок,
		|	0,
		|	0,
		|	ВТ_КоличествоБревен25.КоличествоБревен25,
		|	0,
		|	0,
		|	0,
		|	ВТ_КоличествоБревен25.КоличествоБревен25
		|ИЗ
		|	ВТ_КоличествоБревен25 КАК ВТ_КоличествоБревен25
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Участок,
		|	СУММА(ВТ.ВремяПростоя) КАК ВремяПростоя,
		|	СУММА(ВТ.Объем) КАК Объем,
		|	СУММА(ВТ.КоличествоБревен) КАК КоличествоБревен,
		|	СУММА(ВТ.Объем20) КАК Объем20,
		|	СУММА(ВТ.Объем25) КАК Объем25,
		|	СУММА(ВТ.КоличествоБревен20) КАК КоличествоБревен20,
		|	СУММА(ВТ.КоличествоБревен25) КАК КоличествоБревен25
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Участок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Участок,
		|	ВТ_Итог.ВремяПростоя,
		|	ВТ_Итог.Объем,
		|	ВТ_Итог.КоличествоБревен,
		|	ВТ_Итог.Объем20,
		|	ВТ_Итог.Объем25,
		|	ВТ_Итог.КоличествоБревен20,
		|	ВТ_Итог.КоличествоБревен25,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.КоличествоБревен20 = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(SQRT(ВТ_Итог.Объем20 / ВТ_Итог.КоличествоБревен20 / 2 / 3.14) * 100 * 2, 2)
		|	КОНЕЦ КАК СреднийДиаметр20,
		|	ВЫБОР
		|		КОГДА ВТ_Итог.КоличествоБревен25 = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(SQRT(ВТ_Итог.Объем25 / ВТ_Итог.КоличествоБревен25 / 2.5 / 3.14) * 100 * 2, 2)
		|	КОНЕЦ КАК СреднийДиаметр25
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог";
	
	Возврат ТекстЗапроса;	

КонецФункции // ТекстЗапросаПоказателейОборудования()


Функция ПолучитьДанныеПоказателейОборудования(ДатаСмены, Смена, Участок) Экспорт
	
	Показатели = Новый Структура;  
	
	Показатели.Вставить("ВремяПростоя", 	0);
	Показатели.Вставить("КоличествоБревен", 0);
	Показатели.Вставить("Объем", 			0);
	Показатели.Вставить("Объем20", 			0);
	Показатели.Вставить("Объем25", 			0);		
	Показатели.Вставить("СреднийДиаметр20", 0);
	Показатели.Вставить("СреднийДиаметр25", 0); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоказателейОборудования();
	
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Участок", Участок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		Показатели.Вставить("ВремяПростоя", 	ВыборкаДетальныеЗаписи.ВремяПростоя);
		Показатели.Вставить("КоличествоБревен", ВыборкаДетальныеЗаписи.КоличествоБревен);
		Показатели.Вставить("Объем", 			ВыборкаДетальныеЗаписи.Объем); 
		Показатели.Вставить("Объем20", 			ВыборкаДетальныеЗаписи.Объем20);
		Показатели.Вставить("Объем25", 			ВыборкаДетальныеЗаписи.Объем25);
		Показатели.Вставить("СреднийДиаметр20", ВыборкаДетальныеЗаписи.СреднийДиаметр20);
		Показатели.Вставить("СреднийДиаметр25", ВыборкаДетальныеЗаписи.СреднийДиаметр25);
	КонецЦикла;
	
	Возврат Показатели;

КонецФункции // ПолучитьДанныеПоказателейОборудования()


 // Функция подбирает по заданным параметрам остатки для списания пропорционально доли сечений на остатках.
// Списываться может либо поштучно, либо по объему. 
// Параметры - структура параметров отбора
//
Функция ПодобратьОстаткиПропорциональноОбъемамСечений(Параметры) Экспорт

	// устанавка параметров
	
	Если Параметры.Свойство("Склад") Тогда		
		Склад = Параметры.Склад; 
	Иначе 
		Склад = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000001"); // Участок сортированных лесоматериалов ЦЛП 
	КонецЕсли;
	
	Если Параметры.Свойство("Штабель") Тогда		
		Штабель = Параметры.Штабель;
	Иначе 
		Штабель = Справочники.алк_Штабели.ПустаяСсылка();
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда		
		Дата = Параметры.Дата;
	Иначе 
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("Порода") Тогда		
		Порода = Параметры.Порода;
	Иначе 
		Порода = "";
	КонецЕсли;

	Если Параметры.Свойство("Объем") Тогда		
		Объем = Параметры.Объем;
	Иначе 
		Объем = 0;
	КонецЕсли;
	
	Если Параметры.Свойство("Штуки") Тогда		
		Штуки = Параметры.Штуки;
	Иначе 
		Штуки = 0;
	КонецЕсли;
	
	Если Параметры.Свойство("Длина") Тогда		
		Длина = Параметры.Длина;
	Иначе 
		Длина = "";
	КонецЕсли;
	
	Если Параметры.Свойство("Диаметр") Тогда		
		Диаметр = Параметры.Диаметр;
	Иначе 
		Диаметр = "";
	КонецЕсли;
	
	Если Параметры.Свойство("Сорт") Тогда		
		Сорт = Параметры.Сорт;
	Иначе 
		Сорт = "";
	КонецЕсли;
	
	Если Параметры.Свойство("СписыватьТолстомер") Тогда		
		СписыватьТолстомер = Параметры.СписыватьТолстомер;
	Иначе
		СписыватьТолстомер = Истина;
	КонецЕсли; 	
	 	
	Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002");  // пиловочник

		
	МассивВозврата = Новый Массив;
		
	Запрос = Новый Запрос; 
	// запрос для определения долей разных длин и сечений в объеме списани
	
#Область Запрос1
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Сорт,
		|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК ОбъемОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА алк_ПараметрыХарактеристик.Объем = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(15, 0))
		|		КОНЕЦ) КАК КоличествоШтук,
		|	алк_ПараметрыХарактеристик.Порода.Код КАК ПородаКод,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
		|	алк_ОстаткиЗапасовОстатки.Сертификат КАК Сертификат,
		|	алк_ПараметрыХарактеристик.Сечение,
		|	алк_ПараметрыХарактеристик.Объем
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&Дата,
		|			СтруктурнаяЕдиница = &Склад
		|				И Штабель = &Штабель
		|				И Номенклатура = &Номенклатура) КАК алк_ОстаткиЗапасовОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток > 0
		|	И алк_ПараметрыХарактеристик.Порода = &Порода
		|	И (алк_ПараметрыХарактеристик.Длина В (&Длина)
		|			ИЛИ &ВсеДлины)
		|	И (алк_ПараметрыХарактеристик.Сечение В (&Сечения)
		|			ИЛИ &ВсеСечения)
		|	И (алк_ПараметрыХарактеристик.Сорт В (&Сорт)
		|			ИЛИ &ВсеСорта)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Порода.Код,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ПараметрыХарактеристик.Сечение,
		|	алк_ПараметрыХарактеристик.Объем,
		|	алк_ПараметрыХарактеристик.Сорт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Остатки.ОбъемОстаток) КАК ОбъемОстаток
		|ПОМЕСТИТЬ ВТ_ОбщийОбъемОстатки
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Порода,
		|	ВТ_Остатки.Длина,
		|	ВТ_Остатки.Сорт,
		|	ВТ_Остатки.ОбъемОстаток,
		|	ВТ_Остатки.КоличествоШтук,
		|	ВТ_Остатки.ПородаКод,
		|	ВТ_Остатки.ДлинаДлинаММ,
		|	ВТ_Остатки.Сертификат,
		|	ВТ_Остатки.Сечение,
		|	ВТ_Остатки.Объем КАК ОбъемШтуки,
		|	ВТ_ОбщийОбъемОстатки.ОбъемОстаток КАК ОбщийОбъем,
		|	&Краспределению * ВТ_Остатки.ОбъемОстаток / ВТ_ОбщийОбъемОстатки.ОбъемОстаток КАК КСписанию,
		|	ВЫБОР
		|		КОГДА ВТ_Остатки.Объем = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(&Краспределению * ВТ_Остатки.ОбъемОстаток / ВТ_ОбщийОбъемОстатки.ОбъемОстаток / ВТ_Остатки.Объем КАК ЧИСЛО(15, 0))
		|	КОНЕЦ КАК КСписаниюШтук,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3)) КАК Списано,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 0)) КАК СписаноШтук
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОбщийОбъемОстатки КАК ВТ_ОбщийОбъемОстатки
		|		ПО (ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъемШтуки УБЫВ"; 
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Дата",			Новый Граница(Дата, ВидГраницы.Включая)); 
	Запрос.УстановитьПараметр("Склад", 			Склад);
	Запрос.УстановитьПараметр("Штабель", 		Штабель);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура); 
	Запрос.УстановитьПараметр("Порода", 		Порода);
	Запрос.УстановитьПараметр("Краспределению",	?(Объем = 0, Штуки, Объем));
	Запрос.УстановитьПараметр("Длина",			Длина); 
	Запрос.УстановитьПараметр("ВсеДлины",		Не ЗначениеЗаполнено(Длина));
	Запрос.УстановитьПараметр("Сечения",		Диаметр); 
	Запрос.УстановитьПараметр("ВсеСечения",		Не ЗначениеЗаполнено(Диаметр));
	Запрос.УстановитьПараметр("Сорт",			Сорт); 
	Запрос.УстановитьПараметр("ВсеСорта",		Не ЗначениеЗаполнено(Сорт));
	
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТЗ = РезультатЗапроса.Выгрузить();  //таблица для итогов
    ТЗ.Очистить();
	
	Стр = РезультатЗапроса.Выбрать(); 
	
	// Остатки перебераются от большего диаметра к меньшему
	// Если "КСписаниюШтук" равно нулю пытаемся списать хоть одну штуку, т.к. доля получается очень маленькая, 
	// но попытаться списать большое бревно требуется. 
	
	// Далее перебераем, стараясь не выходить за границы количества штук к списанию, в конце добирам самым маленьким диаметром. 
	
	НеСписанно = ?(Объем = 0, Штуки, Объем);  
	
	Если НеСписанно = 0 Тогда
		Возврат МассивВозврата;
	КонецЕсли;
	
	Пока Стр.Следующий() Цикл  		
			
		КСписаниюШтук 	= ?(Объем = 0, Стр.КСписанию, Стр.КСписаниюШтук);
		ОбъемШтуки 		= Стр.ОбъемШтуки;
		СписаноШтук 	= 0;  
		
		Если Стр.КСписаниюШтук = 0 и  ?(Объем = 0, Истина, ОбъемШтуки < НеСписанно) И СписыватьТолстомер Тогда      // списываем по одному толстомеру  
			
			НеСписанно = НеСписанно - ?(Объем = 0, 1, ОбъемШтуки); 			
			СписаноШтук = СписаноШтук + 1; 
			
		КонецЕсли; 
		
		Пока КСписаниюШтук > 0 И НеСписанно > 0 Цикл 
			
			НеСписанно = НеСписанно - ?(Объем = 0, 1, ОбъемШтуки);
			
			КСписаниюШтук = КСписаниюШтук - 1;
			СписаноШтук = СписаноШтук + 1; 
			
		КонецЦикла;
		
		Если СписаноШтук = 0 Тогда
			Продолжить;	
		КонецЕсли;
				
		НоваяСтр = ТЗ.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
		
		НоваяСтр.Списано 		= ОбъемШтуки * СписаноШтук;
		НоваяСтр.СписаноШтук 	= СписаноШтук;			
		
	КонецЦикла;  

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Количество,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Сечение,
		|	алк_ПараметрыХарактеристик.Объем КАК ОбъемШтуки,
		|	алк_ПараметрыХарактеристик.Сорт
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&Дата,
		|			СтруктурнаяЕдиница = &Склад
		|				И Штабель = &Штабель
		|				И Номенклатура = &Номенклатура) КАК алк_ОстаткиЗапасовОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток > 0
		|	И алк_ПараметрыХарактеристик.Порода = &Порода
		|	И алк_ПараметрыХарактеристик.Длина В(&Длина)
		|	И алк_ПараметрыХарактеристик.Сечение В(&Сечение)
		|	И алк_ПараметрыХарактеристик.Сорт В(&Сорт)
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ПараметрыХарактеристик.Объем УБЫВ,
		|	алк_ПараметрыХарактеристик.Сорт.Порядок УБЫВ";
	

	Запрос.УстановитьПараметр("Склад", 			Склад);
	Запрос.УстановитьПараметр("Штабель", 		Штабель);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Порода", 		Порода);
	Запрос.УстановитьПараметр("Длина", 			ТЗ.ВыгрузитьКолонку("Длина"));
	Запрос.УстановитьПараметр("Сорт", 			ТЗ.ВыгрузитьКолонку("Сорт"));
	Запрос.УстановитьПараметр("Сечение", 		ТЗ.ВыгрузитьКолонку("Сечение")); 
	Запрос.УстановитьПараметр("Дата",			Новый Граница(Дата, ВидГраницы.Включая)); 
		
	ТЗ_Остатки = Запрос.Выполнить().Выгрузить();   
	
	ТЗ_Итог = ТЗ_Остатки.Скопировать(); 
	ТЗ_Итог.Очистить(); 
	
	Для каждого Стр Из ТЗ Цикл 
		
		КСписаниюОбъем = Стр.Списано;
		
		Для каждого СтрОст Из ТЗ_Остатки Цикл
			
			Если Стр.Длина = СтрОст.Длина И Стр.Сечение = СтрОст.Сечение И Стр.Сорт = СтрОст.Сорт Тогда 
				
				НоваяСтр = ТЗ_Итог.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтр, СтрОст);			
				
				ОбъемСписания = Мин(КСписаниюОбъем, СтрОст.Количество);
				
				НоваяСтр.Количество = ОбъемСписания;
				
				КСписаниюОбъем = КСписаниюОбъем - ОбъемСписания;				
			
			КонецЕсли;  
			
			Если КСписаниюОбъем = 0 Тогда  				
				Прервать;			
			КонецЕсли;
			
		КонецЦикла;	
	КонецЦикла;  	
	
	    	
	Для каждого Строка из ТЗ_Итог Цикл
		
		МассивВозврата.Добавить(Новый структура("Номенклатура, Характеристика, Сертификат, КоличествоШтук, Количество", 
		Номенклатура, 
		Строка.Характеристика, 
		Строка.Сертификат, 
		?(ОбъемШтуки = 0, 0, Окр(Строка.Количество/Строка.ОбъемШтуки,0)), 
		Строка.Количество));
		
	КонецЦикла;   
	
	Возврат МассивВозврата;		
	
КонецФункции 

 
Процедура РаспределитьМатериалыПоДаннымОборудованияИОстаткам(ОбъектДокументПроизводства, ОбъемЛущенияОбр20, ОбъемЛущенияОбр25) Экспорт
	
		// в списание может уходить пиловочник разных длин, есть две условные группы, 4.0 метра и 5.2 метра. 
		// объем лущения данных груп можно получить с оборудования. 
		// Так же возможно несколько пород. Породу определяем по продукции.
		
		// Возможные вариатны:
		//
		// 1. Две породы, две длины  (соотносим их по объемам больший объем по породе - больший объем по длине)
		// 2. Две породы, одна длина (разбиваем объем с оборудования пропорционально объему продукции по породам)
		// 3. Одна порода, две длины (заполняем последовательно, с одной породой)
		// 4. Одна порода, одна длина (один вариан)
		
		// добавить заполнение среднего диаметра
		// добавить заполнение отходов
		
		// получаем объемы по породам по продукции   
		
#Область ЗапросПоПрородам   

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(алк_ПроизводствоПродукция.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОбщийОбъем
		|ИЗ
		|	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
		|ГДЕ
		|	алк_ПроизводствоПродукция.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПараметрыХарактеристик.Порода,
		|	СУММА(алк_ПроизводствоПродукция.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ОбъемПоПородам
		|ИЗ
		|	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ПроизводствоПродукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ПроизводствоПродукция.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПараметрыХарактеристик.Порода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбъемПоПородам.Порода КАК Порода,
		|	ВТ_ОбъемПоПородам.Количество КАК Количество,
		|	ВТ_ОбщийОбъем.Количество КАК КоличествоВсего,
		|	ВЫБОР
		|		КОГДА ВТ_ОбщийОбъем.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_ОбъемПоПородам.Количество / ВТ_ОбщийОбъем.Количество
		|	КОНЕЦ КАК Доля
		|ИЗ
		|	ВТ_ОбъемПоПородам КАК ВТ_ОбъемПоПородам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщийОбъем КАК ВТ_ОбщийОбъем
		|		ПО (ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ";   
		
#КонецОбласти
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектДокументПроизводства.Ссылка);
		ТЗ_ПоПородам = Запрос.Выполнить().Выгрузить();
		
			
		// массивы длин, два массива для 4.0 и 5.2
		
		Длина4_0 = Новый Массив;
		
		Длина4_0.Добавить(Справочники.Длины.НайтиПоКоду("000000003")); //3,8
		Длина4_0.Добавить(Справочники.Длины.НайтиПоКоду("000000008")); //4,0
		Длина4_0.Добавить(Справочники.Длины.НайтиПоКоду("000000089")); //4,1
		Длина4_0.Добавить(Справочники.Длины.НайтиПоКоду("000000094")); //4,25
		Длина4_0.Добавить(Справочники.Длины.НайтиПоКоду("000000010")); //4,3
		Длина4_0.Добавить(Справочники.Длины.НайтиПоКоду("000000092")); //4,55 
		
		
		Длина5_2 = Новый Массив;
		
		Длина5_2.Добавить(Справочники.Длины.НайтиПоКоду("000000095")); //5,0
		Длина5_2.Добавить(Справочники.Длины.НайтиПоКоду("000000033")); //5,2
		Длина5_2.Добавить(Справочники.Длины.НайтиПоКоду("000000102")); //5,3
		Длина5_2.Добавить(Справочники.Длины.НайтиПоКоду("000000093")); //5,45

		// объемы по длинам с оборудования  
		
		ТЗ_ДанныеОборудования = Новый ТаблицаЗначений; 
		
		ТЗ_ДанныеОборудования.Колонки.Добавить("Имя");
		ТЗ_ДанныеОборудования.Колонки.Добавить("Длина");
		ТЗ_ДанныеОборудования.Колонки.Добавить("Объем"); 
		
		Если ОбъемЛущенияОбр20 > 0 Тогда 			
			НоваяСтр = ТЗ_ДанныеОборудования.Добавить(); 		
			НоваяСтр.Имя = "4.0";
			НоваяСтр.Длина = Длина4_0;
			НоваяСтр.Объем = ОбъемЛущенияОбр20;			
		КонецЕсли;
		
		Если ОбъемЛущенияОбр25 > 0 Тогда 			
			НоваяСтр = ТЗ_ДанныеОборудования.Добавить(); 		
			НоваяСтр.Имя = "5.2";
			НоваяСтр.Длина = Длина5_2;
			НоваяСтр.Объем = ОбъемЛущенияОбр25;			
		КонецЕсли;
		
		ТЗ_ДанныеОборудования.Сортировать("Объем Убыв");		
				
		

		// формируем наборы данных для заполнения
		
		МассивПараметров = Новый Массив;
		
		ПараметрыДляЗаполнения = Новый Структура; //("Дата, Порода, Объем, Длина",  
		
		ВремяСмены = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(ОбъектДокументПроизводства.Смена, ОбъектДокументПроизводства.ДатаСмены); 
		
		ПараметрыДляЗаполнения.Вставить("Дата", ВремяСмены.ДатаВремяКонцаСмены);
		ПараметрыДляЗаполнения.Вставить("Участок", ОбъектДокументПроизводства.Участок);
	
		
		// 1. Две породы, две длины  (соотносим их по объемам больший объем по породе - больший объем по длине)
		Если ТЗ_ПоПородам.Количество() > 1 и ТЗ_ДанныеОборудования.Количество() > 1 Тогда  
			
			// первый
			ПараметрыДляЗаполнения.Вставить("Порода", ТЗ_ПоПородам[0].Порода);
			ПараметрыДляЗаполнения.Вставить("Объем", ТЗ_ДанныеОборудования[0].Объем);
			ПараметрыДляЗаполнения.Вставить("Длина", ТЗ_ДанныеОборудования[0].Длина);   
			
			ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения);
			
			// второй
			ПараметрыДляЗаполнения.Вставить("Порода", ТЗ_ПоПородам[1].Порода);
			ПараметрыДляЗаполнения.Вставить("Объем", ТЗ_ДанныеОборудования[1].Объем);
			ПараметрыДляЗаполнения.Вставить("Длина", ТЗ_ДанныеОборудования[1].Длина);   
			
			ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения);	
			
			
		// 2. Две породы, одна длина (разбиваем объем с оборудования пропорционально объему продукции по породам)
		ИначеЕсли ТЗ_ПоПородам.Количество() > 1 и ТЗ_ДанныеОборудования.Количество() = 1 Тогда  
			
			// первый
			ПараметрыДляЗаполнения.Вставить("Порода", ТЗ_ПоПородам[0].Порода);
			ПараметрыДляЗаполнения.Вставить("Объем", ТЗ_ДанныеОборудования[0].Объем * ТЗ_ПоПородам[0].Доля);
			ПараметрыДляЗаполнения.Вставить("Длина", ТЗ_ДанныеОборудования[0].Длина);   
			
			ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения);
			
			// второй
			ПараметрыДляЗаполнения.Вставить("Порода", ТЗ_ПоПородам[1].Порода);
			ПараметрыДляЗаполнения.Вставить("Объем", ТЗ_ДанныеОборудования[0].Объем * ТЗ_ПоПородам[1].Доля);
			ПараметрыДляЗаполнения.Вставить("Длина", ТЗ_ДанныеОборудования[0].Длина);   
			
			ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения);		
			
			
		// 3. Одна порода, две длины (заполняем последовательно, с одной породой)	
		ИначеЕсли ТЗ_ПоПородам.Количество() = 1 и ТЗ_ДанныеОборудования.Количество() > 1 Тогда  
			
			// первый
			ПараметрыДляЗаполнения.Вставить("Порода", ТЗ_ПоПородам[0].Порода);
			ПараметрыДляЗаполнения.Вставить("Объем", ТЗ_ДанныеОборудования[0].Объем);
			ПараметрыДляЗаполнения.Вставить("Длина", ТЗ_ДанныеОборудования[0].Длина);   
			
			ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения);
			
			// второй
			ПараметрыДляЗаполнения.Вставить("Порода", ТЗ_ПоПородам[0].Порода);
			ПараметрыДляЗаполнения.Вставить("Объем", ТЗ_ДанныеОборудования[1].Объем);
			ПараметрыДляЗаполнения.Вставить("Длина", ТЗ_ДанныеОборудования[1].Длина);   
			
			ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения);
			
			
		// 4. Одна порода, одна длина (один вариан)	
		ИначеЕсли ТЗ_ПоПородам.Количество() = 1 и ТЗ_ДанныеОборудования.Количество() = 1  Тогда	  
			
			// первый
			ПараметрыДляЗаполнения.Вставить("Порода", ТЗ_ПоПородам[0].Порода);
			ПараметрыДляЗаполнения.Вставить("Объем", ТЗ_ДанныеОборудования[0].Объем);
			ПараметрыДляЗаполнения.Вставить("Длина", ТЗ_ДанныеОборудования[0].Длина);   
			
			ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения);  	
			
		
		КонецЕсли; 

	

КонецПроцедуры


Процедура ДополнитьМатериал(ОбъектДокументПроизводства, ПараметрыДляЗаполнения)    
	
	МассивВозврата = ПодобратьОстаткиПропорциональноОбъемамСечений(ПараметрыДляЗаполнения);  
	
	Для каждого Стр Из МассивВозврата Цикл
		НоваяСтр = ОбъектДокументПроизводства.Материалы.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
		НоваяСтр.Период = ПараметрыДляЗаполнения.Дата;
		НоваяСтр.Склад =  РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(ПараметрыДляЗаполнения.Участок, "СкладСписания");
	КонецЦикла; 	

КонецПроцедуры

//Ранее контроль был только на текущий момент. Появился вопрос про минус на прошлый период (дату документа)
//20250513
Функция КонтролироватьОстаткиНаДатуДокумента()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ДополнительныеНастройки.Период КАК Период,
		|	алк_ДополнительныеНастройки.Параметр КАК Параметр,
		|	алк_ДополнительныеНастройки.Дата КАК Дата,
		|	алк_ДополнительныеНастройки.Булево КАК Булево,
		|	алк_ДополнительныеНастройки.Строка КАК Строка
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеНастройки КАК алк_ДополнительныеНастройки
		|ГДЕ
		|	алк_ДополнительныеНастройки.Параметр = ""КонтролироватьОстаткиНаДатуДокумента""
		|	И алк_ДополнительныеНастройки.Булево";
	
	ТЧ = Запрос.Выполнить().Выгрузить();
	
	Если ТЧ.Количество() = 0 Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// из правил обмена
Функция КонвертироватьТовары(данныеСтроки, Источник = "") Экспорт   
	
	ИмяЗначения = "";
	
	Если ДанныеСтроки.Свойство("Номенклатура", ИмяЗначения) тогда
		Если нРег(ИмяЗначения) = "пиломатериал" тогда
			ИмяЗначения = "Пиломатериалы";
		ИначеЕсли нРег(ИмяЗначения) = "шпон кусковой" тогда
			ИмяЗначения = "ШпонКусковой";
		ИначеЕсли нРег(ИмяЗначения) = "карандаш" тогда
			ИмяЗначения = "Карандаши";
		ИначеЕсли нРег(ИмяЗначения) = "пеллеты" тогда
			ИмяЗначения = "Пеллеты";
		ИначеЕсли нРег(ИмяЗначения) = "отходыпроизводствап/м(хар-ка)" тогда
			ИмяЗначения = "ОтходыПМ";
		КонецЕсли;
		данныеСтроки.Номенклатура = ИмяЗначения;
	КонецЕсли;
	нРегНоменклатура = нРег(ИмяЗначения);
	
	Если ДанныеСтроки.Свойство("Порода", ИмяЗначения) тогда
		ИмяЗначения = СтрЗаменить(ИмяЗначения,"ё" , "е"); //Заменить ё на е
		Если 	  ИмяЗначения = "Яс" или ИмяЗначения = "Ясень" 			тогда ИмяЗначения = "Ясень";		 
		ИначеЕсли ИмяЗначения = "Бб" или ИмяЗначения = "Береза белая" 	тогда ИмяЗначения = "Береза белая";
		ИначеЕсли ИмяЗначения = "Бж" или ИмяЗначения = "Береза желтая" 	тогда ИмяЗначения = "Береза желтая";
		ИначеЕсли ИмяЗначения = "Д"  или ИмяЗначения = "Дуб"  			тогда ИмяЗначения = "Дуб";
		ИначеЕсли ИмяЗначения = "Е"  или ИмяЗначения = "Ель" 			тогда ИмяЗначения = "Ель";
		ИначеЕсли ИмяЗначения = "Ил" или ИмяЗначения = "Ильм" 			тогда ИмяЗначения = "Ильм";
		ИначеЕсли ИмяЗначения = "Лп" или ИмяЗначения = "Липа" 			тогда ИмяЗначения = "Липа";
		ИначеЕсли ИмяЗначения = "Лц" или ИмяЗначения = "Лиственница" 	тогда ИмяЗначения = "Лиственница";
		ИначеЕсли ИмяЗначения = "Ос" или ИмяЗначения = "Осина" 			тогда ИмяЗначения = "Осина";
		ИначеЕсли ИмяЗначения = "П"  или ИмяЗначения = "Пихта" 			тогда ИмяЗначения = "Пихта";
		ИначеЕсли ИмяЗначения = "Т"  или ИмяЗначения = "Тополь" 		тогда ИмяЗначения = "Тополь";
		ИначеЕсли ИмяЗначения = "Яс" или ИмяЗначения = "Ясень" 			тогда ИмяЗначения = "Ясень";
		КонецЕсли;
		данныеСтроки.Порода = ИмяЗначения;	
	КонецЕсли;
	
	Если ДанныеСтроки.Свойство("Сорт", ИмяЗначения) тогда
		Если нРег(ИмяЗначения) = "баланс (таб.4)" или нРег(ИмяЗначения) = "баланс" тогда
			ИмяЗначения = Неопределено;
			данныеСтроки.Номенклатура = "Балансы";
			нРегНоменклатура = нРег(данныеСтроки.Номенклатура);
		ИначеЕсли нРег(ИмяЗначения) = "дрова" тогда
			ИмяЗначения = Неопределено;
			данныеСтроки.Номенклатура = "Дрова";
			нРегНоменклатура = нРег(данныеСтроки.Номенклатура);
		Иначе
			Если СтрНайти("1234567890", Лев(ИмяЗначения, 1)) > 0 И СтрНайти(ИмяЗначения, "сорт") = 0 тогда
				ИмяЗначения = СокрЛП(ИмяЗначения) + " сорт";
			КонецЕсли;
			
			Если нРегНоменклатура = "шпон" Тогда
				ИмяЗначения = СтрРазделить(ИмяЗначения, "|")[0];
				ИмяЗначения = СокрЛП(ИмяЗначения);
			КонецЕсли; 
			
			Если нРегНоменклатура = "пиловочник" Тогда  
				
				Если ИмяЗначения = "1-2 сорт"
					Или ИмяЗначения = "3 сорт" Тогда 
					
					ИмяЗначения = "1-3 сорт";	
				
				КонецЕсли;           	
			
			КонецЕсли; 
			
			
		КонецЕсли;
		данныеСтроки.Сорт = ИмяЗначения;
	КонецЕсли;
	
	Если ДанныеСтроки.Свойство("Сечение", ИмяЗначения) тогда
		ИмяЗначения = СтрЗаменить(нРег(ИмяЗначения),"x" , "х"); //С английского на русский
		ИмяЗначения	= СтрЗаменить(ИмяЗначения," " , "");
		ИмяЗначения	= СокрЛП(СтрЗаменить(ИмяЗначения,"d" , ""));
		Если ЗначениеЗаполнено(ИмяЗначения) тогда
			Если нРегНоменклатура = "пиловочник" или нРегНоменклатура = "дрова" или нРегНоменклатура = "карандаши" или нРегНоменклатура = "балансы" Тогда
				ИмяЗначения = ?(ИмяЗначения="9", "09", ИмяЗначения);
				ИмяЗначения = ?(ИмяЗначения="8", "08", ИмяЗначения);
				ИмяЗначения = ?(ИмяЗначения="7", "07", ИмяЗначения);
				ИмяЗначения = ?(ИмяЗначения="6", "06", ИмяЗначения);
				Если СтрНайти(ИмяЗначения, "х") = 0 И СтрНайти("1234567890", Лев(ИмяЗначения, 1)) > 0 тогда
					ИмяЗначения = "d " + СокрЛП(ИмяЗначения);
				КонецЕсли;
			Иначе
				массив = СтрРазделить(ИмяЗначения, "х", Ложь);
				Если массив.Количество() = 3 тогда
					Если данныеСтроки.Свойство("Длина") И данныеСтроки.Длина = неопределено тогда
						данныеСтроки.Длина = массив[2];
					КонецЕсли;
					ИмяЗначения = СтрЗаменить(ИмяЗначения, "х"+массив[2], ""); 
				КонецЕсли;
				Если массив.Количество() > 1 тогда
					Ширина	= ?(Число(массив[0]) < Число(массив[1]), Число(массив[1]), Число(массив[0]));
					Толщина = ?(Число(массив[0]) < Число(массив[1]), Число(массив[0]), Число(массив[1]));
					ИмяЗначения = Строка(Формат(Ширина, "ЧГ=0")) + "х" + Формат(Толщина, "ЧГ=0")
				КонецЕсли;
			КонецЕсли;
		Иначе
			ИмяЗначения = Неопределено;
		КонецЕсли;
		данныеСтроки.Сечение = ИмяЗначения;
	КонецЕсли;
	
	Если ДанныеСтроки.Свойство("Длина", ИмяЗначения) тогда
		ИмяЗначения = Число(ИмяЗначения);
		Если ЗначениеЗаполнено(ИмяЗначения) тогда
			Если ИмяЗначения > 100 тогда
				ИмяЗначения = ИмяЗначения / 1000;
			КонецЕсли;
		Иначе
			ИмяЗначения = неопределено;
		КонецЕсли;
		данныеСтроки.Длина = ИмяЗначения;	
	КонецЕсли;
	
	Если ДанныеСтроки.Свойство("Влажность", ИмяЗначения) тогда
		Если СтрНайти(ИмяЗначения, "KD") > 0 тогда
			Если СтрНайти(ИмяЗначения, "KD(12%)") > 0 тогда
				ИмяЗначения = 12;
			Иначе
				ИмяЗначения = 18;
			КонецЕсли;
		ИначеЕсли СтрНайти(ИмяЗначения, "Gr") > 0 тогда 
			ИмяЗначения = 60;
		КонецЕсли;
		
		данныеСтроки.Влажность = ?(ЗначениеЗаполнено(ИмяЗначения), ИмяЗначения, ""); 
	КонецЕсли; 
	
	
	Если ДанныеСтроки.Свойство("Поверхность", ИмяЗначения) тогда  	
		ИмяЗначения = "";                                        	
		данныеСтроки.Поверхность = ?(ЗначениеЗаполнено(ИмяЗначения), ИмяЗначения, "");
	КонецЕсли; 

	
	
	///////
	
	Если ДанныеСтроки.Свойство("штабель", ИмяЗначения) Тогда
		Если ТипЗнч(Источник)=Тип("ДокументСсылка.алк_ПриемкаЛесопродукции") тогда
			Запрос = новый запрос(
			"ВЫБРАТЬ
			|	алк_ВозвратныйШтабельСрезПоследних.ШтабельЯвляетсяВозвратным как Возврат
			|ИЗ
			|	РегистрСведений.алк_ВозвратныйШтабель.СрезПоследних(&Дата, Контрагент = &Контрагент И Штабель = &Штабель) КАК алк_ВозвратныйШтабельСрезПоследних");
			Запрос.УстановитьПараметр("Дата", Источник.Дата);
			Запрос.УстановитьПараметр("Контрагент", Источник.Производитель);
			Запрос.УстановитьПараметр("Штабель", ДанныеСтроки.Штабель);
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			Если РезультатЗапроса.Следующий() И РезультатЗапроса.Возврат тогда
				ИмяЗначения = "ШтабельВозврат";
			ИначеЕсли ЗначениеЗаполнено(ИмяЗначения) И Не ИмяЗначения.Несоответствие Тогда//или Параметры.ДатаОтменыОтветХранения < Источник.Дата тогда
				ИмяЗначения = "ШтабельОсновной";
			Иначе
				ИмяЗначения = "ШтабельНесоответствие";
			КонецЕсли;
			данныеСтроки.штабель = Строка(ИмяЗначения);
		Иначе
			Если ЗначениеЗаполнено(ИмяЗначения) И Не ИмяЗначения.Несоответствие Тогда
				ИмяЗначения = "ШтабельОсновной";
			ИначеЕсли ЗначениеЗаполнено(ИмяЗначения) И ИмяЗначения.Несоответствие тогда
				ИмяЗначения = "ШтабельНесоответствие";
			КонецЕсли;
			данныеСтроки.штабель = Строка(ИмяЗначения);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСтроки.Свойство("ТипУпаковки", ИмяЗначения) тогда
		Если ДанныеСтроки.ТипУпаковки = "упаковка 0,65 т." тогда
			ИмяЗначения = "Биг-бэг 95х95х130";
			//ИначеЕсли ЗначениеЗаполнено(ИмяЗначения) и Не ИмяЗначения.Несоответствие тогда
			//	ИмяЗначения = "ШтабельОсновной";
			//Иначе
			//	ИмяЗначения = "ШтабельНесоответствие";
		КонецЕсли;
		данныеСтроки.ТипУпаковки = ИмяЗначения;
	КонецЕсли;
	
	
	Возврат данныеСтроки;
	
	
КонецФункции // КонвертироватьТовары()







#КонецОбласти           


#Область ПодпискиНаСобытия

Процедура РФП_ПередЗаписьюДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
		
	Если Источник.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	алк_ПроизводствоОборот.Операция как Операция,
	|	алк_ПроизводствоОборот.ДатаСмены как ДатаСмены
	|ИЗ
	|	РегистрНакопления.алк_ПроизводствоОборот КАК алк_ПроизводствоОборот
	|ГДЕ
	|	алк_ПроизводствоОборот.Регистратор = &Регистратор");
	Запрос.УстановитьПараметр("Регистратор", Источник.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
			Результат.ДатаСмены,
			Результат.Операция,
			Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);	
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти
