
//используется на форме серийного номера
Функция ВернутьДанныеПоСерийномуНомеру(СерийныйНомер) Экспорт  
	
	Если СтрНайти(СерийныйНомер, "ШП-") > 0 
		ИЛИ СтрНайти(СерийныйНомер, "КШ-") > 0
		ИЛИ СтрНайти(СерийныйНомер, "РВ-") > 0 Тогда		
		ИмяМакетаСКД = "СхКД_шпон"; 	
	ИначеЕсли СтрНайти(СерийныйНомер, "ДГ-") > 0 Тогда		
		ИмяМакетаСКД = "СхКД_ДГ";
	ИначеЕсли СтрНайти(СерийныйНомер, "ИФ-") > 0 Тогда		
		ИмяМакетаСКД = "СхКД_ИФ";
	Иначе 
		ИмяМакетаСКД = "МакетПМ";  
	КонецЕсли;
			
	СхемаКомпоновкиДанных = Обработки.алк_УправлениеСериями.ПолучитьМакет(ИмяМакетаСКД);      		
	ТекстЗапросаМакета = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;    
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаМакета;
	Запрос.УстановитьПараметр("СерийныйНомер",СерийныйНомер);
	Запрос.УстановитьПараметр("Операция",Справочники.алк_ОперацииПроизводства.УпаковкаФанеры);
	
	РезЗ = Запрос.Выполнить();
	
	Если РезЗ.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка;
	КонецЦикла;
	
КонецФункции 

&НаСервере
Функция ВернутьДвиженияПоПакету(СерийныйНомер) Экспорт //используется в этой обработке и на форме серийного номера 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОбороты.ПериодСекунда КАК ДатаСобытия,
	|	алк_ОстаткиЗапасовОбороты.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(алк_ОстаткиЗапасовОбороты.Регистратор) КАК РегистраторПредставление,
	|	ВЫБОР
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	|			ТОГДА ""Передано в отгрузку""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ТранспортировкаЗапасов
	|			ТОГДА ""Отгрузка""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Производство
	|			ТОГДА ""Производство""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ПеремещениеЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Перемещение
	|			ТОГДА ""Перемещение""
	|		ИНАЧЕ ""Прочая""
	|	КОНЕЦ КАК Операция
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Авто, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОстаткиЗапасовОбороты.ПериодСекунда,
	|	ВЫБОР
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_РасходнаяНакладная
	|			ТОГДА ""Передано в отгрузку""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ТранспортировкаЗапасов
	|			ТОГДА ""Отгрузка""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Производство
	|			ТОГДА ""Производство""
	|		КОГДА алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_ПеремещениеЗапасов
	|				ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Перемещение
	|			ТОГДА ""Перемещение""
	|		ИНАЧЕ ""Прочая""
	|	КОНЕЦ,
	|	алк_ОстаткиЗапасовОбороты.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);  
			
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции