#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСписанияПорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АктСписанияПортЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_АктСписанияПортЗапасы.Номенклатура,
		|	алк_АктСписанияПортЗапасы.КоличествоПакетов,
		|	алк_АктСписанияПортЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_АктСписанияПортЗапасы.Ссылка.Организация,
		|	алк_АктСписанияПортЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_АктСписанияПорт.Запасы КАК алк_АктСписанияПортЗапасы
		|ГДЕ
		|	алк_АктСписанияПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_АктСписанияПортЗапасы.Номенклатура,
		|	алк_АктСписанияПортЗапасы.Ссылка.Дата КАК ДатаСобытия,
		|	алк_АктСписанияПортЗапасы.Ссылка.Дата КАК Период,
		|	алк_АктСписанияПортЗапасы.СерийныйНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Судно) КАК Операция,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|ИЗ
		|	Документ.алк_АктСписанияПорт.Запасы КАК алк_АктСписанияПортЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_АктСписанияПортЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_АктСписанияПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	алк_АктСписанияПортЗапасы.Ссылка.Организация,
		|	алк_АктСписанияПортЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_АктСписанияПортЗапасы.Номенклатура,
		|	алк_АктСписанияПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_АктСписанияПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_АктСписанияПортЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_АктСписанияПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА алк_АктСписанияПортЗапасы.ВесНетто
		|		ИНАЧЕ алк_АктСписанияПортЗапасы.ОбъемТаможня
		|	КОНЕЦ КАК Количество,
		|	алк_АктСписанияПортЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_АктСписанияПорт.Запасы КАК алк_АктСписанияПортЗапасы
		|ГДЕ
		|	алк_АктСписанияПортЗапасы.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСписанияПорт);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаАктСписанияПорт.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[2].Выгрузить());
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли