

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРапортОкорка, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Номенклатура,
		|	рфп_РапортОкорка.ДатаСмены,
		|	рфп_РапортОкорка.Смена,
		|	&Период,
		|	&ВидДвижения,
		|	ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.Окорка) КАК Аналитика,
		|	рфп_РапортОкорка.ОбъемКоры КАК Объем
		|ИЗ
		|	Документ.рфп_РапортОкорка КАК рфп_РапортОкорка
		|ГДЕ
		|	рфп_РапортОкорка.Ссылка = &Ссылка";
		
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаРапортОкорка.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРапортОкорка.Ссылка);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Номенклатура", РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Кора));
		
		МассивРезультатов = Запрос.ВыполнитьПакет();	
	
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
		
#КонецЕсли
