
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	 
	
	// установка участка
	Если Не ЗначениеЗаполнено(Объект.Участок) Тогда
		Объект.Участок = Справочники.алк_Участки.НайтиПоКоду("000000002"); // лесопиление  	
	КонецЕсли; 		
	
	УчастокПриИзмененииНаСервере(); // установить отбор смен по участку	
		
	//СоставСмены
	ПерезаполнитьСоставСмены();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

///////////////////////////////// ТП "Т_Распилено" ////////////////////////////////////

&НаКлиенте
Процедура Т_РаспиленоКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Распилено.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Распилено.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрРаспилено Из Объект.Т_Распилено Цикл
			
			МассивКлючей.Добавить(стрРаспилено.КлючСвязи);
			
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.КлючСвязи = МаксЭлемент.Значение + 1;
			
		Иначе
			
			Элемент.ТекущиеДанные.КлючСвязи = 1;
			
		КонецЕсли; 
		
		Элемент.ТекущиеДанные.Постав = XMLСтрока(Новый УникальныйИдентификатор);
		
	Иначе
		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Т_Распилено.ТекущиеДанные = Неопределено Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элементы.Т_Распилено.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.Т_Выход.ТекущиеДанные.КлючСвязи     = Элементы.Т_Распилено.ТекущиеДанные.КлючСвязи;
		Элементы.Т_Выход.ТекущиеДанные.СертификатFSC = Элементы.Т_Распилено.ТекущиеДанные.СертификатFSC;     
		
		УстановитьОтборТаблицы(Элемент);
		
	Иначе
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборТаблицы(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПередУдалением(Элемент, Отказ)
	
	КлючКУдалению = Элемент.ТекущиеДанные.КлючСвязи;
	
	Индекс = Объект.Т_Выход.Количество() - 1; 
	
	Пока Индекс >= 0 Цикл 
		
		Если Объект.Т_Выход[Индекс].КлючСвязи = КлючКУдалению Тогда 
			Объект.Т_Выход.Удалить(Индекс); 
		КонецЕсли; 
		
		Индекс = Индекс - 1; 
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоСертификатFSCПриИзменении(Элемент)
	
	ТекДанные = Элементы.Т_Распилено.ТекущиеДанные;
	
	Если Не ТекДанные.СертификатFSC  Тогда		
		ТекДанные.Сертификат = ПредопределенноеЗначение("Справочник.СертификатыНаПродукцию.ПустаяСсылка");		
	КонецЕсли; 
	
	ИзменитьПодчиненныеСтроки(ТекДанные);
	
КонецПроцедуры

///////////////////////////////// ТП "Т_Выход" ////////////////////////////////////

&НаКлиенте
Процедура Т_ВыходКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Выход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Выход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереданоНаСушкуСерийныйНомерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПереданоНаСушку.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.СерийныйНомер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыСерииЗавершение = Новый ОписаниеОповещения("ЗаполнитьПараметрыСерииЗавершение", ЭтотОбъект);
	ВыполнитьОбработкуОповещения(ЗаполнитьПараметрыСерииЗавершение, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ЗаполнитьРапортНаСервере()
	
	ЗаполнитьДанныеОтходыНаСервере();
	ЗаполнитьДанныеСГПНаСервере(); 
	ЗаполнитьДанныеУпаковкаНаСервере(Ложь);
	ЗаполнитьДанныеУпаковкаНаСервере(Истина);
	ЗаполнитьДанныеСырьеНаСервере();
	ЗаполнитьДанныеСортировкаНаСервере();
	ЗаполнитьДанныеПриемкаСырьяНаСервере();
	ЗаполнитьДанныеПереупаковкаНаСервере();
	ЗаполнитьДанныеНезавершенкиНаСервере();
	
	Объект.ПереданоНаСушку.Очистить();
	ЗаполнитьПереданоНаСушкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРапорт(Команда)
	ЗаполнитьРапортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеУпаковкаНаСервере(УпакованоНаУчасткеМалойПересортировки)
	
	// проверка на переход на новые регистры, после перехода данный документ не делает движения по новым регистрам
	// т.к. движения создаются стандартным документом производства при упаковке пакета.  
	
	СтруктураНастроек = Новый Структура("Параметр", "ДатаПерехода_ЦЛП");
	ПолучитьДатуВвода = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
	ДатаВвода = Дата("23001201");
	Если ПолучитьДатуВвода.Количество() > 0 Тогда
		ДатаВвода = ПолучитьДатуВвода[0].Дата;
	КонецЕсли;
	
	Если ДатаВвода <= Объект.ДатаСмены Тогда
		НовыеДокументы = Истина;
	Иначе 
		НовыеДокументы = Ложь;
	КонецЕсли;  	
	
	Запрос = Новый Запрос;
	
	Если НовыеДокументы Тогда   
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ПроизводствоПродукция.Ссылка.Организация,
		|	алк_ПроизводствоПродукция.Номенклатура,
		|	алк_ПроизводствоПродукция.Характеристика,
		|	алк_ПроизводствоПродукция.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПроизводствоПродукция.Ссылка.ДатаСмены,
		|	алк_ПроизводствоПродукция.Ссылка.Смена,
		|	алк_ПроизводствоПродукция.Период КАК ПериодУпаковки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ВЫРАЗИТЬ(алк_ПроизводствоПродукция.Количество / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(20, 0))
		|	КОНЕЦ КАК КоличествоСостав,
		|	алк_ПроизводствоПродукция.Количество КАК Объем,
		|	алк_ПроизводствоПродукция.Сертификат
		|ПОМЕСТИТЬ втРезультат
		|ИЗ
		|	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ПроизводствоПродукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ПроизводствоПродукция.Ссылка.Участок В(&УчастокСписок)
		|	И алк_ПроизводствоПродукция.Ссылка.Операция = &Операция
		|	И алк_ПроизводствоПродукция.Ссылка.Организация = &Организация
		|	И алк_ПроизводствоПродукция.Ссылка.Проведен
		|	И алк_ПроизводствоПродукция.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_ПроизводствоПродукция.Ссылка.Смена = &Смена
		|	И алк_ПроизводствоПродукция.СерийныйНомер.Наименование ПОДОБНО ""ПМ%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультат.Организация,
		|	втРезультат.Номенклатура,
		|	втРезультат.Характеристика,
		|	втРезультат.СерийныйНомер,
		|	втРезультат.ДатаСмены,
		|	втРезультат.Смена,
		|	втРезультат.Сертификат,
		|	втРезультат.КоличествоСостав,
		|	втРезультат.ПериодУпаковки,
		|	втРезультат.Объем
		|ИЗ
		|	втРезультат КАК втРезультат";  
		
		
	Иначе   
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ВыпускПродукцииСерииОбороты.Организация,
		|	алк_ВыпускПродукцииСерииОбороты.Номенклатура,
		|	алк_ВыпускПродукцииСерииОбороты.Характеристика,
		|	алк_ВыпускПродукцииСерииОбороты.ЗаказПокупателя,
		|	алк_ВыпускПродукцииСерииОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ВыпускПродукцииСерииОбороты.ДатаСмены,
		|	алк_ВыпускПродукцииСерииОбороты.Смена,
		|	алк_ВыпускПродукцииСерииОбороты.КоличествоПакетовОборот,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
		|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня,
		|	алк_ВыпускПродукцииСерииОбороты.Номенклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат
		|ПОМЕСТИТЬ втРезультат
		|ИЗ
		|	РегистрНакопления.алк_ВыпускПродукцииСерии.Обороты(
		|			,
		|			,
		|			Запись,
		|			ДатаСмены = &ДатаСмены
		|				И Смена = &Смена
		|				И СерийныйНомер.Наименование ПОДОБНО ""ПМ%"") КАК алк_ВыпускПродукцииСерииОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО алк_ВыпускПродукцииСерииОбороты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	(алк_ВыпускПродукцииСерииОбороты.Регистратор.Участок = &Участок
		|				И &УпакованоНаУчасткеМалойПересортировки
		|			ИЛИ алк_ВыпускПродукцииСерииОбороты.Регистратор.Участок <> &Участок
		|				И НЕ &УпакованоНаУчасткеМалойПересортировки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРезультат.Организация,
		|	втРезультат.Номенклатура,
		|	втРезультат.Характеристика,
		|	втРезультат.ЗаказПокупателя,
		|	втРезультат.СерийныйНомер,
		|	втРезультат.ДатаСмены,
		|	втРезультат.Смена,
		|	втРезультат.КоличествоПакетовОборот,
		|	втРезультат.ПериодУпаковки,
		|	втРезультат.КоличествоСостав,
		|	втРезультат.Объем,
		|	втРезультат.СертификатFSC,
		|	втРезультат.ОбъемТаможня,
		|	втРезультат.ВесНеттоТаможня,
		|	втРезультат.ВесБруттоТаможня,
		|	втРезультат.КатегорияНоменклатуры,
		|	втРезультат.НомерПакета КАК НомерПакета,
		|	втРезультат.Сертификат
		|ИЗ
		|	втРезультат КАК втРезультат
		|ГДЕ
		|	втРезультат.КатегорияНоменклатуры В(&спКатегорий)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПакета";
			
	КонецЕсли;  
	
	УчастокСписок = Новый Массив;
	
	Если УпакованоНаУчасткеМалойПересортировки Тогда
		УчастокСписок.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000046")); //УМП		
	Иначе  
		УчастокСписок.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000004")); //УЧАСТОК ПФМ (1 ЛИНИЯ)  
		УчастокСписок.Добавить(Справочники.алк_Участки.НайтиПоКоду("000000026")); //УЧАСТОК ПФМ (2 ЛИНИЯ)	
	КонецЕсли; 		
	
	Запрос.УстановитьПараметр("УчастокСписок", УчастокСписок);  
	Запрос.УстановитьПараметр("Операция", Справочники.алк_ОперацииПроизводства.Упаковка);
    Запрос.УстановитьПараметр("Организация", Объект.Организация);

	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("спКатегорий", РфпПолучениеДанныхСервер.ПолучитьКатегорииНаправления(Перечисления.алк_НаправленияДеятельности.Лесопиление));
	Запрос.УстановитьПараметр("УпакованоНаУчасткеМалойПересортировки",УпакованоНаУчасткеМалойПересортировки); 
	Запрос.УстановитьПараметр("Участок",Справочники.алк_Участки.НайтиПоКоду("000000046")); //УМП
	
	
	
	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Если НЕ УпакованоНаУчасткеМалойПересортировки Тогда 
		Объект.ДанныеУпаковка.Загрузить(РезультатЗапроса.Выгрузить());
	Иначе 
		Объект.ДанныеУпаковкаУМП.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеУпаковка(Команда)
	
	ПроверитьЗаполениеРеквизитовСмены();
	ЗаполнитьДанныеУпаковкаНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСГПНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ЗапасыНаСкладахСерии.Организация,
	|	алк_ЗапасыНаСкладахСерии.СтруктурнаяЕдиница,
	|	алк_ЗапасыНаСкладахСерии.Ячейка,
	|	алк_ЗапасыНаСкладахСерии.Номенклатура,
	|	алк_ЗапасыНаСкладахСерии.СерийныйНомер,
	|	алк_ЗапасыНаСкладахСерии.ЗаказПокупателя,
	|	алк_ЗапасыНаСкладахСерии.КоличествоПакетов,
	|	алк_ЗапасыНаСкладахСерии.ДатаСмены,
	|	алк_ЗапасыНаСкладахСерии.Смена
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыНаСкладахСерии КАК алк_ЗапасыНаСкладахСерии
	|ГДЕ
	|	алк_ЗапасыНаСкладахСерии.Активность
	|	И алк_ЗапасыНаСкладахСерии.СтруктурнаяЕдиница = &СГП
	|	И алк_ЗапасыНаСкладахСерии.ДатаСмены = &ДатаСмены
	|	И алк_ЗапасыНаСкладахСерии.Смена = &Смена
	|	И алк_ЗапасыНаСкладахСерии.Операция = ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства)
	|	И алк_ЗапасыНаСкладахСерии.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("СГП", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.СГП));
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ПередачаНаСГП.Загрузить(РезультатЗапроса.Выгрузить());
	
	ТекстЗапроса = Запрос.Текст;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПередачаИзПроизводства", "ВозвратНаПроизводство");
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ВозвратС_СГП.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСГП(Команда)
	
	ПроверитьЗаполениеРеквизитовСмены();
	ЗаполнитьДанныеСГПНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОтходыНаСервере() 
	
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.Лесопиление Тогда
		
		ПроцентРаспыла = 1;		
		ПроцентЩепы = 30;
		ПроцентКоры = 8;
		
		// отходы ЦЛП
	
		// По фактическим измерениям выхода щепы составлен акт, в котором принят выход щепы в плотном объеме - 30%
		// Также есть безвозвратные потери "распыл" - 1%
		// Выход опилок нужно будет считать по следующей формуле:
		// Объем опилок = Итого Объем распилено - Итого Объем получено факт  - Распыл (1%*Объем рапсилено) - Щепа(30%*Объем распилено)

		ОбъемМатериала = Объект.Т_Распилено.Итог("Объем");
		
		ПолученоФакт = Объект.Т_Выход.Итог("ОбъемСПрипуском");;
		
		Если ПолученоФакт = 0 Тогда			
			Сообщить("Объем продукции за смену равен нулю (Расчетный выход: объем с припуском)! Автозаполнение отходов невозможно!"); 		
			Возврат;   	
		КонецЕсли; 
		
		Распыл 	= ПроцентРаспыла*ОбъемМатериала/100;
		Щепа	= ПроцентЩепы*ОбъемМатериала/100;
		Кора = ПроцентКоры*ОбъемМатериала/100;
		
		Опилки	= ОбъемМатериала - ПолученоФакт - Распыл - Щепа; 	
		
		Объект.Отходы.Очистить();
		
		НоваяСтрокаОтходы = Объект.Отходы.Добавить();
		НоваяСтрокаОтходы.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000007"); // Щепа 
		НоваяСтрокаОтходы.Количество = Щепа;   
		
		НоваяСтрокаОтходы = Объект.Отходы.Добавить();
		НоваяСтрокаОтходы.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000008"); // Кора
	    НоваяСтрокаОтходы.Количество = Кора;   
		
		НоваяСтрокаОтходы = Объект.Отходы.Добавить();
		НоваяСтрокаОтходы.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000009"); // Опилки
	    НоваяСтрокаОтходы.Количество = Опилки;   				
		
	КонецЕсли;
	
		
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьФактРаспила(Направление, ДатаСмены, Смена) 
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(алк_СборкаЗапасовПродукция.Объем) КАК Объем
		|ИЗ
		|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
		|ГДЕ
		|	алк_СборкаЗапасовПродукция.Ссылка.Проведен
		|	И алк_СборкаЗапасовПродукция.Ссылка.Направление = &Направление
		|	И алк_СборкаЗапасовПродукция.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_СборкаЗапасовПродукция.Ссылка.Смена = &Смена";
	
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.УстановитьПараметр("Смена", Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбъемВыпуска = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъемВыпуска = ВыборкаДетальныеЗаписи.Объем;
	КонецЦикла;	
	
	Возврат ОбъемВыпуска;
	

КонецФункции // ПолучитьФактРаспила()


&НаКлиенте
Процедура ЗаполнитьДанныеОтходы(Команда)
	ЗаполнитьДанныеОтходыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСырьеНаСервере()    
	
	ВремяСмены = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Объект.Смена, Объект.ДатаСмены);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОбороты.Номенклатура,
	|	алк_ОстаткиЗапасовОбороты.Характеристика,
	|	ВЫБОР
	|		КОГДА НЕ алк_ПараметрыХарактеристик.Объем ЕСТЬ NULL
	|				И алк_ПараметрыХарактеристик.Объем <> 0
	|			ТОГДА ОКР(алк_ОстаткиЗапасовОбороты.КоличествоПриход / алк_ПараметрыХарактеристик.Объем, 0)
	|		ИНАЧЕ алк_ОстаткиЗапасовОбороты.КоличествоПриход
	|	КОНЕЦ КАК Количество,
	|	алк_ОстаткиЗапасовОбороты.КоличествоПриход КАК Объем
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	|			&ВремяНачалаСмены,
	|			&ВремяКонцаСмены,
	|			Секунда,
	|			СтруктурнаяЕдиница.Код = ""ПБ-000003""
	|				И Номенклатура.Код = ""ПБ-00000002"") КАК алк_ОстаткиЗапасовОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика";
	
	Запрос.УстановитьПараметр("ВремяНачалаСмены", ВремяСмены.ДатаВремяНачалаСмены);
	Запрос.УстановитьПараметр("ВремяКонцаСмены", ВремяСмены.ДатаВремяКонцаСмены);
		
	РезультатЗапроса = Запрос.Выполнить();  
	Объект.ПереданоСырьяВПроизводство.Загрузить(РезультатЗапроса.Выгрузить());	
		
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСырье(Команда)
	ЗаполнитьДанныеСырьеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСортировкаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СортировкаЛесопродукцииОбороты.Номенклатура,
	|	алк_СортировкаЛесопродукцииОбороты.Партия,
	|	алк_СортировкаЛесопродукцииОбороты.Порода,
	|	алк_СортировкаЛесопродукцииОбороты.Сорт,
	|	алк_СортировкаЛесопродукцииОбороты.Длина,
	|	алк_СортировкаЛесопродукцииОбороты.Сечение,
	|	алк_СортировкаЛесопродукцииОбороты.КоличествоОборот КАК Количество,
	|	алк_СортировкаЛесопродукцииОбороты.ОбъемОборот КАК Объем
	|ИЗ
	|	РегистрНакопления.алк_СортировкаЛесопродукции.Обороты КАК алк_СортировкаЛесопродукцииОбороты
	|ГДЕ
	|	алк_СортировкаЛесопродукцииОбороты.ДатаСмены = &ДатаСмены
	|	И алк_СортировкаЛесопродукцииОбороты.Смена = &Смена";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.Сортировка.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСортировка(Команда)
	ЗаполнитьДанныеСортировкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПриемкаСырьяНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(алк_ЗапасыОрганизацииОбороты.КоличествоПриход) КАК Количество,
	|	СУММА(алк_ЗапасыОрганизацииОбороты.ОбъемПриход) КАК Объем,
	|	алк_ЗапасыОрганизацииОбороты.Номенклатура,
	|	алк_ЗапасыОрганизацииОбороты.Характеристика,
	|	алк_ЗапасыОрганизацииОбороты.Регистратор.ВидТранспортировки КАК ВидТранспортировки,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка КАК Штабель
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДатаСмены = &ДатаСмены
	|				И Смена = &Смена
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_ЗапасыОрганизацииОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ЗапасыОрганизацииОбороты.Номенклатура,
	|	алк_ЗапасыОрганизацииОбороты.Регистратор.ВидТранспортировки,
	|	алк_ЗапасыОрганизацииОбороты.Характеристика,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ПринятоСырьяУСЛ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПриемкаСырья(Команда)
	ЗаполнитьДанныеПриемкаСырьяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПереупаковкаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНезавершенкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ПараметрыПакетовОперативный.СерийныйНомер,
	|	алк_ПараметрыПакетовОперативный.НомерПакета,
	|	алк_ПараметрыПакетовОперативный.ПериодПакета,
	|	алк_ПараметрыПакетовОперативный.КоличествоСостав КАК Количество,
	|	алк_ПараметрыПакетовОперативный.Объем,
	|	алк_ПараметрыПакетовОперативный.Характеристика,
	|	алк_ПараметрыПакетовОперативный.ДатаСмены,
	|	алк_ПараметрыПакетовОперативный.Смена,
	|	алк_ПараметрыПакетовОперативный.Характеристика.Владелец КАК Номенклатура,
	|	алк_ПараметрыПакетовОперативный.Сертификат
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный КАК алк_ПараметрыПакетовОперативный
	|ГДЕ
	|	алк_ПараметрыПакетовОперативный.Смена = &Смена
	|	И алк_ПараметрыПакетовОперативный.ДатаСмены = &ДатаСмены
	|	И алк_ПараметрыПакетовОперативный.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)
	|	И алк_ПараметрыПакетовОперативный.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""";	
	
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("ДатаСмены", НачалоДня(Объект.ДатаСмены));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.НезавершенноеПроизводство.Загрузить(РезультатЗапроса);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПереупаковка(Команда)
	ЗаполнитьДанныеПереупаковкаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасчетныйВыход(Команда)
	
	СтрокаТЧ = Элементы.Т_Выход.ТекущиеДанные;
	
	ОбщееКоличество = СтрокаТЧ.Количество;
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
		
	Соответствие = ПролучитьСоответствиеСоотношений(СтрокаТЧ.Характеристика, Объект.ДатаСмены, Объект.Смена);

	сКоличество3650 = Соответствие.Получить("Количество3650");
	сКоличество3750 = Соответствие.Получить("Количество3750");

	НоваяХарактеристика = Соответствие.Получить("НоваяХарактеристика");

	Если сКоличество3650 <> 0 И сКоличество3750 <> 0 Тогда
		
		Модифицированность = Истина;
		
		Количество3650 = Окр(ОбщееКоличество * сКоличество3650 /(сКоличество3650 + сКоличество3750));
		Количество3750 = ОбщееКоличество - Количество3650;
		
		СтрокаТЧ.Количество = Количество3650;
		РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТЧ);
		
		НоваяСтрока = Объект.Т_Выход.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.Характеристика = НоваяХарактеристика;
		НоваяСтрока.Количество = Количество3750;
		
		РфпРаботаСДокументами.ПересчитатьОбъемСтроки(НоваяСтрока); 

	ИначеЕсли сКоличество3650 = 0 Тогда
		
		Сообщить("Не найден выпуск для длины 3.65");
		
	ИначеЕсли сКоличество3750 = 0 Тогда
		
		Сообщить("Не найден выпуск для длины 3.75");	
	
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПереданоНаСушку(Команда)
	
	Если Объект.ПереданоНаСушку.Количество() > 0 Тогда
		
		ЗаполнитьПереданоНаСушкуЗавершение = Новый ОписаниеОповещения("ЗаполнитьПереданоНаСушкуЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='В табличной части уже заполнены строки. Очистить табличную часть?'");
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("Перезаполнить");
		СписокВыбора.Добавить("Отмена");
		
		ПоказатьВопрос(ЗаполнитьПереданоНаСушкуЗавершение, ТекстВопроса, СписокВыбора); 
	Иначе
		ЗаполнитьПереданоНаСушкуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПереданоНаСушкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "Перезаполнить" Тогда
		Объект.ПереданоНаСушку.Очистить();
	ИначеЕсли Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПереданоНаСушкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПереданоНаСушкуНаСервере() //теперь перадано берется из РН ПроизводствоОборот
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ПроизводствоОборотОбороты.СерийныйНомер,
	|	алк_ПроизводствоОборотОбороты.Номенклатура,
	|	алк_ПроизводствоОборотОбороты.Характеристика,
	|	алк_ПроизводствоОборотОбороты.Сертификат,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) <> 0
	|				ТОГДА ОКР(алк_ПроизводствоОборотОбороты.КоличествоОборот / алк_ПараметрыХарактеристик.Объем)
	|			ИНАЧЕ алк_ПроизводствоОборотОбороты.КоличествоОборот
	|		КОНЕЦ) КАК Количество,
	|	СУММА(алк_ПроизводствоОборотОбороты.КоличествоОборот) КАК Объем,
	|	алк_ПроизводствоОборотОбороты.Период
	|ИЗ
	|	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДатаСмены = &ДатаСмены
	|				И Смена = &Смена
	|				И Номенклатура.Код = ""ПБ-00000012""
	|				И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеПриход)
	|				И Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.СушильныйБуфер)
	|				И СерийныйНомер В
	|					(ВЫБРАТЬ
	|						алк_ПроизводствоОборотОбороты.СерийныйНомер
	|					ИЗ
	|						РегистрНакопления.алк_ПроизводствоОборот.Обороты(, , , ДатаСмены = &ДатаСмены
	|							И Смена = &Смена
	|							И Номенклатура.Код = ""ПБ-00000012""
	|							И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеРасход)
	|							И Склад.Код = ""ПБ-000003"") КАК алк_ПроизводствоОборотОбороты)) КАК алк_ПроизводствоОборотОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ПроизводствоОборотОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПроизводствоОборотОбороты.СерийныйНомер,
	|	алк_ПроизводствоОборотОбороты.Номенклатура,
	|	алк_ПроизводствоОборотОбороты.Характеристика,
	|	алк_ПроизводствоОборотОбороты.Сертификат,
	|	алк_ПроизводствоОборотОбороты.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_ПроизводствоОборотОбороты.Период";	
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);

	Запрос.УстановитьПараметр("Смена", Объект.Смена);
		
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		НоваяСтрока = Объект.ПереданоНаСушку.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИзРезультатаЗапроса);
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////// Закрытие смены ////////////////////////////////

&НаСервере
Процедура ЗаполнитьДокументСборкиСухихПакетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаСухихПакетов.Ссылка
	|ИЗ
	|	Документ.алк_СборкаСухихПакетов КАК алк_СборкаСухихПакетов
	|ГДЕ
	|	алк_СборкаСухихПакетов.Автозаполнение = &Автозаполнение
	|	И алк_СборкаСухихПакетов.Смена = &Смена
	|	И НЕ алк_СборкаСухихПакетов.ПометкаУдаления
	|	И алк_СборкаСухихПакетов.Дата = &ДатаСмены";
	
	Запрос.УстановитьПараметр("Автозаполнение", Истина);
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);                    	
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   ВыборкаДетальныеЗаписи.Следующий();
		
		ДокументСборки = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если ДокументСборки.РучнаяКорректировка Тогда 	
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка сборки сухих пакетов! Документ сборки сухих пакетов отредактирован вручную!";
			Сообщение.Сообщить();
			
			Возврат;
		
		КонецЕсли; 
		
		ДокументСборки.Продукция.Очистить();
		
		ДокументСборки.ЗаполнитьПродукциюПоДаннымРегистра();
		
	Иначе
		
		ДокументСборки = Документы.алк_СборкаСухихПакетов.СоздатьДокумент(); 
		
		ДокументСборки.Автозаполнение = Истина;
		ДокументСборки.Дата		      = Объект.ДатаСмены;
		ДокументСборки.Смена          = Объект.Смена;
		
		ДокументСборки.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс
		ДокументСборки.Организация = Справочники.Организации.ОсновнаяОрганизация;
		
		ДокументСборки.Ответственный = ПолучитьПользователяПоСотруднику(Объект.Ответственный);
				
		ДокументСборки.ЗаполнитьПродукциюПоДаннымРегистра();
		
	КонецЕсли; 
	
	Попытка
		
		ДокументСборки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сборка сухих пакетов заполнена!";
		Сообщение.Сообщить(); 
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка сборки сухих пакетов! " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки; 
	
КонецПроцедуры

Функция ПолучитьПользователяПоСотруднику(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиПользователя.Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
		|ГДЕ
		|	СотрудникиПользователя.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Пользователь;
	КонецЦикла;
	
КонецФункции // ПолучитьПользователяПоСотруднику()
 
&НаСервере
Процедура ЗаполнитьДокументПроизводстваПМ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СборкаЗапасов.Ссылка
	|ИЗ
	|	Документ.алк_СборкаЗапасов КАК алк_СборкаЗапасов
	|ГДЕ
	|	алк_СборкаЗапасов.Автозаполнение = &Автозаполнение
	|	И алк_СборкаЗапасов.Направление = &Направление
	|	И алк_СборкаЗапасов.Смена = &Смена
	|	И алк_СборкаЗапасов.ДатаСмены = &ДатаСмены
	|	И НЕ алк_СборкаЗапасов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Автозаполнение", Истина);
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Направление", Перечисления.алк_НаправленияДеятельности.Лесопиление);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить(); // РезультатЗапроса.Выгрузить()
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   ВыборкаДетальныеЗаписи.Следующий();
		
		ДокументСборки = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументСборки.ЗаполнитьПродукциюПоДаннымРегистра(Истина);
		
	Иначе
		
		ДокументСборки = Документы.алк_СборкаЗапасов.СоздатьДокумент();
		
		ДокументСборки.Автозаполнение = Истина;
		ДокументСборки.Направление    = Перечисления.алк_НаправленияДеятельности.Лесопиление;
		ДокументСборки.ДатаСмены      = Объект.ДатаСмены;
		ДокументСборки.Смена          = Объект.Смена;
		
		ДокументСборки.Участок = Объект.Участок; //добавим заполнение участка ТА
		ДокументСборки.СтруктурнаяЕдиница = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.ЦехПроизводстваПМ);
		ДокументСборки.СтруктурнаяЕдиницаПродукции = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.БуферныйСкладЦЛП);
		
		ДокументСборки.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
		ДокументСборки.Организация = Справочники.Организации.ОсновнаяОрганизация;
		
		ДокументСборки.Ответственный = Объект.Ответственный;
		
		ДокументСборки.ЗаполнитьПродукциюПоДаннымРегистра(Истина);
		
	КонецЕсли; 
	
	Попытка
		
		ДокументСборки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Смена закрыта. Заполните рапорт!";
		Сообщение.Сообщить(); 
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка закрытия смены! " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьСменуНаСервере()
	
	//ЗаполнитьДокументСборкиСухихПакетов();    - не актуальная история
	
	// проверка на переход на новые регистры, после перехода данный документ не делает движения по новым регистрам
	// т.к. движения создаются стандартным документом производства при упаковке пакета.
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаСмены) ИЛИ НЕ ЗначениеЗаполнено(Объект.Смена) Тогда  
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаСмены) Тогда 
			Сообщить("Заполните дату смены!");
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Объект.Смена) Тогда
			Сообщить("Заполните смену!");
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураНастроек = Новый Структура("Параметр", "ДатаПерехода_ЦЛП");
	ПолучитьДатуВвода = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураНастроек);
	ДатаВвода = Дата("23001201");
	Если ПолучитьДатуВвода.Количество() > 0 Тогда
		ДатаВвода = ПолучитьДатуВвода[0].Дата;
	КонецЕсли;
	
	Если ДатаВвода > Объект.ДатаСмены Тогда
		ЗаполнитьДокументПроизводстваПМ(); 
	КонецЕсли;   
	
	ЗаполнитьДокументПеремещениеПередачуНаСушку();
	
КонецПроцедуры 

&НаСервере
Процедура  ЗаполнитьДокументПеремещениеПередачуНаСушку() 
	
	БуферныйСкладЦЛП = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000003");
	
	СушБуфер = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.СушильныйБуфер"); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_Перемещение.Ссылка
	               |ИЗ
	               |	Документ.алк_Перемещение КАК алк_Перемещение
	               |ГДЕ
	               |	алк_Перемещение.Проведен
	               |	И алк_Перемещение.ДатаСмены = &ДатаСмены
	               |	И алк_Перемещение.Смена = &Смена
	               |	И алк_Перемещение.СкладОтправитель = &СкладОтправитель
	               |	И алк_Перемещение.СкладПолучатель = &СкладПолучатель";
	
	Запрос.УстановитьПараметр("ДатаСмены",Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена",Объект.Смена);
	Запрос.УстановитьПараметр("СкладОтправитель", БуферныйСкладЦЛП);
	Запрос.УстановитьПараметр("СкладПолучатель", СушБуфер);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   ВыборкаДетальныеЗаписи.Следующий();
		
		ДокументПередачаНаСушку = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
		
		ДокументПередачаНаСушку.ЗаполнитьЗапасыПередаваемыеНаСушкуИзПроизводства();
		
	Иначе
		
		ДокументПередачаНаСушку = Документы.алк_Перемещение.СоздатьДокумент();     
		
		//ПараметрыСмены = Новый Структура("ДатаСмены, Смена", Объект.ДатаСмены,  Объект.Смена); 
	
		//ДокументПередачаНаСушку.Дата                    = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, "ПеремещениеНаСушкуПилмат");
		
		ДокументПередачаНаСушку.ДатаСмены	            = Объект.ДатаСмены;
		ДокументПередачаНаСушку.Смена                   = Объект.Смена;
		
		ДокументПередачаНаСушку.Организация             = Справочники.Организации.ОсновнаяОрганизация;
		ДокументПередачаНаСушку.Участок                 = Справочники.алк_Участки.НайтиПоКоду("000000024");
		
		ДокументПередачаНаСушку.СкладОтправитель        = БуферныйСкладЦЛП; 
		ДокументПередачаНаСушку.СкладПолучатель         = СушБуфер; 
		
		ДокументПередачаНаСушку.Ответственный           = ПолучитьПользователяПоСотруднику(Объект.Ответственный);
				
		ДокументПередачаНаСушку.ЗаполнитьЗапасыПередаваемыеНаСушкуИзПроизводства();
		
	КонецЕсли; 
	
	Попытка
		
		ДокументПередачаНаСушку.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Передача пакетов на сушку заполнена!";
		Сообщение.Сообщить(); 
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка педачи пакетов на сушку! " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки; 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	ЗакрытьСменуНаСервере();
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////


#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполениеРеквизитовСмены()
	
	Если Не ЗначениеЗаполнено(Объект.ДатаСмены) ИЛИ Не ЗначениеЗаполнено(Объект.Смена) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните реквизиты смены!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПодчиненныеСтроки(ТекДанные)
	
	Если ТекДанные <> Неопределено Тогда
		
		ЗначениеФлага = ТекДанные.СертификатFSC;
		
		Для каждого стрВыход Из Объект.Т_Выход Цикл
			Если стрВыход.КлючСвязи <> ТекДанные.КлючСвязи Тогда
				Продолжить;
			Иначе
				стрВыход.СертификатFSC = ЗначениеФлага;
				стрВыход.Сертификат = ТекДанные.Сертификат;
			КонецЕсли; 	
		КонецЦикла; 
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыСерииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СерийныйНомер = Результат.СерийныйНомер;
	АктуальныеПараметрыСерии = АктуальныеПараметрыСерии(СерийныйНомер); 
	ЗаполнитьЗначенияСвойств(Результат, АктуальныеПараметрыСерии);
	
КонецПроцедуры

&НаСервере
Функция АктуальныеПараметрыСерии(СерийныйНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ПараметрыПакетовОперативный.НомерПакета,
	|	алк_ПараметрыПакетовОперативный.ПериодПакета,
	|	алк_ПараметрыПакетовОперативный.КоличествоСостав КАК Количество,
	|	алк_ПараметрыПакетовОперативный.Объем,
	|	алк_ПараметрыПакетовОперативный.Характеристика,
	|	алк_ПараметрыПакетовОперативный.СертификатFSC,
	|	алк_ПараметрыПакетовОперативный.ОбъемТаможня,
	|	алк_ПараметрыПакетовОперативный.ВесБруттоТаможня,
	|	алк_ПараметрыПакетовОперативный.ВесНеттоТаможня,
	|	алк_ПараметрыПакетовОперативный.ДатаСмены,
	|	алк_ПараметрыПакетовОперативный.Смена,
	|	алк_ПараметрыПакетовОперативный.Характеристика.Владелец КАК Номенклатура,
	|	алк_ПараметрыПакетовОперативный.Сертификат
	|ИЗ
	|	РегистрСведений.алк_ПараметрыПакетовОперативный КАК алк_ПараметрыПакетовОперативный
	|ГДЕ
	|	алк_ПараметрыПакетовОперативный.Смена = &Смена
	|	И алк_ПараметрыПакетовОперативный.ДатаСмены = &ДатаСмены
	|	И алк_ПараметрыПакетовОперативный.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)
	|	И алк_ПараметрыПакетовОперативный.СерийныйНомер = &СерийныйНомер";	
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();

	СтруктураПараметровСерии = Новый Структура;
	Для Каждого Реквизит Из Метаданные.Документы.алк_СменныйРапортЦЛП.ТабличныеЧасти.ПереданоНаСушку.Реквизиты Цикл
		СтруктураПараметровСерии.Вставить(Реквизит.Имя);	
	КонецЦикла;
	
	СтруктураПараметровСерии.СерийныйНомер = СерийныйНомер;
	Если ВыборкаИзРезультатаЗапроса.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметровСерии, ВыборкаИзРезультатаЗапроса);
	КонецЕсли;	
	
	Возврат СтруктураПараметровСерии;
	
КонецФункции


#КонецОбласти 


#Область ИнтерфейсныеПроцедуры

&НаКлиенте
Процедура УстановитьОтборТаблицы(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", Элемент.ТекущиеДанные.КлючСвязи);
		
		Элементы.Т_Выход.ОтборСтрок = СтруктураОтбора;
		
	Иначе
		
		Элементы.Т_Выход.ОтборСтрок = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьОтборТаблицы


#КонецОбласти 


Процедура Конец()	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоСертификатПриИзменении(Элемент)
	
	ИзменитьПодчиненныеСтроки(Элементы.Т_Распилено.ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПролучитьСоответствиеСоотношений(Характеристика, ДатаСмены, Смена)

	Соответствие = Новый Соответствие;
	
	Если Ложь Тогда                                                            	// для отладки
		Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("");	
	КонецЕсли; 
	
	НоваяХарактеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(СтрЗаменить(Характеристика.Наименование,"3.65","3.75"),,,Характеристика.Владелец);
	
	Соответствие.Вставить("НоваяХарактеристика",НоваяХарактеристика);
	
	// получаем параметры характеристик
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПараметрыХарактеристик.Характеристика,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Сорт,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Сечение,
		|	алк_ПараметрыХарактеристик.Влажность,
		|	алк_ПараметрыХарактеристик.КоличествоРеквизитов
		|ИЗ
		|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|ГДЕ
		|	алк_ПараметрыХарактеристик.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Порода = "";
	Сечение = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Порода = ВыборкаДетальныеЗаписи.Порода;
		Сечение = ВыборкаДетальныеЗаписи.Сечение;
	КонецЦикла;
	
	// получаем выпуск продукции по двум интересеющим нас длинам одного сечения
	// 
	
	Пилмат = Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000002");
	
	Длина3650 = Справочники.Длины.НайтиПоНаименованию("3.65",,,Пилмат);
	Длина3750 = Справочники.Длины.НайтиПоНаименованию("3.75",,,Пилмат);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВыпускПродукцииСерииОбороты.ДатаСмены КАК ДатаСмены,
		|	алк_ВыпускПродукцииСерииОбороты.Смена КАК Смена,
		|	алк_ВыпускПродукцииСерииОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(алк_ВыпускПродукцииСерииОбороты.КоличествоПакетовОборот) КАК КоличествоПакетовОборот,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение
		|ИЗ
		|	РегистрНакопления.алк_ВыпускПродукцииСерии.Обороты(, , , ) КАК алк_ВыпускПродукцииСерииОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ВыпускПродукцииСерииОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_ВыпускПродукцииСерииОбороты.ДатаСмены = &ДатаСмены
		|	И алк_ВыпускПродукцииСерииОбороты.Смена = &Смена
		|	И (алк_ПараметрыХарактеристик.Длина = &Длина3650
		|			ИЛИ алк_ПараметрыХарактеристик.Длина = &Длина3750)
		|	И алк_ПараметрыХарактеристик.Сечение = &Сечение
		|	И алк_ПараметрыХарактеристик.Порода = &Порода
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВыпускПродукцииСерииОбороты.ДатаСмены,
		|	алк_ВыпускПродукцииСерииОбороты.Смена,
		|	алк_ВыпускПродукцииСерииОбороты.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода,
		|	алк_ПараметрыХарактеристик.Длина,
		|	алк_ПараметрыХарактеристик.Сечение
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ";
	
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("Длина3650", Длина3650);
	Запрос.УстановитьПараметр("Длина3750", Длина3750);
	Запрос.УстановитьПараметр("Порода", Порода);
	Запрос.УстановитьПараметр("Сечение", Сечение);
	Запрос.УстановитьПараметр("Смена", Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Количество3650 = 0;
	Количество3750 = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Длина = Длина3650 Тогда
			Количество3650 = ВыборкаДетальныеЗаписи.КоличествоПакетовОборот;
		Иначе
			Количество3750 = ВыборкаДетальныеЗаписи.КоличествоПакетовОборот;
		КонецЕсли; 		
	КонецЦикла;
	
	Соответствие.Вставить("Количество3650",Количество3650);
	Соответствие.Вставить("Количество3750",Количество3750);
	
	Возврат Соответствие;

КонецФункции 

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)

	ДоступностьЭлементовПоНаправлению();
	
КонецПроцедуры


&НаКлиенте
Процедура ДоступностьЭлементовПоНаправлению() 	 
	
	Если Элементы.Направление.ТекстРедактирования = "Лесопиление" Тогда 		
		Элементы.ФормаЗаполнитьРапорт.Доступность 	= Истина;	
		Элементы.ФормаЗакрытьСмену.Доступность 		= Истина;		
	Иначе
		Элементы.ФормаЗаполнитьРапорт.Доступность 	= Ложь;  
		Элементы.ФормаЗакрытьСмену.Доступность 		= Ложь;
	КонецЕсли;       

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступностьЭлементовПоНаправлению();
	
КонецПроцедуры


#Область СоставСмены

Процедура ПерезаполнитьСоставСмены()
	ТЗСоставаСмены = Документы.алк_ЧисленныйСоставСмены.ПолучитьСоставСмены(ПараметрыЗаполненияЧисленногоСоставаСмены());	
	СоставСмены.Загрузить(ТЗСоставаСмены.Персонал);
	СоставСменыТранспорт.Загрузить(ТЗСоставаСмены.Транспорт);
КонецПроцедуры

Функция ПараметрыЗаполненияЧисленногоСоставаСмены()    
	
	ПараметрыЗаполнения = Документы.алк_ЧисленныйСоставСмены.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
	//ПараметрыЗаполнения.Направление = Объект.Направление;//Пробно убрали заполнение, предполагаем Реквизит Направление из Численного состава смены можно удалить в будущем
	ПараметрыЗаполнения.Участок = Объект.Участок;
	ПараметрыЗаполнения.ДатаСмены = Объект.ДатаСмены;
	ПараметрыЗаполнения.Смена = Объект.Смена;
	ПараметрыЗаполнения.Бригада = Объект.Бригада;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСоставСмены(Команда)
	Если Модифицированность Тогда	
		ПоказатьВопросОбновленияСоставаСмены();
	Иначе
		ПерезаполнитьСоставСмены();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОбновленияСоставаСмены()
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаОбновленияСоставаСмены", ЭтотОбъект);	
 	ПоказатьВопрос(Оповещение,
        "Не записаные данные будут потеряны. Продолжить?",
      	РежимДиалогаВопрос.ДаНет,
        0,
        КодВозвратаДиалога.Да, 
		"Обновление состава смены"
    );   
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОбновленияСоставаСмены(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ПерезаполнитьСоставСмены();
    КонецЕсли;	
КонецПроцедуры

Процедура ЗаписатьСоставСмены()
	Если СоставСмены.Количество() > 0 Тогда	
		Если ЗаполненностьРеквизитовДляСостава() Тогда
			ОбъектДокументЧисленныйСоставСмены = ПолучитьОбъектЧисленныйСоставСмены(Истина);
			
			НовыйСоставСмены = СоставСмены.Выгрузить();
			ОбъектДокументЧисленныйСоставСмены.Персонал.Загрузить(НовыйСоставСмены);
			ОбъектДокументЧисленныйСоставСмены.Бригада = Объект.Бригада;
			
			НовыйСоставСменыТранспорт = СоставСменыТранспорт.Выгрузить();
			ОбъектДокументЧисленныйСоставСмены.Транспорт.Загрузить(НовыйСоставСменыТранспорт);
			
			Попытка
				ОбъектДокументЧисленныйСоставСмены.Записать(РежимЗаписиДокумента.Проведение);		
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		Иначе
			Сообщить("Не заполнены основные реквизиты смены. Состав смены не сохранен");	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЗаполненностьРеквизитовДляСостава()
	Если ЗначениеЗаполнено(Объект.Участок)
		//И ЗначениеЗаполнено(Объект.Направление)
		И ЗначениеЗаполнено(Объект.Бригада)
		И ЗначениеЗаполнено(Объект.ДатаСмены)
		И ЗначениеЗаполнено(Объект.Смена) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьОбъектЧисленныйСоставСмены(СоздаватьНовый = Ложь)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияЧисленногоСоставаСмены();
	
	ДокументЧисленныйСоставСмены = алк_ПроизводствоСервер.ПолучитьДокументЧисленныйСоставСмены(ПараметрыЗаполнения, СоздаватьНовый);	
	
	Если ДокументЧисленныйСоставСмены <> Неопределено Тогда 
		ОбъектДокументЧисленныйСоставСмены = ДокументЧисленныйСоставСмены.Ссылка.ПолучитьОбъект();
		Возврат ОбъектДокументЧисленныйСоставСмены;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоставСменыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура СоставСменыТранспортПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставСменыПоБригадеНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БригадыСостав.ФизическоеЛицо,
		|	БригадыСостав.Должность,
		|	ЗНАЧЕНИЕ(Справочник.алк_СтатусыСотрудников.ПустаяСсылка) КАК СтатусСотрудника
		|ИЗ
		|	Справочник.Бригады.Состав КАК БригадыСостав
		|ГДЕ
		|	БригадыСостав.Цех.Код = ""000000001""
		|	И БригадыСостав.Ссылка = &Бригада";
	
	Запрос.УстановитьПараметр("Бригада", Объект.Бригада);

	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатТЗ = РезультатЗапроса.Выгрузить();
	РезультатТЗ.ЗаполнитьЗначения(Константы.алк_СтатусСотрудникаПоУмолчанию.Получить(),"СтатусСотрудника");
	
	СоставСмены.Загрузить(РезультатТЗ);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставСменыПоБригаде(Команда)
	Если ЗаполненностьРеквизитовДляСостава() Тогда
		ЗаполнитьСоставСменыПоБригадеНаСервере();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаписатьСоставСмены();
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходПрипускПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Выход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеУпаковкаУМП(Команда)
	
	ПроверитьЗаполениеРеквизитовСмены();
	ЗаполнитьДанныеУпаковкаНаСервере(Истина);

КонецПроцедуры










