

&НаКлиенте
Процедура УстановитьЧисло(Команда)
	
	ЭтаФорма.Закрыть(ТекущееЧисло);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущееЧисло") Тогда
		ТекущееЧисло = Параметры.ТекущееЧисло; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВвод(СтрокаВвода)
	Если СтрокаВвода = "Удалить" Тогда
		ТекущееЧисло = ?(СтрДлина(ТекущееЧисло) - 1 > 0, Число(Лев(ТекущееЧисло, СтрДлина(ТекущееЧисло) - 1)), 0);
		ВводДробнойЧасти = Ложь;
		ВводНуляВДробнойЧасти = Ложь;
	ИначеЕсли СтрокаВвода = "," Тогда
		ВводДробнойЧасти = Истина;
	Иначе 	
		Если ВводДробнойЧасти И ТекущееЧисло - Окр(ТекущееЧисло,0) = 0 Тогда		
			Если ВводНуляВДробнойЧасти Тогда //если уже вводили ноль в дробной части
				ТекущееЧисло = Число(Строка(ТекущееЧисло) + ",0" + СтрокаВвода);		
			Иначе	
				ТекущееЧисло = Число(Строка(ТекущееЧисло) + "," + СтрокаВвода);	
			КонецЕсли;
			
			Если СтрокаВвода = "0" Тогда //покажем что в дробной части вводится ноль
				ВводНуляВДробнойЧасти = Истина;	
			КонецЕсли;
		Иначе
			ТекущееЧисло = Число(Строка(ТекущееЧисло) + СтрокаВвода);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Команда0(Команда)
	ОбработатьВвод("0");	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ОбработатьВвод("1");
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	ОбработатьВвод("2");
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	ОбработатьВвод("3");
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	ОбработатьВвод("4");
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	ОбработатьВвод("5");
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	ОбработатьВвод("6");
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	ОбработатьВвод("7");
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	ОбработатьВвод("8");
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	ОбработатьВвод("9");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапятая(Команда)
	ОбработатьВвод(",");
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьСимвол(Команда)
	ОбработатьВвод("Удалить");
КонецПроцедуры





