
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Функция КлючПараметровПечати() Экспорт
		
		Возврат "ПАРАМЕТРЫ_ПЕЧАТИ_Универсальные_БланкТоварногоНаполнения";
		
	КонецФункции
	
	Функция ПолныйПутьКМакету() Экспорт
		
		Возврат "Обработка.алк_ПечатьБланкТоварногоНаполнения.ПФ_MXL_БланкТоварногоНаполнения";
		
	КонецФункции
	
	Функция ПредставлениеПФ() Экспорт
		
		Возврат НСтр("ru ='Бланк товарного наполнения'");
		
	КонецФункции
	
	Функция СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати) Экспорт
		Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
		
		Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
		ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
		ДанныеПечати		= Новый Структура;
		ЕстьТЧЗапасы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаЗапасы") <> Неопределено);
		ЕстьТЧМатериалы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаМатериалы") <> Неопределено);
		
		Для каждого ДанныеОбъекта Из ДанныеОбъектовПечати Цикл
			
			ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
			
			МассивОбластейМакета = Новый Массив;
			МассивОбластейМакета.Добавить("Заголовок");
			МассивОбластейМакета.Добавить("Склад");
			МассивОбластейМакета.Добавить("ВремяПечати");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеОбъекта.ДатаДокумента, ДанныеОбъекта.Номер, ДанныеОбъекта.Префикс);
			ТекстЗаголовка = ДанныеОбъекта.ПредставлениеРегистратора + "  № " + НомерДокумента + " от " + Формат(ДанныеОбъекта.ДатаДокумента, "ДЛФ=DD");
			ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
			ДанныеПечати.Вставить("ПредставлениеСклада", ДанныеОбъекта.ПредставлениеСклада);
			
			Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
				
				МассивОбластейМакета.Вставить(2, "Ячейка");
				ДанныеПечати.Вставить("ПредставлениеЯчейки", ДанныеОбъекта.ПредставлениеЯчейки);
				
			КонецЕсли;
			
			ВремяПечати = НСтр("ru ='Дата и время печати: '") + ТекущаяДатаСеанса() + НСтр("ru ='. Пользователь: '") + Пользователи.АвторизованныйПользователь();
			ДанныеПечати.Вставить("ВремяПечати", ВремяПечати);
			
			Для каждого ИмяОбласти Из МассивОбластейМакета Цикл
				
				ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, "", Ошибки);
				Если ОбластьМакета <> Неопределено Тогда
					
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Строка", "", Ошибки);
			ОбластьМакетаШапка = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ШапкаТаблицы", "", Ошибки);
			Если ОбластьМакета <> Неопределено
				И ОбластьМакетаШапка <> Неопределено Тогда
				
				ОбластьМакетаИтого = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Итого", "", Ошибки);
				ТаблицаСерийныеНомера = ДанныеОбъекта.ТаблицаСерийныеНомера;
				ПараметрыНоменклатуры = Новый Структура;
				
				Если ЕстьТЧЗапасы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Запасы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
					
					Для каждого СтрокаТаблицыЗапасы Из ДанныеОбъекта.ТаблицаЗапасы Цикл
						
						Если НЕ СтрокаТаблицыЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыЗапасы, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
						
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
					КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЕстьТЧМатериалы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Материалы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
					
					Для каждого СтрокаТаблицыМатериалов Из ДанныеОбъекта.ТаблицаМатериалы Цикл
						
						Если НЕ СтрокаТаблицыМатериалов.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыМатериалов, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
						
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
					КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеОбъекта.Ссылка);
			
		КонецЦикла;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции
	
	Функция алк_СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати) Экспорт
		Перем ПервыйДокумент, НомерСтрокиНачало, Ошибки;
		
		Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
		ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
		ДанныеПечати		= Новый Структура;
		ЕстьТЧЗапасы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаЗапасы") <> Неопределено);
		ЕстьТЧМатериалы		= (ДанныеОбъектовПечати.Колонки.Найти("ТаблицаМатериалы") <> Неопределено);
		
		Для каждого ДанныеОбъекта Из ДанныеОбъектовПечати Цикл
			
			ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
			
			МассивОбластейМакета = Новый Массив;
			МассивОбластейМакета.Добавить("Заголовок");
			МассивОбластейМакета.Добавить("Склад");
			МассивОбластейМакета.Добавить("ВремяПечати");
			
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеОбъекта.ДатаДокумента, ДанныеОбъекта.Номер, ДанныеОбъекта.Префикс);
			ТекстЗаголовка = ДанныеОбъекта.ПредставлениеРегистратора + "  № " + НомерДокумента + " от " + Формат(ДанныеОбъекта.ДатаДокумента, "ДЛФ=DD");
			ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
			ДанныеПечати.Вставить("ПредставлениеСклада", ДанныеОбъекта.ПредставлениеСклада);
			
			Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
				
				МассивОбластейМакета.Вставить(2, "Ячейка");
				ДанныеПечати.Вставить("ПредставлениеЯчейки", ДанныеОбъекта.ПредставлениеЯчейки);
				
			КонецЕсли;
			
			ВремяПечати = НСтр("ru ='Дата и время печати: '") + ТекущаяДатаСеанса() + НСтр("ru ='. Пользователь: '") + Пользователи.АвторизованныйПользователь();
			ДанныеПечати.Вставить("ВремяПечати", ВремяПечати);
			
			Для каждого ИмяОбласти Из МассивОбластейМакета Цикл
				
				ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, "", Ошибки);
				Если ОбластьМакета <> Неопределено Тогда
					
					ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ОбластьМакета = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Строка", "", Ошибки);
			ОбластьМакетаШапка = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "ШапкаТаблицы", "", Ошибки);
			Если ОбластьМакета <> Неопределено
				И ОбластьМакетаШапка <> Неопределено Тогда
				
				ОбластьМакетаИтого = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Итого", "", Ошибки);
				//ТаблицаСерийныеНомера = ДанныеОбъекта.ТаблицаСерийныеНомера;
				ПараметрыНоменклатуры = Новый Структура;
				
				Если ЕстьТЧЗапасы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Запасы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				    ЗаполнитьДанныеПечати(ДанныеПечати,ДанныеОбъекта,Макет,ТабличныйДокумент);
					//Для каждого СтрокаТаблицыЗапасы Из ДанныеОбъекта.ТаблицаЗапасы Цикл
					//	
					//	Если НЕ СтрокаТаблицыЗапасы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
					//		
					//		Продолжить;
					//		
					//	КонецЕсли;
					//	
					//	алк_ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыЗапасы, ДанныеПечати, ПараметрыНоменклатуры);
					//	
					//	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
					//	ТабличныйДокумент.Вывести(ОбластьМакета);
					//	
					//КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЕстьТЧМатериалы Тогда
					
					ДанныеПечати.Вставить("ТипНоменклатурыТаблицы", Нстр("ru ='Материалы'"));
					ОбластьМакетаШапка.Параметры.Заполнить(ДанныеПечати);
					ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
					
					Для каждого СтрокаТаблицыМатериалов Из ДанныеОбъекта.ТаблицаМатериалы Цикл
						
						Если НЕ СтрокаТаблицыМатериалов.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						//ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТаблицыМатериалов, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера);
						
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
					КонецЦикла;
					
					Если ОбластьМакетаИтого <> Неопределено Тогда
						
						ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеОбъекта.Ссылка);
			
			
		КонецЦикла;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // алк_СформироватьПФ()
	
	Процедура ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ДанныеПечати, ПараметрыНоменклатуры, ТаблицаСерийныеНомера)
		
		ДанныеПечати.Очистить();
		
		ДанныеПечати.Вставить("НомерСтроки", СтрокаТабличнойЧасти.НомерСтроки);
		
		СтрокаСерийныеНомера = ПечатьДокументовУНФ.ПредставлениеСерийногоНомера(ТаблицаСерийныеНомера, СтрокаТабличнойЧасти.КлючСвязи);
		
		ПараметрыНоменклатуры.Очистить();
		ПараметрыНоменклатуры.Вставить("Содержание", СтрокаТабличнойЧасти.Содержание);
		ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаТабличнойЧасти.ПредставлениеНоменклатуры);
		ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СтрокаТабличнойЧасти.Характеристика);
		ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", СтрокаТабличнойЧасти.Артикул);
		ПараметрыНоменклатуры.Вставить("СтрокаСерийныеНомера", СтрокаСерийныеНомера);
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
		
		ДанныеПечати.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		ДанныеПечати.Вставить("Склад", СтрокаТабличнойЧасти.Склад);
		ДанныеПечати.Вставить("Ячейка", СтрокаТабличнойЧасти.Ячейка);
		
	КонецПроцедуры
	
	Процедура алк_ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ДанныеПечати, ПараметрыНоменклатуры)
		
		ДанныеПечати.Очистить();
		
		ДанныеПечати.Вставить("НомерСтроки", СтрокаТабличнойЧасти.НомерСтроки);
		
		//СтрокаСерийныеНомера = ПечатьДокументовУНФ.ПредставлениеСерийногоНомера(ТаблицаСерийныеНомера, СтрокаТабличнойЧасти.КлючСвязи);
		//
		ПараметрыНоменклатуры.Очистить();
		//ПараметрыНоменклатуры.Вставить("Содержание", СтрокаТабличнойЧасти.Содержание);
		ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаТабличнойЧасти.ПредставлениеНоменклатуры);
		//ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СтрокаТабличнойЧасти.Характеристика);
		//ПараметрыНоменклатуры.Вставить("ПредставлениеАртикула", СтрокаТабличнойЧасти.Артикул);
		//ПараметрыНоменклатуры.Вставить("СтрокаСерийныеНомера", СтрокаСерийныеНомера);
		
		ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(СтрокаТабличнойЧасти.СерийныйНомер);
		
		//ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры));
		ПредставлениеНоменклатуры = ПараметрыНоменклатуры.ПредставлениеНоменклатуры + "(" + ПараметрыПакета.Характеристика.Наименование + ")";
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", ПредставлениеНоменклатуры);

		//
		ДанныеПечати.Вставить("Количество", ПараметрыПакета.КоличествоСостав);
		ДанныеПечати.Вставить("Объем", ПараметрыПакета.Объем);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", "куб.м.");
		//ДанныеПечати.Вставить("Склад", СтрокаТабличнойЧасти.Склад);
		//ДанныеПечати.Вставить("Ячейка", СтрокаТабличнойЧасти.Ячейка);
		ДанныеПечати.Вставить("Пакет", СтрокаТабличнойЧасти.Пакет);
		
	КонецПроцедуры
	
	
	Процедура ЗаполнитьДанныеПечати(ДанныеПечати,ДанныеОбъекта,Макет,ТабличныйДокумент)  экспорт
		ссылка=ДанныеОбъекта.Ссылка;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|	И алк_ПеремещениеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыИсторияЗаказовСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
		|	алк_ПараметрыПакетовСрезПоследних.Регистратор.Смена,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец) = ТИП(Справочник.КатегорииНоменклатуры)
		|			ТОГДА алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец
		|		ИНАЧЕ алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец.КатегорияНоменклатуры
		|	КОНЕЦ КАК КатегорияНоменклатур,
		|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
		|	алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|			&ДатаСреза,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					Вт.СерийныйНомер
		|				ИЗ
		|					Вт КАК Вт)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(&ДатаСреза, ) КАК алк_ПакетыИсторияЗаказовСрезПоследних
		|		ПО алк_ПараметрыПакетовСрезПоследних.СерийныйНомер = алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер
		|ИТОГИ
		|	КОЛИЧЕСТВО(КоличествоСостав),
		|	СУММА(Объем)
		|ПО
		|	ЗаказПокупателя";
		
		Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТипНоменклатуры",Перечисления.ТипыНоменклатуры.Запас);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПокупатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ЗаказПокупателя");
		 НомерСтроки=0;
		Пока ВыборкаПокупатель.Следующий() Цикл
			
			МакетГруппировки=Макет.ПолучитьОбласть("СтрокаГруппировки");
			ЗаполнитьДанныеПострокеГруппировка(ВыборкаПокупатель,ДанныеПечати);
			МакетГруппировки.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(МакетГруппировки);
			ДетальныеЗаписи=ВыборкаПокупатель.Выбрать();
			
			Пока ДетальныеЗаписи.Следующий() цикл
				НомерСтроки=НомерСтроки+1;
				МакетСтроки=Макет.ПолучитьОбласть("Строка");
				ЗаполнитьДанныеПоСтрокеДетальные(ДетальныеЗаписи,НомерСтроки,ДанныеПечати);
				МакетСтроки.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(МакетСтроки);
			КонецЦикла;
			
		КонецЦикла;
	
	КонецПроцедуры      
	
	Процедура	ЗаполнитьДанныеПострокеГруппировка(Строка,ДанныеПечати)
		ДанныеПечати.Очистить();
		ДанныеПечати.Вставить("Количество", Строка.КоличествоСостав);
		ДанныеПечати.Вставить("Объем", Строка.Объем);
		ДанныеПечати.Вставить("ЗаказПокупателя",Строка.ЗаказПокупателя);
	КонецПроцедуры
	
	Процедура ЗаполнитьДанныеПоСтрокеДетальные(Строка,НомерСтроки,ДанныеПечати)
		ДанныеПечати.Очистить();	
		ДанныеПечати.Вставить("НомерСтроки",НомерСтроки);
		ДанныеПечати.Вставить("ПредставлениеНоменклатуры", Строка.Характеристика);
		ДанныеПечати.Вставить("Количество", Строка.КоличествоСостав);
		ДанныеПечати.Вставить("Объем", Строка.Объем);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", "куб.м.");
		ДанныеПечати.Вставить("Пакет", Строка.СерийныйНомер);	
	КонецПроцедуры
	
	
#КонецЕсли