
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	//Проверка уникальности документа
	ПараметрыЗаполнения = Документы.алк_ЧисленныйСоставСмены.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
	ПараметрыЗаполнения.Участок = Участок;
	ПараметрыЗаполнения.Направление = Направление;
	ПараметрыЗаполнения.ДатаСмены = ДатаСмены;
	ПараметрыЗаполнения.Смена = Смена;
	
	РезультатПроверкиУникальности = алк_ПроизводствоСервер.ПолучитьДокументЧисленныйСоставСмены(ПараметрыЗаполнения, Ложь, ЭтотОбъект.Ссылка);
	Если РезультатПроверкиУникальности <> Неопределено Тогда
		Сообщить("Ошибка уникальности. Документ с такими реквизитами смены уже был создан! Перепроверьте введенные данные или редактируйте уже созданный документ");
		Отказ = Истина;
	КонецЕсли;
	
	//удалим пустую строку персонал
	МассивПустыхСтрокПерсонала = Персонал.НайтиСтроки(Новый Структура("Должность, ФизическоеЛицо", Справочники.Должности.ПустаяСсылка(), Справочники.ФизическиеЛица.ПустаяСсылка()));
	
	Если МассивПустыхСтрокПерсонала <> 0 Тогда 
		Для Каждого эл ИЗ МассивПустыхСтрокПерсонала Цикл
			Персонал.Удалить(эл);
		КонецЦикла;
	КонецЕсли;
	//\\
	
	//удалим пустую строку транспорта
	МассивПустыхСтрокТранспорта = Транспорт.НайтиСтроки(Новый Структура("ТранспортноеСредство",Справочники.ТранспортныеСредства.ПустаяСсылка())); 
	
	Если МассивПустыхСтрокТранспорта.Количество() <> 0 Тогда 
		Для Каждого эл ИЗ МассивПустыхСтрокТранспорта Цикл
			Транспорт.Удалить(эл);
		КонецЦикла; 
	КонецЕсли;
	//\\ 
	
	//проверка, что заполнили фио сотрудников
	МассивПустыхФИО = Персонал.НайтиСтроки(Новый Структура("ФизическоеЛицо", Справочники.ФизическиеЛица.ПустаяСсылка())); 
	
	Если МассивПустыхФИО.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;  
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Отказ = Истина; 
	КонецЕсли;   
	
	Сообщить("Ошибка!");
	
	Для Каждого эл ИЗ МассивПустыхФИО Цикл 
		Сообщить(СтрШаблон("Заполните ФИО сотрудника в строке %1!",эл.НомерСтроки));
	КонецЦикла;
	//\\
			
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);	
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Показатель = Справочники.алк_ОперацииПроизводства.ЧисленныйСоставСмены; //Численный состав смены (общая)
	
	Если Показатель <> Справочники.алк_ОперацииПроизводства.ПустаяСсылка() Тогда			
		РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
		ДатаСмены,
		Показатель,
		Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	//// регистр алк_ГрафикСмен
	//Движения.алк_ГрафикСмен.Записывать = Истина;
	//Движение = Движения.алк_ГрафикСмен.Добавить();
	//Движение.ДатаСмены = ДатаСмены;
	//Движение.Смена = Смена;
	//Движение.Участок = Участок;
	//Движение.Бригада = Бригада;
	
КонецПроцедуры

