
Процедура ПередЗаписью(Отказ, Замещение)
	
	//Заблокируем возможность изменения пользователем с полными правами.
	//Если отключить через роли, при возможном обновлении УНФ отметка автоматически может быть установлена.
	
	//Закомментила, так как удаление не работает тогда 20250708 Данько ТА
	//ПравоИзмененияИзмененияЗапрещены = РольДоступна("РФП_УправлениеСостояниемИзмененияЗапрещены");
	//Если НЕ ПравоИзмененияИзмененияЗапрещены Тогда
	//	Отказ = Истина;
	//	возврат;
	//КонецЕсли;
	
КонецПроцедуры
