
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьДайджестНаСервереПоОперСводке();
	
	ПодключитьОбработчикОжидания("СформироватьДайджест", 60);
	
КонецПроцедуры

#Область СтароеФормирование

&НаСервере
Процедура СформироватьДайджестНаСервере() 
	
	ТД = ""; 
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Макет"); 
	
	//какой сегодня день, сколько всего дней в месяце, и какой день по счету сейчас
	ДатаФормирования = ТекущаяДата(); //данные формируются на эту дату
	ВсегоДнейВМесяце = День(КонецМесяца(ДатаФормирования));
	СегодняДеньПоСчету = День(ДатаФормирования);
	//\\  
    	
	//массив областей для перекраски в зеленый
	МассивОбластей = Новый Массив;
	//\\
		
	//Область шапка таблицы
	ШапкаТЧТД = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	ШапкаТЧТД.Параметры.ДатаФормирования = Формат(ДатаФормирования,"ДФ=dd.MM.yyyy");
	ТД.Вывести(ШапкаТЧТД);
	//\\
	
	//Область производство и упаковка
	ПроизводствоУпаковкаТД = Макет.ПолучитьОбласть("ПроизводствоУпаковка"); 
	
	//категории номенклатуры ЦЛП (пр-во)
	КатегорииНоменклатурыДляПроизводствоЦЛП = Новый Массив;
	КатегорииНоменклатурыДляПроизводствоЦЛП.Добавить(СтруктураКатегорииНоменклатуры().Пиломатериал);
	КатегорииНоменклатурыДляПроизводствоЦЛП.Добавить(СтруктураКатегорииНоменклатуры().ОтходыПилмат);
	КатегорииНоменклатурыДляПроизводствоЦЛП.Добавить(СтруктураКатегорииНоменклатуры().ПобочнаяПродукция);
	//\\
	
	//категории номенклатуры МЛП (пр-во)
	КатегорииНоменклатурыДляПроизводствоМЛП = Новый Массив;
	КатегорииНоменклатурыДляПроизводствоМЛП.Добавить(СтруктураКатегорииНоменклатуры().Пиломатериал);
	КатегорииНоменклатурыДляПроизводствоМЛП.Добавить(СтруктураКатегорииНоменклатуры().ПиломатериалСП);
	//\\
	
	//ЦЛП + МПС
	МассивСкладовПроизводстваЦЛП = Новый Массив;
	МассивСкладовПроизводстваЦЛП.Добавить(СтруктураСклады().БуферныйСкладЦЛП);
	МассивСкладовПроизводстваЦЛП.Добавить(СтруктураСклады().БуферныйСкладМПС);
	
	//Фактические значения
	ОбъемПроизводствоПМЦЛПФакт = ПроизводствоЦЛПМЛП(ДатаФормирования,КатегорииНоменклатурыДляПроизводствоЦЛП,МассивСкладовПроизводстваЦЛП)[0].ОбъемПроизведенного;
	ОбъемУпаковкаПеллетыФакт = УпаковкаПеллеты(ДатаФормирования)[0].КоличествоОборот;
	ОбъемПроизводствоПММЛПФакт = ПроизводствоЦЛПМЛП(ДатаФормирования,КатегорииНоменклатурыДляПроизводствоМЛП,СтруктураСклады().УчастокМЛП)[0].ОбъемПроизведенного;
	ОбъемПроизводствоПМЛаминаФакт = ВТЧЛамина(ДатаФормирования,МассивСкладовПроизводстваЦЛП)[0].ОбъемПроизведенного;
	//\\
	
	//проверка, что показатели не неопределенно факт
	Если ОбъемПроизводствоПМЦЛПФакт = Null Тогда 
		ОбъемПроизводствоПМЦЛПФакт = 0;
	КонецЕсли;
	
	Если ОбъемУпаковкаПеллетыФакт = Null Тогда 
		ОбъемУпаковкаПеллетыФакт = 0;
	КонецЕсли;  
	
	Если ОбъемПроизводствоПММЛПФакт = Null Тогда 
		ОбъемПроизводствоПММЛПФакт = 0;
	КонецЕсли; 
	
	Если ОбъемПроизводствоПМЛаминаФакт = Null Тогда 
		ОбъемПроизводствоПМЛаминаФакт = 0;
	КонецЕсли; 
	//\\
	
	//Плановые значения 
	ОбъемПлановыеПоказатели = ПлановыеПоказателиПоставкаЗапасыПроизводствоОтгрузкаОстатки(ДатаФормирования);
	
	Если ОбъемПлановыеПоказатели.Количество() = 0 Тогда 
		ОбъемПроизводствоПилматЦЛППлан = 0; 
		ОбъемПроизводствоПМВТЧЛаминаПлан = 0;
		ОбъемПроизводствоМЛППлан = 0;
	Иначе  
		ОбъемПроизводствоПилматЦЛППлан = ПлановыйПоказательПроизведеноПМ(ДатаФормирования)[0].Объем;
		ОбъемПроизводствоПМВТЧЛаминаПлан = ОбъемПлановыеПоказатели[0].ПроизводствоПМВТЧЛамина;
		ОбъемПроизводствоМЛППлан = ОбъемПлановыеПоказатели[0].ПроизводствоМЛП;
	КонецЕсли; 
	
	УпаковкаОтгрузкаПеллетыПлан = ПлановыеПоказателиУпаковкаОтгрузка(ДатаФормирования); 
	УпаковкаПеллетыПлан = УпаковкаОтгрузкаПеллетыПлан[0].УпакованоДГ;
	//\\
		
	//факт + план
	ПроизводствоШпон = ПроизводствоШпон(ДатаФормирования); //возврат ОбъемФакт и ПроцентПлана
	
	Если ПроизводствоШпон.Количество() = 0 Тогда 
		ПроизводствоШпонПланПроцент  = 0; 
		ПроизводствоШпонФакт = 0;
	Иначе 
		ПроизводствоШпонПланПроцент = ПроизводствоШпон[0].ПроцентПлана; 
		ПроизводствоШпонФакт = ПроизводствоШпон[0].ОбъемФакт; 
	КонецЕсли;
	//\\
	
	
	//заполняем параметры
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоШпон = ПроизводствоШпонФакт;
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПМЦЛП = Окр(ОбъемПроизводствоПМЦЛПФакт/1000,1); 
	ПроизводствоУпаковкаТД.Параметры.ОбъемУпаковкаПеллеты = Окр(ОбъемУпаковкаПеллетыФакт/1000,1);
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПММЛП = Окр(ОбъемПроизводствоПММЛПФакт/1000,1);
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПМЛамина = Окр(ОбъемПроизводствоПМЛаминаФакт/1000,1);
	
	Если ПроизводствоШпонПланПроцент = NULL Тогда 
		ПроизводствоШпонПланПроцент = 0;
	КонецЕсли;
	
	ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоШпон = ПроизводствоШпонПланПроцент; 
	
	Если ОбъемПроизводствоПилматЦЛППлан = NULL Тогда
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП = 0;
	Иначе 
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП = Окр(ОбъемПроизводствоПМЦЛПФакт/ПлановыйПоказательПроизведеноПМ(ДатаФормирования)[0].Объем *100); 
	КонецЕсли;
	
	Если ОбъемПроизводствоПМВТЧЛаминаПлан = 0  Тогда
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина = 0;
	Иначе 
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина = ОКР(ОбъемПроизводствоПМЛаминаФакт/ОбъемПлановыеПоказатели[0].ПроизводствоПМВТЧЛамина*100);
	КонецЕсли;
	
	Если ОбъемПроизводствоМЛППлан = 0  Тогда  
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП = 0;
	Иначе 
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП = ОКР(ОбъемПроизводствоПММЛПФакт/ОбъемПлановыеПоказатели[0].ПроизводствоМЛП*100);
	КонецЕсли;
	
	Если УпаковкаПеллетыПлан = 0  Тогда
		ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты = 0;
	Иначе
		ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты = ОКР(ОбъемУпаковкаПеллетыФакт/УпаковкаПеллетыПлан*100);   
	КонецЕсли;
	//\\
	
	//назначение цвета
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоШпон >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентПроизводствоШпон");
	КонецЕсли;  
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентПроизводствоПМЦЛП");
	КонецЕсли;
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентПроизводствоПМЛамина");
	КонецЕсли;  
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентПроизводствоПММЛП");
	КонецЕсли;
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентУпаковкаПеллеты");
	КонецЕсли;
	//\\  
	
	ТД.Вывести(ПроизводствоУпаковкаТД);
	//\\
	
	//Область ПоставкаЗапасыОснШтабель
	ПоставкаЗапасыОснШтабельТД = Макет.ПолучитьОбласть("ПоставкаЗапасыОснШтабель"); 
	
	//факт лиственница
	ОбъемФактЛиственница = ПоставкаСырьяЗапасыСырьяОснШтабельОстатки(ДатаФормирования,"000000004",СтруктураСклады().УчастокСортирЛМЦЛП);
	
	Если ОбъемФактЛиственница.Количество() = 0 Тогда 
		ОбъемПоставкаШпонФакт = 0;
		ОбъемЗапасыШпонФакт = 0;
		ОбъемОснШтабельШпонФакт = 0;  
	Иначе
		ОбъемПоставкаШпонФакт = ОбъемФактЛиственница[0].ПоставкаОбъем;
		ОбъемЗапасыШпонФакт = ОбъемФактЛиственница[0].ВсегоОбъем;
		ОбъемОснШтабельШпонФакт = ОбъемФактЛиственница[0].ОснШтабельОбъем;  
	КонецЕсли;
	//\\ 
	
	
	//факт ель
	ОбъемФактЕль = ПоставкаСырьяЗапасыСырьяОснШтабельОстатки(ДатаФормирования, "000000001",СтруктураСклады().УчастокСортирЛМЦЛП);
	
	Если ОбъемФактЛиственница.Количество() = 0 Тогда 
		ОбъемПоставкаПМФакт = 0;
		ОбъемЗапасыПМФакт = 0;
		ОбъемОснШтабельПМФакт  = 0;  
	Иначе
		ОбъемПоставкаПМФакт = ОбъемФактЕль[0].ПоставкаОбъем;
		ОбъемЗапасыПМФакт = ОбъемФактЕль[0].ВсегоОбъем;
		ОбъемОснШтабельПМФакт = ОбъемФактЕль[0].ОснШтабельОбъем;
	КонецЕсли;
	//\\ 
	
	
	//план осн штабель 
	ОбъемОстаткиЕльПлан = УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования, "000000069"); 
	ОбъемОстаткиЛиственницаПлан = УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования, "000000070");  
	
	Если ОбъемОстаткиЕльПлан.Количество() = 0 Тогда 
		ОбъемОстаткиОснШтабельЕльПлан = 0;
	Иначе
		ОбъемОстаткиОснШтабельЕльПлан = ОбъемОстаткиЕльПлан[0].Значение;
	КонецЕсли;   
	
	Если ОбъемОстаткиЛиственницаПлан.Количество() = 0 Тогда 
		ОбъемОстаткиОснШтабельЛиственницаПлан = 0;
	Иначе
		ОбъемОстаткиОснШтабельЛиственницаПлан = УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования, "000000070")[0].Значение;
	КонецЕсли;
	//\\
	
	//план 
	Если ОбъемПлановыеПоказатели.Количество() = 0 Тогда 
		ОбъемПоставкаСырьяЛиственницаПлан = 0;
		ОбъемПоставкаСырьяЕльПлан = 0;
	Иначе
		ОбъемПоставкаСырьяЛиственницаПлан = ОбъемПлановыеПоказатели[0].ПоставкаСырьяЛиственница;  
		ОбъемПоставкаСырьяЕльПлан = ОбъемПлановыеПоказатели[0].ПоставкаСырьяЕль; 
	КонецЕсли;
	//\\
		
	//заполняем параметры
	ПоставкаЗапасыОснШтабельТД.Параметры.ОбъемПоставкаШпон = Окр(ОбъемПоставкаШпонФакт/1000,1);
	ПоставкаЗапасыОснШтабельТД.Параметры.ОбъемЗапасыШпон = Окр(ОбъемЗапасыШпонФакт/1000,1);
	ПоставкаЗапасыОснШтабельТД.Параметры.ОбъемОснШтабельШпон = Окр(ОбъемОснШтабельШпонФакт/1000,1);
	ПоставкаЗапасыОснШтабельТД.Параметры.ОбъемПоставкаПМ = Окр(ОбъемПоставкаПМФакт/1000,1);
	ПоставкаЗапасыОснШтабельТД.Параметры.ОбъемЗапасыПМ = Окр(ОбъемЗапасыПМФакт/1000,1); 
	ПоставкаЗапасыОснШтабельТД.Параметры.ОбъемОснШтабельПМ = Окр(ОбъемОснШтабельПМФакт/1000,1); 
	
	Если ОбъемПоставкаСырьяЛиственницаПлан = 0 Тогда
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентПоставкаШпон = 0;
	Иначе
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентПоставкаШпон = Окр(ОбъемПоставкаШпонФакт/ОбъемПлановыеПоказатели[0].ПоставкаСырьяЛиственница*100);
	КонецЕсли;
	
	Если ОбъемОстаткиОснШтабельЛиственницаПлан = 0  Тогда 
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентОснШтабельШпон = 0;
	Иначе 
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентОснШтабельШпон = Окр(ОбъемОснШтабельШпонФакт/ОбъемОстаткиОснШтабельЛиственницаПлан*100);   
	КонецЕсли;
	
	Если ОбъемПоставкаСырьяЕльПлан = 0 Тогда 
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентПоставкаПМ = 0;
	Иначе 
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентПоставкаПМ = Окр(ОбъемПоставкаПМФакт/ОбъемПлановыеПоказатели[0].ПоставкаСырьяЕль*100);
	КонецЕсли;
	
	Если ОбъемОстаткиОснШтабельЕльПлан = 0 Тогда
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентОснШтабельПМ = 0;
	Иначе 
		ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентОснШтабельПМ = Окр(ОбъемОснШтабельПМФакт/ОбъемОстаткиОснШтабельЕльПлан*100); 
	КонецЕсли;
	//\\ 
	
	//назначение цвета
	Если ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентПоставкаШпон >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентПоставкаШпон");
	КонецЕсли;  
	
	Если ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентОснШтабельШпон >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОснШтабельШпон");
	КонецЕсли;
	
	Если ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентПоставкаПМ >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентПоставкаПМ");
	КонецЕсли;  
	
	Если ПоставкаЗапасыОснШтабельТД.Параметры.ПроцентОснШтабельПМ >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОснШтабельПМ");
	КонецЕсли;
	//\\  
			
	ТД.Вывести(ПоставкаЗапасыОснШтабельТД);
	//\\
	
	//Область ОтгрузкаРеализация
	ОтгрузкаРеализацияТД = Макет.ПолучитьОбласть("ОтгрузкаРеализация"); 
	
	//факт 
	ОбъемОтгрузкаПМ = ОтгрузкаПилМат(ДатаФормирования);
	ОбъемОтгрузкаПеллетыФакт = ОтгрузкаПеллеты(ДатаФормирования)[0].ОбъемОтгрузки;
	ОбъемРеализацияПеллетыФакт = РеализацияПеллеты(ДатаФормирования)[0].Объем;
	//\\ 
	
	//проверка  
	Если ОбъемОтгрузкаПМ[0].Объем = NULL Тогда 
		ОбъемОтгрузкаПМФакт = 0;
	Иначе 
		ОбъемОтгрузкаПМФакт = ОтгрузкаПилМат(ДатаФормирования)[0].Объем;
	КонецЕсли;
	
	Если ОбъемОтгрузкаПеллетыФакт = NULL Тогда 
		ОбъемОтгрузкаПеллетыФакт = 0;
	КонецЕсли;
	
	Если ОбъемРеализацияПеллетыФакт = NULL Тогда 
		ОбъемРеализацияПеллетыФакт = 0;
	КонецЕсли;
	//\\
	
	//план
	ОбъемОтгрузкаПеллетыПлан = УпаковкаОтгрузкаПеллетыПлан[0].ОтгруженоДГ;
	ОбъемРеализацияПеллетПлан = УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования, "000000071");  
	
	Если ОбъемРеализацияПеллетПлан.Количество() = 0 Тогда 
		ОбъемРеализацияПеллетПлан = 0; 
	Иначе 
		ОбъемРеализацияПеллетПлан = ОбъемРеализацияПеллетПлан[0].Значение;  
	КонецЕсли;
	//\\ 
	
	//факт+план
	ОтгрузкаШпон = ОтгрузкаШпон(ДатаФормирования); 
	
	Если ОтгрузкаШпон.Количество() = 0 Тогда
		ОбъемОтгрузкаШпонФакт = 0;
		ОбъемОтгрузкаШпонПланПроцент = 0;
	Иначе 
		ОбъемОтгрузкаШпонФакт = ОтгрузкаШпон[0].ОбъемФакт;
		ОбъемОтгрузкаШпонПланПроцент = ОтгрузкаШпон[0].ПроцентПлана; 
	КонецЕсли;
	//\\
	
	
	//план	
	Если ОбъемПлановыеПоказатели.Количество() = 0 Тогда
		ОбъемОтгрузкаПиломатериалПлан = 0;
	Иначе 
		ОбъемОтгрузкаПиломатериалПлан = ОбъемПлановыеПоказатели[0].ОтгрузкаПиломатериал;
	КонецЕсли;
	//\\
		
	//заполняем параметры
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаШпон = ОбъемОтгрузкаШпонФакт;
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаПМ = Окр(ОбъемОтгрузкаПМФакт/1000,1);
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаПеллеты = Окр(ОбъемОтгрузкаПеллетыФакт/1000,1); 
	ОтгрузкаРеализацияТД.Параметры.ОбъемРеализацияПеллеты = Окр(ОбъемРеализацияПеллетыФакт/1000,1);
	
	Если ОбъемОтгрузкаШпонПланПроцент = NULL Тогда 
		ОбъемОтгрузкаШпонПланПроцент = 0; 
	КонецЕсли;
	
	ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаШпон = ОбъемОтгрузкаШпонПланПроцент;
	
	Если ОбъемОтгрузкаПиломатериалПлан = 0  Тогда
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ = 0;
	Иначе 
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ = Окр(ОбъемОтгрузкаПМФакт/ОбъемОтгрузкаПиломатериалПлан *100);
	КонецЕсли;
	
	Если ОбъемОтгрузкаПеллетыПлан = 0  Тогда
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты = 0;
	Иначе 
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты = Окр(ОбъемОтгрузкаПеллетыФакт/ОбъемОтгрузкаПеллетыПлан*100);
	КонецЕсли;
	
	Если ОбъемРеализацияПеллетПлан = 0 Тогда
		ОтгрузкаРеализацияТД.Параметры.ПроцентРеализацияПеллеты = 0;
	Иначе
		ОтгрузкаРеализацияТД.Параметры.ПроцентРеализацияПеллеты = Окр(ОбъемРеализацияПеллетыФакт/(ОбъемРеализацияПеллетПлан/ВсегоДнейВМесяце*СегодняДеньПоСчету)*100); //в млн?
	КонецЕсли;
	//\\
	
	//назначение цвета
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаШпон >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОтгрузкаШпон");
	КонецЕсли;  
	
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОтгрузкаПМ");
	КонецЕсли;
	
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОтгрузкаПеллеты");
	КонецЕсли;
		
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентРеализацияПеллеты >= 100 Тогда 
		МассивОбластей.Добавить("ПроцентРеализацияПеллеты");
	КонецЕсли;

	ТД.Вывести(ОтгрузкаРеализацияТД);
	//\\
	
	//Область Остатки на СГП
	ОстаткиТД = Макет.ПолучитьОбласть("Остатки"); 
	
	//склады остатков пеллет
	СкладыОстатковПеллет = Новый Массив;
	СкладыОстатковПеллет.Добавить(СтруктураСклады().ДГСГП);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад1);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад2);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад3);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад4);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад5);
	//\\
	
	//факт 
	ОбъемОстаткиПМ = ОстаткиНаСГП(ДатаФормирования+24*60*60,СтруктураСклады().СкладГотовойПродукции,Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"));
	ОбъемОстаткиПеллеты = ОстаткиНаСГП(ДатаФормирования+24*60*60,СтруктураСклады().ДГСГП,Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018")); //ОстаткиНаСГПСТАРЫЙ(ДатаФормирования+24*60*60,СкладыОстатковПеллет,Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018"));
	//\\ 
	
	//проверка 
	Если ОбъемОстаткиПМ.Количество() = 0 Тогда 
		ОбъемОстаткиПМФакт = 0;
	Иначе
		ОбъемОстаткиПМФакт = ОбъемОстаткиПМ[0].Остатки;
	КонецЕсли;
	
	Если ОбъемОстаткиПеллеты.Количество() = 0 Тогда 
		ОбъемОстаткиПеллетыФакт = 0;
	Иначе
		ОбъемОстаткиПеллетыФакт = ОбъемОстаткиПеллеты[0].Остатки;
	КонецЕсли;
	//\\
	
	//план 
	Если  ОбъемПлановыеПоказатели.Количество() = 0 Тогда 
		ОбъемОстаткиПМПлан = 0;
	Иначе
		ОбъемОстаткиПМПлан = ОбъемПлановыеПоказатели[0].ОстатокиСГППМ;
	КонецЕсли;

	ОбъемОстаткиПеллетыПлан = УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования,"000000073");
	
	Если  ОбъемОстаткиПеллетыПлан.Количество() = 0 Тогда 
		ОбъемОстаткиПеллетыПлан = 0;
	Иначе
		ОбъемОстаткиПеллетыПлан = ОбъемОстаткиПеллетыПлан[0].Значение;
	КонецЕсли;
	//\\ 
	
	//факт+план
	ОстаткиШпон = ОстаткиНаСГПШпон(ДатаФормирования,СтруктураПороды().Лиственница,СтруктураСклады().СкладГотовойПродукции);    
		
	//проверка 
	Если ОстаткиШпон.Количество() = 0 Тогда 
		ОбъемОстаткиШпонФакт = 0; 
		ОбъемОстаткиШпонПланПроцент = 0;
	Иначе
		ОбъемОстаткиШпонФакт = ОстаткиШпон[0].ОбъемФакт; 
		ОбъемОстаткиШпонПланПроцент = ОстаткиШпон[0].ПроцентПлана;
	КонецЕсли;
	//\\ 
	//\\
	
	//заполняем параметры
	ОстаткиТД.Параметры.ОбъемОстаткиШпон = ОбъемОстаткиШпонФакт;
	ОстаткиТД.Параметры.ОбъемОстаткиПМ = Окр(ОбъемОстаткиПМФакт/1000,1);
	ОстаткиТД.Параметры.ОбъемОстаткиПеллеты = Окр(ОбъемОстаткиПеллетыФакт/1000,1); 
	
	ОстаткиТД.Параметры.ПроцентОстаткиШпон = ОбъемОстаткиШпонПланПроцент; 
	
	Если ОбъемОстаткиПМПлан = 0 Тогда
		ОстаткиТД.Параметры.ПроцентОстаткиПМ = 0;
	Иначе
		ОстаткиТД.Параметры.ПроцентОстаткиПМ = Окр(ОбъемОстаткиПМФакт/ОбъемОстаткиПМПлан*100);
	КонецЕсли; 
	
	Если ОбъемОстаткиПеллетыПлан = 0  Тогда 
		ОстаткиТД.Параметры.ПроцентОстаткиПеллеты = 0;
	Иначе 
		ОстаткиТД.Параметры.ПроцентОстаткиПеллеты = Окр(ОбъемОстаткиПеллетыФакт / ОбъемОстаткиПеллетыПлан *100);
	КонецЕсли; 
	//\\
	
	//назначение цвета
	Если ОстаткиТД.Параметры.ПроцентОстаткиШпон <= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОстаткиШпон");
	КонецЕсли;  
	
	Если ОстаткиТД.Параметры.ПроцентОстаткиПМ <= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОстаткиПМ");
	КонецЕсли;
	
	Если ОстаткиТД.Параметры.ПроцентОстаткиПеллеты <= 100 Тогда 
		МассивОбластей.Добавить("ПроцентОстаткиПеллеты");
	КонецЕсли;  
	
	#Если НаКлиенте И НаСервере тогда
	ТД = новый ТабличныйДокумент; 
	#КонецЕсли
	ТД.АвтоМасштаб = Ложь;
	ТД.ШиринаСтраницы = 1000;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТД.ТолькоПросмотр = Истина;
	
	ТД.Вывести(ОстаткиТД);
	//\\  
	
	ИзменениеЦветаЯчеекНаЗеленый(МассивОбластей,НазначитьЦвет().Зеленый);   
			
КонецПроцедуры

&НаСервере
Процедура СформироватьДайджестНаСервере2() 
	
	ТД = ""; 
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Макет2");  
	
	//какой сегодня день, сколько всего дней в месяце, и какой день по счету сейчас
	ДатаФормирования = ТекущаяДата(); //данные формируются на эту дату
	ВсегоДнейВМесяце = День(КонецМесяца(ДатаФормирования));
	СегодняДеньПоСчету = День(ДатаФормирования);
	//\\  
    	
	//массив областей для перекраски в зеленый
	МассивОбластейЗеленый = Новый Массив;  
	МассивОбластейКрасный = Новый Массив;
	//\\
		
	//Область шапка таблицы
	ШапкаТЧТД = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	ШапкаТЧТД.Параметры.ДатаФормирования = Формат(ДатаФормирования,"ДФ=dd.MM.yyyy");
	ТД.Вывести(ШапкаТЧТД);
	//\\
	
	//Область производство и упаковка
	ПроизводствоУпаковкаТД = Макет.ПолучитьОбласть("ПроизводствоУпаковка"); 
	
	//категории номенклатуры ЦЛП (пр-во)
	КатегорииНоменклатурыДляПроизводствоЦЛП = Новый Массив;
	КатегорииНоменклатурыДляПроизводствоЦЛП.Добавить(СтруктураКатегорииНоменклатуры().Пиломатериал);
	КатегорииНоменклатурыДляПроизводствоЦЛП.Добавить(СтруктураКатегорииНоменклатуры().ОтходыПилмат);
	КатегорииНоменклатурыДляПроизводствоЦЛП.Добавить(СтруктураКатегорииНоменклатуры().ПобочнаяПродукция);
	//\\
	
	//категории номенклатуры МЛП (пр-во)
	КатегорииНоменклатурыДляПроизводствоМЛП = Новый Массив;
	КатегорииНоменклатурыДляПроизводствоМЛП.Добавить(СтруктураКатегорииНоменклатуры().Пиломатериал);
	КатегорииНоменклатурыДляПроизводствоМЛП.Добавить(СтруктураКатегорииНоменклатуры().ПиломатериалСП);
	//\\
	
	//ЦЛП + МПС
	МассивСкладовПроизводстваЦЛП = Новый Массив;
	МассивСкладовПроизводстваЦЛП.Добавить(СтруктураСклады().БуферныйСкладЦЛП);
	МассивСкладовПроизводстваЦЛП.Добавить(СтруктураСклады().БуферныйСкладМПС);
	
	//Фактические значения
	ОбъемПроизводствоПМЦЛПФакт = ПроизводствоЦЛПМЛП(ДатаФормирования,КатегорииНоменклатурыДляПроизводствоЦЛП,МассивСкладовПроизводстваЦЛП)[0].ОбъемПроизведенного;
	ОбъемУпаковкаПеллетыФакт = УпаковкаПеллеты(ДатаФормирования)[0].КоличествоОборот;
	ОбъемПроизводствоПММЛПФакт = ПроизводствоЦЛПМЛП(ДатаФормирования,КатегорииНоменклатурыДляПроизводствоМЛП,СтруктураСклады().УчастокМЛП)[0].ОбъемПроизведенного;
	ОбъемПроизводствоПМЛаминаФакт = ВТЧЛамина(ДатаФормирования,МассивСкладовПроизводстваЦЛП)[0].ОбъемПроизведенного;
	//\\
	
	//проверка, что показатели не неопределенно факт
	Если ОбъемПроизводствоПМЦЛПФакт = Null Тогда 
		ОбъемПроизводствоПМЦЛПФакт = 0;
	КонецЕсли;
	
	Если ОбъемУпаковкаПеллетыФакт = Null Тогда 
		ОбъемУпаковкаПеллетыФакт = 0;
	КонецЕсли;  
	
	Если ОбъемПроизводствоПММЛПФакт = Null Тогда 
		ОбъемПроизводствоПММЛПФакт = 0;
	КонецЕсли; 
	
	Если ОбъемПроизводствоПМЛаминаФакт = Null Тогда 
		ОбъемПроизводствоПМЛаминаФакт = 0;
	КонецЕсли; 
	//\\
	
	//Плановые значения 
	ОбъемПлановыеПоказатели = ПлановыеПоказателиПоставкаЗапасыПроизводствоОтгрузкаОстатки(ДатаФормирования);
	
	Если ОбъемПлановыеПоказатели.Количество() = 0 Тогда 
		ОбъемПроизводствоПилматЦЛППлан = 0; 
		ОбъемПроизводствоПМВТЧЛаминаПлан = 0;
		ОбъемПроизводствоМЛППлан = 0;
	Иначе  
		ОбъемПроизводствоПилматЦЛППлан = ПлановыйПоказательПроизведеноПМ(ДатаФормирования)[0].Объем;
		ОбъемПроизводствоПМВТЧЛаминаПлан = ОбъемПлановыеПоказатели[0].ПроизводствоПМВТЧЛамина;
		ОбъемПроизводствоМЛППлан = ОбъемПлановыеПоказатели[0].ПроизводствоМЛП;
	КонецЕсли; 
	
	УпаковкаОтгрузкаПеллетыПлан = ПлановыеПоказателиУпаковкаОтгрузка(ДатаФормирования); 
	УпаковкаПеллетыПлан = УпаковкаОтгрузкаПеллетыПлан[0].УпакованоДГ;
	//\\
		
	//факт + план
	ПроизводствоШпон = ПроизводствоШпон(ДатаФормирования); //возврат ОбъемФакт и ПроцентПлана
	
	Если ПроизводствоШпон.Количество() = 0 Тогда 
		ПроизводствоШпонПланПроцент  = 0; 
		ПроизводствоШпонФакт = 0;
	Иначе 
		ПроизводствоШпонПланПроцент = ПроизводствоШпон[0].ПроцентПлана; 
		ПроизводствоШпонФакт = ПроизводствоШпон[0].ОбъемФакт; 
	КонецЕсли;
	//\\
	
	//заполняем параметры
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоШпон = ПроизводствоШпонФакт;
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПМЦЛП = Окр(ОбъемПроизводствоПМЦЛПФакт/1000,1); 
	ПроизводствоУпаковкаТД.Параметры.ОбъемУпаковкаПеллеты = Окр(ОбъемУпаковкаПеллетыФакт/1000,1);
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПММЛП = Окр(ОбъемПроизводствоПММЛПФакт/1000,1);
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПМЛамина = Окр(ОбъемПроизводствоПМЛаминаФакт/1000,1);
	
	Если ПроизводствоШпонПланПроцент = NULL Тогда 
		ПроизводствоШпонПланПроцент = 0;
	КонецЕсли;
	
	ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоШпон = ПроизводствоШпонПланПроцент; 
	
	Если ОбъемПроизводствоПилматЦЛППлан = NULL Тогда
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП = 0;
	Иначе 
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП = Окр(ОбъемПроизводствоПМЦЛПФакт/ПлановыйПоказательПроизведеноПМ(ДатаФормирования)[0].Объем *100); 
	КонецЕсли;
	
	Если ОбъемПроизводствоПМВТЧЛаминаПлан = 0 ИЛИ ОбъемПроизводствоПМВТЧЛаминаПлан = NULL Тогда
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина = 0;
	Иначе 
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина = ОКР(ОбъемПроизводствоПМЛаминаФакт/ОбъемПлановыеПоказатели[0].ПроизводствоПМВТЧЛамина*100);
	КонецЕсли;
	
	Если ОбъемПроизводствоМЛППлан = 0 ИЛИ ОбъемПроизводствоМЛППлан = NULL Тогда  
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП = 0;
	Иначе 
		ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП = ОКР(ОбъемПроизводствоПММЛПФакт/ОбъемПлановыеПоказатели[0].ПроизводствоМЛП*100);
	КонецЕсли;
	
	Если УпаковкаПеллетыПлан = 0 ИЛИ УпаковкаПеллетыПлан = NULL Тогда
		ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты = 0;
	Иначе
		ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты = ОКР(ОбъемУпаковкаПеллетыФакт/УпаковкаПеллетыПлан*100);   
	КонецЕсли;
	//\\
	
	//назначение цвета
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоШпон >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоШпон"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоШпон");
	КонецЕсли;  
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоПМЦЛП");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоПМЦЛП");
	КонецЕсли;
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоПМЛамина");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоПМЛамина");
	КонецЕсли;  
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоПММЛП");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоПММЛП");
	КонецЕсли;
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентУпаковкаПеллеты"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентУпаковкаПеллеты");
	КонецЕсли;
	//\\  
	
	ТД.Вывести(ПроизводствоУпаковкаТД);
	//\\
	
	Лиственница = Справочники.Породы.НайтиПоКоду("000000004"); //Лц
	
	Ель = Новый Массив;
	Ель.Добавить(Справочники.Породы.НайтиПоКоду("000000001")); //Ель
	Ель.Добавить(Справочники.Породы.НайтиПоКоду("000000003")); //Пихта
	
	//ОБЛАСТЬ ПОСТАВКА СЫРЬЯ
	ПоставкаСырьяТД = Макет.ПолучитьОбласть("ПоставкаСырья");  
	
	//ФАКТ
	ПоставкаСырьяЛц = ВернутьЗначениеПоставки(ДатаФормирования,Истина,Лиственница);
	ПоставкаСырьяЕль = ВернутьЗначениеПоставки(ДатаФормирования,Истина,Ель);  
	ПоставкаСырьяВсего = ВернутьЗначениеПоставки(ДатаФормирования,Ложь,Справочники.Породы.ПустаяСсылка());
	//\\
	
	//Проверка
	Если ПоставкаСырьяЛц = NULL Тогда 
		ПоставкаСырьяЛц = 0;
	КонецЕсли;
	
	Если ПоставкаСырьяЕль= NULL Тогда 
		ПоставкаСырьяЕль = 0;
	КонецЕсли;
	
	Если ПоставкаСырьяВсего = NULL Тогда 
		ПоставкаСырьяВсего = 0;
	КонецЕсли; 
	//\\
	
	//ПЛАН 
	МассивИменЗапросовПлановПоставки = Новый Массив;
	МассивИменЗапросовПлановПоставки.Добавить("ОбъемПоступленияСырьяЕльУПСС");
	МассивИменЗапросовПлановПоставки.Добавить("ОбъемПоступленияСырьяПихтаУПСС");
	
	ПланПоставкаЛЦ = ВернутьПлан(ДатаФормирования,"ОбъемПоступленияСырьяЛцУПСС");
	ПланПоставкаЕль = ВернутьПлан(ДатаФормирования, МассивИменЗапросовПлановПоставки); 
	
	МассивИменЗапросовПлановПоставки.Добавить("ОбъемПоступленияСырьяЛцУПСС");
	
	ПланПоставкаВсего = ВернутьПлан(ДатаФормирования,МассивИменЗапросовПлановПоставки);
	//\\  
	
	//Проверка
	Если ПланПоставкаЛЦ = NULL ИЛИ ПланПоставкаЛЦ = 0  Тогда 
		ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЛц = 0; 
	Иначе 
		ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЛц = ОКР(ПоставкаСырьяЛц/ПланПоставкаЛЦ*100); 
	КонецЕсли;
	
	Если ПланПоставкаЕль= NULL ИЛИ ПланПоставкаЕль = 0 Тогда 
		ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЕль = 0;  
	Иначе  
		ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЕль = ОКР(ПоставкаСырьяЕль/ПланПоставкаЕль*100);
	КонецЕсли;
	
	Если ПланПоставкаВсего = NULL ИЛИ ПланПоставкаВсего = 0 Тогда 
		ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяВсего = 0; 
	Иначе
		ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяВсего = ОКР(ПоставкаСырьяВсего/ПланПоставкаВсего*100);
	КонецЕсли; 
	//\\
	
	//Устанавливаем параметры   
	ПоставкаСырьяТД.Параметры.ОбъемПоставкаСырьяЛц = ОКР(ПоставкаСырьяЛц/1000,1); 
	ПоставкаСырьяТД.Параметры.ОбъемПоставкаСырьяЕль = ОКР(ПоставкаСырьяЕль/1000,1);
	ПоставкаСырьяТД.Параметры.ОбъемПоставкаСырьяВсего = ОКР(ПоставкаСырьяВсего/1000,1);
	//\\ 
	
	//назначение цвета
	Если ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЛц >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПоставкаСырьяЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПоставкаСырьяЛц");
	КонецЕсли;  
	
	Если ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЕль >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПоставкаСырьяЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПоставкаСырьяЕль");
	КонецЕсли;
	
	Если ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяВсего >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПоставкаСырьяВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПоставкаСырьяВсего");
	КонецЕсли;      
	//\\
	
	ТД.Вывести(ПоставкаСырьяТД); 
	//\\
	
	//ОБЛАСТЬ ПРИЕМКА СЫРЬЯ
	ПриемкаСырьяТД = Макет.ПолучитьОбласть("ПриемкаСырья");  
	
	//ФАКТ
	ПриемкаСырьяЛц = ВернутьЗначениеПриемки(ДатаФормирования,Истина,Лиственница);
	ПриемкаСырьяЕль = ВернутьЗначениеПриемки(ДатаФормирования,Истина,Ель);  
	ПриемкаСырьяВсего = ВернутьЗначениеПриемки(ДатаФормирования,Ложь,Справочники.Породы.ПустаяСсылка()); 
	//\\
	
	//Проверка
	Если ПриемкаСырьяЛц = NULL Тогда 
		ПриемкаСырьяЛц = 0;
	КонецЕсли;
	
	Если ПриемкаСырьяЕль= NULL Тогда 
		ПриемкаСырьяЕль = 0;
	КонецЕсли;
	
	Если ПриемкаСырьяВсего = NULL Тогда 
		ПриемкаСырьяВсего = 0;
	КонецЕсли; 
	//\\
	
	//ПЛАН 
	МассивИменЗапросовПлановПриемки = Новый Массив;
	МассивИменЗапросовПлановПриемки.Добавить("ПриемкаСырьяЕль");
	МассивИменЗапросовПлановПриемки.Добавить("ПриемкаСырьяЛц");
	
	ПланПриемкиЛЦ = ВернутьПлан(ДатаФормирования,"ПриемкаСырьяЛц"); 
	ПланПриемкиЕль = ВернутьПлан(ДатаФормирования,"ПриемкаСырьяЕль"); 
		
	ПланПриемкиВсего = ВернутьПлан(ДатаФормирования,МассивИменЗапросовПлановПриемки);
	//\\  
	
	//Проверка
	Если ПланПриемкиЛЦ = NULL ИЛИ ПланПриемкиЛЦ = 0  Тогда 
		ПриемкаСырьяТД.Параметры.ПроцентПриемкаЛц = 0; 
	Иначе 
		ПриемкаСырьяТД.Параметры.ПроцентПриемкаЛц = ОКР(ПриемкаСырьяЛц/ПланПриемкиЛЦ*100); 
	КонецЕсли;
	
	Если ПланПриемкиЕль= NULL ИЛИ ПланПриемкиЕль = 0 Тогда 
		ПриемкаСырьяТД.Параметры.ПроцентПриемкаЕль = 0;  
	Иначе  
		ПриемкаСырьяТД.Параметры.ПроцентПриемкаЕль = ОКР(ПриемкаСырьяЕль/ПланПриемкиЕль*100);
	КонецЕсли;
	
	Если ПланПриемкиВсего = NULL ИЛИ ПланПриемкиВсего = 0 Тогда 
		ПриемкаСырьяТД.Параметры.ПроцентПриемкаВсего = 0; 
	Иначе
		ПриемкаСырьяТД.Параметры.ПроцентПриемкаВсего = ОКР(ПриемкаСырьяВсего/ПланПриемкиВсего*100);
	КонецЕсли; 
	//\\

	//Устанавливаем параметры   
	ПриемкаСырьяТД.Параметры.ПриемкаЛц = ОКР(ПриемкаСырьяЛц/1000,1); 
	ПриемкаСырьяТД.Параметры.ПриемкаЕль = ОКР(ПриемкаСырьяЕль/1000,1);
	ПриемкаСырьяТД.Параметры.ПриемкаВсего = ОКР(ПриемкаСырьяВсего/1000,1);
	//\\
	
	//назначение цвета
	Если ПриемкаСырьяТД.Параметры.ПроцентПриемкаЛц >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПриемкаЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПриемкаЛц");
	КонецЕсли;  
	
	Если ПриемкаСырьяТД.Параметры.ПроцентПриемкаЕль >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПриемкаЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПриемкаЕль");
	КонецЕсли;
	
	Если ПриемкаСырьяТД.Параметры.ПроцентПриемкаВсего >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПриемкаВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПриемкаВсего");
	КонецЕсли; 
	//\\

	ТД.Вывести(ПриемкаСырьяТД); 
	
	//ЗАПАСЫ СЫРЬЯ (правил. длинномеры)
	ЗапасыСырьяТД = Макет.ПолучитьОбласть("ЗапасыСырья");  
	
	//ФАКТ
	ЗапасыСырьяЛц = ВернутьЗначениеЗапасы(ДатаФормирования,Истина,Лиственница,"00000000002");    
	ЗапасыСырьяЕль = ВернутьЗначениеЗапасы(ДатаФормирования,Истина,Ель,"00000000002");  
	ЗапасыСырьяВсего = ВернутьЗначениеЗапасы(ДатаФормирования,Ложь,Справочники.Породы.ПустаяСсылка(),"00000000002");
	//\\
	
	//Проверка
	Если ЗапасыСырьяЛц = NULL Тогда 
		ЗапасыСырьяЛц = 0;
	КонецЕсли;
	
	Если ЗапасыСырьяЕль= NULL Тогда 
		ЗапасыСырьяЕль = 0;
	КонецЕсли;
	
	Если ЗапасыСырьяВсего = NULL Тогда 
		ЗапасыСырьяВсего = 0;
	КонецЕсли; 
	//\\

	//ПЛАН 
	МассивИменЗапросовПлановЗапасыСырья = Новый Массив; 
	МассивИменЗапросовПлановЗапасыСырья.Добавить("ОстаткиОсновнойШтабельЕль");
	МассивИменЗапросовПлановЗапасыСырья.Добавить("ОстаткиОсновнойШтабельЛиственница");
	
	ПланЗапасыСырьяЛЦ = ВернутьПлан(ДатаФормирования,"ОстаткиОсновнойШтабельЛиственница");
	ПланЗапасыСырьяЕль = ВернутьПлан(ДатаФормирования,"ОстаткиОсновнойШтабельЕль");
		
	ПланЗапасыСырьяВсего = ВернутьПлан(ДатаФормирования,МассивИменЗапросовПлановЗапасыСырья);
	//\\  
	
	//Проверка
	Если ПланЗапасыСырьяЛЦ = NULL ИЛИ ПланЗапасыСырьяЛЦ = 0  Тогда 
		ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЛц = 0; 
	Иначе 
		ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЛц = ОКР(ЗапасыСырьяЛц/ПланЗапасыСырьяЛЦ*100); 
	КонецЕсли;
	
	Если ПланЗапасыСырьяЕль= NULL ИЛИ ПланЗапасыСырьяЕль = 0 Тогда 
		ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЕль = 0;  
	Иначе  
		ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЕль = ОКР(ЗапасыСырьяЕль/ПланЗапасыСырьяЕль*100);
	КонецЕсли;
	
	Если ПланЗапасыСырьяВсего = NULL ИЛИ ПланЗапасыСырьяВсего = 0 Тогда 
		ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяВсего = 0; 
	Иначе
		ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяВсего = ОКР(ЗапасыСырьяВсего/ПланЗапасыСырьяВсего*100);
	КонецЕсли; 
	//\\
	
	//Устанавливаем параметры   
	ЗапасыСырьяТД.Параметры.ЗапасыСырьяЛц = ОКР(ЗапасыСырьяЛц/1000,1); 
	ЗапасыСырьяТД.Параметры.ЗапасыСырьяЕль = ОКР(ЗапасыСырьяЕль/1000,1);
	ЗапасыСырьяТД.Параметры.ЗапасыСырьяВсего = ОКР(ЗапасыСырьяВсего/1000,1);
	//\\
	
	//назначение цвета
	Если ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЛц <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентЗапасыСырьяЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентЗапасыСырьяЛц");
	КонецЕсли;  
	
	Если ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЕль <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентЗапасыСырьяЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентЗапасыСырьяЕль");
	КонецЕсли;
	
	Если ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяВсего <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентЗапасыСырьяВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентЗапасыСырьяВсего");
	КонецЕсли; 
	//\\
	
	ТД.Вывести(ЗапасыСырьяТД);                                            
	
	//НЕЛИКВИД (неправильные длинномеры) + реализация пеллет
	НеликвидТД = Макет.ПолучитьОбласть("Неликвид");  
	
	//ФАКТ
	НеликвидЛц = ВернутьЗначениеЗапасы(ДатаФормирования,Истина,Лиственница,"00000000028");    
	НеликвидЕль = ВернутьЗначениеЗапасы(ДатаФормирования,Истина,Ель,"00000000028");  
	НеликвидВсего = ВернутьЗначениеЗапасы(ДатаФормирования,Ложь,Справочники.Породы.ПустаяСсылка(),"00000000028");  
	ОбъемРеализацияПеллетыФакт = РеализацияПеллеты(ДатаФормирования)[0].Объем;  
	
	//Проверка
	Если НеликвидЛц = NULL Тогда 
		НеликвидЛц = 0;
	КонецЕсли;
	
	Если НеликвидЕль= NULL Тогда 
		НеликвидЕль = 0;
	КонецЕсли;
	
	Если НеликвидВсего = NULL Тогда 
		НеликвидВсего = 0;
	КонецЕсли;
	
	Если ОбъемРеализацияПеллетыФакт = NULL Тогда 
		ОбъемРеализацияПеллетыФакт = 0;
	КонецЕсли;
	//\\
	
	//ПЛАН 
	МассивИменЗапросовПлановНеликвид = Новый Массив; 
	МассивИменЗапросовПлановНеликвид.Добавить("ОстатокПиловочникНеправильныеДлинномерыЕльБиржа");
	МассивИменЗапросовПлановНеликвид.Добавить("ОстатокПиловочникНеправильныеДлинномерыПихтаБиржа");
	
	ПланНеликвидЛЦ = ВернутьПлан(ДатаФормирования,"ОстатокПиловочникНеправильныеДлинномерыЛцБиржа");
	ПланНеликвидЕль = ВернутьПлан(ДатаФормирования,МассивИменЗапросовПлановНеликвид);
	
	МассивИменЗапросовПлановНеликвид.Добавить("ОстатокПиловочникНеправильныеДлинномерыЛцБиржа");
		
	ПланНеликвидВсего = ВернутьПлан(ДатаФормирования, МассивИменЗапросовПлановНеликвид);
	//\\  
	
	//Проверка
	Если ПланНеликвидЛЦ = NULL ИЛИ ПланНеликвидЛЦ = 0  Тогда 
		НеликвидТД.Параметры.ПроцентНеликвидЛц = 0; 
	Иначе 
		НеликвидТД.Параметры.ПроцентНеликвидЛц = ОКР(НеликвидЛц/ПланНеликвидЛЦ*100); 
	КонецЕсли;
	
	Если ПланНеликвидЕль= NULL ИЛИ ПланНеликвидЕль = 0 Тогда 
		НеликвидТД.Параметры.ПроцентНеликвидЕль = 0;  
	Иначе  
		НеликвидТД.Параметры.ПроцентНеликвидЕль = ОКР(НеликвидЕль/ПланНеликвидЕль*100);
	КонецЕсли;
	
	Если ПланНеликвидВсего = NULL ИЛИ ПланНеликвидВсего = 0 Тогда 
		НеликвидТД.Параметры.ПроцентНеликвидВсего = 0; 
	Иначе
		НеликвидТД.Параметры.ПроцентНеликвидВсего = ОКР(НеликвидВсего/ПланНеликвидВсего*100);
	КонецЕсли; 
	//\\
	
	//ПЛАН 
	ОбъемРеализацияПеллетПлан = УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования, "000000071");
	
	Если ОбъемРеализацияПеллетПлан.Количество() = 0 Тогда 
		ОбъемРеализацияПеллетПлан = 0; 
	Иначе 
		ОбъемРеализацияПеллетПлан = ОбъемРеализацияПеллетПлан[0].Значение;  
	КонецЕсли;
	//\\
	
	//Устанавливаем параметры   
	НеликвидТД.Параметры.НеликвидЛц = ОКР(НеликвидЛц/1000,1); 
	НеликвидТД.Параметры.НеликвидЕль = ОКР(НеликвидЕль/1000,1);
	НеликвидТД.Параметры.НеликвидВсего = ОКР(НеликвидВсего/1000,1);
	НеликвидТД.Параметры.ОбъемРеализацияПеллеты = Окр(ОбъемРеализацияПеллетыФакт/1000,1);  
	
	Если ОбъемРеализацияПеллетПлан = 0 Тогда
		НеликвидТД.Параметры.ПроцентРеализацияПеллеты = 0;
	Иначе
		НеликвидТД.Параметры.ПроцентРеализацияПеллеты = Окр(ОбъемРеализацияПеллетыФакт/(ОбъемРеализацияПеллетПлан/ВсегоДнейВМесяце*СегодняДеньПоСчету)*100); //в млн?
	КонецЕсли;
	//\\ 
	
	//назначение цвета
	Если НеликвидТД.Параметры.ПроцентНеликвидЛц <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентНеликвидЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентНеликвидЛц");
	КонецЕсли;  
	
	Если НеликвидТД.Параметры.ПроцентНеликвидЕль <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентНеликвидЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентНеликвидЕль");
	КонецЕсли;
	
	Если НеликвидТД.Параметры.ПроцентНеликвидВсего <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентНеликвидВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентНеликвидВсего");
	КонецЕсли;
	
	Если НеликвидТД.Параметры.ПроцентРеализацияПеллеты >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентРеализацияПеллеты"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентРеализацияПеллеты");
	КонецЕсли;

	//\\
	
	ТД.Вывести(НеликвидТД);

	//Область ОтгрузкаРеализация
	ОтгрузкаРеализацияТД = Макет.ПолучитьОбласть("ОтгрузкаРеализация"); 
	
	//факт 
	ОбъемОтгрузкаПМ = ОтгрузкаПилМат(ДатаФормирования);
	ОбъемОтгрузкаПеллетыФакт = ОтгрузкаПеллеты(ДатаФормирования)[0].ОбъемОтгрузки;
	//\\ 
	
	//проверка  
	Если ОбъемОтгрузкаПМ[0].Объем = NULL Тогда 
		ОбъемОтгрузкаПМФакт = 0;
	Иначе 
		ОбъемОтгрузкаПМФакт = ОтгрузкаПилМат(ДатаФормирования)[0].Объем;
	КонецЕсли;
	
	Если ОбъемОтгрузкаПеллетыФакт = NULL Тогда 
		ОбъемОтгрузкаПеллетыФакт = 0;
	КонецЕсли;
	//\\
	
	//план
	ОбъемОтгрузкаПеллетыПлан = УпаковкаОтгрузкаПеллетыПлан[0].ОтгруженоДГ; 
	//\\ 
	
	//факт+план
	ОтгрузкаШпон = ОтгрузкаШпон(ДатаФормирования); 
	
	Если ОтгрузкаШпон.Количество() = 0 Тогда
		ОбъемОтгрузкаШпонФакт = 0;
		ОбъемОтгрузкаШпонПланПроцент = 0;
	Иначе 
		ОбъемОтгрузкаШпонФакт = ОтгрузкаШпон[0].ОбъемФакт;
		ОбъемОтгрузкаШпонПланПроцент = ОтгрузкаШпон[0].ПроцентПлана; 
	КонецЕсли;
	//\\
	
	//план	
	Если ОбъемПлановыеПоказатели.Количество() = 0 Тогда
		ОбъемОтгрузкаПиломатериалПлан = 0;
	Иначе 
		ОбъемОтгрузкаПиломатериалПлан = ОбъемПлановыеПоказатели[0].ОтгрузкаПиломатериал;
	КонецЕсли;
	//\\
		
	//заполняем параметры
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаШпон = ОбъемОтгрузкаШпонФакт;
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаПМ = Окр(ОбъемОтгрузкаПМФакт/1000,1);
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаПеллеты = Окр(ОбъемОтгрузкаПеллетыФакт/1000,1); 
		
	Если ОбъемОтгрузкаШпонПланПроцент = NULL Тогда 
		ОбъемОтгрузкаШпонПланПроцент = 0; 
	КонецЕсли;
	
	ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаШпон = ОбъемОтгрузкаШпонПланПроцент;
	
	Если ОбъемОтгрузкаПиломатериалПлан = 0 ИЛИ ОбъемОтгрузкаПиломатериалПлан = NULL Тогда
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ = 0;
	Иначе 
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ = Окр(ОбъемОтгрузкаПМФакт/ОбъемОтгрузкаПиломатериалПлан *100);
	КонецЕсли;
	
	Если ОбъемОтгрузкаПеллетыПлан = 0 ИЛИ ОбъемОтгрузкаПеллетыПлан = NULL Тогда
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты = 0;
	Иначе 
		ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты = Окр(ОбъемОтгрузкаПеллетыФакт/ОбъемОтгрузкаПеллетыПлан*100);
	КонецЕсли;
	//\\
	
	//назначение цвета
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаШпон >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОтгрузкаШпон"); 
	Иначе   
		МассивОбластейКрасный.Добавить("ПроцентОтгрузкаШпон");
	КонецЕсли;  
	
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОтгрузкаПМ"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентОтгрузкаПМ");
	КонецЕсли;
	
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОтгрузкаПеллеты"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентОтгрузкаПеллеты");
	КонецЕсли;
	//\\
	
	ТД.Вывести(ОтгрузкаРеализацияТД);
	//\\
	
	//Область Остатки на СГП
	ОстаткиТД = Макет.ПолучитьОбласть("Остатки"); 
	
	//склады остатков пеллет
	СкладыОстатковПеллет = Новый Массив;
	СкладыОстатковПеллет.Добавить(СтруктураСклады().ДГСГП);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад1);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад2);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад3);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад4);
	СкладыОстатковПеллет.Добавить(СтруктураСклады().Склад5);
	//\\
	
	//факт 
	ОбъемОстаткиПМ = ОстаткиНаСГП(ДатаФормирования+24*60*60,СтруктураСклады().СкладГотовойПродукции,Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"));
	ОбъемОстаткиПеллеты = ОстаткиНаСГП(ДатаФормирования+24*60*60,СтруктураСклады().ДГСГП,Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018")); //ОстаткиНаСГПСТАРЫЙ(ДатаФормирования+24*60*60,СкладыОстатковПеллет,Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018"));
	//\\ 
	
	//проверка 
	Если ОбъемОстаткиПМ.Количество() = 0 Тогда 
		ОбъемОстаткиПМФакт = 0;
	Иначе
		ОбъемОстаткиПМФакт = ОбъемОстаткиПМ[0].Остатки;
	КонецЕсли;
	
	Если ОбъемОстаткиПеллеты.Количество() = 0 Тогда 
		ОбъемОстаткиПеллетыФакт = 0;
	Иначе
		ОбъемОстаткиПеллетыФакт = ОбъемОстаткиПеллеты[0].Остатки;
	КонецЕсли;
	//\\
	
	//план 
	Если  ОбъемПлановыеПоказатели.Количество() = 0 Тогда 
		ОбъемОстаткиПМПлан = 0;
	Иначе
		ОбъемОстаткиПМПлан = ОбъемПлановыеПоказатели[0].ОстатокиСГППМ;
	КонецЕсли;

	ОбъемОстаткиПеллетыПлан = УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования,"000000073");
	
	Если  ОбъемОстаткиПеллетыПлан.Количество() = 0 Тогда 
		ОбъемОстаткиПеллетыПлан = 0;
	Иначе
		ОбъемОстаткиПеллетыПлан = ОбъемОстаткиПеллетыПлан[0].Значение;
	КонецЕсли;
	//\\ 
	
	//факт+план
	ОстаткиШпон = ОстаткиНаСГПШпон(ДатаФормирования,СтруктураПороды().Лиственница,СтруктураСклады().СкладГотовойПродукции);    
		
	//проверка 
	Если ОстаткиШпон.Количество() = 0 Тогда 
		ОбъемОстаткиШпонФакт = 0; 
		ОбъемОстаткиШпонПланПроцент = 0;
	Иначе
		ОбъемОстаткиШпонФакт = ОстаткиШпон[0].ОбъемФакт; 
		ОбъемОстаткиШпонПланПроцент = ОстаткиШпон[0].ПроцентПлана;
	КонецЕсли;
	//\\ 
	//\\
	
	//заполняем параметры
	ОстаткиТД.Параметры.ОбъемОстаткиШпон = ОбъемОстаткиШпонФакт;
	ОстаткиТД.Параметры.ОбъемОстаткиПМ = Окр(ОбъемОстаткиПМФакт/1000,1);
	ОстаткиТД.Параметры.ОбъемОстаткиПеллеты = Окр(ОбъемОстаткиПеллетыФакт/1000,1); 
	
	ОстаткиТД.Параметры.ПроцентОстаткиШпон = ОбъемОстаткиШпонПланПроцент; 
	
	Если ОбъемОстаткиПМПлан = 0 ИЛИ ОбъемОстаткиПМПлан = NULL Тогда
		ОстаткиТД.Параметры.ПроцентОстаткиПМ = 0;
	Иначе
		ОстаткиТД.Параметры.ПроцентОстаткиПМ = Окр(ОбъемОстаткиПМФакт/ОбъемОстаткиПМПлан*100);
	КонецЕсли; 
	
	Если ОбъемОстаткиПеллетыПлан = 0 ИЛИ ОбъемОстаткиПеллетыПлан = NULL  Тогда 
		ОстаткиТД.Параметры.ПроцентОстаткиПеллеты = 0;
	Иначе 
		ОстаткиТД.Параметры.ПроцентОстаткиПеллеты = Окр(ОбъемОстаткиПеллетыФакт / ОбъемОстаткиПеллетыПлан *100);
	КонецЕсли; 
	//\\
	
	//назначение цвета
	Если ОстаткиТД.Параметры.ПроцентОстаткиШпон <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОстаткиШпон"); 
	Иначе 
		МассивОбластейКрасный.Добавить("ПроцентОстаткиШпон");
	КонецЕсли;  
	
	Если ОстаткиТД.Параметры.ПроцентОстаткиПМ <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОстаткиПМ");
	Иначе  
		МассивОбластейКрасный.Добавить("ПроцентОстаткиПМ");
	КонецЕсли;
	
	Если ОстаткиТД.Параметры.ПроцентОстаткиПеллеты <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОстаткиПеллеты");
	Иначе   
		МассивОбластейКрасный.Добавить("ПроцентОстаткиПеллеты");
	КонецЕсли;  
	
	#Если НаКлиенте И НаСервере тогда
	ТД = новый ТабличныйДокумент; 
	#КонецЕсли
	ТД.АвтоМасштаб = Ложь;
	ТД.ШиринаСтраницы = 1000;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТД.ТолькоПросмотр = Истина;
	
	ТД.Вывести(ОстаткиТД);
	//\\  
	
	ИзменениеЦветаЯчеекНаЗеленый(МассивОбластейЗеленый,НазначитьЦвет().Зеленый); 
	ИзменениеЦветаЯчеекНаЗеленый(МассивОбластейКрасный,НазначитьЦвет().Красный); 
			
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СформироватьДайджест()
		
	СформироватьДайджестНаСервереПоОперСводке();	
		
КонецПроцедуры 


//////////////////////////////////////////////Область служебных функций и процедур//////////////////////////////////////////////////////
#Область СлужебныеФункцииИПроцедуры 

&НаСервереБезКонтекста
Функция СтруктураСклады()
	
	Склады = Новый Структура;
	
	Склады.Вставить("УчастокСортирЛМЦЛП", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000001")); 
	Склады.Вставить("СкладГотовойПродукции", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ОсновнойСклад"));
	Склады.Вставить("ДГСГП", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000044")); 
	Склады.Вставить("БуферныйСкладЦЛП", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000003"));
    Склады.Вставить("УчастокМЛП", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000060"));
	Склады.Вставить("Склад1", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000049"));
	Склады.Вставить("Склад2", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000050"));
	Склады.Вставить("Склад3", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000051"));
	Склады.Вставить("Склад4", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000052"));
	Склады.Вставить("Склад5", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000053"));
	Склады.Вставить("БуферныйСкладМПС", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000092"));
	//Склады.Вставить("ДГСырье", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-ПБ-000046")); 
	//Склады.Вставить("ДГБрак", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000054"));


	Возврат Склады;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураПороды()
	
	Породы = Новый Структура;
	
	Породы.Вставить("Лиственница", Справочники.Породы.НайтиПоКоду("000000004"));
	Породы.Вставить("Ель", Справочники.Породы.НайтиПоКоду("000000001"));
	
	Возврат Породы;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураКатегорииНоменклатуры()
	
	Категории = Новый Структура;
	
	Категории.Вставить("ОтходыПилмат",ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.ОтходыПилмат")); 
	Категории.Вставить("Пиломатериал",ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиломатериал"));
	Категории.Вставить("ПиломатериалСП",ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.ПиломатериалСП")); 
	Категории.Вставить("ПобочнаяПродукция", Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000006"));	
	
	Возврат Категории;
	
КонецФункции

&НаСервереБезКонтекста
Функция НазначитьЦвет()
	
	Цвета = Новый Структура;
	
	Цвета.Вставить("Красный", Новый Цвет(255, 0, 0));
	Цвета.Вставить("Зеленый", Новый Цвет(0, 176, 79));
	
	Возврат Цвета;
	
КонецФункции

&НаСервере
Процедура ИзменениеЦветаЯчеекНаЗеленый(Области,Цвет)
	
	Для Каждого обл ИЗ Области Цикл  
		ТД.Область(обл).ЦветТекста = Цвет;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДайджестНаСервереПоОперСводке() 
	
	ТД = ""; 
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("Макет2");  
	
	//какой сегодня день, сколько всего дней в месяце, и какой день по счету сейчас
	ДатаФормирования = ТекущаяДата(); //данные формируются на эту дату
	ВсегоДнейВМесяце = День(КонецМесяца(ДатаФормирования));
	СегодняДеньПоСчету = День(ДатаФормирования);
	//\\ 
	
	//МАССИВ ОБЛАСТЕЙ ДЛЯ ПЕРЕКРАСКИ В ЗЕЛЕНЫЙ
	МассивОбластейЗеленый = Новый Массив;  
	МассивОбластейКрасный = Новый Массив;
	//\\
	
	#Область ШапкаТаблицы 
	
	ШапкаТЧТД = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	ШапкаТЧТД.Параметры.ДатаФормирования = Формат(ДатаФормирования,"ДФ=dd.MM.yyyy");
	ТД.Вывести(ШапкаТЧТД);
	
	#КонецОбласти
	
	#Область ПроизводствоУпаковка
	
	ПроизводствоУпаковкаТД = Макет.ПолучитьОбласть("ПроизводствоУпаковка"); 
	
	//Получаем параметры 
	ПроизводствоШпон = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000754")[0]; 
	
	МассивКодовПоказателей = Новый Массив;
	МассивКодовПоказателей.Добавить("000000921"); //товар ЦЛП
	МассивКодовПоказателей.Добавить("000000923"); //товар УПП
	
	ПроизводствоПМЦЛП = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,МассивКодовПоказателей)[0];
	
	МассивКодовПоказателей = Новый Массив;
	МассивКодовПоказателей.Добавить("000000926"); //ЦЛП Ель ламина (сухой)
	МассивКодовПоказателей.Добавить("000000936"); //ЦЛП Лц ламина (сухой) 
	МассивКодовПоказателей.Добавить("000000946"); //ЦЛП Ель ламина (сырой)
	МассивКодовПоказателей.Добавить("000000957"); //ЦЛП Лц ламина (сырой) 
	
	МассивКодовПоказателей.Добавить("000001016"); //УПП Ель ламина (сухой)
	МассивКодовПоказателей.Добавить("000001023"); //УПП Лц ламина (сухой) 
	МассивКодовПоказателей.Добавить("000000997"); //УПП Ель ламина (сырой)
	МассивКодовПоказателей.Добавить("000001004"); //УПП Лц ламина (сырой)
	
	ПроизводствоПМЛамина = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,МассивКодовПоказателей)[0];  
	ПроизводствоПММЛП = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000919")[0];  
	УпаковкаПеллеты = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000501")[0];
	//\\
	
	//Устанавливаем параметры
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоШпон =     ПроизводствоШпон.Факт;
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПМЦЛП =    ПроизводствоПМЦЛП.Факт; 
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПМЛамина = ПроизводствоПМЛамина.Факт;
	ПроизводствоУпаковкаТД.Параметры.ОбъемПроизводствоПММЛП =    ПроизводствоПММЛП.Факт;
	ПроизводствоУпаковкаТД.Параметры.ОбъемУпаковкаПеллеты =      УпаковкаПеллеты.Факт;
	
	ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоШпон =     ПроизводствоШпон.Процент; 
	ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП =    ПроизводствоПМЦЛП.Процент;
	ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина = ПроизводствоПМЛамина.Процент;
	ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП =    ПроизводствоПММЛП.Процент;
	ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты =      УпаковкаПеллеты.Процент;
	//\\
	
	//Назначаем цвет
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоШпон >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоШпон"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоШпон");
	КонецЕсли;  
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЦЛП >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоПМЦЛП");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоПМЦЛП");
	КонецЕсли;
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПМЛамина >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоПМЛамина");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоПМЛамина");
	КонецЕсли;  
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентПроизводствоПММЛП >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПроизводствоПММЛП");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПроизводствоПММЛП");
	КонецЕсли;
	
	Если ПроизводствоУпаковкаТД.Параметры.ПроцентУпаковкаПеллеты >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентУпаковкаПеллеты"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентУпаковкаПеллеты");
	КонецЕсли;
	//\\  
	
	ТД.Вывести(ПроизводствоУпаковкаТД);
	
	#КонецОбласти
	
	#Область ПоставкаСырья    
	
	ПоставкаСырьяТД = Макет.ПолучитьОбласть("ПоставкаСырья");
	
	//Получаем параметры
	ПоставкаСырьяЛц = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000618")[0]; 
	
	МассивКодовПоказателей = Новый Массив;
	МассивКодовПоказателей.Добавить("000000615"); //поступило Ель
	МассивКодовПоказателей.Добавить("000000619"); //поступило Пихта
	
	ПоставкаСырьяЕль = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,МассивКодовПоказателей)[0];
	ПоставкаСырьяВсего = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000614")[0];
	//\\
	
	//Устанавливаем параметры   
	ПоставкаСырьяТД.Параметры.ОбъемПоставкаСырьяЛц =    ПоставкаСырьяЛц.Факт; 
	ПоставкаСырьяТД.Параметры.ОбъемПоставкаСырьяЕль =   ПоставкаСырьяЕль.Факт;
	ПоставкаСырьяТД.Параметры.ОбъемПоставкаСырьяВсего = ПоставкаСырьяВсего.Факт;  
	
	ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЛц =    ПоставкаСырьяЛц.Процент; 
	ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЕль =   ПоставкаСырьяЕль.Процент;
	ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяВсего = ПоставкаСырьяВсего.Процент;
	//\\ 
	
	//Назначаем цвет
	Если ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЛц >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПоставкаСырьяЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПоставкаСырьяЛц");
	КонецЕсли;  
	
	Если ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяЕль >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПоставкаСырьяЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПоставкаСырьяЕль");
	КонецЕсли;
	
	Если ПоставкаСырьяТД.Параметры.ПроцентПоставкаСырьяВсего >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПоставкаСырьяВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПоставкаСырьяВсего");
	КонецЕсли;      
	//\\
	
	ТД.Вывести(ПоставкаСырьяТД); 
	
	#КонецОбласти
	
	#Область ПриемкаСырья
	
	ПриемкаСырьяТД = Макет.ПолучитьОбласть("ПриемкаСырья");  
	
	//Получаем параметры 
	//Факт
	МассивКодовПоказателей = Новый Массив;
	МассивКодовПоказателей.Добавить("000000624"); //сортировка ЛЦ правил. длин.
	МассивКодовПоказателей.Добавить("000000629"); //сортировка ЛЦ неправил. длин.

	ПриемкаСырьяЛц = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,МассивКодовПоказателей)[0].Факт; 
	
	МассивКодовПоказателей = Новый Массив;
	МассивКодовПоказателей.Добавить("000000622"); //сортировка Ель правил. длин.
	МассивКодовПоказателей.Добавить("000000627"); //сортировка Ель неправил. длин.

	МассивКодовПоказателей.Добавить("000000626"); //сортировка Пихта правил. длин.
	МассивКодовПоказателей.Добавить("000000630"); //сортировка Пихта неправил. длин.
	
	ПриемкаСырьяЕль = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,МассивКодовПоказателей)[0].Факт;  
	
	ПриемкаСырьяВсего = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000620")[0].Факт;
	//\\
	
	//План 
	ПриемкаСырьяЛцПлан = ВернутьПлановыеЗначенияПоказателейПоОперСводки(ДатаФормирования,"000000436");
	ПриемкаСырьяЕльПлан = ВернутьПлановыеЗначенияПоказателейПоОперСводки(ДатаФормирования,"000000435");
	ПриемкаСырьяВсегоПлан = ПриемкаСырьяЕльПлан + ПриемкаСырьяЛцПлан;
	//\\
	//\\
		
	//Устанавливаем параметры   
	ПриемкаСырьяТД.Параметры.ПриемкаЛц =    ПриемкаСырьяЛц; 
	ПриемкаСырьяТД.Параметры.ПриемкаЕль =   ПриемкаСырьяЕль;
	ПриемкаСырьяТД.Параметры.ПриемкаВсего = ПриемкаСырьяВсего; 
	
	ПриемкаСырьяТД.Параметры.ПроцентПриемкаЛц =    ?(ПриемкаСырьяЛцПлан = 0,0,ОКР(ПриемкаСырьяЛц/ПриемкаСырьяЛцПлан*100)); 
	ПриемкаСырьяТД.Параметры.ПроцентПриемкаЕль =   ?(ПриемкаСырьяЕльПлан = 0,0,ОКР(ПриемкаСырьяЕль/ПриемкаСырьяЕльПлан*100));
	ПриемкаСырьяТД.Параметры.ПроцентПриемкаВсего = ?(ПриемкаСырьяВсегоПлан = 0,0,ОКР(ПриемкаСырьяВсего/ПриемкаСырьяВсегоПлан*100));
	//\\
	
	//Назначаем цвет
	Если ПриемкаСырьяТД.Параметры.ПроцентПриемкаЛц >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПриемкаЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПриемкаЛц");
	КонецЕсли;  
	
	Если ПриемкаСырьяТД.Параметры.ПроцентПриемкаЕль >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПриемкаЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПриемкаЕль");
	КонецЕсли;
	
	Если ПриемкаСырьяТД.Параметры.ПроцентПриемкаВсего >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентПриемкаВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентПриемкаВсего");
	КонецЕсли; 
	//\\

	ТД.Вывести(ПриемкаСырьяТД);
	
	#КонецОбласти
	
	#Область ЗапасыСырьяПравилДлинномеры
	
	ЗапасыСырьяТД = Макет.ПолучитьОбласть("ЗапасыСырья");  
	
	//Получаем параметры
	//Факт
	ЗапасыСырьяЛц = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000635",Истина)[0].Факт;  
	
	МассивКодовПоказателей = Новый Массив;
	МассивКодовПоказателей.Добавить("000000633"); //ост Ель правил. длин.
	МассивКодовПоказателей.Добавить("000000637"); //ост Пихта правил. длин.
	
	ЗапасыСырьяЕль = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,МассивКодовПоказателей,Истина)[0].Факт;  
	ЗапасыСырьяВсего = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000632",Истина)[0].Факт; 
	//\\
	
	//План 
	ЗапасыСырьяЛцПлан = ВернутьПлановыеЗначенияПоказателейПоОперСводки(ДатаФормирования,"000000070");
	ЗапасыСырьяЕльПлан = ВернутьПлановыеЗначенияПоказателейПоОперСводки(ДатаФормирования,"000000069");
	ЗапасыСырьяВсегоПлан = ЗапасыСырьяЕльПлан + ЗапасыСырьяЛцПлан;
	//\\
	//\\
		
	//Устанавливаем параметры   
	ЗапасыСырьяТД.Параметры.ЗапасыСырьяЛц =    ЗапасыСырьяЛц; 
	ЗапасыСырьяТД.Параметры.ЗапасыСырьяЕль =   ЗапасыСырьяЕль;
	ЗапасыСырьяТД.Параметры.ЗапасыСырьяВсего = ЗапасыСырьяВсего;
	
	ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЛц =    ?(ЗапасыСырьяЛцПлан = 0,0,ОКР(ЗапасыСырьяЛц/ЗапасыСырьяЛцПлан*100)); 
	ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЕль =   ?(ЗапасыСырьяЕльПлан = 0,0,ОКР(ЗапасыСырьяЕль/ЗапасыСырьяЕльПлан*100));
	ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяВсего = ?(ЗапасыСырьяВсегоПлан = 0,0,ОКР(ЗапасыСырьяВсего/ЗапасыСырьяВсегоПлан*100));
	//\\
	
	//Назначаем цвет
	Если ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЛц <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентЗапасыСырьяЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентЗапасыСырьяЛц");
	КонецЕсли;  
	
	Если ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяЕль <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентЗапасыСырьяЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентЗапасыСырьяЕль");
	КонецЕсли;
	
	Если ЗапасыСырьяТД.Параметры.ПроцентЗапасыСырьяВсего <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентЗапасыСырьяВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентЗапасыСырьяВсего");
	КонецЕсли; 
	//\\
	
	ТД.Вывести(ЗапасыСырьяТД);
	
	#КонецОбласти
	
	#Область ЗапасыСырьяНеправилДлинномерыРеализацияПеллет 
	
	НеликвидТД = Макет.ПолучитьОбласть("Неликвид");  
	
	//Получаем параметры
	НеликвидЛц = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000640",Истина)[0];  
	
	МассивКодовПоказателей = Новый Массив;
	МассивКодовПоказателей.Добавить("000000639"); //ост Ель неправил. длин.
	МассивКодовПоказателей.Добавить("000000641"); //ост Пихта неправил. длин.
	
	НеликвидЕль = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,МассивКодовПоказателей,Истина)[0]; 
	
	НеликвидВсего = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000638",Истина)[0];  
	
	РеализацияПеллетыФакт = ОКР(РеализацияПеллеты(ДатаФормирования)[0].Объем/1000,1);  
	РеализацияПеллетПлан = УстановкаПлановыхПоказателейРеализацияОстаткиПеллет(ДатаФормирования,"000000071");
	//\\
		
	//Устанавливаем параметры   
	НеликвидТД.Параметры.НеликвидЛц =             НеликвидЛц.Факт; 
	НеликвидТД.Параметры.НеликвидЕль =            НеликвидЕль.Факт;
	НеликвидТД.Параметры.НеликвидВсего =          НеликвидВсего.Факт;
	НеликвидТД.Параметры.ОбъемРеализацияПеллеты = РеализацияПеллетыФакт;
	
	НеликвидТД.Параметры.ПроцентНеликвидЛц =             НеликвидЛц.Процент; 
	НеликвидТД.Параметры.ПроцентНеликвидЕль =            НеликвидЕль.Процент;
	НеликвидТД.Параметры.ПроцентНеликвидВсего =          НеликвидВсего.Процент;
	
	НеликвидТД.Параметры.ПроцентРеализацияПеллеты = ?(РеализацияПеллетПлан = 0,0,Окр(РеализацияПеллетыФакт/ОКР((РеализацияПеллетПлан/ВсегоДнейВМесяце*СегодняДеньПоСчету)/1000,1)*100));
	//\\
	
	//Назначаем цвет
	Если НеликвидТД.Параметры.ПроцентНеликвидЛц <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентНеликвидЛц"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентНеликвидЛц");
	КонецЕсли;  
	
	Если НеликвидТД.Параметры.ПроцентНеликвидЕль <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентНеликвидЕль");  
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентНеликвидЕль");
	КонецЕсли;
	
	Если НеликвидТД.Параметры.ПроцентНеликвидВсего <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентНеликвидВсего");
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентНеликвидВсего");
	КонецЕсли;
	
	Если НеликвидТД.Параметры.ПроцентРеализацияПеллеты >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентРеализацияПеллеты"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентРеализацияПеллеты");
	КонецЕсли;
	//\\
	
	ТД.Вывести(НеликвидТД); 
	
	#КонецОбласти

	#Область Отгрузка 
	
	ОтгрузкаРеализацияТД = Макет.ПолучитьОбласть("ОтгрузкаРеализация"); 
	
	//Получаем параметры 
	ОтгрузкаПМ = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000857")[0];
	ОтгрузкаПеллеты = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000529")[0];
	ОтгрузкаШпон = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000806")[0];
	//\\
			
	//Устанавливаем параметры
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаШпон =    ОтгрузкаШпон.Факт;
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаПМ =      ОтгрузкаПМ.Факт;
	ОтгрузкаРеализацияТД.Параметры.ОбъемОтгрузкаПеллеты = ОтгрузкаПеллеты.Факт; 
	
	ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаШпон =    ОтгрузкаШпон.Процент;
	ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ =      ОтгрузкаПМ.Процент;
	ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты = ОтгрузкаПеллеты.Процент; 
	//\\
	
	//Назначаем цвет
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаШпон >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОтгрузкаШпон"); 
	Иначе   
		МассивОбластейКрасный.Добавить("ПроцентОтгрузкаШпон");
	КонецЕсли;  
	
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПМ >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОтгрузкаПМ"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентОтгрузкаПМ");
	КонецЕсли;
	
	Если ОтгрузкаРеализацияТД.Параметры.ПроцентОтгрузкаПеллеты >= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОтгрузкаПеллеты"); 
	Иначе
		МассивОбластейКрасный.Добавить("ПроцентОтгрузкаПеллеты");
	КонецЕсли;
	//\\
	
	ТД.Вывести(ОтгрузкаРеализацияТД); 
	
	#КонецОбласти
	
	#Область ОстаткиНаСГП   
	
	ОстаткиТД = Макет.ПолучитьОбласть("Остатки"); 
		
	//Получаем параметры 
	//Факт
	ОстаткиПМ = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000876",Истина)[0];
	ОстаткиПеллеты = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000530",Истина)[0].Факт; 
	ОстаткиШпон = ВернутьЗначениеПоказателейПоОперСводки(ДатаФормирования,"000000823",Истина)[0];  
	//\\
	
	//План
	ОстаткиПеллетыПлан = ОКР(УстановкаПлановыхПоказателейРеализацияОстаткиПеллет(ДатаФормирования,"000000073")/1000,1);
	//\\
	//\\
	
	//Устанавливаем параметры
	ОстаткиТД.Параметры.ОбъемОстаткиШпон =    ОстаткиШпон.Факт;
	ОстаткиТД.Параметры.ОбъемОстаткиПМ =      ОстаткиПМ.Факт;
	ОстаткиТД.Параметры.ОбъемОстаткиПеллеты = ОстаткиПеллеты; 
	
	ОстаткиТД.Параметры.ПроцентОстаткиШпон =    ОстаткиШпон.Процент; 
	ОстаткиТД.Параметры.ПроцентОстаткиПМ =      ОстаткиПМ.Процент;
	ОстаткиТД.Параметры.ПроцентОстаткиПеллеты = ?(ОстаткиПеллетыПлан = 0,0,ОКР(ОстаткиПеллеты/ОстаткиПеллетыПлан*100)); 
	//\\
	
	//Назначаем цвет
	Если ОстаткиТД.Параметры.ПроцентОстаткиШпон <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОстаткиШпон"); 
	Иначе 
		МассивОбластейКрасный.Добавить("ПроцентОстаткиШпон");
	КонецЕсли;  
	
	Если ОстаткиТД.Параметры.ПроцентОстаткиПМ <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОстаткиПМ");
	Иначе  
		МассивОбластейКрасный.Добавить("ПроцентОстаткиПМ");
	КонецЕсли;
	
	Если ОстаткиТД.Параметры.ПроцентОстаткиПеллеты <= 100 Тогда 
		МассивОбластейЗеленый.Добавить("ПроцентОстаткиПеллеты");
	Иначе   
		МассивОбластейКрасный.Добавить("ПроцентОстаткиПеллеты");
	КонецЕсли; 
	//\\
	
	#Если НаКлиенте И НаСервере тогда
	ТД = Новый ТабличныйДокумент; 
	#КонецЕсли
	ТД.АвтоМасштаб = Ложь;
	ТД.ШиринаСтраницы = 1000;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТД.ТолькоПросмотр = Истина;
	
	ТД.Вывести(ОстаткиТД);
	
	#КонецОбласти
	
	ИзменениеЦветаЯчеекНаЗеленый(МассивОбластейЗеленый,НазначитьЦвет().Зеленый); 
	ИзменениеЦветаЯчеекНаЗеленый(МассивОбластейКрасный,НазначитьЦвет().Красный); 
			
КонецПроцедуры

#КонецОбласти 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////Область формирования данных для макета////////////////////////////////////////////////////////////
#Область Данные 

&НаСервереБезКонтекста
Функция ВернутьЗначениеПоказателейПоОперСводки(Период,КодПоказателя,Остатки=Ложь) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ОКР(ФактПлан.Факт / 1000, 1), 0) КАК Факт,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ФактПлан.План, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(ЕСТЬNULL(ФактПлан.Факт, 0) / ФактПлан.План * 100)
		|	КОНЕЦ КАК Процент
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА алк_ЗначенияПоказателейДляОтчетов.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.алк_ВидЗначенияПоказателяОтчетов.Факт)
		|					ТОГДА алк_ЗначенияПоказателейДляОтчетов.ЗначениеСутки
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК Факт,
		|		СУММА(ВЫБОР
		|				КОГДА алк_ЗначенияПоказателейДляОтчетов.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.алк_ВидЗначенияПоказателяОтчетов.План)
		|					ТОГДА алк_ЗначенияПоказателейДляОтчетов.ЗначениеСутки
		|				ИНАЧЕ 0
		|			КОНЕЦ) КАК План
		|	ИЗ
		|		РегистрСведений.алк_ЗначенияПоказателейДляОтчетов КАК алк_ЗначенияПоказателейДляОтчетов
		|	ГДЕ
		|		алк_ЗначенияПоказателейДляОтчетов.ОперацияПроизводства В
		|				(ВЫБРАТЬ
		|					алк_ПоказателиОтчетов.ОперацияПроизводства КАК ОперацияПроизводства
		|				ИЗ
		|					Справочник.алк_ПоказателиОтчетов КАК алк_ПоказателиОтчетов
		|				ГДЕ
		|					алк_ПоказателиОтчетов.Код В (&КодПоказателя))
		|		И алк_ЗначенияПоказателейДляОтчетов.Период МЕЖДУ &НачалоПериода И НАЧАЛОПЕРИОДА(&Сегодня, ДЕНЬ)) КАК ФактПлан";
	
	Запрос.УстановитьПараметр("КодПоказателя", КодПоказателя); 
	Запрос.УстановитьПараметр("Сегодня", Период);
	Запрос.УстановитьПараметр("НачалоПериода", ?(Остатки,НачалоДня(Период),НачалоМесяца(Период)));

	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ТЗ = Новый ТаблицаЗначений;
		
		ТЗ.Колонки.Добавить("Факт");
		ТЗ.Колонки.Добавить("Процент");
		
		Стр = ТЗ.Добавить(); 
		Стр.Факт = 0;
		Стр.Процент = 0;
		
		Возврат Стр;   
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();   
	
	//от 20250911 заявка №23078 
	//Для более точного формирования дайджеста, который отображается на мониторе в холле АБК, прошу подцепить данные с оперативных сводок:
	//	- произ-во шпон –оперсводка по шпону, строка сдано на СГП;                                                     
	//	- произ-во  ЦЛП – оперсводка пилмат, строка производство  товарное пилмат + УПП
	//	- в т ч ламина -  строка всего ламина;
	//	- МЛП -  строка произ-во валовое;
	//	- поставка сырья – оперсводка УПСС , поступило сырья;
	//	- приемка сырья -  строка сортировка сырья;
	//	- запасы сырья -  строка остатки сырья на складе, правильные длинномеры ( % берем от 15000 м3 по породам);
	//	- неликвидные - строка остатки сырья на складе, неправильные длинномеры;
	//	- отгрузка шпон -  оперсводка СГП, строка отгрузка с СГП;
	//	- остатки на СГП шпон -  строка конечные остатки;
	//	- отгрузка пилмат-  отгружено всего пиломатериалов;
	//	- остатки на СГП пилмат – строка конечные остатки на СГП;
	//	- ДГ упаковка -  оперсводка ДГ, строка упаковано всего;
	//	- реализация -  1с  , отчет сводны реестр инвойсов;
	//	-  отгрузка -  строка отгружено;
	//	-  остатки на СГП – строка остатки ДГ  на СГП (% от 2000 м3).
	
КонецФункции

//Для ЗапасовСырья/ПриемкиОтдельныйПлан
&НаСервереБезКонтекста
Функция ВернутьПлановыеЗначенияПоказателейПоОперСводки(Период,КодПоказателя) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОКР(ЕСТЬNULL(СУММА(алк_ПлановыеПоказателиПроизводства.Значение), 0) / 1000) КАК План
		|ИЗ
		|	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
		|ГДЕ
		|	алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ &НачалоПериода И НАЧАЛОПЕРИОДА(&Сегодня, ДЕНЬ)
		|	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
		|	И алк_ПлановыеПоказателиПроизводства.Показатель.Код = &КодПоказателя";
	
	Запрос.УстановитьПараметр("КодПоказателя", КодПоказателя); 
	Запрос.УстановитьПараметр("Сегодня", Период);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));

	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ТЗ = Новый ТаблицаЗначений;
		
		ТЗ.Колонки.Добавить("План");
		
		Стр = ТЗ.Добавить(); 
		Стр.План = 0;
		
		Возврат Стр;   
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].План;   
	
КонецФункции

//остатки + реализация пеллет  
&НаСервереБезКонтекста
Функция УстановкаПлановыхПоказателейРеализацияОстаткиПеллет(ДатаФормирования,КодПоказателя) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(алк_ПлановыеПоказателиПроизводстваСрезПоследних.Значение, 0) КАК План
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства.СрезПоследних(&Дата, Показатель.Код = &КодПоказателя) КАК алк_ПлановыеПоказателиПроизводстваСрезПоследних
	               |ГДЕ
	               |	НЕ алк_ПлановыеПоказателиПроизводстваСрезПоследних.ЭтоБюджет"; 
	
	Запрос.УстановитьПараметр("Дата",ДатаФормирования);
	Запрос.УстановитьПараметр("КодПоказателя", КодПоказателя);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ТЗ = Новый ТаблицаЗначений;
		
		ТЗ.Колонки.Добавить("План");
		
		Стр = ТЗ.Добавить(); 
		Стр.План = 0;
		
		Возврат Стр;   
		
	КонецЕсли; 
		
	Возврат РезультатЗапроса.Выгрузить()[0].План; 
	
	//"000000071" реализация пеллет
	//"000000073" остатки пеллет на СГП
 
КонецФункции 

//факт реализации
&НаСервереБезКонтекста
Функция РеализацияПеллеты(ДатаФормирования) 
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.ВесНетто, 0)) КАК ВесНетто
	               |ПОМЕСТИТЬ НаПрямуюБезПорта
	               |ИЗ
	               |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	               |ГДЕ
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Проведен
	               |	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД
	               |	И (алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	               |			ИЛИ НЕ алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель.алк_УчетТоваровВПорту)
	               |	И НЕ алк_ТранспортировкаЗапасовЗапасы.Ссылка.ПриемкаВПорту
	               |	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура.Код = ""ПБ-00000018""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ТранспортировочныеПартииЗапасы.ВесНеттоФакт, 0)) КАК ВесНеттоФакт
	               |ПОМЕСТИТЬ Партии
	               |ИЗ
	               |	Документ.алк_ТранспортировочныеПартии.Запасы КАК алк_ТранспортировочныеПартииЗапасы
	               |ГДЕ
	               |	алк_ТранспортировочныеПартииЗапасы.Ссылка.Проведен
	               |	И алк_ТранспортировочныеПартииЗапасы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И алк_ТранспортировочныеПартииЗапасы.Ссылка.ВыгружатьВ_ТД
	               |	И алк_ТранспортировочныеПартииЗапасы.Номенклатура.Код = ""ПБ-00000018""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(алк_ПогрузкаСудовыхПартийЗапасы.ВесНетто) КАК ВесНетто
	               |ПОМЕСТИТЬ ПогрузкаСудовыхПартий
	               |ИЗ
	               |	Документ.алк_ПогрузкаСудовыхПартий.Запасы КАК алк_ПогрузкаСудовыхПартийЗапасы
	               |ГДЕ
	               |	алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Проведен
	               |	И алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.Организация = &Организация
	               |	И алк_ПогрузкаСудовыхПартийЗапасы.Ссылка.ДокументОснование = ЗНАЧЕНИЕ(Документ.алк_ТранспортировочныеПартии.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(НаПрямуюБезПорта.ВесНетто, 0) + ЕСТЬNULL(Партии.ВесНеттоФакт, 0) + ЕСТЬNULL(ПогрузкаСудовыхПартий.ВесНетто, 0)) КАК Объем
	               |ИЗ
	               |	НаПрямуюБезПорта КАК НаПрямуюБезПорта,
	               |	Партии КАК Партии,
	               |	ПогрузкаСудовыхПартий КАК ПогрузкаСудовыхПартий"; 
	
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(ДатаФормирования)); 
	Запрос.УстановитьПараметр("Дата2",  ДатаФормирования); 
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.НайтиПоКоду("ПБ-000002"));   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат 0;
	КонецЕсли;
		
	Возврат РезультатЗапроса.Выгрузить();  
	
КонецФункции

#Область СтароеПолучениеДанных 

&НаСервереБезКонтекста 
Функция ТекстПроизводствоЦЛПМЛП() 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПроизводствоОборотОбороты.КоличествоОборот, 0)) КАК ОбъемПроизведенного
	               |ИЗ
	               |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	               |			ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, 8),
	               |			&КонецПериода,
	               |			,
	               |			ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	               |				И Номенклатура.КатегорияНоменклатуры В (&МассивКатегорийНоменклатуры)
	               |				И Склад В (&Склад)
	               |				И Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Распил), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Списание))) КАК алк_ПроизводствоОборотОбороты";
	
	Возврат Запрос.Текст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаОстаткиНаСГП()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0)) КАК Остатки
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			&КонецПериода,
	               |			СтруктурнаяЕдиница В (&СтруктурнаяЕдиница)
	               |				И Номенклатура = &Номенклатура) КАК алк_ОстаткиЗапасовОстатки";
	
	Возврат Запрос.Текст;
	
КонецФункции   

&НаСервереБезКонтекста
Функция ТекстЗапросаПоОстаткамЗапасов() 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПроизводствоОборотОбороты.КоличествоОборот, 0)) КАК КоличествоПриход
	               |ПОМЕСТИТЬ ПоставкаСырья
	               |ИЗ
	               |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	               |			ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, 8),
	               |			&КонецПериода,
	               |			,
	               |			Склад = &СтруктурнаяЕдиница
	               |				И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Приемка)) КАК алк_ПроизводствоОборотОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО алк_ПроизводствоОборотОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	               |ГДЕ
	               |	(&КодПороды = ""000000001""
	               |				И алк_ПараметрыХарактеристик.Порода.Код = ""000000003""
	               |			ИЛИ алк_ПараметрыХарактеристик.Порода.Код = &КодПороды)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0)) КАК ВсегоОбъем
	               |ПОМЕСТИТЬ ЗапасыСырья
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			&КонецПериода,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Штабель <> ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	               |ГДЕ
	               |	(&КодПороды = ""000000001""
	               |				И алк_ПараметрыХарактеристик.Порода.Код = ""000000003""
	               |			ИЛИ алк_ПараметрыХарактеристик.Порода.Код = &КодПороды)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ОстаткиОснШтабель
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			&КонецПериода,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Штабель.Код = ""000000001"") КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	               |ГДЕ
	               |	(&КодПороды = ""000000001""
	               |				И алк_ПараметрыХарактеристик.Порода.Код = ""000000003""
	               |			ИЛИ алк_ПараметрыХарактеристик.Порода.Код = &КодПороды)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0)) КАК ОстаткиНесортированногоНаНачалоМес
	               |ПОМЕСТИТЬ ВТ_НесортированноеНачалоМесяца
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиНесортированного.Остатки(
	               |			ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, 8),
	               |			&КодПороды = ""000000001""
	               |					И Порода.Код = ""000000003""
	               |				ИЛИ Порода.Код = &КодПороды) КАК алк_ОстаткиНесортированногоОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0)) КАК ОстаткиНесортированногоНаТекМомент
	               |ПОМЕСТИТЬ ВТ_НесортированноеТекМомент
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиНесортированного.Остатки(
	               |			&КонецПериода,
	               |			&КодПороды = ""000000001""
	               |					И Порода.Код = ""000000003""
	               |				ИЛИ Порода.Код = &КодПороды) КАК алк_ОстаткиНесортированногоОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ОстаткиОснШтабель.КоличествоОстаток, 0) КАК ОснШтабельОбъем,
	               |	ЕСТЬNULL(ЗапасыСырья.ВсегоОбъем, 0) + ЕСТЬNULL(ВТ_НесортированноеТекМомент.ОстаткиНесортированногоНаТекМомент, 0) КАК ВсегоОбъем,
	               |	ЕСТЬNULL(ПоставкаСырья.КоличествоПриход, 0) + ЕСТЬNULL(ВТ_НесортированноеТекМомент.ОстаткиНесортированногоНаТекМомент, 0) - ЕСТЬNULL(ВТ_НесортированноеНачалоМесяца.ОстаткиНесортированногоНаНачалоМес, 0) КАК ПоставкаОбъем
	               |ИЗ
	               |	ПоставкаСырья КАК ПоставкаСырья,
	               |	ЗапасыСырья КАК ЗапасыСырья,
	               |	ОстаткиОснШтабель КАК ОстаткиОснШтабель,
	               |	ВТ_НесортированноеНачалоМесяца КАК ВТ_НесортированноеНачалоМесяца,
	               |	ВТ_НесортированноеТекМомент КАК ВТ_НесортированноеТекМомент";
	
	Возврат Запрос.Текст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаЗначенияПоказателейДляОтчетов()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ЗначенияПоказателейДляОтчетов.ЗначениеСутки, 0)) КАК ЗначениеСутки
	               |ПОМЕСТИТЬ Факт
	               |ИЗ
	               |	РегистрСведений.алк_ЗначенияПоказателейДляОтчетов КАК алк_ЗначенияПоказателейДляОтчетов
	               |ГДЕ
	               |	алк_ЗначенияПоказателейДляОтчетов.Период МЕЖДУ &ДатаНачала И &ДатаКонец
	               |	И алк_ЗначенияПоказателейДляОтчетов.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.алк_ВидЗначенияПоказателяОтчетов.Факт)
	               |	И алк_ЗначенияПоказателейДляОтчетов.ОперацияПроизводства.Код = &КодОперации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ЗначенияПоказателейДляОтчетов.ЗначениеСутки, 0)) КАК ЗначениеСутки
	               |ПОМЕСТИТЬ План
	               |ИЗ
	               |	РегистрСведений.алк_ЗначенияПоказателейДляОтчетов КАК алк_ЗначенияПоказателейДляОтчетов
	               |ГДЕ
	               |	алк_ЗначенияПоказателейДляОтчетов.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.алк_ВидЗначенияПоказателяОтчетов.План)
	               |	И алк_ЗначенияПоказателейДляОтчетов.ОперацияПроизводства.Код = &КодОперации
	               |	И алк_ЗначенияПоказателейДляОтчетов.Период МЕЖДУ &ДатаНачала И &ДатаКонец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ОКР(Факт.ЗначениеСутки / 1000, 1), 0) КАК ОбъемФакт,
	               |	ВЫБОР
	               |		КОГДА План.ЗначениеСутки = 0
	               |				ИЛИ План.ЗначениеСутки = NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ ОКР(Факт.ЗначениеСутки / План.ЗначениеСутки * 100)
	               |	КОНЕЦ КАК ПроцентПлана
	               |ИЗ
	               |	Факт КАК Факт,
	               |	План КАК План";   
	
	 	
	Возврат Запрос.Текст;
	
КонецФункции

//ОбъемФакт и ПроцентПлана
&НаСервереБезКонтекста
Функция ПроизводствоШпон(ДатаФормирования)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаЗначенияПоказателейДляОтчетов();
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаФормирования));  
	Запрос.УстановитьПараметр("ДатаКонец", ДатаФормирования);
	Запрос.УстановитьПараметр("КодОперации", "000000122");
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтгрузкаШпон(ДатаФормирования) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаЗначенияПоказателейДляОтчетов();
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаФормирования));  
	Запрос.УстановитьПараметр("ДатаКонец", ДатаФормирования);
	Запрос.УстановитьПараметр("КодОперации", "000000031");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить()); 
	
КонецФункции

&НаСервереБезКонтекста
Функция ОстаткиНаСГПШпон(ДатаФормирования, Порода, Склад)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОКР(ЕСТЬNULL(алк_ЗначенияПоказателейДляОтчетовСрезПоследних.ЗначениеСутки, 0) / 1000, 1) КАК ОбъемФакт,
	               |	ВЫБОР
	               |		КОГДА План.ЗначениеСутки = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ОКР(алк_ЗначенияПоказателейДляОтчетовСрезПоследних.ЗначениеСутки / План.ЗначениеСутки * 100)
	               |	КОНЕЦ КАК ПроцентПлана
	               |ИЗ
	               |	РегистрСведений.алк_ЗначенияПоказателейДляОтчетов.СрезПоследних(
	               |			&ДатаКонец,
	               |			ВидЗначения = ЗНАЧЕНИЕ(Перечисление.алк_ВидЗначенияПоказателяОтчетов.Факт)
	               |				И ОперацияПроизводства.Код = ""000000032"") КАК алк_ЗначенияПоказателейДляОтчетовСрезПоследних,
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(алк_ЗначенияПоказателейДляОтчетовСрезПоследних.ЗначениеСутки, 0) КАК ЗначениеСутки
	               |	ИЗ
	               |		РегистрСведений.алк_ЗначенияПоказателейДляОтчетов.СрезПоследних(
	               |				&ДатаКонец,
	               |				ВидЗначения = ЗНАЧЕНИЕ(Перечисление.алк_ВидЗначенияПоказателяОтчетов.План)
	               |					И ОперацияПроизводства.Код = ""000000032"") КАК алк_ЗначенияПоказателейДляОтчетовСрезПоследних) КАК План";
	
	Запрос.УстановитьПараметр("ДатаКонец", ДатаФормирования);
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить()); //возвращает остатки факт на сгп в тыс и процент выполненного плана 
	
КонецФункции

//поставка и запасы 
&НаСервереБезКонтекста
Функция ПоставкаСырьяЗапасыСырьяОснШтабельОстатки(ДатаФормирования, КодПороды, Склад) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаПоОстаткамЗапасов();
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(ДатаФормирования));
	Запрос.УстановитьПараметр("КонецПериода", ДатаФормирования);
	Запрос.УстановитьПараметр("КодПороды", КодПороды);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервереБезКонтекста
Функция ОстаткиНаСГП (ДатаФормирования, Склад, Номенклатура)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаОстаткиНаСГП();
	
	Запрос.УстановитьПараметр("КонецПериода", ДатаФормирования);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции       

&НаСервереБезКонтекста
Функция ПроизводствоЦЛПМЛП (ДатаФормирования, МассивКатегорийНоменклатуры, Склад) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстПроизводствоЦЛПМЛП(); 
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаФормирования)); 
	Запрос.УстановитьПараметр("КонецПериода",  ДатаФормирования);
	Запрос.УстановитьПараметр("МассивКатегорийНоменклатуры", МассивКатегорийНоменклатуры); 
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции 

&НаСервереБезКонтекста
Функция ВТЧЛамина(ДатаФормирования, Склад) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПроизводствоОборотОбороты.КоличествоОборот, 0)) КАК ОбъемПроизведенного
	               |ИЗ
	               |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	               |			ДобавитьКДате(&НачалоПериода,Час,8),
	               |			&КонецПериода,
	               |			,
	               |			ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	               |				И Номенклатура.КатегорияНоменклатуры = ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.Пиломатериал)
	               |				И Склад.Код = ""ПБ-000003"") КАК алк_ПроизводствоОборотОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО (алк_ПараметрыХарактеристик.Характеристика = алк_ПроизводствоОборотОбороты.Характеристика)
	               |ГДЕ
	               |	алк_ПараметрыХарактеристик.Порода.Код = ""000000001""
	               |	И алк_ПараметрыХарактеристик.Сорт.Код = ""000000005""
	               |	И алк_ПараметрыХарактеристик.Влажность.Код = ""000000002""";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаФормирования)); 
	Запрос.УстановитьПараметр("КонецПериода",  ДатаФормирования); 
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());  
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтгрузкаПилМат(ДатаФормирования) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Объем, 0)) КАК Объем
	               |ИЗ
	               |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	               |		ПО алк_ТранспортировкаЗапасовЗапасы.Ссылка = алк_ТранспортировкаЗапасов.Ссылка
	               |ГДЕ
	               |	алк_ТранспортировкаЗапасов.Проведен
	               |	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата МЕЖДУ ДобавитьКДате(&НачалоПериода,ЧАС,8) И &КонецПериода
	               |	И алк_ТранспортировкаЗапасов.Направление = ЗНАЧЕНИЕ(Перечисление.алк_НаправленияДеятельности.Лесопиление)
	               |	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура.Код = ""ПБ-00000001""";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаФормирования)); 
	Запрос.УстановитьПараметр("КонецПериода",  (КонецДня(ДатаФормирования)-4*60*60)); 
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());  
	
КонецФункции

&НаСервереБезКонтекста
Функция УпаковкаПеллеты(ДатаФормирования) 
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПроизводствоОборотОбороты.КоличествоОборот, 0)) КАК КоличествоОборот
	               |ИЗ
	               |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	               |			ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, 8),
	               |			&КонецПериода,
	               |			,
	               |			Склад.Код = ""ПБ-000044""
	               |				И Номенклатура.Код = ""ПБ-00000018""
	               |				И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеПриход)
	               |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)) КАК алк_ПроизводствоОборотОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаФормирования)); 
	Запрос.УстановитьПараметр("КонецПериода",  (КонецДня(ДатаФормирования)-4*60*60));  
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить()); //одно значение ??? 
	
КонецФункции   

&НаСервереБезКонтекста
Функция ОтгрузкаПеллеты(ДатаФормирования) 
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.ВесБрутто, 0)) КАК ОбъемОтгрузки
	               |ИЗ
	               |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	               |ГДЕ
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Проведен
	               |	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоПериода, ЧАС, 8) И &КонецПериода
	               |	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура.Код = ""ПБ-00000018""";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДатаФормирования)); 
	Запрос.УстановитьПараметр("КонецПериода",  (КонецДня(ДатаФормирования)-4*60*60));  
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());  
	
КонецФункции

//поставка сырья запасы сырья производство отгрузкаПМ остаткиПМ
&НаСервереБезКонтекста
Функция ПлановыеПоказателиПоставкаЗапасыПроизводствоОтгрузкаОстатки(ДатаФормирования)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0)) КАК ПроизводствоМЛП,
	               |	NULL КАК ПроизводствоПМВТЧЛамина,
	               |	NULL КАК ПоставкаСырьяЛиственница,
	               |	NULL КАК ПоставкаСырьяЕль,
	               |	NULL КАК ОтгрузкаПиломатериал,
	               |	NULL КАК ОстатокиСГППМ
	               |ПОМЕСТИТЬ ВТ_Итог
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов = ""ПроизведеноПМВалМЛП""
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0)),
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов В (""ПроизводствоПМСухойЕльЛаминаЦЛП"", ""ПроизводствоТоварноеСухойЕльЛаминаПММПС"")
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0)),
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов = ""ОбъемПоступленияСырьяЛцУПСС""
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0)),
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов = ""ОбъемПоступленияСырьяЕльУПСС""
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0)),
	               |	NULL
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов В (""ОтгрузкаПилматИПобочнаяПродукцияЖД"", ""ОтгрузкаПилматИПобочнаяПродукцияКонтейнерами"", ""ОтгрузкаПилматПобочнаяПродукцияПрочее"")
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0))
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов В (""ОстатокПМСухойНаСГП"", ""ОстатокПМСыройНаСГП"")
	               |	И алк_ПлановыеПоказателиПроизводства.Период = НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.ПроизводствоМЛП, 0)) КАК ПроизводствоМЛП,
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.ПроизводствоПМВТЧЛамина, 0)) КАК ПроизводствоПМВТЧЛамина,
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.ПоставкаСырьяЛиственница, 0)) КАК ПоставкаСырьяЛиственница,
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.ПоставкаСырьяЕль, 0)) КАК ПоставкаСырьяЕль,
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.ОтгрузкаПиломатериал, 0)) КАК ОтгрузкаПиломатериал,
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.ОстатокиСГППМ, 0)) КАК ОстатокиСГППМ
	               |ИЗ
	               |	ВТ_Итог КАК ВТ_Итог";
	
	Запрос.УстановитьПараметр("ДатаФормирования", ДатаФормирования); 

	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПлановыйПоказательПроизведеноПМ(ДатаФормирования)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0)) КАК Объем
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов В (""ПроизводствоПМТовар"", ""ПроизводствоПМТоварноеМПС"")
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет";  
	
	Запрос.УстановитьПараметр("ДатаФормирования", ДатаФормирования);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

//упаковка и отгрузка пеллетов
&НаСервереБезКонтекста
Функция ПлановыеПоказателиУпаковкаОтгрузка(ДатаФормирования)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0)) КАК УпакованоДГ,
	               |	NULL КАК ОтгруженоДГ
	               |ПОМЕСТИТЬ ВТ_Итог
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов = ""УпакованоДГВсего""
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	NULL,
	               |	СУММА(ЕСТЬNULL(алк_ПлановыеПоказателиПроизводства.Значение, 0))
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов В (""ВесПогруженыхВагоновДГ"", ""ВесПогруженыхПолувагоновДГ"", ""ВесПогруженыхКонтейнеровДГ"", ""ВесПогруженыхАвтомобилейДГ"")
	               |	И алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И НАЧАЛОПЕРИОДА(&ДатаФормирования, ДЕНЬ)
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.УпакованоДГ, 0)) КАК УпакованоДГ,
	               |	СУММА(ЕСТЬNULL(ВТ_Итог.ОтгруженоДГ, 0)) КАК ОтгруженоДГ
	               |ИЗ
	               |	ВТ_Итог КАК ВТ_Итог";
	
	Запрос.УстановитьПараметр("ДатаФормирования", ДатаФормирования); 
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());

КонецФункции

//отгрузка шпон
&НаСервереБезКонтекста
Функция ПлановыеПоказателиОтгрузка(ДатаФормирования)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ЗначенияПоказателейДляОтчетов.ЗначениеСутки, 0)) КАК ЗначениеСутки
	               |ИЗ
	               |	РегистрСведений.алк_ЗначенияПоказателейДляОтчетов КАК алк_ЗначенияПоказателейДляОтчетов
	               |ГДЕ
	               |	алк_ЗначенияПоказателейДляОтчетов.Период МЕЖДУ &ДатаНачала И &ДатаКонец
	               |	И алк_ЗначенияПоказателейДляОтчетов.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.алк_ВидЗначенияПоказателяОтчетов.План)
	               |	И алк_ЗначенияПоказателейДляОтчетов.ОперацияПроизводства.Код = ""000000031""";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаФормирования)); 
	Запрос.УстановитьПараметр("ДатаКонец", НачалоМесяца(ДатаФормирования) + 24*60*60);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

//остатки по осн. штабелю (ель, лиственница) и реализация пеллет и остатки пеллет  
&НаСервереБезКонтекста
Функция УстановкаПлановыхПоказателейОстаткиОснШтабельРеализацияПеллет(ДатаФормирования, КодПоказателя) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(алк_ПлановыеПоказателиПроизводстваСрезПоследних.Значение, 0) КАК Значение
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства.СрезПоследних(&Дата, Показатель.Код = &КодПоказателя) КАК алк_ПлановыеПоказателиПроизводстваСрезПоследних"; 
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ДатаФормирования));
	Запрос.УстановитьПараметр("КодПоказателя", КодПоказателя);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить()); 
	
	//"000000069" ель осн штабель
	//"000000070" лиственница осн штабель
	//"000000071" реализация пеллет 
	//"000000073" остатки пеллет на СГП
 
КонецФункции 






/// новый раздел от 20240911 как в Опер сводках ///   
&НаСервереБезКонтекста
Функция ВернутьЗначениеПоставки(ДатаФормирования,ПоПородам,Порода)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПроизводствоОборотОбороты.КоличествоОборот, 0)) КАК ЗначениеСутки
	               |ИЗ
	               |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	               |			ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ), ЧАС, 8),
	               |			&ДатаФормирования,
	               |			Авто,
	               |			Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Прибыло)
	               |				И Склад.Код = ""ПБ-000001""
	               |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)) КАК алк_ПроизводствоОборотОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО алк_ПроизводствоОборотОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ПоПородам
	               |				ТОГДА алк_ПараметрыХарактеристик.Порода В (&Порода)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ДатаФормирования",ДатаФормирования);
	Запрос.УстановитьПараметр("ПоПородам",ПоПородам);
	Запрос.УстановитьПараметр("Порода",Порода);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Возврат Выборка.ЗначениеСутки;
	КонецЦикла;
КонецФункции  

&НаСервереБезКонтекста
Функция ВернутьЗначениеПриемки(ДатаФормирования,ПоПородам,Порода)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ПроизводствоОборотОбороты.КоличествоОборот,0)) КАК ЗначениеСутки
	               |ИЗ
	               |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ), ЧАС, 8), &ДатаФормирования, Авто, Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Приемка)) КАК алк_ПроизводствоОборотОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО алк_ПроизводствоОборотОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ПоПородам
	               |				ТОГДА алк_ПараметрыХарактеристик.Порода В (&Порода)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ДатаФормирования",ДатаФормирования);
	Запрос.УстановитьПараметр("ПоПородам",ПоПородам);
	Запрос.УстановитьПараметр("Порода",Порода);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл  
		Возврат Выборка.ЗначениеСутки;
	КонецЦикла;
КонецФункции       

//правильные
&НаСервереБезКонтекста
Функция ВернутьЗначениеЗапасы(ДатаФормирования,ПоПородам,Порода,КодГруппы)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Родитель КАК Группа,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Ссылка КАК Категория,
	               |	алк_ПроизводственныеКатегорииНоменклатурыДлины.Длина КАК Длина,
	               |	алк_ПроизводственныеКатегорииНоменклатурыПороды.Порода КАК Порода,
	               |	алк_ПроизводственныеКатегорииНоменклатурыСорта.Сорт КАК Сорт,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДляВсехПород КАК ДляВсехПород,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонС КАК ДиапазонС,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонПо КАК ДиапазонПо,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ Категории
	               |ИЗ
	               |	Справочник.алк_ПроизводственныеКатегорииНоменклатуры КАК алк_ПроизводственныеКатегорииНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Сорта КАК алк_ПроизводственныеКатегорииНоменклатурыСорта
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыСорта.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Породы КАК алк_ПроизводственныеКатегорииНоменклатурыПороды
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыПороды.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Длины КАК алк_ПроизводственныеКатегорииНоменклатурыДлины
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыДлины.Ссылка
	               |ГДЕ
	               |	НЕ алк_ПроизводственныеКатегорииНоменклатуры.ЭтоГруппа
	               |	И алк_ПроизводственныеКатегорииНоменклатуры.Родитель.Родитель.Код = ""00000000001""
	               |	И НЕ алк_ПроизводственныеКатегорииНоменклатуры.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток,0)) КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			ДОБАВИТЬКДАТЕ(&ДатаФормирования, ЧАС, 8),
	               |			СтруктурнаяЕдиница.Код = ""ПБ-000001""
	               |				И Номенклатура.Код = ""ПБ-00000002""
	               |				И НЕ Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.Пустаяссылка)) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Категории КАК Категории
	               |			ПО алк_ПараметрыХарактеристик.Длина = Категории.Длина
	               |				И алк_ПараметрыХарактеристик.Сорт = Категории.Сорт
	               |				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ >= Категории.ДиапазонС
	               |				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ <= Категории.ДиапазонПо
	               |				И (ВЫБОР
	               |					КОГДА Категории.ДляВсехПород
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Категории.Порода = алк_ПараметрыХарактеристик.Порода
	               |				КОНЕЦ)
	               |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	               |ГДЕ
	               |	Категории.Группа.Код = &КодГруппы
	               |	И ВЫБОР
	               |			КОГДА &ПоПородам
	               |				ТОГДА алк_ПараметрыХарактеристик.Порода В (&Порода)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ДатаФормирования",НачалоДня(ДатаФормирования)+24*3600);
	Запрос.УстановитьПараметр("ПоПородам",ПоПородам);
	Запрос.УстановитьПараметр("Порода",Порода);
	Запрос.УстановитьПараметр("КодГруппы",КодГруппы);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл  
		Возврат Выборка.КоличествоОстаток;
	КонецЦикла;

	//"00000000002" - правильные 
	//"00000000028" - неправильные
КонецФункции 

&НаСервереБезКонтекста
Функция ВернутьПлан(ДатаФормирования,ИмяДляЗапросов)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(алк_ПлановыеПоказателиПроизводства.Значение) КАК Значение
	               |ИЗ
	               |	РегистрСведений.алк_ПлановыеПоказателиПроизводства КАК алк_ПлановыеПоказателиПроизводства
	               |ГДЕ
	               |	алк_ПлановыеПоказателиПроизводства.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормирования, МЕСЯЦ) И &ДатаФормирования
	               |	И НЕ алк_ПлановыеПоказателиПроизводства.ЭтоБюджет
	               |	И алк_ПлановыеПоказателиПроизводства.Показатель.ИмяДляЗапросов В (&ИмяДляЗапросов)";
	Запрос.УстановитьПараметр("ДатаФормирования",ДатаФормирования);
	Запрос.УстановитьПараметр("ИмяДляЗапросов",ИмяДляЗапросов);
		
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Значение;
	КонецЦикла;
КонецФункции  
//\\

#КонецОбласти

 #КонецОбласти 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



