
Процедура ДобавлениеСерийногоНомера(СерийныйНомер) Экспорт  	
	Запись = РегистрыСведений.алк_СвободныеСерийныеНомера.СоздатьМенеджерЗаписи(); 
	Запись.СерийныйНомер = СерийныйНомер;	
	Запись.Записать(); 	
КонецПроцедуры

Процедура ДобавлениеСпискаСерийныхНомеров(МассивСерийныхНомеров) Экспорт  
	Для Каждого СерийныйНомер Из МассивСерийныхНомеров Цикл 
		ДобавлениеСерийногоНомера(СерийныйНомер);
	КонецЦикла;
КонецПроцедуры

Процедура УдалениеСпискаСерийныхНомеров(МассивСерийныхНомеров) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_СвободныеСерийныеНомера.СерийныйНомер
	               |ИЗ
	               |	РегистрСведений.алк_СвободныеСерийныеНомера КАК алк_СвободныеСерийныеНомера
	               |ГДЕ
	               |	алк_СвободныеСерийныеНомера.СерийныйНомер В (&СерийныйНомер)";
	Запрос.УстановитьПараметр("СерийныйНомер",МассивСерийныхНомеров);
	РезЗапроса = Запрос.Выполнить(); 
	Если РезЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	Выборка = РезЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НайденнаяЗапись = РегистрыСведений.алк_СвободныеСерийныеНомера.СоздатьНаборЗаписей();
		НайденнаяЗапись.Отбор.СерийныйНомер.Установить(Выборка.СерийныйНомер);
		НайденнаяЗапись.Записать(Истина);
	КонецЦикла;
КонецПроцедуры