
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ДанныеГруппы = НайтиКорень(Объект, 0);
	
	Если ДанныеГруппы["Родитель"]= Справочники.алк_Простой.СтруктураПоГруппам Тогда  	
		Возврат;	
	КонецЕсли;  
	
	  
	Объект.Цех 				= Объект.Родитель.Цех;
	Объект.Участок 			= Объект.Родитель.Участок;
	Объект.МашинныйЦентр 	= Объект.Родитель.МашинныйЦентр;
	Объект.Тип 				= Объект.Родитель.Тип;
	Объект.Подтип1 			= Объект.Родитель.Подтип1;
	Объект.Подтип2 			= Объект.Родитель.Подтип2;
	Объект.Подтип25 		= Объект.Родитель.Подтип25;
	
	
КонецПроцедуры

&НаСервере
Функция НайтиКорень(Элем, УровеньГруппы)
	
	УровеньГруппы = УровеньГруппы + 1; 
	
	ДанныеГруппы = Новый Соответствие;
		
	Если НЕ ЗначениеЗаполнено(Элем.Родитель) Тогда 	
		
		ДанныеГруппы.Вставить("Родитель", Элем);
		ДанныеГруппы.Вставить("УровеньГруппы", УровеньГруппы);
		
        Возврат ДанныеГруппы;
		
	Иначе
		
		Возврат НайтиКорень(Элем.Родитель, УровеньГруппы);
		
	КонецЕсли; 
	
КонецФункции