
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоставРазделов.Очистить();
	
	НовыйРаздел = СоставРазделов.Добавить();
	НовыйРаздел.ИмяРаздела = "Биржа";
	НовыйРаздел.ЗаголовокРаздела = "Биржа";
	НовыйПодраздел = НовыйРаздел.СоставПодразделов.Добавить();
	НовыйПодраздел.ИмяПодраздела = "Подраздел_б1";
	НовыйПодраздел.ЗаголовокПодраздела = "Остатки";
	
	НовыйРаздел = СоставРазделов.Добавить();
	НовыйРаздел.ИмяРаздела = "Ответхранение";
	НовыйРаздел.ЗаголовокРаздела = "Ответхранение";
	НовыйПодраздел = НовыйРаздел.СоставПодразделов.Добавить();
	НовыйПодраздел.ИмяПодраздела = "Подраздел_о1";
	НовыйПодраздел.ЗаголовокПодраздела = "Ведомость";
	НовыйПодраздел = НовыйРаздел.СоставПодразделов.Добавить();
	НовыйПодраздел.ИмяПодраздела = "Подраздел_о2";
	НовыйПодраздел.ЗаголовокПодраздела = "Остатки";
	
	НовыйРаздел = СоставРазделов.Добавить();
	НовыйРаздел.ИмяРаздела = "Производство";
	НовыйРаздел.ЗаголовокРаздела = "Производство";
	НовыйПодраздел = НовыйРаздел.СоставПодразделов.Добавить();
	НовыйПодраздел.ИмяПодраздела = "Подраздел_п1";
	НовыйПодраздел.ЗаголовокПодраздела = "Подраздел_п1";
	
	СписокРазделов = Новый СписокЗначений;
	СписокРазделов.Добавить("Биржа");
	СписокРазделов.Добавить("Ответхранение");
	СписокРазделов.Добавить("Производство");
	
	СоздатьСтраницыПоРазделам(СписокРазделов);		
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтраницыПоРазделам(СписокРазделов)
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого стрРаздел Из СписокРазделов Цикл
		
		// Добавляем реквизит с элементом
		НовыйРеквизит = Новый РеквизитФормы(стрРаздел.Значение, Новый ОписаниеТипов("ТабличныйДокумент"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
		ПараметрыОтбора = Новый Структура("ИмяРаздела", стрРаздел.Значение); 
		МассивСтрок = СоставРазделов.НайтиСтроки(ПараметрыОтбора);
		
		Для каждого стрПодраздел Из МассивСтрок[0].СоставПодразделов Цикл
			НовыйРеквизит = Новый РеквизитФормы(стрПодраздел.ИмяПодраздела, Новый ОписаниеТипов("ТабличныйДокумент"));
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("о"+стрПодраздел.ИмяПодраздела, Новый ОписаниеТипов("Строка"));
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		КонецЦикла; 
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого стрРаздел Из СписокРазделов Цикл
		
		ПараметрыОтбора = Новый Структура("ИмяРаздела", стрРаздел.Значение); 
		МассивСтрок = СоставРазделов.НайтиСтроки(ПараметрыОтбора);
		
		Если МассивСтрок <> 0 Тогда
			
			СтрокаРаздела = МассивСтрок[0];
			
			НовыйЭлемент = Элементы.Вставить(СтрокаРаздела.ИмяРаздела, Тип("ГруппаФормы"), Элементы.стрыРазделы);
			НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
			НовыйЭлемент.Заголовок = СтрокаРаздела.ЗаголовокРаздела;
			
			НовыйЭлемент = Элементы.Вставить("п"+СтрокаРаздела.ИмяРаздела, Тип("ГруппаФормы"), НовыйЭлемент);
			НовыйЭлемент.Вид = ВидГруппыФормы.Страницы;
			НовыйЭлемент.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСлеваГоризонтально;
			НовыйЭлемент.Заголовок = СтрокаРаздела.ЗаголовокРаздела;
			
			//тдНовыйЭлемент = Элементы.Вставить("тд"+СтрокаРаздела.ИмяРаздела, Тип("ПолеФормы"), НовыйЭлемент);
			//тдНовыйЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
			//тдНовыйЭлемент.ПутьКДанным = СтрокаРаздела.ИмяРаздела;
			
			Для каждого стрПодраздел Из МассивСтрок[0].СоставПодразделов  Цикл
				пНовыйЭлемент = Элементы.Вставить(стрПодраздел.ИмяПодраздела, Тип("ГруппаФормы"), НовыйЭлемент);
				пНовыйЭлемент.Вид = ВидГруппыФормы.Страница;
				пНовыйЭлемент.Заголовок = стрПодраздел.ЗаголовокПодраздела;
				//пНовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				
				оНовыйЭлемент = Элементы.Вставить("о"+стрПодраздел.ИмяПодраздела, Тип("ПолеФормы"), пНовыйЭлемент);
				оНовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
				оНовыйЭлемент.Заголовок = "Описание";
				оНовыйЭлемент.РастягиватьПоГоризонтали = Истина;
				оНовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
				оНовыйЭлемент.Высота = 3;
				оНовыйЭлемент.ПутьКДанным = "о"+стрПодраздел.ИмяПодраздела; 
				
				тдНовыйЭлемент = Элементы.Вставить("тд"+стрПодраздел.ИмяПодраздела, Тип("ПолеФормы"), пНовыйЭлемент);
				тдНовыйЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
				тдНовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				тдНовыйЭлемент.ПутьКДанным = стрПодраздел.ИмяПодраздела;
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура МониторСкомпоноватьРезультат(Команда) 
	
	//Для каждого Реквизит Из ЭтаФорма. Цикл
	//	Если Реквизит.Имя = "Подраздел_б1" Тогда
	//		Реквизит = МониторСкомпоноватьРезультатНаСервере();		
	//	КонецЕсли; 	
	//КонецЦикла; 
	
	Подраздел_б1 = МониторСкомпоноватьРезультатНаСервере();
	
КонецПроцедуры

&НаСервере
Функция МониторСкомпоноватьРезультатНаСервере()
	
	СхемаКомпоновкиДанных = Отчеты.алк_ОстаткиНаБирже_Топ.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Получаем оформление из макета
	//МакетОформленияКомпоновкиДанных = Отчеты.алк_АктПриемкиЛесопродукции.ПолучитьМакет("МакетОформленияКомпоновкиДанныхПесок");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//Настройки = СхемаКомпоновкиДанных.ВариантыНастроек["Вариант1"].Настройки;
	
	УстановитьОтбор(Настройки, "П1", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	УстановитьОтбор(Настройки, "Период", Объект.ДатаСмены);
	
	
	//ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Период");
	//
	//Для каждого стрПараметр Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//	
	//	Если стрПараметр.Параметр = ПараметрКомпоновки Тогда
	//		
	//		Если Не ЗначениеЗаполнено(стрПараметр.Значение) Тогда
	//			
	//			УстановитьПараметрПользовательскойНастройки(КомпоновщикНастроек.ПользовательскиеНастройки, "НаДату", ТекущаяДата());	
	//			
	//		КонецЕсли; 
	//		
	//	КонецЕсли; 	
	//	
	//КонецЦикла; 
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент;
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);  
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
	
	ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	
	Если ОбрПараметр <> Неопределено Тогда
		
		ОбрПараметр.Использование = Истина;
		ОбрПараметр.Значение      = Значение;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, ИмяНастройки, Значение)
	
	ПолеКомпоновкиПараметр = Новый ПараметрКомпоновкиДанных(ИмяНастройки);
	ЭлементОтбора = Неопределено;
	
	Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
		Если Элемент.Параметр = ПолеКомпоновкиПараметр Тогда
			Элемент.Значение = Значение;
			Элемент.Использование = Истина; 
			Прервать;	
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьДлительноеВычисление(Команда)
	
	// вызываем серверную процедуру формы для запуска длительной операции
	ЗапуститьДлительныеВычисленияНаСервере();
	// инициализируем параметры ожидания (посмотрите документацию, там можно включить режим вывода прогресса выполнения и методами СообщитьПрогресс/ПрочитатьПрогресс указывать прогресс выполнения операции
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	// подключаем обработчик ожидания и указываем описание оповещения о завершении задания	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,
	Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтаФорма),
	ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт
	
	// данный код сработает после завершения работы задания автоматически
	//РезультатВычислений = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);	
	
	РезультатСтруктура = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
	
	Подраздел_б1   = РезультатСтруктура.Результат;
	оПодраздел_б1  = РезультатСтруктура.Описание;
	
КонецПроцедуры

&НаСервере
Процедура _ЗапуститьДлительныеВычисленияНаСервере()
	
	// код запуска длительной операции посредством БСП
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Длительное вычисление'");
	// далее в "Новый Структура" можно поместить нужные фоновому заданию параметры
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("тестСерверВнешСоед.ПроизвестиДлительноеВычисление", 
	Новый Структура, 
	ПараметрыВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьДлительныеВычисленияНаСервере()
	
	// код запуска длительной операции посредством БСП
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Длительное вычисление'");
	// далее в "Новый Структура" можно поместить нужные фоновому заданию параметры
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РфпОперативныйМониторСервер.ПроизвестиДлительноеВычисление", 
	Новый Структура("ДатаСмены", Объект.ДатаСмены), 
	ПараметрыВыполнения);
	
КонецПроцедуры


