

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборДляОператоровЦЛП") Тогда
		
		Заголовок = "Документы производство ЦЛП";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоНаправлению(Перечисления.алк_НаправленияДеятельности.Лесопиление);
		ОтобратьПоАвтозаполнению(Ложь);
				
	ИначеЕсли Параметры.Свойство("ОтборДляОператоровМЛП") Тогда 
		
		Заголовок = "Документы производства МЛП";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоНаправлению(Перечисления.алк_НаправленияДеятельности.МалоеЛесопиление);
		ОтобратьПоАвтозаполнению(Ложь);
		
	ИначеЕсли Параметры.Свойство("ОтборДляОператоровОтходы") Тогда 
		
		Заголовок = "Документы производства ""Отходов""";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоНаправлению(Перечисления.алк_НаправленияДеятельности.Отходы);
		ОтобратьПоАвтозаполнению(Истина);
		
	ИначеЕсли Параметры.Свойство("ОтборДляОператоровДГ") Тогда 
		
		Заголовок = "Документы производства Древесные гранулы";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоНаправлению(Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы);
		ОтобратьПоАвтозаполнению(Истина); 
		
	ИначеЕсли Параметры.Свойство("ОтборДляОператоровОтходыШпон") Тогда 
		
		Заголовок = "Документы оформления отходов (шпон)";
		АвтоЗаголовок = Ложь;
		
		ОтобратьПоНаправлению(Перечисления.алк_НаправленияДеятельности.Шпон);
		ОтобратьПоАвтозаполнению(Ложь);

		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПиФ

&НаСервере
Процедура ОтобратьПоНаправлению(НаправлениеДеятельности)
	
	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор;
	
	ОтборВПользовательскихНастройках = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	Отбор.ИдентификаторПользовательскойНастройки);
	
	РаботаемСНастройками = Истина;																		
	Если ОтборВПользовательскихНастройках <> Неопределено Тогда
		
		РаботаемСНастройками = Ложь;
		Отбор = ОтборВПользовательскихНастройках;		
		
	КонецЕсли;																		
	
	ОтборПоНаправлению = Неопределено;
	ПолеНаправление = Новый ПолеКомпоновкиДанных("Направление");
	
	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			и ЭлементОтбора.ЛевоеЗначение = ПолеНаправление Тогда
			
			ОтборПоНаправлению = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ОтборПоНаправлению = Неопределено Тогда
		
		ОтборПоНаправлению = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоНаправлению.ЛевоеЗначение = ПолеНаправление;
		ОтборПоНаправлению.Использование = Ложь;
		//ОтборПоНаправлению.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ОтборПоНаправлению.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборПоНаправлению.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		Элементы.Список.СоздатьЭлементыФормыПользовательскихНастроек();
		
	КонецЕсли;
	
	Если РаботаемСНастройками Тогда
		
		ОтборПоНаправлению = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ОтборПоНаправлению.ИдентификаторПользовательскойНастройки);
		
	КонецЕсли;
	
	ОтборПоНаправлению.Использование = Не ОтборПоНаправлению.Использование;
	
	ОтборПоНаправлению.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	ОтборПоНаправлению.ПравоеЗначение = НаправлениеДеятельности;
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоАвтозаполнению(Флаг)
	
	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор;
	
	ОтборВПользовательскихНастройках = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	Отбор.ИдентификаторПользовательскойНастройки);
	
	РаботаемСНастройками = Истина;																		
	Если ОтборВПользовательскихНастройках <> Неопределено Тогда
		
		РаботаемСНастройками = Ложь;
		Отбор = ОтборВПользовательскихНастройках;		
		
	КонецЕсли;																		
	
	ОтборПоАвтозаполнению = Неопределено;
	ПолеАвтозаполнение = Новый ПолеКомпоновкиДанных("Автозаполнение");
	
	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			и ЭлементОтбора.ЛевоеЗначение = ПолеАвтозаполнение Тогда
			
			ОтборПоАвтозаполнению = ЭлементОтбора;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ОтборПоАвтозаполнению = Неопределено Тогда
		
		ОтборПоАвтозаполнению = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоАвтозаполнению.ЛевоеЗначение = ПолеАвтозаполнение;
		ОтборПоАвтозаполнению.Использование = Ложь;
		//ОтборПоАвтозаполнению.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ОтборПоАвтозаполнению.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборПоАвтозаполнению.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
		Элементы.Список.СоздатьЭлементыФормыПользовательскихНастроек();
		
	КонецЕсли;
	
	Если РаботаемСНастройками Тогда
		
		ОтборПоАвтозаполнению = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ОтборПоАвтозаполнению.ИдентификаторПользовательскойНастройки);
		
	КонецЕсли;
	
	ОтборПоАвтозаполнению.Использование = Не ОтборПоАвтозаполнению.Использование;
	
	ОтборПоАвтозаполнению.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
	ОтборПоАвтозаполнению.ПравоеЗначение = Флаг;
	
КонецПроцедуры


#КонецОбласти


Процедура Конец()	
КонецПроцедуры


 