
//Основные функции http
Функция GetServerDateAction(Запрос)
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("ДатаСервера", Строка(ТекущаяДата()));
	
	Запись = Новый ЗаписьJSON;
	
	Попытка
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		Запись.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(Запись, СтруктураОтвет);
	Исключение
	КонецПопытки;
	
	Ответ = Запись.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;

КонецФункции

Функция CheckConnectionAction(Запрос)
	
	ДатаУстройства = Запрос.ПараметрыЗапроса.Получить("date");
	
	РазницаДат = Дата(ДатаУстройства) - ТекущаяДата();
	МодульРазницыДат = ?(РазницаДат > 0, РазницаДат, -РазницаДат);
	
	Если МодульРазницыДат <= 600 Тогда
		СтруктураПараметров = Новый Структура("ДатаСоответствует", Истина);
	Иначе
		СтруктураПараметров = Новый Структура("ДатаСоответствует", Ложь);
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;

	Попытка
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);
	Исключение
	КонецПопытки;
	
	Ответ = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;

КонецФункции

Функция GetPackAction(Запрос)
	
	Штрихкод = Запрос.ПараметрыЗапроса.Получить("code");
	Если Штрихкод = Неопределено тогда
		Штрихкод = Запрос.ПолучитьТелоКакСтроку();
	КонецЕсли;
	Номер = ЛатВКир(Штрихкод);
	
	СерийныйНомерНаименование   = "";
	СостояниеНаименование   	= "";	
	УпаковкаНаименование  		= "";
	УпаковкаИдентификатор 		= "";
	Вес				  		    = "";
	ДатаСмены					= "";
	Смена						= "";	
	СообщениеЮзеру		 	    = "";
	Отказ	          		    = Ложь;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"""" КАК Состояние,
		|	0 КАК Вес,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Упаковка,
		|	"""" КАК УпаковкаНаименование,
		|	СерийныеНомера.Наименование КАК СерийныйНомерНаименование,
		|	0 КАК ДатаСмены,
		|	0 КАК Смена
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование = &Номер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Удален)
		|			ТОГДА 0
		|		ИНАЧЕ алк_ПараметрыПакетовОперативныйСрезПоследних.КоличествоСостав
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Удален)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		ИНАЧЕ алк_ПараметрыПакетовОперативныйСрезПоследних.Характеристика
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Удален)
		|			ТОГДА """"
		|		ИНАЧЕ алк_ПараметрыПакетовОперативныйСрезПоследних.Характеристика.Наименование
		|	КОНЕЦ,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер.Наименование,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ДатаСмены,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыПакетовОперативныйСрезПоследних.Смена = ЗНАЧЕНИЕ(Перечисление.Смены.смена_8_20)
		|			ТОГДА ""День""
		|		ИНАЧЕ ""Ночь""
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, СерийныйНомер.Наименование = &Номер) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|ГДЕ
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Актуальность <> ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Удален)";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СообщениеЮзеру = "Нет данных по штрихкоду";
		Отказ = Истина;
	Иначе		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СерийныйНомерНаименование   = ВыборкаДетальныеЗаписи.СерийныйНомерНаименование;
			СостояниеНаименование   	= Строка(ВыборкаДетальныеЗаписи.Состояние);	
			УпаковкаНаименование  		= ВыборкаДетальныеЗаписи.УпаковкаНаименование;
			УпаковкаИдентификатор 		= ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Упаковка),Строка(ВыборкаДетальныеЗаписи.Упаковка.УникальныйИдентификатор()), "");
			Вес				  		    = Строка(ВыборкаДетальныеЗаписи.Вес);
			ДатаСмены					= ВыборкаДетальныеЗаписи.ДатаСмены;
			Смена						= ВыборкаДетальныеЗаписи.Смена;
		КонецЦикла;
	
	КонецЕсли;
	
	СтруктураШтрихкод = Новый Структура;
	СтруктураШтрихкод.Вставить("СерийныйНомер",					СерийныйНомерНаименование);
	СтруктураШтрихкод.Вставить("Состояние",						СостояниеНаименование);
	СтруктураШтрихкод.Вставить("Упаковка",						УпаковкаНаименование);
	СтруктураШтрихкод.Вставить("УпаковкаУИД",					УпаковкаИдентификатор);
	СтруктураШтрихкод.Вставить("Вес",							Вес);
	СтруктураШтрихкод.Вставить("ДатаСмены",						ДатаСмены);
	СтруктураШтрихкод.Вставить("Смена",							Смена);
	СтруктураШтрихкод.Вставить("Сообщение",						СообщениеЮзеру);
	СтруктураШтрихкод.Вставить("ШтрихкодНайден",				Не Отказ); 
	
	Запись = Новый ЗаписьJSON;
	
	Попытка
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		Запись.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(Запись, СтруктураШтрихкод);
	Исключение
	КонецПопытки;
	
	Ответ = Запись.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Информация,,, "Запрос характеристик пакета по штрихкоду");
		
	Возврат HTTPОтвет;

КонецФункции

Функция ChangePackAction(Запрос)  
	                                                                                   //номер пакета       вес      УИД Характеристики  "упаковка 0,65 т."     ответственный
	//пример запроса: http://rfp01-hst021/UT_LK_COPY_AM/hs/ExchangePack/ChangePack/?code=dg-24-034159&weight=665&packid=163d733a-7be0-11eb-bb9e-00155d080105&nameid=
    // & - разделитель параметров
	
	Штрихкод 	= Запрос.ПараметрыЗапроса.Получить("code");
	Вес 	 	= Запрос.ПараметрыЗапроса.Получить("weight");
	УпаковкаУИД = Запрос.ПараметрыЗапроса.Получить("packid");
//	ДатаСмены	= Запрос.ПараметрыЗапроса.Получить("date");
//	Смена		= Запрос.ПараметрыЗапроса.Получить("shift");  
	ОтветственныйИД = Запрос.ПараметрыЗапроса.Получить("nameid");
	
	// сюда нужно передать ссылку участок
	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Справочники.алк_Участки.НайтиПоКоду("000000023"), ТекущаяДата());
	
	Смена = ПараметрыСменыПоТекущейДате.Смена;
	ДатаСмены = ПараметрыСменыПоТекущейДате.ДатаСмены;	
	
	Участок = Справочники.алк_Участки.НайтиПоКоду("000000030"); //Участок упаковки (ДГ)
	
	Операция = Справочники.алк_ОперацииПроизводства.Упаковка;

		
	Если ЗначениеЗаполнено(УпаковкаУИД) Тогда
		Упаковка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(УпаковкаУИД));
	Иначе
		Упаковка = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Вес) Тогда
		Вес = Число(Вес);
	КонецЕсли;
	
	Если Штрихкод = Неопределено тогда
		Штрихкод = Запрос.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Ответственный = ВернутьПользователя(ОтветственныйИД);	

	Номер = ЛатВКир(Штрихкод);
	СерийныйНомер   = НайтиСерийныйНомер(Номер);
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Номенклатура 	= СерийныйНомер.Владелец;
		
		//Расчетные параметры
		Объемы = РфпСервер.ОбъемыПакета(Упаковка, Вес, , Неопределено);	
		Объем = Объемы.Объем;
		ОбъемТаможня = Объемы.ОбъемТаможня;
		
		стрПакет = Новый Структура("Номенклатура, Характеристика, КоличествоСостав, Объем, ОбъемТаможня", Номенклатура, Упаковка, Вес, Объем, ОбъемТаможня); 
		РассчетныеПараметры = РфпСервер.ЗаполнитьСтруктуруПараметровПакета(стрПакет, ТекущаяДата(), Неопределено);
		
		
		Если Константы.алк_НоваяСхемаДГ.Получить() Тогда // создание пакета по новой схеме	
			
			Ответ = ""; 	
			СоздатьПакетНаСервере(Ответ, Участок, Операция, ДатаСмены, Смена, СерийныйНомер, стрПакет);	
			
		Иначе 
			
			//Заполняем данные для проверки и последующей записи
			МенеджерЗаписи = РегистрыСведений.алк_ПараметрыПакетовОперативный.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.СерийныйНомер = СерийныйНомер;
			МенеджерЗаписи.Актуальность = Перечисления.алк_ОперативнаяАктуальностьПакетов.Актуален;
			МенеджерЗаписи.Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы;
			МенеджерЗаписи.ДатаСмены = ДатаСмены;
			МенеджерЗаписи.Смена = Смена;
			МенеджерЗаписи.Ответственный = Ответственный;
			МенеджерЗаписи.НомерПакета = ПолучитьНомерПакетаИзСерийногоНомера(Штрихкод);
			МенеджерЗаписи.ПериодПакета = НачалоГода(ТекущаяДата());
			МенеджерЗаписи.КоличествоСостав = Вес;
			МенеджерЗаписи.Объем = РассчетныеПараметры.Объем;
			МенеджерЗаписи.Характеристика = Упаковка;//Упаковка
			МенеджерЗаписи.ОбъемТаможня = РассчетныеПараметры.ОбъемТаможня;
			МенеджерЗаписи.ВесНеттоТаможня = РассчетныеПараметры.ВесНеттоТаможня;
			МенеджерЗаписи.ВесБруттоТаможня = РассчетныеПараметры.ВесБруттоТаможня;
			МенеджерЗаписи.Сертификат = Справочники.СертификатыНаПродукцию.ПустаяСсылка(); 
			МенеджерЗаписи.Участок = Участок; //Участок упаковки (ДГ)
			
			ПопыткаУстановкиПакета = УстановитьИзменитьПакетНаСервере(МенеджерЗаписи);
			
			Ответ = ПопыткаУстановкиПакета.Ответ;
			
		КонецЕсли;
		
	Иначе
		Ответ = "Ошибка! Серийный номер не найден!";
	КонецЕсли;

	/////////////////////////////////
	
	//Устанавливаем или изменяем пакет	
	ЗаписьJSON = Новый ЗаписьJSON;

	СтруктураПараметров = Новый Структура("Ответ", Ответ);
	
	Попытка
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);
	Исключение
	КонецПопытки;
	
	Ответ = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("%1 запросил изменение пакета %2",Ответственный, СерийныйНомер));
	
	Возврат HTTPОтвет; 
	
КонецФункции

Функция DeletePackAction(Запрос)
	Штрихкод 	= Запрос.ПараметрыЗапроса.Получить("code");
	Если Штрихкод = Неопределено тогда
		Штрихкод = Запрос.ПолучитьТелоКакСтроку();
	КонецЕсли;
	Номер = ЛатВКир(Штрихкод);
	
	СерийныйНомер   = НайтиСерийныйНомер(Номер);
	Если НЕ ЗначениеЗаполнено(СерийныйНомер) Тогда
		HTTPОтвет = Новый HTTPСервисОтвет(500); 	
		Возврат HTTPОтвет;
	КонецЕсли;
			
	ПараметрыПакетовОперативный = РегистрыСведений.алк_ПараметрыПакетовОперативный.СоздатьНаборЗаписей();
	ПараметрыПакетовОперативный.Отбор.СерийныйНомер.Установить(СерийныйНомер);
	ПараметрыПакетовОперативный.Прочитать();
	Для Каждого Запись Из ПараметрыПакетовОперативный Цикл			
		Запись.Актуальность = Перечисления.алк_ОперативнаяАктуальностьПакетов.Удален;  		
	КонецЦикла;
		
	Попытка
		ПараметрыПакетовОперативный.Записать();
	    Ответ = "Успешно";
	Исключение
		Ответ = "При удалении пакета произошла ошибка! Не удалось записать в оперативный регистр.";
	КонецПопытки;

	СтруктураПараметров = Новый Структура("Ответ", Ответ);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
	Попытка
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров);
	Исключение
	КонецПопытки;
	
	Ответ = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);

	ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запрос удаления пакета %2", СерийныйНомер));
	
	Возврат HTTPОтвет;	
	
КонецФункции

Функция GetDownloadUsersAction(Запрос)
	Структура = Новый Структура;
	СписокПользователей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.ИдентификаторПользователяИБ КАК ИмяВ1С,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Отчество, """") КАК Отчество
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|		ПО Пользователи.Ссылка = ФИОФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.Служебный";
	
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		Фамилия  = СокрЛП(ВыборкаИзРезультатаЗапроса.Фамилия);
		Имя 	 = СокрЛП(ВыборкаИзРезультатаЗапроса.Имя);
		Отчество = СокрЛП(ВыборкаИзРезультатаЗапроса.Отчество);
		
		ДанныеФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыборкаИзРезультатаЗапроса.Наименование, " ", Истина);
		Если ПустаяСтрока(Фамилия) И ДанныеФИО.Количество() > 0 Тогда
			Фамилия = СокрЛП(ДанныеФИО[0]);
		КонецЕсли;
		Если ПустаяСтрока(Имя) И ДанныеФИО.Количество() > 1 Тогда
			Имя = СокрЛП(ДанныеФИО[1]);
		КонецЕсли;
		Если ПустаяСтрока(Отчество) И ДанныеФИО.Количество() > 2 Тогда
			Отчество = СокрЛП(ДанныеФИО[2]);
		КонецЕсли;
		
		СтрокаДанныхПользователя = Новый Структура;
		СтрокаДанныхПользователя.Вставить("Наименование", 	СокрЛП(ВыборкаИзРезультатаЗапроса.Наименование));
		СтрокаДанныхПользователя.Вставить("Фамилия", 		СокрЛП(Фамилия));
		СтрокаДанныхПользователя.Вставить("Имя", 			СокрЛП(Имя));
		СтрокаДанныхПользователя.Вставить("Отчество", 		СокрЛП(Отчество));
		СтрокаДанныхПользователя.Вставить("ИмяВ1С", 		СокрЛП(ВыборкаИзРезультатаЗапроса.ИмяВ1С));
		
		СписокПользователей.Добавить(СтрокаДанныхПользователя);		
	КонецЦикла;
	
	Структура.Вставить("ДанныеПользователей", СписокПользователей);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализации);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);
	
	Возврат HTTPОтвет;
КонецФункции

Функция CreateTransferAction(Запрос)
	
	Перем ДатаДокумента, ДатаСмены, Смена, Ответственный, ДанныеШапкиДокументов, ДанныеТабличныхЧастейДокументов;
	
	Ответ = ""; 
	
	JSONТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Если НЕ JSONТелоЗапроса = Неопределено Тогда	
		
		ВидПеремещения	= Запрос.ПараметрыЗапроса.Получить("typeoftransfer");
		ТипПользователя	= Запрос.ПараметрыЗапроса.Получить("typeofuser");
		
		МассивДокументовДляУдаления = Новый Массив;
		ОтветСервера = Новый Структура;
		
		ПолучитьДанныеДляЗагрузки(Запрос, JSONТелоЗапроса, ДатаДокумента, ДатаСмены, Смена, Ответственный, ДанныеШапкиДокументов, ДанныеТабличныхЧастейДокументов);
		
		Если ДанныеШапкиДокументов <> Неопределено И ДанныеТабличныхЧастейДокументов <> Неопределено Тогда
			Для Каждого СтрокаШапкиДокумента Из ДанныеШапкиДокументов Цикл
				
				СтрокаШапкиДокумента = ПолучитьСтруктуруИзСоответствия(СтрокаШапкиДокумента);
				СтрокиТабличнойЧасти = ДанныеТабличныхЧастейДокументов.Получить(СтрокаШапкиДокумента.Ссылка);
				
				//Соберем общую ТЧ для загрузки в документы
				ТЗЗапасов = Новый ТаблицаЗначений;
				ТЗЗапасов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
				ТЗЗапасов.Колонки.Добавить("СерийныйНомер", Новый ОписаниеТипов("СправочникСсылка.СерийныеНомера"));
				
				Для Каждого СтрокаТабличнойЧасти Из СтрокиТабличнойЧасти Цикл		
					СтрокаТабличнойЧасти 	= ПолучитьСтруктуруИзСоответствия(СтрокаТабличнойЧасти);
					СерийныйНомер   = НайтиСерийныйНомер(ЛатВКир(СтрокаТабличнойЧасти.СерийныйНомер));
					Если ЗначениеЗаполнено(СерийныйНомер) Тогда
						Запас = ТЗЗапасов.Добавить();
						Запас.Номенклатура = СерийныйНомер.Владелец;
						Запас.СерийныйНомер = СерийныйНомер;
					Иначе
						Продолжить;
					КонецЕсли;	
				КонецЦикла;
				
				Если ТЗЗапасов.Количество() > 0 Тогда
					ЭтоШпон = (ТЗЗапасов[0].Номенклатура = Справочники.Номенклатура.Шпон);				
					
					Если НЕ ЭтоШпон Тогда
						НовыйДокумент = Документы.алк_ПеремещениеЗапасов.СоздатьДокумент();	
						НовыйДокумент.Ответственный = Ответственный;
						
						Если ТипПользователя = "ДГ" Тогда		
							НовыйДокумент.Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы;
							Строка = НовыйДокумент.ВидыНоменклатуры.Добавить();
							Строка.ВидНоменклатуры = Справочники.КатегорииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("580ad4af-7bde-11eb-bb9e-00155d080105"));
						Иначе
							НовыйДокумент.Направление = Перечисления.алк_НаправленияДеятельности.Лесопиление;
							Строка = НовыйДокумент.ВидыНоменклатуры.Добавить();
							Строка.ВидНоменклатуры = Справочники.КатегорииНоменклатуры.Пиломатериал;	
						КонецЕсли;
						
						Если ВидПеремещения = "Из производства" И ТипПользователя = "ДГ" Тогда
							НовыйДокумент.ВидОперации 					= Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства;
							СкладыСтруктура = РфпСервер.ПолучитьСкладыДГ(ТекущаяДата());
							НовыйДокумент.СтруктурнаяЕдиница 			= СкладыСтруктура.ДГ_Производство; // ДГ Производство  
							НовыйДокумент.СтруктурнаяЕдиницаПолучатель 	= СкладыСтруктура.ДГ_СГП; // ДГ СГП	
						ИначеЕсли ВидПеремещения = "Из производства" И ТипПользователя <> "ДГ" Тогда
							НовыйДокумент.ВидОперации 					= Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП;
							НовыйДокумент.СтруктурнаяЕдиница           	= Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
							НовыйДокумент.Штабель						= Справочники.алк_Штабели.НайтиПоКоду("000000012");	//Участок приемки на СГП
							НовыйДокумент.СтруктурнаяЕдиницаПолучатель 	= Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции	
						Иначе		
							НовыйДокумент.ВидОперации 					= Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение;
							НовыйДокумент.СтруктурнаяЕдиница 			= Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.СкладОтправитель)); 
							НовыйДокумент.СтруктурнаяЕдиницаПолучатель 	= Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.СкладПолучатель));		
						КонецЕсли;
						
						Для Каждого СтрокаТабличнойЧасти Из ТЗЗапасов Цикл		
							Запас = НовыйДокумент.Запасы.Добавить();
							ЗаполнитьЗначенияСвойств(Запас, СтрокаТабличнойЧасти);
							Запас.КоличествоПакетов = 1;
							Запас.НомерСерии = Число(Сред(СтрокаТабличнойЧасти.СерийныйНомер,7));	
						КонецЦикла;
						
					Иначе
						НовыйДокумент = Документы.алк_Перемещение.СоздатьДокумент();
						НовыйДокумент.Участок = Справочники.алк_Участки.НайтиПоКоду("000000038");
						НовыйДокумент.Ответственный 	= ВернутьПользователя(Запрос.ПараметрыЗапроса.Получить("nameid"), Истина);
						
						НовыйДокумент.СкладОтправитель 	= Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.СкладОтправитель)); 
						НовыйДокумент.СкладПолучатель 	= Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.СкладПолучатель));	
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ТЗЗапасов.Номенклатура,
						|	ТЗЗапасов.СерийныйНомер
						|ПОМЕСТИТЬ вт
						|ИЗ
						|	&ТЗЗапасов КАК ТЗЗапасов
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	алк_ОстаткиЗапасовОстатки.Номенклатура,
						|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
						|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Количество,
						|	алк_ОстаткиЗапасовОстатки.Сертификат,
						|	алк_ОстаткиЗапасовОстатки.Характеристика
						|ИЗ
						|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
						|			,
						|			(Номенклатура, СерийныйНомер) В
						|				(ВЫБРАТЬ
						|					ТЗЗапасов.Номенклатура,
						|					ТЗЗапасов.СерийныйНомер
						|				ИЗ
						|					вт КАК ТЗЗапасов)) КАК алк_ОстаткиЗапасовОстатки";
						Запрос.УстановитьПараметр("ТЗЗапасов", ТЗЗапасов);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Запас = НовыйДокумент.Запасы.Добавить();
							ЗаполнитьЗначенияСвойств(Запас, ВыборкаДетальныеЗаписи);
						КонецЦикла;							
						
					КонецЕсли;
					
					НовыйДокумент.Организация 		= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e1faddcf-80a1-11eb-bb9f-00155d080105"));
					НовыйДокумент.ДатаСмены			= Дата(ДатаСмены);
					НовыйДокумент.Смена 			= Смена;	 
					НовыйДокумент.Дата 				= Дата(СтрокаШапкиДокумента.ДатаДокумента);
					НовыйДокумент.Проведен  		= Ложь;	
		
					Попытка 
						НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
						МассивДокументовДляУдаления.Добавить(Новый структура("УИД", СтрокаШапкиДокумента.Ссылка));
					Исключение
						Ответ = ОписаниеОшибки();
						//HTTPОтвет = Новый HTTPСервисОтвет(500); 	
						//Возврат HTTPОтвет;
					КонецПопытки;
					
				Иначе
					//МассивДокументовДляУдаления.Добавить(Новый структура("УИД", СтрокаШапкиДокумента.Ссылка));
					Ответ = "В документе(ах) используются несуществующие серийные номера" 
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ОтветСервера.Вставить("Удалить", МассивДокументовДляУдаления);
		Если Ответ <> "" Тогда
			ОтветСервера.Вставить("Ответ", Ответ);
		КонецЕсли;	
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
		ЗаписатьJSON(ЗаписьJSON, ОтветСервера, НастройкиСериализации);
		СериализованнаяСтрока = ЗаписьJSON.Закрыть();
		
		HTTPОтвет = Новый HTTPСервисОтвет(200);
		HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
		HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);
		
	Иначе
		HTTPОтвет = Новый HTTPСервисОтвет(500);
		HTTPОтвет.Заголовки.Insert("Content-Type","text/html1; charset=utf-8");
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Информация, НовыйДокумент, СтрШаблон("%1 создал/изменил перемещение",Ответственный));
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция CreateShipmentAction(Запрос)
	
	Перем ДатаДокумента, ДатаСмены, Смена, Ответственный, ДанныеШапкиДокументов, ДанныеТабличныхЧастейДокументов;
	
	JSONТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Если НЕ JSONТелоЗапроса = Неопределено Тогда
		ВидОтгрузки	= Запрос.ПараметрыЗапроса.Получить("typeofshipment");
		ТипПользователя	= Запрос.ПараметрыЗапроса.Получить("typeofuser");
		
		ПолучитьДанныеДляЗагрузки(Запрос, JSONТелоЗапроса, ДатаДокумента, ДатаСмены, Смена, Ответственный, ДанныеШапкиДокументов, ДанныеТабличныхЧастейДокументов);
		
		МассивДокументовДляУдаления = Новый Массив;
		ДокументыДляУдаления = Новый Структура;
		//
		Если ДанныеШапкиДокументов <> Неопределено И ДанныеТабличныхЧастейДокументов <> Неопределено Тогда
			Для Каждого СтрокаШапкиДокумента Из ДанныеШапкиДокументов Цикл
				
				СтрокаШапкиДокумента = ПолучитьСтруктуруИзСоответствия(СтрокаШапкиДокумента);
				ДополнениеДокумента = Ложь;
				
				Если ВидОтгрузки = "Контейнер" Тогда
					
					Если НЕ ЗначениеЗаполнено(СтрокаШапкиДокумента.ЗаказСсылка) Тогда //Проверяем есть ли заказ, если он есть значит ищем ссылку на конкретный документ для дополнения 
						КонтейнерДляДополнения = ПроверкаНаДополнениеКонтенераПоИдентификатору(СтрокаШапкиДокумента.ИдентификаторТС);		
					Иначе
						КонтейнерДляДополнения = Документы.алк_ЗагрузкаКонтейнера.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.Ссылка));
					КонецЕсли;
					
					Если КонтейнерДляДополнения = Неопределено Тогда
						НовыйДокумент							= Документы.алк_ЗагрузкаКонтейнера.СоздатьДокумент();
						НовыйДокумент.ИдентификаторКонтейнера	= СтрокаШапкиДокумента.ИдентификаторТС;
					Иначе
						НовыйДокумент = КонтейнерДляДополнения.ПолучитьОбъект();
						ДополнениеДокумента = Истина;
					КонецЕсли;
					
				Иначе
					
					Если НЕ ЗначениеЗаполнено(СтрокаШапкиДокумента.ЗаказСсылка) Тогда //Проверяем есть ли заказ, если он есть значит ищем ссылку на конкретный документ для дополнения 
						НакладнаяДляДополнения = ПроверкаНаДополнениеНакладнойПоИдентификатору(СтрокаШапкиДокумента.ИдентификаторТС);		
					Иначе
						НакладнаяДляДополнения = Документы.алк_РасходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.Ссылка));
					КонецЕсли;	
					
					Если НакладнаяДляДополнения = Неопределено Тогда
						НовыйДокумент							= Документы.алк_РасходнаяНакладная.СоздатьДокумент();
						НовыйДокумент.ВидОперации 				= Перечисления.алк_ВидыДокументаРН.РеализацияЭкспортТД;
						НовыйДокумент.СтрокаИДКонтейнеров		= СтрокаШапкиДокумента.ИдентификаторТС;
						
						Если ТипПользователя = "ДГ" Тогда
							НовыйДокумент.Направление 				= Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы;
						Иначе
							НовыйДокумент.Направление 				= Перечисления.алк_НаправленияДеятельности.Лесопиление;
						КонецЕсли;
						
					Иначе
						НовыйДокумент = НакладнаяДляДополнения.ПолучитьОбъект();
						ДополнениеДокумента = Истина;
					КонецЕсли;
					
					НовыйДокумент.ДатаСмены					= Дата(ДатаСмены);
					НовыйДокумент.Смена 					= Смена;
					
				КонецЕсли;	
				
				Если ТипПользователя = "ДГ" Тогда
					НовыйДокумент.Организация 					= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e1faddcf-80a1-11eb-bb9f-00155d080105"));//Древесные гранулы
				Иначе
					НовыйДокумент.Организация 					= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("06b5a0cb-5556-11e7-9c78-3052cbd25cef"));// Амурская ЛК
				КонецЕсли;	
				
				НовыйДокумент.Ответственный 				= Ответственный; 
				НовыйДокумент.Дата 							= Дата(СтрокаШапкиДокумента.ДатаДокумента);	
				НовыйДокумент.СтруктурнаяЕдиница 			= Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.Склад));
				
				Если НЕ ДополнениеДокумента Тогда
					Строка = НовыйДокумент.ВидыНоменклатуры.Добавить();
					Если ТипПользователя = "ДГ" Тогда
						Строка.ВидНоменклатуры = Справочники.КатегорииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("580ad4af-7bde-11eb-bb9e-00155d080105"));//Пелеты
					Иначе	
						Строка.ВидНоменклатуры = Справочники.КатегорииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("d8d84d3f-57c7-11e7-9c78-3052cbd25cef"));//Пиломатериал (Кат)
					КонецЕсли;
				КонецЕсли;
				
				НовыйДокумент.Проведен  = Ложь;
				
				СтрокиТабличнойЧасти = ДанныеТабличныхЧастейДокументов.Получить(СтрокаШапкиДокумента.Ссылка);
				
				Для Каждого СтрокаТабличнойЧасти Из СтрокиТабличнойЧасти Цикл		
					СтрокаТабличнойЧасти 	= ПолучитьСтруктуруИзСоответствия(СтрокаТабличнойЧасти);
					СерийныйНомер   = НайтиСерийныйНомер(ЛатВКир(СтрокаТабличнойЧасти.СерийныйНомер));
					Если ЗначениеЗаполнено(СерийныйНомер) Тогда
						Запас = НовыйДокумент.Запасы.Добавить();
						Запас.Номенклатура = СерийныйНомер.Владелец;
						Запас.СерийныйНомер = СерийныйНомер;
						Запас.КоличествоПакетов = 1;
						Запас.НомерСерии = Число(Сред(СерийныйНомер,7));
					Иначе
						Продолжить;
					КонецЕсли;	
				КонецЦикла;
				
				Попытка
					НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
					МассивДокументовДляУдаления.Добавить(Новый структура("УИД", СтрокаШапкиДокумента.Ссылка));
				Исключение
					Ошибка = ОписаниеОшибки();
					HTTPОтвет = Новый HTTPСервисОтвет(500); 	
					Возврат HTTPОтвет;
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		ДокументыДляУдаления.Вставить("Удалить", МассивДокументовДляУдаления);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
		ЗаписатьJSON(ЗаписьJSON, ДокументыДляУдаления, НастройкиСериализации);
		СериализованнаяСтрока = ЗаписьJSON.Закрыть();
		
		HTTPОтвет = Новый HTTPСервисОтвет(200);
		HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
		HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);	
	Иначе
		HTTPОтвет = Новый HTTPСервисОтвет(500);
		HTTPОтвет.Заголовки.Insert("Content-Type","text/html1; charset=utf-8");
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Информация, НовыйДокумент, СтрШаблон("%1 создал/изменил отгрузку",Ответственный));
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция CreateInventoryAction(Запрос)
	
	Перем ДатаДокумента, ДатаСмены, Смена, Ответственный, ДанныеШапкиДокументов, ДанныеТабличныхЧастейДокументов;
	
	JSONТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Если НЕ JSONТелоЗапроса = Неопределено Тогда	
		
		МассивДокументовДляУдаления = Новый Массив;
		ДокументыДляУдаления = Новый Структура;
		
		ПолучитьДанныеДляЗагрузки(Запрос, JSONТелоЗапроса, ДатаДокумента, ДатаСмены, Смена, Ответственный, ДанныеШапкиДокументов, ДанныеТабличныхЧастейДокументов);
		
		Если ДанныеШапкиДокументов <> Неопределено И ДанныеТабличныхЧастейДокументов <> Неопределено Тогда
			Для Каждого СтрокаШапкиДокумента Из ДанныеШапкиДокументов Цикл
				
				СтрокаШапкиДокумента = ПолучитьСтруктуруИзСоответствия(СтрокаШапкиДокумента);
				
				НовыйДокумент = Документы.алк_ИнвентаризацияПоСериям.СоздатьДокумент(); 
				НовыйДокумент.Организация 					= Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("06b5a0cb-5556-11e7-9c78-3052cbd25cef"));// Амурская ЛК
				НовыйДокумент.ДатаСмены						= Дата(ДатаСмены);
				НовыйДокумент.Смена 						= Смена;
				НовыйДокумент.Ответственный 				= Ответственный; 
				НовыйДокумент.Дата 							= Дата(СтрокаШапкиДокумента.ДатаДокумента);		
				НовыйДокумент.СтруктурнаяЕдиница 			= Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапкиДокумента.Склад)); 	
				//НовыйДокумент.Номенклатура 					= Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001");//Пиломатериал
				НовыйДокумент.Проведен  = Ложь;
				
				СтрокиТабличнойЧасти = ДанныеТабличныхЧастейДокументов.Получить(СтрокаШапкиДокумента.Ссылка);
				
				Для Каждого СтрокаТабличнойЧасти Из СтрокиТабличнойЧасти Цикл		
					СтрокаТабличнойЧасти 	= ПолучитьСтруктуруИзСоответствия(СтрокаТабличнойЧасти);
					СерийныйНомер   = НайтиСерийныйНомер(ЛатВКир(СтрокаТабличнойЧасти.СерийныйНомер));
					Если ЗначениеЗаполнено(СерийныйНомер) Тогда
						Факт = НовыйДокумент.ЗапасыРеальные.Добавить();
						Факт.СерийныйНомер = СерийныйНомер;
						Факт.КоличествоФакт = 1;
						Факт.НомерПакета = Число(Сред(СерийныйНомер,7));
					Иначе
						Продолжить;
					КонецЕсли;	
				КонецЦикла;
				
				Попытка
					НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
					МассивДокументовДляУдаления.Добавить(Новый структура("УИД", СтрокаШапкиДокумента.Ссылка));
				Исключение
					Ошибка = ОписаниеОшибки();
					HTTPОтвет = Новый HTTPСервисОтвет(500); 	
					Возврат HTTPОтвет;
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		ДокументыДляУдаления.Вставить("Удалить", МассивДокументовДляУдаления);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
		ЗаписатьJSON(ЗаписьJSON, ДокументыДляУдаления, НастройкиСериализации);
		СериализованнаяСтрока = ЗаписьJSON.Закрыть();
		
		HTTPОтвет = Новый HTTPСервисОтвет(200);
		HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
		HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);
		
	Иначе
		HTTPОтвет = Новый HTTPСервисОтвет(500);
		HTTPОтвет.Заголовки.Insert("Content-Type","text/html1; charset=utf-8");
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Информация, НовыйДокумент, СтрШаблон("%1 создал/изменил инвентаризацию",Ответственный));
	
	Возврат HTTPОтвет;

КонецФункции

Функция UploadShipmentAction(Запрос)
	
	//ДатаСмены		= Запрос.ПараметрыЗапроса.Получить("date");
	//Смена			= Запрос.ПараметрыЗапроса.Получить("shift");  
	//ОтветственныйИД = Запрос.ПараметрыЗапроса.Получить("nameid");
	ВидОтгрузки		= Запрос.ПараметрыЗапроса.Получить("typeofshipment");
	//ТипПользователя	= Запрос.ПараметрыЗапроса.Получить("typeofuser");
	
	МассивДокументовВыгрузки = Новый Массив;
	//ДокументыКВыгрузке = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗагрузкаКонтейнера.Ссылка,
		|	алк_ЗагрузкаКонтейнера.Номер,
		|	алк_ЗагрузкаКонтейнера.Дата,
		|	алк_ЗагрузкаКонтейнера.СтруктурнаяЕдиница КАК Склад,
		|	алк_ЗагрузкаКонтейнера.ИдентификаторКонтейнера КАК ИдентификаторТС,
		|	алк_ЗагрузкаКонтейнера.Ответственный КАК Ответственный,
		|	алк_ЗагрузкаКонтейнера.Заказ.Ссылка КАК ЗаказСсылка,
		|	алк_ЗагрузкаКонтейнера.Участок
		|ИЗ
		|	Документ.алк_ЗагрузкаКонтейнера КАК алк_ЗагрузкаКонтейнера
		|ГДЕ
		|	&ВидОтгрузки = ""Контейнер""
		|	И алк_ЗагрузкаКонтейнера.ПометкаУдаления = ЛОЖЬ
		|	И алк_ЗагрузкаКонтейнера.Проведен = ЛОЖЬ
		|	И алк_ЗагрузкаКонтейнера.Дата >= &ДатаНачалаПоискаДокументов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_РасходнаяНакладная.Ссылка,
		|	алк_РасходнаяНакладная.Номер,
		|	алк_РасходнаяНакладная.Дата,
		|	алк_РасходнаяНакладная.СтруктурнаяЕдиница,
		|	алк_РасходнаяНакладная.СтрокаИДКонтейнеров,
		|	алк_РасходнаяНакладная.Ответственный,
		|	алк_РасходнаяНакладная.Заказ.Ссылка,
		|	алк_РасходнаяНакладная.Участок
		|ИЗ
		|	Документ.алк_РасходнаяНакладная КАК алк_РасходнаяНакладная
		|ГДЕ
		|	&ВидОтгрузки <> ""Контейнер""
		|	И алк_РасходнаяНакладная.ПометкаУдаления = ЛОЖЬ
		|	И алк_РасходнаяНакладная.Проведен = ЛОЖЬ
		|	И алк_РасходнаяНакладная.Направление <> &НаправлениеДревесныеГранулы
		|	И алк_РасходнаяНакладная.Дата >= &ДатаНачалаПоискаДокументов";
	
	Запрос.УстановитьПараметр("ВидОтгрузки", ВидОтгрузки);
	Запрос.УстановитьПараметр("НаправлениеДревесныеГранулы", Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы);
	//Запрос.УстановитьПараметр("ВидНоменклатурыПелеты", Справочники.КатегорииНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("580ad4af-7bde-11eb-bb9e-00155d080105")));//Пелеты
	Запрос.УстановитьПараметр("ДатаНачалаПоискаДокументов", ТекущаяДата() - 86400);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокКВыгрузке = Новый Структура;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Участок) Тогда
			ДокКВыгрузке.Вставить("ЗаказСсылка", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаказСсылка), Строка(ВыборкаДетальныеЗаписи.ЗаказСсылка.УникальныйИдентификатор()), Строка(Документы.алк_Аддендумы.ПустаяСсылка().УникальныйИдентификатор())));	
		Иначе
			ДокКВыгрузке.Вставить("ЗаказСсылка", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаказСсылка), Строка(ВыборкаДетальныеЗаписи.ЗаказСсылка.УникальныйИдентификатор()), Строка(Документы.алк_ЗаказПокупателя.ПустаяСсылка().УникальныйИдентификатор())));
		КонецЕсли;	
		ДокКВыгрузке.Вставить("ДокСсылка", Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));
		ДокКВыгрузке.Вставить("Склад", ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Склад), Строка(ВыборкаДетальныеЗаписи.Склад.УникальныйИдентификатор()), Строка(Справочники.СтруктурныеЕдиницы.ПустаяСсылка().УникальныйИдентификатор())));
		ДокКВыгрузке.Вставить("Номер", ВыборкаДетальныеЗаписи.Номер);
		ДокКВыгрузке.Вставить("Дата", ВыборкаДетальныеЗаписи.Дата);
		ДокКВыгрузке.Вставить("ИдентификаторТС", ВыборкаДетальныеЗаписи.ИдентификаторТС);
		МассивДокументовВыгрузки.Добавить(ДокКВыгрузке);
	КонецЦикла;
	
	//ДокументыКВыгрузке.Вставить("Результат", МассивДокументовВыгрузки);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписатьJSON(ЗаписьJSON, МассивДокументовВыгрузки, НастройкиСериализации);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);
	
	Возврат HTTPОтвет;
	
	//Ответ = Новый HTTPСервисОтвет(200);
	//Возврат Ответ;
КонецФункции

Функция GetPkgAction(Запрос)
	Структура = Новый Структура;
	СписокУпаковок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Наименование,
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("9c065106-7bde-11eb-bb9e-00155d080105")));
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаДанныхУпаковки = Новый Структура;
		СтрокаДанныхУпаковки.Вставить("Упаковка", 	СокрЛП(ВыборкаДетальныеЗаписи.Наименование));
		СтрокаДанныхУпаковки.Вставить("УпаковкаУИД", 		?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка),Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()), ""));	
		СписокУпаковок.Добавить(СтрокаДанныхУпаковки);		
	КонецЦикла;
	
	Структура.Вставить("Упаковки", СписокУпаковок);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализации);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);
	
	Возврат HTTPОтвет;

КонецФункции

Функция GetStructuralUnitsAction(Запрос)
	
	ТипПользователя	= Запрос.ПараметрыЗапроса.Получить("typeofuser");

	Структура = Новый Структура;
	СписокСтруктурныхЕдиниц = Новый Массив;
	
	Если ТипПользователя = "ДГ" Тогда
		СкладыСтруктура = РфпСервер.ПолучитьСкладыДГ(ТекущаяДата());
		Для Каждого СтрСклад Из СкладыСтруктура Цикл
			СтрокаДанныхСтруктурнойЕдиницы = Новый Структура;
			СтрокаДанныхСтруктурнойЕдиницы.Вставить("Склад",СокрЛП(СтрСклад.Значение.Наименование));
			СтрокаДанныхСтруктурнойЕдиницы.Вставить("СкладУИД", ?(ЗначениеЗаполнено(СтрСклад.Значение.Ссылка),Строка(СтрСклад.Значение.Ссылка.УникальныйИдентификатор()), ""));	
			СписокСтруктурныхЕдиниц.Добавить(СтрокаДанныхСтруктурнойЕдиницы);		
		КонецЦикла;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтруктурныеЕдиницы.Ссылка
			|ИЗ
			|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
			|ГДЕ
			|	(СтруктурныеЕдиницы.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
			|			ИЛИ СтруктурныеЕдиницы.Код = ""ПБ-000064"")"; //ПБ-000064 Буфер упаковки
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаДанныхСтруктурнойЕдиницы = Новый Структура;
			СтрокаДанныхСтруктурнойЕдиницы.Вставить("Склад",СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.Наименование));
			СтрокаДанныхСтруктурнойЕдиницы.Вставить("СкладУИД", Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()));	
			СписокСтруктурныхЕдиниц.Добавить(СтрокаДанныхСтруктурнойЕдиницы);
		КонецЦикла;
	КонецЕсли;
	
	Структура.Вставить("Склады", СписокСтруктурныхЕдиниц);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализации);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);
	
	Возврат HTTPОтвет;

	//Ответ = Новый HTTPСервисОтвет(200);
	//Возврат Ответ;
КонецФункции

Функция CheckPackToOrderAction(Запрос)
	
	СтруктураОтвета = Новый Структура;
	
	ЗаказСсылкаСтрокой	= Запрос.ПараметрыЗапроса.Получить("reforder");
	Штрихкод 	= Запрос.ПараметрыЗапроса.Получить("code");
	
	Номер = ЛатВКир(Штрихкод);
	СерийныйНомер   = НайтиСерийныйНомер(Номер);
	
	ЗаказСсылка = Документы.алк_ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗаказСсылкаСтрокой));	
	
	АддендумСсылка = Документы.алк_Аддендумы.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗаказСсылкаСтрокой));	
		
	Если ЗначениеЗаполнено(ЗаказСсылка.Номер) И ЗаказСсылка <> Документы.алк_ЗаказПокупателя.ПустаяСсылка() Тогда
				
		ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(СерийныйНомер);
		
		ТаблицаЗаказа = ЗаказСсылка.ЗапасыАссортимент;
		ОтборДляПоиска = Новый Структура;
		ОтборДляПоиска.Вставить("Характеристика", ПараметрыПакета.Характеристика); 
		
		НайденыеСтроки = ТаблицаЗаказа.НайтиСтроки(ОтборДляПоиска);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			СтруктураОтвета.Вставить("Результат", Ложь);
			СтруктураОтвета.Вставить("ОписаниеОшибки", "Пакет не соответствует заказу");
		Иначе 
			СтруктураОтвета.Вставить("Результат", Истина); 
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(АддендумСсылка.Номер) И АддендумСсылка <> Документы.алк_Аддендумы.ПустаяСсылка() Тогда	
				
		Если РфпПолучениеДанныхСервер.СоответствиеСНАддендуму(СерийныйНомер, АддендумСсылка) Тогда
			СтруктураОтвета.Вставить("Результат", Истина);	
		Иначе 
			СтруктураОтвета.Вставить("Результат", Ложь);
			СтруктураОтвета.Вставить("ОписаниеОшибки", "Пакет не соответствует аддендуму"); 
		КонецЕсли;	
		
	Иначе
		СтруктураОтвета.Вставить("Результат", Ложь);
		СтруктураОтвета.Вставить("ОписаниеОшибки", "В отгрузке не указан заказ");
	КонецЕсли;
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, НастройкиСериализации);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/html; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(СериализованнаяСтрока);
	
	Возврат HTTPОтвет;

КонецФункции


//Вспомогательные функции http
Функция ЛатВКир(Слово)Экспорт
	Кириллица= "";
	СоотвБукв = новый СписокЗначений;
	//Кириллица
	СоотвБукв.Добавить("j","й");
	СоотвБукв.Добавить("c","ц");
	СоотвБукв.Добавить("u","у");
	СоотвБукв.Добавить("k","к");
	СоотвБукв.Добавить("e","е");
	СоотвБукв.Добавить("n","н");
	СоотвБукв.Добавить("g","г");
	СоотвБукв.Добавить("sh","ш");
	СоотвБукв.Добавить("sch","щ");
	СоотвБукв.Добавить("z","з");
	СоотвБукв.Добавить("h","х");
	СоотвБукв.Добавить("#","ъ");
	СоотвБукв.Добавить("f","ф");
	СоотвБукв.Добавить("y","ы");
	СоотвБукв.Добавить("v","в");
	СоотвБукв.Добавить("a","а"); 
	СоотвБукв.Добавить("p","п"); 
	СоотвБукв.Добавить("r","р"); 
	СоотвБукв.Добавить("o","о"); 
	СоотвБукв.Добавить("l","л"); 
	СоотвБукв.Добавить("d","д"); 
	СоотвБукв.Добавить("zh","ж"); 
	СоотвБукв.Добавить("je","э"); 
	СоотвБукв.Добавить("ya","я"); 
	СоотвБукв.Добавить("ch","ч"); 
	СоотвБукв.Добавить("s","с"); 
	СоотвБукв.Добавить("m","м"); 
	СоотвБукв.Добавить("i","и"); 
	СоотвБукв.Добавить("t","т"); 
	СоотвБукв.Добавить("'","ь"); 
	СоотвБукв.Добавить("b","б"); 
	СоотвБукв.Добавить("ju","ю");
	СоотвБукв.Добавить("jo","ё");
	
	СоотвБукв.Добавить("-","-");
	//Цифры
	СоотвБукв.Добавить("0","0");
	СоотвБукв.Добавить("1","1");
	СоотвБукв.Добавить("2","2");
	СоотвБукв.Добавить("3","3");
	СоотвБукв.Добавить("4","4");
	СоотвБукв.Добавить("5","5");
	СоотвБукв.Добавить("6","6");
	СоотвБукв.Добавить("7","7");
	СоотвБукв.Добавить("8","8");  
	СоотвБукв.Добавить("9","9"); 
	
	Если Сред(Слово, 1,2) = "SH" Тогда
		НачалоСлова = 3;
		Кириллица = "ШП";
	Иначе
		НачалоСлова=1;
	КонецЕсли;
	
	Для а=НачалоСлова по СтрДлина(Слово) Цикл		 
		Кириллица = Кириллица + СоотвБукв.НайтиПоЗначению(НРЕГ(Сред(Слово,а,1)));
	КонецЦикла; 
	
	Возврат ВРЕГ(Кириллица);
КонецФункции

Функция НайтиСерийныйНомер(Штрихкод)
	
	Если Лев(Штрихкод, 2) = "ПМ" И Число(Прав(Штрихкод,6)) > 100000 Тогда //Это "замаскированный" МЛ пакет	
		СНПоЧастям = СтрРазделить(Штрихкод, "-");	
		НомерСН = Прав(СНПоЧастям[2], 5);
		Штрихкод = "МЛ-" + СНПоЧастям[1] + "-0" + НомерСН;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование = &Номер";
	Запрос.УстановитьПараметр("Номер", Штрихкод);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка; 
		КонецЦикла;
	КонецЕсли;
КонецФункции
Функция ВернутьПользователя(ИдентификаторПользователяИБ, ТипПользователь = Ложь)
	Если НЕ ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		Возврат Неопределено;
	КонецЕсли;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|" +?(ТипПользователь, "СотрудникиПользователя.Пользователь КАК Ссылка", "СотрудникиПользователя.Сотрудник.Ссылка КАК Ссылка") +"
	|ИЗ
	|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
	|ГДЕ
	|	СотрудникиПользователя.Пользователь.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", Новый УникальныйИдентификатор(ИдентификаторПользователяИБ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если ТипПользователь Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();	
	Иначе
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ВернутьСмену(смена)
	Если смена = "Ночь" Тогда
		Возврат Справочники.алк_Смены.Ночь_2;
	Иначе
		Возврат Справочники.алк_Смены.День_2;
	КонецЕсли; 
КонецФункции

Функция ДанныеВыгрузкиВТСД(СписокСсылокНаДокументы) Экспорт 
	
	ДанныеЗагрузкиВТСД = Новый Структура;   
	
	ВременнаяТаблицаДанныхТабличныхЧастейДокументов = ВременнаяТаблицаДанныхТабличныхЧастейДокументов(СписокСсылокНаДокументы);
	
	ДанныеШапкиДокументов 			= ДанныеШапкиДокументов(СписокСсылокНаДокументы);
	ДанныеТабличныхЧастейДокументов = ДанныеТабличныхЧастейДокументов(СписокСсылокНаДокументы);
	ДанныеСправочников  			= ДанныеСправочников(ВременнаяТаблицаДанныхТабличныхЧастейДокументов, СписокСсылокНаДокументы);
	
	ДанныеЗагрузкиВТСД.Вставить("ДанныеШапкиДокументов", 			ДанныеШапкиДокументов);
	ДанныеЗагрузкиВТСД.Вставить("ДанныеТабличныхЧастейДокументов", 	ДанныеТабличныхЧастейДокументов);
	ДанныеЗагрузкиВТСД.Вставить("ДанныеСправочников", 				ДанныеСправочников); 
	
	Возврат ДанныеЗагрузкиВТСД;
КонецФункции

Функция ДанныеШапкиДокументов(СписокСсылокНаДокументы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	алк_ПеремещениеЗапасов.Номер,
	|	алк_ПеремещениеЗапасов.Дата,
	|	""Перемещение"" КАК ТипДокумента,
	|	алк_ПеремещениеЗапасов.Ссылка
	|ИЗ
	|	Документ.алк_ПеремещениеЗапасов КАК алк_ПеремещениеЗапасов
	|ГДЕ
	|	алк_ПеремещениеЗапасов.Ссылка В(&СписокСсылокНаДокументы)";
	
	
	Запрос.УстановитьПараметр("СписокСсылокНаДокументы", СписокСсылокНаДокументы);
	
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	СписокШапокДокументов = Новый Массив;
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		ШапкаДокумента = Новый Структура;
		ШапкаДокумента.Вставить("ТипДокумента", СокрЛП(ВыборкаИзРезультатаЗапроса.ТипДокумента));
		ШапкаДокумента.Вставить("Ссылка", 	  	СокрЛП(ВыборкаИзРезультатаЗапроса.Ссылка.УникальныйИдентификатор()));
		ШапкаДокумента.Вставить("Номер", 	  	СокрЛП(ВыборкаИзРезультатаЗапроса.Номер));
		ШапкаДокумента.Вставить("Дата", 	  	ВыборкаИзРезультатаЗапроса.Дата);  	
		
		СписокШапокДокументов.Добавить(ШапкаДокумента);
	КонецЦикла;
	
	Возврат СписокШапокДокументов;
	
КонецФункции

Функция ВременнаяТаблицаДанныхТабличныхЧастейДокументов(СписокСсылокНаДокументы)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер
		|ПОМЕСТИТЬ ВТ_ТабличныеЧастиДокументов
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка В(&СписокСсылокНаДокументы)";
	
	Запрос.УстановитьПараметр("Ссылка", СписокСсылокНаДокументы);
	
	Запрос.Выполнить();  
	Возврат Запрос.МенеджерВременныхТаблиц;  
КонецФункции

Функция ДанныеТабличныхЧастейДокументов(СписокСсылокНаДокументы)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	алк_ПеремещениеЗапасовЗапасы.НомерСерии,
		|	алк_ПеремещениеЗапасовЗапасы.КоличествоПакетов,
		|	алк_ПеремещениеЗапасовЗапасы.НомерСтроки,
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка В(&СписокСсылокНаДокументы)
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("СписокСсылокНаДокументы", СписокСсылокНаДокументы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ТабличныеЧастиДокументов = Новый Соответствие;
		СтрокиТабличнойЧасти = Новый Массив; 
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать(); 	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТабличнойЧастиДокумента = Новый Структура;
			СтрокаТабличнойЧастиДокумента.Вставить("Номенклатура", 	 СокрЛП(ВыборкаДетальныеЗаписи.Номенклатура.УникальныйИдентификатор()));
			СтрокаТабличнойЧастиДокумента.Вставить("Количество", 	 СокрЛП(ВыборкаДетальныеЗаписи.КоличествоПакетов));
			СтрокаТабличнойЧастиДокумента.Вставить("НомерСтроки", 	 СокрЛП(ВыборкаДетальныеЗаписи.НомерСтроки));
			СтрокаТабличнойЧастиДокумента.Вставить("СерийныйНомер",  СокрЛП(ВыборкаДетальныеЗаписи.СерийныйНомер.УникальныйИдентификатор()));
			СтрокиТабличнойЧасти.Добавить(СтрокаТабличнойЧастиДокумента);
		КонецЦикла;
		ТабличныеЧастиДокументов.Вставить(СокрЛП(ВыборкаСсылка.Ссылка.УникальныйИдентификатор()), СтрокиТабличнойЧасти); 

	КонецЦикла;
	Возврат ТабличныеЧастиДокументов;
		
КонецФункции

Функция ДанныеСправочников(МенеджерВременныхТаблиц,СписокСсылокНаДокументы)
	
	ДанныеСправочников = Новый Структура;
	ДанныеСправочников.Вставить("Номенклатура", 	ДанныеНоменклатуры(МенеджерВременныхТаблиц));
	//ДанныеСправочников.Вставить("Характеристики", 	ДанныеХарактеристикНоменклатуры(МенеджерВременныхТаблиц));
	//ДанныеСправочников.Вставить("Упаковки", 		ДанныеУпаковок(МенеджерВременныхТаблиц));
	ДанныеСправочников.Вставить("СерийныеНомера",  ДанныеСерийныхНомеров(МенеджерВременныхТаблиц));
	
	Возврат ДанныеСправочников;
	
КонецФункции

Функция ДанныеНоменклатуры(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ТабличныеЧастиДокументов.Номенклатура КАК Ссылка
	|ИЗ
	|	ВТ_ТабличныеЧастиДокументов КАК ВТ_ТабличныеЧастиДокументов";
	ВыгрузкаИзРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	СписокНоменклатуры = ВыгрузкаИзРезультатаЗапроса.ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
 	"ВЫБРАТЬ
 	|	СправочникНоменклатура.Ссылка КАК Ссылка,
 	|	СправочникНоменклатура.Наименование КАК Наименование
 	|ИЗ
 	|	Справочник.Номенклатура КАК СправочникНоменклатура
 	|ГДЕ
 	|	СправочникНоменклатура.Ссылка В(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	СписокНоменклатуры = Новый Массив;
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		СтрокаДанныхНоменклатуры = Новый Структура;
		СтрокаДанныхНоменклатуры.Вставить("Ссылка", СокрЛП(ВыборкаИзРезультатаЗапроса.Ссылка.УникальныйИдентификатор()));
		СтрокаДанныхНоменклатуры.Вставить("Наименование", СокрЛП(ВыборкаИзРезультатаЗапроса.Наименование));
		СписокНоменклатуры.Добавить(СтрокаДанныхНоменклатуры);		
	КонецЦикла;
	
	Возврат СписокНоменклатуры;
	
КонецФункции

Функция ДанныеСерийныхНомеров(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ_ТабличныеЧастиДокументов.СерийныйНомер КАК Ссылка
	|ИЗ
	|	ВТ_ТабличныеЧастиДокументов КАК ВТ_ТабличныеЧастиДокументов";
	ВыгрузкаИзРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	СписокСерийныхномеров = ВыгрузкаИзРезультатаЗапроса.ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
 	"ВЫБРАТЬ
 	|	СерийныеНомера.Ссылка,
 	|	СерийныеНомера.Наименование
 	|ИЗ
 	|	Справочник.СерийныеНомера КАК СерийныеНомера
 	|ГДЕ
 	|	СерийныеНомера.Ссылка В(&СписокСерийныхномеров)";
	Запрос.УстановитьПараметр("СписокСерийныхномеров", СписокСерийныхномеров);
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	СписокСерийныхномеров = Новый Массив;
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		СтрокаДанныхСерийногоНомера = Новый Структура;
		СтрокаДанныхСерийногоНомера.Вставить("Ссылка", СокрЛП(ВыборкаИзРезультатаЗапроса.Ссылка.УникальныйИдентификатор()));
		СтрокаДанныхСерийногоНомера.Вставить("Наименование", СокрЛП(ВыборкаИзРезультатаЗапроса.Наименование));
		СписокСерийныхномеров.Добавить(СтрокаДанныхСерийногоНомера);		
	КонецЦикла;
	
	Возврат СписокСерийныхномеров;
	
КонецФункции

Функция ПолучитьСтруктуруИзСоответствия(ЗначВход) Экспорт
 
	СтруктураВозврат=Новый Структура;
	
	Если ТипЗнч(ЗначВход)=Тип("Соответствие") Тогда
		
		ФлагОщибка=Ложь;
		
		Для Каждого р Из ЗначВход Цикл
			Попытка
				СтруктураВозврат.Вставить(р.Ключ,ПолучитьСтруктуруИзСоответствия(р.Значение));
			Исключение
				ФлагОщибка=Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
		
		Если ФлагОщибка Тогда // пришел ключь который не возможно поместить в структуру
			СтруктураВозврат = Новый Массив;
			Для Каждого р Из ЗначВход Цикл
				ДопСтруктура=Новый Структура;
				ДопСтруктура.Вставить("Ключ",р.Ключ);
				ДопСтруктура.Вставить("Значение",ПолучитьСтруктуруИзСоответствия(р.Значение));
				СтруктураВозврат.Добавить(ДопСтруктура);
			КонецЦикла;
		КонецЕсли;
		
		Возврат СтруктураВозврат; 
		
	ИначеЕсли ТипЗнч(ЗначВход)=Тип("Массив") Тогда
		
		НовыйМассив=Новый Массив;
		Для Каждого ЭлМ Из ЗначВход Цикл
			НовыйМассив.Добавить(ПолучитьСтруктуруИзСоответствия(ЭлМ));
		КонецЦикла;
		Возврат НовыйМассив;
		
	КонецЕсли;
	
	Возврат ЗначВход; 
 
КонецФункции

//Функция УстановитьСсылкуНаОбъект(МетаданныеОбъекта, СсылкаНаОбъект, ЭтоНовый = Ложь)   Экспорт
//	
//	Новый_UID   = Новый УникальныйИдентификатор(СсылкаНаОбъект);
//	НоваяСсылка = МетаданныеОбъекта.ПолучитьСсылку(Новый_UID);
//	НовыйОбъект = НоваяСсылка.ПолучитьОбъект();

//	Если НовыйОбъект = Неопределено Тогда
//		ЭтоНовый = Истина;
//		Если СтрЧислоВхождений(МетаданныеОбъекта.ПустаяСсылка().Метаданные().ПолноеИмя(), "Справочник") > 0 Тогда
//			НовыйОбъект = МетаданныеОбъекта.СоздатьЭлемент();
//		ИначеЕсли СтрЧислоВхождений(МетаданныеОбъекта.ПустаяСсылка().Метаданные().ПолноеИмя(), "Документ") > 0 Тогда
//			НовыйОбъект = МетаданныеОбъекта.СоздатьДокумент();
//		КонецЕсли;	
//		НовыйОбъект.УстановитьСсылкуНового(НоваяСсылка);
//	КонецЕсли;	
//	
//	Возврат НовыйОбъект;

//КонецФункции

//Функция делает запись в регистре алк_ПараметрыПакетовОперативный
//
//Возвращаемые значения: Структура с описанием
Функция УстановитьИзменитьПакетНаСервере(НоваяЗапись)
	
	СтруктураОтвет = Новый Структура;
    ПроверкаДиапазона = Ложь;
	
//Заполним диапазоны пока тут т.к ориентировачно они не должны меняться	
	Если НоваяЗапись.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048202") Тогда   //0,65т
		ВДиапазон = 700;
		НДиапазон = 600;
		ПроверкаДиапазона = Истина;
	ИначеЕсли НоваяЗапись.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048203") Тогда //1,00т
		ВДиапазон = 1200;
		НДиапазон = 701;
		ПроверкаДиапазона = Истина;
	КонецЕсли;
	
	Если ПроверкаДиапазона И НЕ(НоваяЗапись.КоличествоСостав >= НДиапазон И НоваяЗапись.КоличествоСостав <= ВДиапазон) Тогда
		СтруктураОтвет.Вставить("Результат", Ложь);  
		СтруктураОтвет.Вставить("Ответ", "Ошибка! Значение веса выходит из возможного диапазона");
		Возврат СтруктураОтвет;	
	КонецЕсли;
	
	Если НоваяЗапись.СерийныйНомер.Владелец <> РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ПиломатериалСП) Тогда			
		Если НоваяЗапись.ВесНеттоТаможня = 0 Тогда                                                                      						
			СтруктураОтвет.Вставить("Результат", Ложь);  
			СтруктураОтвет.Вставить("Ответ", "Невозможно рассчитать вес пакета по данным параметрам!");
			Возврат СтруктураОтвет;
		КонецЕсли;                                         			
	КонецЕсли;   
	
	//Ищем прошлые записи с использованием входящего серийного номера
	НаборЗаписей = РегистрыСведений.алк_ПараметрыПакетовОперативный.СоздатьНаборЗаписей(); 			
	НаборЗаписей.Отбор.СерийныйНомер.Установить(НоваяЗапись.СерийныйНомер);
	НаборЗаписей.Прочитать();
	
	//Всем найденым записям меняем актуальность
	Для Каждого Запись Из НаборЗаписей Цикл  			
		Запись.Актуальность = Перечисления.алк_ОперативнаяАктуальностьПакетов.Изменен; 			
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);

	//Создаем новую запись
	НоваяЗапись.Записать();
	
	СтруктураОтвет.Вставить("Результат", Истина);  
	СтруктураОтвет.Вставить("Ответ", "Успешно");
	Возврат СтруктураОтвет;
	
КонецФункции

Процедура СоздатьПакетНаСервере(Ответ, Участок, Операция, ДатаСмены, Смена, СерийныйНомер, стрПакет)
			
	//Получим документ производства
	ПараметрыПроизводства = Документы.алк_Производство.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
	ПараметрыПроизводства.Участок = Участок;
	ПараметрыПроизводства.Операция = Операция;
	ПараметрыПроизводства.ДатаСмены = ДатаСмены;
	ПараметрыПроизводства.Смена = Смена;
	
	ДокументТекущегоПроизводства = алк_ПроизводствоСервер.ПолучитьДокументПроизводстваТекущейСмены(ПараметрыПроизводства, Истина); 
	
	
		
	//Проверим его статус
	Если ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Закрыт Тогда
		Ответ = "Ошибка! Смена закрыта мастером. Создание новых пакетов запрещено в закрытой смене. Возможно неверно заполнены реквизиты смены. Проверьте реквизиты смены или обратитесь в мастеру";
		Возврат;
	ИначеЕсли ДокументТекущегоПроизводства.Статус = Перечисления.алк_СтатусыОтчетаПроизводства.Заблокирован Тогда
		Ответ = "Ошибка! Мастер заблокировал документ. Дождитесь разблокировки или обратитесь в мастеру";
		Возврат;
	КонецЕсли;
	
	Если стрПакет.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048202") Тогда   //0,65т
		ВДиапазон = 700;
		НДиапазон = 600;
		ПроверкаДиапазона = Истина;
	ИначеЕсли стрПакет.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048203") Тогда //1,00т
		ВДиапазон = 1200;
		НДиапазон = 701;
		ПроверкаДиапазона = Истина; 
	Иначе
		ПроверкаДиапазона = Ложь;		
	КонецЕсли;
	
	Если ПроверкаДиапазона И НЕ(стрПакет.КоличествоСостав >= НДиапазон И стрПакет.КоличествоСостав <= ВДиапазон) Тогда
		Ответ = "Ошибка! Значение веса выходит из возможного диапазона";
		Возврат;	
	КонецЕсли; 
	
	// Проверка на повторное внесение пакета 
	
	НайденнаяСтрокаПродукции = ДокументТекущегоПроизводства.Ссылка.Продукция.Найти(СерийныйНомер);
	
	Если Не НайденнаяСтрокаПродукции = Неопределено Тогда 	
		Ответ = "Ошибка! Пакет " + СерийныйНомер + " уже добавлен в " + Формат(НайденнаяСтрокаПродукции.Период, "ДЛФ=T");
		Возврат; 		
	КонецЕсли; 
	
	// Проверка на использованиее пакета ранее
	ДокументРанееИспользованный = ПроверитьИспользованиеПакета(СерийныйНомер, ДокументТекущегоПроизводства.Ссылка); 
	
	Если ЗначениеЗаполнено(ДокументРанееИспользованный) Тогда 	
		Ответ = "Ошибка! Пакет " + СерийныйНомер + " уже добавлен в документ " + ДокументРанееИспользованный;
		Возврат; 		
	КонецЕсли;
	
 
		
	//Добавим пакет в документ производства	
		
	ПараметрыПакета = Документы.алк_Производство.ПолучитьСтруктуруЗаполнения_ДобавитьСписатьПакет();
	ПараметрыПакета.ТипЗаполнения = "ДобавитьПакет";
	ПараметрыПакета.Количество = стрПакет.КоличествоСостав/1000;
	ПараметрыПакета.Номенклатура = стрПакет.Номенклатура;
	ПараметрыПакета.Период = ТекущаяДата();
	ПараметрыПакета.СерийныйНомер = СерийныйНомер;
	ПараметрыПакета.Сертификат = Справочники.СертификатыНаПродукцию.ПустаяСсылка();
	ПараметрыПакета.Характеристика = стрПакет.Характеристика; 
	ПараметрыПакета.Склад = Участок.СкладВыпуска;

	
	ОбъектДокументПроизводства = ДокументТекущегоПроизводства.Ссылка.ПолучитьОбъект();
	ОбъектДокументПроизводства.Заполнить(ПараметрыПакета);
	
	Попытка
		ОбъектДокументПроизводства.Записать(РежимЗаписиДокумента.Проведение);
		
		//Сделаем движения в регистр ДополнительныеПараметрыПакетов
		//МенеджерЗаписи = РегистрыСведений.алк_ДополнительныеПараметрыПакетов.СоздатьМенеджерЗаписи();		
		//МенеджерЗаписи.ВидШпона = Объект.ВидШпона;
		//МенеджерЗаписи.Период = Период;
		//МенеджерЗаписи.СерийныйНомер = Объект.СерийныйНомер;
		//МенеджерЗаписи.СлойДревесины = Объект.СлойДревесины;
		//МенеджерЗаписи.Записать();
	Исключение
		Ответ = "Ошибка проведения документа производства!"; 
		Возврат;
	КонецПопытки; 
	
	Ответ = "Успешно";

		
КонецПроцедуры

 
Функция ПроверитьИспользованиеПакета(СерийныйНомер, Ссылка) 
			
	РезультатПроверки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПроизводствоПродукция.Ссылка.Представление КАК Представление
		|ИЗ
		|	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
		|ГДЕ
		|	НЕ алк_ПроизводствоПродукция.Ссылка = &Ссылка
		|	И алк_ПроизводствоПродукция.Ссылка.Проведен
		|	И алк_ПроизводствоПродукция.СерийныйНомер = &СерийныйНомер
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ПроизводствоПродукция.Период";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		РезультатПроверки = ВыборкаДетальныеЗаписи.Представление;		
	КонецЦикла;
	
	
	Возврат РезультатПроверки;

	

КонецФункции // ПроверитьИспользованиеПакета()













Функция ПолучитьНомерПакетаИзСерийногоНомера(Штрихкод)
	Возврат Число(Прав(Штрихкод, 6));	
КонецФункции

Процедура ПолучитьДанныеДляЗагрузки(Запрос, JSONТелоЗапроса, ДатаДокумента, ДатаСмены, Смена, Ответственный, ДанныеШапкиДокументов, ДанныеТабличныхЧастейДокументов)
	
	ДатаДокумента	= Запрос.ПараметрыЗапроса.Получить("datedoc");
	ДатаСмены		= Запрос.ПараметрыЗапроса.Получить("date");
	Смена			= Запрос.ПараметрыЗапроса.Получить("shift");  
	ОтветственныйИД = Запрос.ПараметрыЗапроса.Получить("nameid");
	Уид				= Запрос.ПараметрыЗапроса.Получить("uid");
	
	Смена = ВернутьСмену(Смена);
	Ответственный = ВернутьПользователя(ОтветственныйИД);  
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONТелоЗапроса);
	
	СчитанныеДанные = ПрочитатьJSON(ЧтениеJSON, Истина,"Дата", ФорматДатыJSON.ISO);
	ЧтениеJSON.Закрыть();
	
	ДанныеШапкиДокументов = СчитанныеДанные.Получить("ДанныеШапкиДокументов");
	ДанныеТабличныхЧастейДокументов = СчитанныеДанные.Получить("ДанныеТабличныхЧастейДокументов");
	
КонецПроцедуры	

Функция ПроверкаНаДополнениеКонтенераПоИдентификатору(ИдентификаторТС)
	//Ищем последницй контейнер с таким идентификатором
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	алк_ЗагрузкаКонтейнера.Ссылка КАК КонтейнерСсылка,
	|	алк_ЗагрузкаКонтейнера.Дата КАК Дата
	|ИЗ
	|	Документ.алк_ЗагрузкаКонтейнера КАК алк_ЗагрузкаКонтейнера
	|ГДЕ
	|	алк_ЗагрузкаКонтейнера.ИдентификаторКонтейнера = &ИдентификаторКонтейнера
	//|	И алк_ЗагрузкаКонтейнера.Организация = &Организация
	|	И НЕ алк_ЗагрузкаКонтейнера.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ИдентификаторКонтейнера", ИдентификаторТС);
	//Запрос.УстановитьПараметр("Организация", Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e1faddcf-80a1-11eb-bb9f-00155d080105")));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НайденыйКонтейнер = РезультатЗапроса.Выгрузить();
	
	Если НайденыйКонтейнер.Количество() > 0 Тогда 
		//Проверяем есть ли на него раходный ордер
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_РасходнаяНакладнаяКонтейнеры.Контейнер
		|ИЗ
		|	Документ.алк_РасходнаяНакладная.Контейнеры КАК алк_РасходнаяНакладнаяКонтейнеры
		|ГДЕ
		//|	алк_РасходнаяНакладнаяКонтейнеры.Ссылка.Организация = &Организация
		|	И НЕ алк_РасходнаяНакладнаяКонтейнеры.Ссылка.ПометкаУдаления
		|	И алк_РасходнаяНакладнаяКонтейнеры.Контейнер В(&Контейнер)
		|	И алк_РасходнаяНакладнаяКонтейнеры.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("Контейнер", НайденыйКонтейнер);
		//Запрос.УстановитьПараметр("Организация", Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e1faddcf-80a1-11eb-bb9f-00155d080105")));
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество() = 0 Тогда				
			Возврат НайденыйКонтейнер[0].КонтейнерСсылка;  
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Функция ПроверкаНаДополнениеНакладнойПоИдентификатору(ИдентификаторТС)
	//Ищем Расходную накладную НЕ ПРОВЕДЕННУЮ с таким же Идентификатором ТС	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алк_РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.алк_РасходнаяНакладная КАК алк_РасходнаяНакладная
		|ГДЕ
		|	НЕ алк_РасходнаяНакладная.Проведен
		|	И алк_РасходнаяНакладная.СтрокаИДКонтейнеров = &СтрокаИДКонтейнеров
		//|	И алк_РасходнаяНакладная.Организация = &Организация
		|	И НЕ алк_РасходнаяНакладная.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_РасходнаяНакладная.Дата УБЫВ";
	
	//Запрос.УстановитьПараметр("Организация", Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("e1faddcf-80a1-11eb-bb9f-00155d080105")));
	Запрос.УстановитьПараметр("СтрокаИДКонтейнеров", ИдентификаторТС);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//Если есть записи значит есть не проведеная накладная, то возвращаем ее для дополнения
	Если РезультатЗапроса.Количество() > 0 Тогда				
		Возврат РезультатЗапроса[0].Ссылка;  
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
