
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр алк_АналитикаНоменклатурыПЭО
	Движения.алк_АналитикаНоменклатурыПЭО.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаНоменклатуры Из ТаблицаНоменклатуры Цикл
		Движение = Движения.алк_АналитикаНоменклатурыПЭО.Добавить();
		Движение.Период = Дата;
		Движение.Характеристика = ТекСтрокаТаблицаНоменклатуры.Характеристика;
		Движение.КатегорияНоменклатурыПЭО = Категория;
		Движение.ТипНоменклатурыПЭО = Тип;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
