
Функция ПолучитьЗначениеОбъема(ДлинаМ, СечениеМ, ТипКубатурника) Экспорт
	Результат = 0;
	Запрос = новый запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	алк_КубатурникКруглогоЛеса.Объем как Объем
	|ИЗ
	|	РегистрСведений.алк_КубатурникКруглогоЛеса КАК алк_КубатурникКруглогоЛеса
	|ГДЕ
	|	алк_КубатурникКруглогоЛеса.ДлинаМ = &ДлинаМ
	|	И алк_КубатурникКруглогоЛеса.СечениеМ = &СечениеМ
	|	И алк_КубатурникКруглогоЛеса.ТипКубатурника = &ТипКубатурника");
	Запрос.УстановитьПараметр("ДлинаМ", ДлинаМ);
	Запрос.УстановитьПараметр("СечениеМ", СечениеМ);
	Запрос.УстановитьПараметр("ТипКубатурника", ТипКубатурника);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() тогда
		Результат = РезультатЗапроса.Объем;
	КонецЕсли;
	Возврат Результат;
КонецФункции