	  
Процедура ДобавитьЗадание(ПериодРасчета, ОперацияПроизводства, ВидЗначения) Экспорт  
	
	//Если не указали дату в документе, то не добавляем задание в рс
	Если ПериодРасчета = Дата(1,1,1) Тогда   
		Возврат;
	КонецЕсли; 
	//\\
	
	НовыйПериод = ПериодРасчета;
	
	//если проводят документ в будущем
	Если ПериодРасчета > ТекущаяДата() Тогда 
		НовыйПериод = ТекущаяДата();
	КонецЕсли;    
	
	НоваяЗапись = РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ПериодРасчета = НовыйПериод;//ПериодРасчета;
	НоваяЗапись.ОперацияПроизводства = ОперацияПроизводства;
	НоваяЗапись.ВидЗначения = ВидЗначения;
	НоваяЗапись.ВременнаяМетка = ТекущаяДата();
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры