
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура("Номенклатура", Объект.Номенклатура); 
	ПараметрыФормы.Вставить("СтрокаКоманды", "Справочник.ХарактеристикиНоменклатуры.ФормаВыбора");
	
	СписокСсылок = Новый СписокЗначений;
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияПодбора", ЭтотОбъект, СписокСсылок);
	
	Форма = ОткрытьФорму("Обработка.алк_ПодборВСписки.Форма.ФормаПодборИзПодчинСпр", ПараметрыФормы, ЭтаФорма,,,,Оп);
	            
КонецПроцедуры


Процедура ВыполнитьПослеЗакрытияПодбора(СписокСсылок, Параметры)

	Если СписокСсылок = Неопределено Тогда		
		Возврат;	
	КонецЕсли; 
	
	Для каждого Стр Из СписокСсылок Цикл 		
		НоваяСтр = Объект.ТаблицаНоменклатуры.Добавить();
		НоваяСтр.Характеристика = Стр.Значение;		
	КонецЦикла; 

КонецПроцедуры
 