

/////////////////////////////////////// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ И ПРОЦЕДУРЫ /////////////////////////////////////////////////////////////////

Функция ПреобразоватьСтрокуВДату(СтрокаДата)
	СтрокаДатаБезЧерточек = СтрЗаменить(СтрокаДата,"-","");
	Попытка 
		НД = Дата(СтрокаДатаБезЧерточек);
		Возврат НД;
	Исключение
		Возврат Неопределено
	КонецПопытки;
КонецФункции  

Функция ПреобразоватьСтрокуВБулево(СтрокаБулево)
	Если НРег(СтрокаБулево) = "истина" Тогда 
		Возврат Истина;
	ИначеЕсли НРег(СтрокаБулево) = "ложь" Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции  

Функция ПреобразоватьДатуВСтроку(Дата,ДатаВремя=Ложь)
	Если НЕ ДатаВремя Тогда 
		Возврат Формат(Дата, "ДФ=yyyy-MM-dd"); 
	Иначе 
		Возврат Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss");
	КонецЕсли;
КонецФункции

Процедура ДобавитьЗаписьВМассивJSON(Запись,ИмяСвойства,Значение)
	Запись.ЗаписатьИмяСвойства(ИмяСвойства);
	Запись.ЗаписатьЗначение(Значение);
КонецПроцедуры

Функция ВернутьОтветJSON(Таб,ДатаВремя=Ложь)
	
	Запись = Новый ЗаписьJSON;   
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);  
	Запись.УстановитьСтроку(ПараметрыЗаписиJSON); 
	
	Запись.ЗаписатьНачалоМассива();  
	
	Для Каждого Стр ИЗ Таб Цикл 
		
		Запись.ЗаписатьНачалоОбъекта();
		
		Для Каждого Колонка ИЗ Таб.Колонки Цикл 
			
			Если ТипЗнч(Стр[Колонка.Имя]) = Тип("Дата") Тогда 
				
				ДобавитьЗаписьВМассивJSON(Запись,Колонка.Имя,ПреобразоватьДатуВСтроку(Стр[Колонка.Имя],ДатаВремя));
				
			ИначеЕсли ТипЗнч(Стр[Колонка.Имя]) = Тип("ТаблицаЗначений") Тогда 
				
				Запись.ЗаписатьИмяСвойства(Колонка.Имя);
				Запись.ЗаписатьНачалоМассива();
				
				Для Каждого строкитз ИЗ Стр[Колонка.Имя] Цикл
					
					Запись.ЗаписатьНачалоОбъекта();
					
					Для Каждого колонкитз ИЗ Стр[Колонка.Имя].Колонки Цикл  
						
						Значение = строкитз[колонкитз.Имя];
						
						Если ТипЗнч(Значение) = Тип("Дата") Тогда
							Значение = ПреобразоватьДатуВСтроку(Значение,ДатаВремя);
						КонецЕсли; 
						
						ДобавитьЗаписьВМассивJSON(Запись,колонкитз.Имя,Значение);	
						
					КонецЦикла;
					
					Запись.ЗаписатьКонецОбъекта();
					
				КонецЦикла;
				
				Запись.ЗаписатьКонецМассива();
				
			Иначе
				
				ДобавитьЗаписьВМассивJSON(Запись,Колонка.Имя,Стр[Колонка.Имя]);
				
			КонецЕсли;		 
			
		КонецЦикла;  
		
		Запись.ЗаписатьКонецОбъекта(); 
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецМассива();	
	
	Возврат Запись.Закрыть();  
	
КонецФункции 

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//////////////////////////////////////// ОТВЕТЫ К ЗАПРОСАМ ОПТИ СОФТ /////////////////////////////////////////////////////////////
Функция WoodStoreAction(Запрос)
	
	ПараметрыЗапроса = Запрос.ПараметрыЗапроса.Получить("date"); 
	
	Если ПараметрыЗапроса = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПараметрыЗапроса); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли;
	
	СписокНоменклатуры = Новый Массив;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002")); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапросаWoodStore(); 
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаЗапроса) + 8*3600);	
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
			
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.StoreCode = "";
		Стр.WoodKindCode = "";
		Стр.SortGroupCode = "";
		Стр.Diameter = 0; 
		Стр.Length = 0;
		Стр.Count = 0;
		Стр.Volume = 0;	
	КонецЕсли; 
	
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;
	
КонецФункции

Функция WoodDeliveryAction(Запрос)
			
	ПарамСтрДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");
	ПарамСтрДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo");

	ПарамСтрКонтрагентКод = Запрос.ПараметрыЗапроса.Получить("ContragentCode"); 
	
	Если ПарамСтрКонтрагентКод = Неопределено Тогда 
		ПарамСтрКонтрагентКод = "";
	КонецЕсли;
	
	Если ПарамСтрДатаС = Неопределено ИЛИ ПарамСтрДатаПо = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
   		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапросаС = ПреобразоватьСтрокуВДату(ПарамСтрДатаС); 
	ДатаЗапросаПо = ПреобразоватьСтрокуВДату(ПарамСтрДатаПо); 
		
	Если ДатаЗапросаС = Неопределено ИЛИ ДатаЗапросаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапросаWoodDelivery(); 	

	Запрос.УстановитьПараметр("Дата1", ДатаЗапросаС);	
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаЗапросаПо));
	Запрос.УстановитьПараметр("ContragentCode", ПарамСтрКонтрагентКод);
	Запрос.УстановитьПараметр("ПоВсемПоставщикам", Не ЗначениеЗаполнено(ПарамСтрКонтрагентКод));
				
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.ContragentCode = "";
		Стр.WoodKindCode = "";
		Стр.Diameter = 0; 
		Стр.Length = 0; 
		Стр.GradeCode = "";
		Стр.Count = 0;
		Стр.Volume = 0;	
	КонецЕсли; 
	
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
		
	Возврат HTTPОтвет;

КонецФункции

Функция WoodIncomeAction(Запрос)
	
	ПарамСтрДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");
	ПарамСтрДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo");
	
	Если ПарамСтрДатаС = Неопределено ИЛИ ПарамСтрДатаПо = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапросаС = ПреобразоватьСтрокуВДату(ПарамСтрДатаС); 
	ДатаЗапросаПо = ПреобразоватьСтрокуВДату(ПарамСтрДатаПо); 
	
	Если ДатаЗапросаС = Неопределено ИЛИ ДатаЗапросаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапросаWoodIncome();
	
	Запрос.УстановитьПараметр("Дата1", ДатаЗапросаС);	
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаЗапросаПо));
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.ContragentCode = "";
		Стр.StoreTakeCode = "";
		Стр.WoodCode = "";
		Стр.WoodKindCode = "";
		Стр.StoreIncomeCode = "";
		Стр.Volume = 0;	
	КонецЕсли; 
	
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция LumberStoreAction(Запрос)
	
	ПарамСтрДата = Запрос.ПараметрыЗапроса.Получить("date");
		
	Если ПарамСтрДата = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПарамСтрДата); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапросаLumberStore();
	
	СписокНоменклатуры = Новый Массив;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"));  //Пиломатериал
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012"));  //Пиломатериал СП

	Запрос.УстановитьПараметр("ДатаОстатков", НачалоДня(ДатаЗапроса) + 8*3600);  //чтобы отсекать отгрузки выполненные в текущей дневной смене
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);	
	Запрос.УстановитьПараметр("ПустойШтабель", Справочники.алк_Штабели.ПустаяСсылка());
		
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.StoreCode = "";
		Стр.PacketNumber = "";
		Стр.ThicknessProd = 0;
		Стр.WoodKindCode = "";
		Стр.WidthProd = 0;
		Стр.TypeProdCode = "";
		Стр.GradeCode = "";
		Стр.Wetness = 0;
		Стр.SawType = 0;
		Стр.WorkCenterCode = "";
		Стр.DateCreate = "";
		Стр.DateIncome = "";
		Стр.SelfCost = 0;
		Стр.PacketCode = "";
		Стр.Volume = 0;
		Стр.Count = 0;
		Стр.Length = 0;
	КонецЕсли;
	
	НоваяТЗ = ДобавлениеКолонкиСтруктурыКолДлинБревен(ФормируемСтруктуруТЗДляОбменаLumberStore(),ТЗ);
	
	Ответ = ВернутьОтветJSON(НоваяТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция LumberInTunnelsAction(Запрос) 
		
	ПарамСтрДата = Запрос.ПараметрыЗапроса.Получить("date");
	
	Если ПарамСтрДата = Неопределено Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапроса = ПреобразоватьСтрокуВДату(ПарамСтрДата); 
	
	Если ДатаЗапроса = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;    
	
	Запрос.Текст = ПолучитьТекстЗапросаLumberInTunnels_1();
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ДатаЗапроса) - 14*24*60*60);  //пакеты поступившие на сушку за 14 дней  
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ДатаЗапроса) + 8*3600);  
	Запрос.УстановитьПараметр("КодРабочегоЦентраВыпустившегоПакет", "ПБ-000003");  // Буферный склад ЦЛП    
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();    
		
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.TunnelCode = "";
		Стр.PacketNumber = "";
		Стр.WoodKindCode = "";
		Стр.ThicknessProd = 0; 
		Стр.WidthProd = 0; 
		Стр.TypeProdCode = "";
		Стр.GradeCode = "";
		Стр.Volume = 0;
		Стр.Wetness = 0;
		Стр.SawType = 0; 
		Стр.PacketCode = "";
		Стр.WorkCenterCode = "";
        Стр.DateCreate = "";
		Стр.DateIncome = "";
		Стр.DateOutcome = "";
		Стр.Length = 0;
		Стр.Count = 0;
		Стр.SelfCost = 0;	
	КонецЕсли; 
	
	НоваяТЗ = ДобавлениеКолонкиСтруктурыКолДлинБревен(ФормируемСтруктуруТЗДляОбменаLumberInTunnels(),ТЗ);
		
	Ответ = ВернутьОтветJSON(НоваяТЗ,Истина);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция LumberProductionInputAction(Запрос)
	
	ПарамСтрДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");
	ПарамСтрДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo");
	
	Если ПарамСтрДатаС = Неопределено ИЛИ ПарамСтрДатаПо = Неопределено  Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапросаС = ПреобразоватьСтрокуВДату(ПарамСтрДатаС);
	ДатаЗапросаПо = ПреобразоватьСтрокуВДату(ПарамСтрДатаПо);
	
	Если ДатаЗапросаС = Неопределено ИЛИ ДатаЗапросаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;    
	
	Запрос.Текст = ПолучитьТекстЗапросаLumberProductionInput_1();
	
	Запрос.УстановитьПараметр("Дата1", ДатаЗапросаС);	
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаЗапросаПо)); 
	Запрос.УстановитьПараметр("СменаДень",Перечисления.Смены.смена_8_20);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.ShiftCode = "";
		Стр.WoodKindCode = "";
		Стр.SortGroupCode = "";
		Стр.Volume = 0;	
	КонецЕсли; 
	
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция LumberProductionOutputAction(Запрос)
	
	ПарамСтрДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");
	ПарамСтрДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo");
	
	Если ПарамСтрДатаС = Неопределено ИЛИ ПарамСтрДатаПо = Неопределено  Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапросаС = ПреобразоватьСтрокуВДату(ПарамСтрДатаС);
	ДатаЗапросаПо = ПреобразоватьСтрокуВДату(ПарамСтрДатаПо);
	
	Если ДатаЗапросаС = Неопределено ИЛИ ДатаЗапросаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;    
	
	Запрос.Текст = ПолучитьТекстЗапросаLumberProductionOutput_2();
	
	СписокНоменклатуры = Новый Массив;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"));   //Пиломатериал
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012"));   //Пиломатериал (СП)
	 		
	Запрос.УстановитьПараметр("Дата1", ДатаЗапросаС);	
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаЗапросаПо));
	Запрос.УстановитьПараметр("СменаДень",Перечисления.Смены.смена_8_20);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);

	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.ShiftCode = "";
		Стр.WoodKindCode = "";
		Стр.Thickness = 0;
		Стр.Width = 0;
		Стр.TypeProdCode = "";
		Стр.GradeCode = "";
		Стр.Length = 0;
		Стр.Volume = 0;	
	КонецЕсли;
		
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция CustomerAndContractAction(Запрос)
	
	Запрос = Новый Запрос;    
	
	Запрос.Текст = ПолучитьТекстЗапросаCustomerAndContract();
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.ContragentCode = "";
		Стр.ContragentName = "";
		Стр.IsCustomer = 0;
		Стр.IsConsignee = 0;
		Стр.ContractCode = "";
		Стр.ContractName = "";
		Стр.ContractDate = "";
		Стр.DateExpiration = "";
	КонецЕсли;
		
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция OrderAction(Запрос)
	
	ПарамСтрДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");
	ПарамСтрДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo");
	
	Если ПарамСтрДатаС = Неопределено ИЛИ ПарамСтрДатаПо = Неопределено  Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапросаС = ПреобразоватьСтрокуВДату(ПарамСтрДатаС);
	ДатаЗапросаПо = ПреобразоватьСтрокуВДату(ПарамСтрДатаПо);
	
	Если ДатаЗапросаС = Неопределено ИЛИ ДатаЗапросаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;    
	
	Запрос.Текст = ПолучитьТекстЗапросаOrder();
	
	//ТЗ_ПакетыПоЗаказам = ПолучитьПакетыПоЗаказам_НаНовыхРегистрах(КонецДня(ДатаЗапросаС));
	ТЗ_ПакетыПоАддендумам = ПолучитьПакетыПоАддендумам(КонецДня(ДатаЗапросаПо));
	
	//Запрос.УстановитьПараметр("ТЗ", ТЗ_ПакетыПоЗаказам);
	Запрос.УстановитьПараметр("ТЗ1", ТЗ_ПакетыПоАддендумам);
	Запрос.УстановитьПараметр("Дата1", ДатаЗапросаС);	
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаЗапросаПо));
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.OrderCode = "";
		Стр.OrderName = "";
		Стр.OrderNumDoc = "";
		Стр.ContragentCode = "";
		Стр.ContractCode = "";
		Стр.DateCreate = "";
		Стр.ShipmentDate = "";
		Стр.ActivationDate = "";
		Стр.CompletionDate = "";
		Стр.ConsigneeCode = ""; 
		Стр.IncotermsCode = "";
		Стр.WoodKindCode = "";
		Стр.Thickness = 0;
		Стр.Width = 0;
		Стр.TypeProdCode = "";
		Стр.GradeCode = "";
		Стр.MinLength = 0;
        Стр.MaxLength = 0;
		Стр.CurrencyCode = "";
		Стр.Cost = 0;
		Стр.VolumeOrdered = 0;
		Стр.Margin = 0;
		Стр.VolumeShipped = 0;
		Стр.VolumeReserved = 0;
		Стр.Status = 0;
		Стр.GroupNumber = "";
		Стр.PacketNumbers = "";
	КонецЕсли;
	
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция OrderShipmentAction(Запрос)
	
	ПарамСтрДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");
	ПарамСтрДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo");
	
	Если ПарамСтрДатаС = Неопределено ИЛИ ПарамСтрДатаПо = Неопределено  Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапросаС = ПреобразоватьСтрокуВДату(ПарамСтрДатаС);
	ДатаЗапросаПо = ПреобразоватьСтрокуВДату(ПарамСтрДатаПо);
	
	Если ДатаЗапросаС = Неопределено ИЛИ ДатаЗапросаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;    
	
	Запрос.Текст = ПолучитьТекстЗапросаOrderShipment();
	
	СписокНоменклатуры = Новый Массив;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001"));   //Пиломатериал
	
	Запрос.УстановитьПараметр("Дата1", ДатаЗапросаС + 8*3600);	
	Запрос.УстановитьПараметр("Дата2", НачалоДня(ДатаЗапросаПо) + 8*3600);   		
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.OrderCode = "";
		Стр.ContragentCode = "";
		Стр.ContractCode = "";
		Стр.DateCreate = "";
		Стр.ConsigneeCode = ""; 
		Стр.WoodKindCode = "";
		Стр.Thickness = 0;
		Стр.Width = 0;
		Стр.TypeProdCode = "";
		Стр.GradeCode = "";
		Стр.CurrencyCode = "";
		Стр.Cost = 0;
		Стр.VolumeShipped = 0;
		Стр.Length = 0;
		Стр.ShipmentDate = "";
	КонецЕсли;
	
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция LumberProductionAction(Запрос)
	
	ПарамСтрДатаС = Запрос.ПараметрыЗапроса.Получить("dateFrom");
	ПарамСтрДатаПо = Запрос.ПараметрыЗапроса.Получить("dateTo");
	
	ПарамСтрБулево = Запрос.ПараметрыЗапроса.Получить("WithoutML");
	
	Если ПарамСтрДатаС = Неопределено ИЛИ ПарамСтрДатаПо = Неопределено  Тогда //страница не найдена 
		HTTPОтвет = Новый HTTPСервисОтвет(404);
		Возврат HTTPОтвет;
	КонецЕсли;
	
	ДатаЗапросаС = ПреобразоватьСтрокуВДату(ПарамСтрДатаС);
	ДатаЗапросаПо = ПреобразоватьСтрокуВДату(ПарамСтрДатаПо);
	
	Если ДатаЗапросаС = Неопределено ИЛИ ДатаЗапросаПо = Неопределено Тогда //синтаксис
		HTTPОтвет = Новый HTTPСервисОтвет(400); 
		Возврат HTTPОтвет;
	КонецЕсли; 
	
	Запрос = Новый Запрос;    
	
	Если ПарамСтрБулево <> Неопределено Тогда
		Запрос.Текст = ПолучитьТекстЗапросаLumberProduction_1(); 		
	Иначе
		Запрос.Текст = ПолучитьТекстЗапросаLumberProduction(); 			
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаЗапросаС) + 8*3600);	
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаЗапросаПо) + 8*3600);  
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	
	Если ТЗ.Количество() = 0 Тогда 
		Стр = ТЗ.Добавить();
		Стр.WoodKindCode = "";
		Стр.ThicknessProd = 0;
		Стр.WidthProd = 0;
		Стр.TypeProdCode = "";
		Стр.GradeCode = "";
		Стр.Volume = 0;
	КонецЕсли;
	
	Ответ = ВернутьОтветJSON(ТЗ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Insert("Content-Type","text/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(Ответ);
	
	Возврат HTTPОтвет;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//////////////////////////// ТЕКСТЫ ЗАПРОСОВ К БД //////////////////////////////////////////////////////////////////////////////  

Функция ПолучитьТекстЗапросаWoodStore()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код, """") КАК StoreCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	"""" КАК SortGroupCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ДиаметрММ, 0) КАК Diameter,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем, 0)
	|	КОНЕЦ КАК Count,
	|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0) КАК Volume
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			Номенклатура В (&СписокНоменклатуры)
	|				И СтруктурнаяЕдиница.Код = ""ПБ-000001""
	|				И Штабель.Код = ""000000001"") КАК алк_ОстаткиЗапасовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_ПараметрыХарактеристик.Порода.Наименование,
	|	алк_ПараметрыХарактеристик.Сорт.Наименование,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса1()

Функция ПолучитьТекстЗапросаWoodDelivery()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Производитель.Код КАК ContragentCode,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Порода.Код КАК WoodKindCode,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Штабель.Код КАК SortGroupCode,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Сечение.ДиаметрММ КАК Diameter,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Длина.ДлинаММ / 1000 КАК Length,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Сорт.Код КАК GradeCode,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Количество КАК Count,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Объем КАК Volume
	|ПОМЕСТИТЬ ВТ_ОУ
	|ИЗ
	|	Документ.алк_ПриемкаЛесопродукции.ПиловочникОУ КАК алк_ПриемкаЛесопродукцииПиловочникОУ
	|ГДЕ
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Проведен
	|	И (алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Производитель.Код = &ContragentCode
	|			ИЛИ &ПоВсемПоставщикам)
	|	И алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И алк_ПриемкаЛесопродукцииПиловочникОУ.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ПоВсемПоставщикам
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОУ.ContragentCode, """")
	|	КОНЕЦ КАК ContragentCode,
	|	ЕСТЬNULL(ВТ_ОУ.WoodKindCode, """") КАК WoodKindCode,
	|	ЕСТЬNULL(ВТ_ОУ.Diameter, 0) КАК Diameter,
	|	ЕСТЬNULL(ВТ_ОУ.Length, 0) КАК Length,
	|	ЕСТЬNULL(ВТ_ОУ.GradeCode, """") КАК GradeCode,
	|	СУММА(ЕСТЬNULL(ВТ_ОУ.Count, 0)) КАК Count,
	|	СУММА(ЕСТЬNULL(ВТ_ОУ.Volume, 0)) КАК Volume
	|ИЗ
	|	ВТ_ОУ КАК ВТ_ОУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &ПоВсемПоставщикам
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОУ.ContragentCode, """")
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_ОУ.WoodKindCode, """"),
	|	ЕСТЬNULL(ВТ_ОУ.Diameter, 0),
	|	ЕСТЬNULL(ВТ_ОУ.Length, 0),
	|	ЕСТЬNULL(ВТ_ОУ.GradeCode, """")";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса2()

Функция ПолучитьТекстЗапросаWoodIncome()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Производитель.Код, """") КАК ContragentCode,
	|	ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Производитель.Код, """") КАК StoreTakeCode,
	|	ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникОУ.Номенклатура.Код, """") КАК WoodCode,
	|	ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникОУ.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.СтруктурнаяЕдиница.Код, """") КАК StoreIncomeCode,
	|	ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникОУ.Объем, 0) КАК Volume
	|ИЗ
	|	Документ.алк_ПриемкаЛесопродукции.ПиловочникОУ КАК алк_ПриемкаЛесопродукцииПиловочникОУ
	|ГДЕ
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Проведен
	|	И алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И алк_ПриемкаЛесопродукцииПиловочникОУ.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Ссылка.Производитель,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Номенклатура,
	|	алк_ПриемкаЛесопродукцииПиловочникОУ.Порода";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса3()

Функция ПолучитьТекстЗапросаLumberStore()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код В (""ПБ-000095"", ""ПБ-000097"", ""ПБ-000098"")
	|			ТОГДА ""СухойСклад""
	|		ИНАЧЕ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код
	|	КОНЕЦ КАК СтруктурнаяЕдиницаКод,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер.Наименование КАК СерийныйНомерНаименование,
	|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПакеты
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			Номенклатура В (&СписокНоменклатуры)
	|				И (СтруктурнаяЕдиница.Код В (""00-000005"", ""ПБ-000095"", ""ПБ-000097"", ""ПБ-000098"")
	|					ИЛИ СтруктурнаяЕдиница.Код = ""00-000001""
	|						И Штабель = &ПустойШтабель)) КАК алк_ОстаткиЗапасовОстатки
	|ГДЕ
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток > 0
	|	И НЕ алк_ОстаткиЗапасовОстатки.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОстаткиПакеты.СтруктурнаяЕдиницаКод, """") КАК StoreCode,
	|	ЕСТЬNULL(ВТ_ОстаткиПакеты.СерийныйНомер.Представление, """") КАК PacketNumber,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ВТ_ОстаткиПакеты.СерийныйНомер.Наименование, 1, 2) = ""СП""
	|			ТОГДА ""СП""
	|		КОГДА ПОДСТРОКА(ВТ_ОстаткиПакеты.СерийныйНомер.Наименование, 1, 2) = ""МС""
	|			ТОГДА ""МС""
	|		ИНАЧЕ ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """")
	|	КОНЕЦ КАК TypeProdCode,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	|			ТОГДА ""All""
	|		ИНАЧЕ ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Код, """")
	|	КОНЕЦ КАК GradeCode,
	|	ЕСТЬNULL(ВТ_ОстаткиПакеты.КоличествоОстаток, 0) КАК Volume,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Влажность.Код = ""000000001""
	|			ТОГДА 65
	|		ИНАЧЕ ВЫБОР
	|				КОГДА алк_ПараметрыХарактеристик.Влажность.Код = ""000000002""
	|					ТОГДА 12
	|				ИНАЧЕ ВЫБОР
	|						КОГДА алк_ПараметрыХарактеристик.Влажность.Код = ""000000003""
	|							ТОГДА 18
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Wetness,
	|	0 КАК SawType,
	|	ЕСТЬNULL(ПОДСТРОКА(ВТ_ОстаткиПакеты.СерийныйНомер.Наименование, 1, 2), """") КАК PacketCode,
	|	""00001"" КАК WorkCenterCode,
	|	ЕСТЬNULL(ПериодСозданияПакетов.Период, """") КАК DateCreate,
	|	ЕСТЬNULL(ПериодСозданияПакетов.Период, """") КАК DateIncome,
	|	0 КАК SelfCost,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) <> 0
	|			ТОГДА ОКР(ВТ_ОстаткиПакеты.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Count
	|ИЗ
	|	ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО ВТ_ОстаткиПакеты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	|				&ДатаОстатков,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиПакеты.СерийныйНомер
	|					ИЗ
	|						ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			алк_ОстаткиЗапасов.Период КАК Период,
	|			алк_ОстаткиЗапасов.СерийныйНомер КАК СерийныйНомер
	|		ИЗ
	|			РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	|		ГДЕ
	|			алк_ОстаткиЗапасов.СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиПакеты.СерийныйНомер
	|					ИЗ
	|						ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты)
	|			И (алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|					ИЛИ алк_ОстаткиЗапасов.Регистратор ССЫЛКА Документ.алк_Производство)) КАК ПериодСозданияПакетов
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = ПериодСозданияПакетов.СерийныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	PacketNumber";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса4()

Функция ПолучитьТекстЗапросаLumberStore_Старый()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код В (""ПБ-000095"", ""ПБ-000097"", ""ПБ-000098"")
	|			ТОГДА ""СухойСклад""
	|		ИНАЧЕ алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код
	|	КОНЕЦ КАК СтруктурнаяЕдиницаКод,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер.Наименование КАК СерийныйНомерНаименование,
	|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПакеты
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			Номенклатура В (&СписокНоменклатуры)
	|				И (СтруктурнаяЕдиница.Код В (""00-000005"", ""ПБ-000095"", ""ПБ-000097"", ""ПБ-000098"")
	|					ИЛИ СтруктурнаяЕдиница.Код = ""00-000001""
	|						И Штабель = &ПустойШтабель)) КАК алк_ОстаткиЗапасовОстатки
	|ГДЕ
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиСН.Период КАК Период,
	|	ОстаткиСН.Регистратор КАК Регистратор,
	|	ОстаткиСН.ВидДвижения КАК ВидДвижения,
	|	ОстаткиСН.СтруктурнаяЕдиницаКод КАК СтруктурнаяЕдиницаКод,
	|	ОстаткиСН.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ ОборотыПоСННаОстатках
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_ОстаткиЗапасов.Период КАК Период,
	|		алк_ОстаткиЗапасов.Регистратор КАК Регистратор,
	|		алк_ОстаткиЗапасов.ВидДвижения КАК ВидДвижения,
	|		алк_ОстаткиЗапасов.СтруктурнаяЕдиница.Код КАК СтруктурнаяЕдиницаКод,
	|		алк_ОстаткиЗапасов.СерийныйНомер КАК СерийныйНомер
	|	ИЗ
	|		РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	|	ГДЕ
	|		алк_ОстаткиЗапасов.СерийныйНомер В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиПакеты.СерийныйНомер
	|				ИЗ
	|					ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты)) КАК ОстаткиСН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыПоСННаОстатках.Период КАК Период,
	|	ОборотыПоСННаОстатках.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ ПериодСозданияПакетов
	|ИЗ
	|	ОборотыПоСННаОстатках КАК ОборотыПоСННаОстатках
	|ГДЕ
	|	(ОборотыПоСННаОстатках.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|			ИЛИ ОборотыПоСННаОстатках.Регистратор ССЫЛКА Документ.алк_Производство)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ОборотыПоСННаОстатках.Период) КАК Период,
	|	ОборотыПоСННаОстатках.СерийныйНомер КАК СерийныйНомер
	|ПОМЕСТИТЬ ПериодПоступленияПакетовНаСклад
	|ИЗ
	|	ОборотыПоСННаОстатках КАК ОборотыПоСННаОстатках
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты
	|		ПО ОборотыПоСННаОстатках.СерийныйНомер = ВТ_ОстаткиПакеты.СерийныйНомер
	|			И ОборотыПоСННаОстатках.СтруктурнаяЕдиницаКод = ВТ_ОстаткиПакеты.СтруктурнаяЕдиницаКод
	|ГДЕ
	|	ОборотыПоСННаОстатках.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыПоСННаОстатках.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОстаткиПакеты.СтруктурнаяЕдиницаКод, """") КАК StoreCode,
	|	ЕСТЬNULL(ВТ_ОстаткиПакеты.СерийныйНомер.Представление, """") КАК PacketNumber,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ВТ_ОстаткиПакеты.СерийныйНомер.Наименование, 1, 2) = ""СП""
	|			ТОГДА ""СП""
	|		КОГДА ПОДСТРОКА(ВТ_ОстаткиПакеты.СерийныйНомер.Наименование, 1, 2) = ""МС""
	|			ТОГДА ""МС""
	|		ИНАЧЕ ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """"))
	|	КОНЕЦ КАК TypeProdCode,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	|			ТОГДА ""All""
	|		ИНАЧЕ ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Код, """")
	|	КОНЕЦ КАК GradeCode,
	|	ЕСТЬNULL(ВТ_ОстаткиПакеты.КоличествоОстаток, 0) КАК Volume,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Влажность.Код = ""000000001""
	|			ТОГДА 65
	|		ИНАЧЕ ВЫБОР
	|				КОГДА алк_ПараметрыХарактеристик.Влажность.Код = ""000000002""
	|					ТОГДА 12
	|				ИНАЧЕ ВЫБОР
	|						КОГДА алк_ПараметрыХарактеристик.Влажность.Код = ""000000003""
	|							ТОГДА 18
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Wetness,
	|	0 КАК SawType,
	|	ЕСТЬNULL(ПОДСТРОКА(ВТ_ОстаткиПакеты.СерийныйНомер.Наименование, 1, 2), """") КАК PacketCode,
	|	""00001"" КАК WorkCenterCode,
	|	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки, ЕСТЬNULL(ПериодСозданияПакетов.Период, """")) КАК DateCreate,
	|	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки, ЕСТЬNULL(ПериодСозданияПакетов.Период, """")) КАК DateIncome,
	|	0 КАК SelfCost,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) <> 0
	|			ТОГДА ОКР(ВТ_ОстаткиПакеты.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Count
	|ИЗ
	|	ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				&ДатаОстатков,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиПакеты.СерийныйНомер
	|					ИЗ
	|						ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО ВТ_ОстаткиПакеты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	|				&ДатаОстатков,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиПакеты.СерийныйНомер
	|					ИЗ
	|						ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодСозданияПакетов КАК ПериодСозданияПакетов
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = ПериодСозданияПакетов.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодПоступленияПакетовНаСклад КАК ПериодПоступленияПакетовНаСклад
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = ПериодПоступленияПакетовНаСклад.СерийныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	PacketNumber";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса4()

Функция ПолучитьТекстЗапросаLumberInTunnels_1()
	
	ЗапросТекст = "ВЫБРАТЬ
	              |	алк_ПроизводствоОборотОбороты.СерийныйНомер КАК СерийныйНомер,
	              |	алк_ПроизводствоОборотОбороты.Период КАК Период,
	              |	алк_ПроизводствоОборотОбороты.Штабель.Код КАК ШтабельКод,
	              |	алк_ПроизводствоОборотОбороты.Характеристика КАК Характеристика,
	              |	алк_ПроизводствоОборотОбороты.КоличествоОборот КАК КоличествоОборот,
	              |	ВЫРАЗИТЬ(алк_ПроизводствоОборотОбороты.Регистратор КАК Документ.алк_ЗагрузкаВКамеру).ДатаВыгрузки КАК ДатаВыгрузкиПлан
	              |ПОМЕСТИТЬ ВТ_ВсеПакетыКоторыеСушились
	              |ИЗ
	              |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	              |			ДОБАВИТЬКДАТЕ(&ДатаНачала, ЧАС, 8),
	              |			&ДатаОкончания,
	              |			Регистратор,
	              |			Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	              |				И (Склад.Код = ""ПБ-000031""
	              |					ИЛИ Склад.Код = ""ПБ-000090"")
	              |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)) КАК алк_ПроизводствоОборотОбороты
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	алк_ПроизводствоОборотОбороты.СерийныйНомер КАК СерийныйНомер,
	              |	алк_ПроизводствоОборотОбороты.Период КАК Период,
	              |	алк_ПроизводствоОборотОбороты.Штабель.Код КАК ШтабельКод,
	              |	алк_ПроизводствоОборотОбороты.КоличествоОборот КАК КоличествоОборот,
	              |	ВЫРАЗИТЬ(алк_ПроизводствоОборотОбороты.Регистратор КАК Документ.алк_ВыгрузкаИзКамеры).Дата КАК ДатаВыгрузкиФакт
	              |ПОМЕСТИТЬ ВТ_ВсеПакетыКоторыеПросушились
	              |ИЗ
	              |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	              |			ДОБАВИТЬКДАТЕ(&ДатаНачала, ЧАС, 8),
	              |			&ДатаОкончания,
	              |			Регистратор,
	              |			Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	              |				И (Склад.Код = ""ПБ-000031""
	              |					ИЛИ Склад.Код = ""ПБ-000090"")
	              |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано)) КАК алк_ПроизводствоОборотОбороты
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
	              |	МИНИМУМ(алк_ОстаткиЗапасовОбороты.Период) КАК Период
	              |ПОМЕСТИТЬ ВТ_ДатаСозданияПакета
	              |ИЗ
	              |	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	              |			,
	              |			,
	              |			Секунда,
	              |			СерийныйНомер В
	              |				(ВЫБРАТЬ
	              |					ВТ_ВсеПакетыКоторыеСушились.СерийныйНомер
	              |				ИЗ
	              |					ВТ_ВсеПакетыКоторыеСушились КАК ВТ_ВсеПакетыКоторыеСушились)) КАК алк_ОстаткиЗапасовОбороты
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_ОстаткиЗапасовОбороты.СерийныйНомер
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЕСТЬNULL(ВТ_ВсеПакетыКоторыеПросушились.ШтабельКод, ВТ_ВсеПакетыКоторыеСушились.ШтабельКод) КАК TunnelCode,
	              |	ЕСТЬNULL(ВТ_ВсеПакетыКоторыеПросушились.СерийныйНомер.Представление, ВТ_ВсеПакетыКоторыеСушились.СерийныйНомер.Представление) КАК PacketNumber,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length,
	              |	ПОДСТРОКА(ЕСТЬNULL(ВТ_ВсеПакетыКоторыеПросушились.СерийныйНомер.Наименование, ВТ_ВсеПакетыКоторыеСушились.СерийныйНомер.Наименование), 1, 2) КАК TypeProdCode,
	              |	ВЫБОР
	              |		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	              |			ТОГДА ""All""
	              |		ИНАЧЕ ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Код, """")
	              |	КОНЕЦ КАК GradeCode,
	              |	ЕСТЬNULL(ВТ_ВсеПакетыКоторыеПросушились.КоличествоОборот, ВТ_ВсеПакетыКоторыеСушились.КоличествоОборот) КАК Volume,
	              |	0 КАК Wetness,
	              |	0 КАК SawType,
	              |	""СП"" КАК PacketCode,
	              |	&КодРабочегоЦентраВыпустившегоПакет КАК WorkCenterCode,
	              |	ЕСТЬNULL(ВТ_ДатаСозданияПакета.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК DateCreate,
	              |	ЕСТЬNULL(ВТ_ВсеПакетыКоторыеСушились.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК DateIncome,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(ВТ_ВсеПакетыКоторыеПросушились.ДатаВыгрузкиФакт, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	              |			ТОГДА ЕСТЬNULL(ВТ_ВсеПакетыКоторыеСушились.ДатаВыгрузкиПлан, ДАТАВРЕМЯ(1, 1, 1))
	              |		ИНАЧЕ ВТ_ВсеПакетыКоторыеПросушились.ДатаВыгрузкиФакт
	              |	КОНЕЦ КАК DateOutcome,
	              |	0 КАК SelfCost,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) <> 0
	              |			ТОГДА ОКР(ЕСТЬNULL(ВТ_ВсеПакетыКоторыеПросушились.КоличествоОборот, ВТ_ВсеПакетыКоторыеСушились.КоличествоОборот) / алк_ПараметрыХарактеристик.Объем)
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК Count
	              |ИЗ
	              |	ВТ_ВсеПакетыКоторыеСушились КАК ВТ_ВсеПакетыКоторыеСушились
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеПакетыКоторыеПросушились КАК ВТ_ВсеПакетыКоторыеПросушились
	              |		ПО ВТ_ВсеПакетыКоторыеСушились.СерийныйНомер = ВТ_ВсеПакетыКоторыеПросушились.СерийныйНомер
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	              |		ПО ВТ_ВсеПакетыКоторыеСушились.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаСозданияПакета КАК ВТ_ДатаСозданияПакета
	              |		ПО ВТ_ВсеПакетыКоторыеСушились.СерийныйНомер = ВТ_ДатаСозданияПакета.СерийныйНомер
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	PacketNumber";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ПолучитьТекстЗапросаLumberInTunnelsStruct_1()
	
	ЗапросТекст = "ВЫБРАТЬ
	              |	ЕСТЬNULL(алк_ПроизводствоОборотОбороты.СерийныйНомер.Представление, """") КАК PacketNumber,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) <> 0
	              |			ТОГДА ВЫРАЗИТЬ(алк_ПроизводствоОборотОбороты.КоличествоОборот / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(5, 0))
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК Count,
	              |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length
	              |ИЗ
	              |	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	              |			ДОБАВИТЬКДАТЕ(&ДатаНачала, ЧАС, 8),
	              |			&ДатаОкончания,
	              |			Регистратор,
	              |			Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	              |				И (Склад.Код = ""ПБ-000031""
	              |					ИЛИ Склад.Код = ""ПБ-000090"")
	              |				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)
	              |				И Штабель <> ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)) КАК алк_ПроизводствоОборотОбороты
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	              |		ПО алк_ПроизводствоОборотОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика";
	
	Возврат ЗапросТекст;
	
КонецФункции

Функция ПолучитьТекстЗапросаLumberProductionInput_1()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовЗапасы.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовЗапасы.Ссылка.Смена,
	|	алк_ПараметрыХарактеристик.Порода.Код,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10 КАК Диаметр,
	|	СУММА(алк_СборкаЗапасовЗапасы.Объем) КАК Объем
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_СборкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_СборкаЗапасовЗапасы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И алк_СборкаЗапасовЗапасы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_СборкаЗапасовЗапасы.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовЗапасы.Ссылка.Смена,
	|	алк_ПараметрыХарактеристик.Порода.Код,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000,
	|	алк_ПараметрыХарактеристик.Сечение.ДиаметрММ / 10
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ.Смена = &СменаДень
	|			ТОГДА ""День_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ ""Ночь_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|	КОНЕЦ КАК ShiftCode,
	|	ВТ.ПородаКод КАК WoodKindCode,
	|	ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Диаметр * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Диаметр * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Длина * 6)) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Длина * 60)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Длина * 600)) / 6 + 1, 1) КАК SortGroupCode,
	|	СУММА(ВТ.Объем) КАК Volume
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВТ.Смена = &СменаДень
	|			ТОГДА ""День_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ ""Ночь_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|	КОНЕЦ,
	|	ВТ.ПородаКод,
	|	ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Диаметр * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Диаметр * 6)) / 6 + 1, 1) + ""-"" + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Длина * 6)) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Длина * 60)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ВТ.Длина * 600)) / 6 + 1, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ShiftCode,
	|	ВТ.ПородаКод,
	|	SortGroupCode";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса8_1()

Функция ПолучитьТекстЗапросаLumberProductionOutput_2()  
	
	// тут нужно на навый выпуск продукции переходить
	
	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	алк_СборкаЗапасовПродукция.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовПродукция.Ссылка.Смена,
	|	алк_ПараметрыХарактеристик.Порода.Код,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код КАК TypeProdCode,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	|			ТОГДА ""All""
	|		ИНАЧЕ алк_ПараметрыХарактеристик.Сорт.Код
	|	КОНЕЦ КАК GradeCode,
	|	СУММА(алк_СборкаЗапасовПродукция.Объем) КАК Объем,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК Длина
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_СборкаЗапасовПродукция.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				&Дата2,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						алк_СборкаЗапасовПродукция.СерийныеНомера
	|					ИЗ
	|						Документ.алк_СборкаЗапасов.Продукция КАК алк_СборкаЗапасовПродукция
	|					ГДЕ
	|						алк_СборкаЗапасовПродукция.Ссылка.Проведен
	|						И алк_СборкаЗапасовПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|						И алк_СборкаЗапасовПродукция.Номенклатура В (&СписокНоменклатуры))) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_СборкаЗапасовПродукция.СерийныеНомера = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_СборкаЗапасовПродукция.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И алк_СборкаЗапасовПродукция.Ссылка.Проведен
	|	И алк_СборкаЗапасовПродукция.Номенклатура В(&СписокНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ПараметрыХарактеристик.Порода.Код,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000,
	|	алк_СборкаЗапасовПродукция.Ссылка.ДатаСмены,
	|	алк_СборкаЗапасовПродукция.Ссылка.Смена,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	|			ТОГДА ""All""
	|		ИНАЧЕ алк_ПараметрыХарактеристик.Сорт.Код
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ.Смена = &СменаДень
	|			ТОГДА ""День_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ ""Ночь_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|	КОНЕЦ КАК ShiftCode,
	|	ЕСТЬNULL(ВТ.ПородаКод, """") КАК WoodKindCode,
	|	ЕСТЬNULL(ВТ.СечениеТолщинаММ, 0) КАК Thickness,
	|	ЕСТЬNULL(ВТ.СечениеШиринаММ, 0) КАК Width,
	|	ЕСТЬNULL(ВТ.TypeProdCode, """") КАК TypeProdCode,
	|	ЕСТЬNULL(ВТ.GradeCode, """") КАК GradeCode,
	|	СУММА(ЕСТЬNULL(ВТ.Объем, 0)) КАК Volume,
	|	ЕСТЬNULL(ВТ.Длина, 0) КАК Length
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ВТ.Смена = &СменаДень
	|			ТОГДА ""День_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|		ИНАЧЕ ""Ночь_"" + ПОДСТРОКА(""0123456789"", ДЕНЬ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ВТ.ДатаСмены) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ВТ.ДатаСмены))) / 6 + 1, 1) + ""."" + ПОДСТРОКА(""0123456789"", ГОД(ВТ.ДатаСмены) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ВТ.ДатаСмены) * 6)) / 6 + 1, 1)
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ.TypeProdCode, """"),
	|	ЕСТЬNULL(ВТ.ПородаКод, """"),
	|	ЕСТЬNULL(ВТ.СечениеТолщинаММ, 0),
	|	ЕСТЬNULL(ВТ.СечениеШиринаММ, 0),
	|	ЕСТЬNULL(ВТ.GradeCode, """"),
	|	ЕСТЬNULL(ВТ.Длина, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ShiftCode,
	|	TypeProdCode,
	|	WoodKindCode,
	|	Length,
	|	Width,
	|	Thickness";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса8_2()

Функция ПолучитьТекстЗапросаCustomerAndContract()

	ЗапросТекст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Владелец.Код, """") КАК ContragentCode,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Владелец.Наименование, """") КАК ContragentName,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Владелец.Покупатель
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК IsCustomer,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Владелец.Покупатель
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК IsConsignee,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Код, """") КАК ContractCode,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Наименование, """") КАК ContractName,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ДатаДоговора, """") КАК ContractDate,
	|	ДОБАВИТЬКДАТЕ(ДоговорыКонтрагентов.ДатаДоговора, ГОД, 10) КАК DateExpiration
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Наименование <> ""Основной договор""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ContragentCode,
	|	ContractCode";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса9()

Функция ПолучитьТекстЗапросаOrder()
	
	//20250214 отключили формирование обмена по старым заказам
	//ЗапросТекст =
	//"ВЫБРАТЬ
	//|	ТЗ.ЗаказПокупателя,
	//|	ТЗ.ИдентификаторТовара,
	//|	ТЗ.СортКод,
	//|	ТЗ.ДлинаММ,
	//|	ТЗ.ТолщинаММ,
	//|	ТЗ.ШиринаММ,
	//|	ТЗ.СерийныеНомера
	//|ПОМЕСТИТЬ ТЗ
	//|ИЗ
	//|	&ТЗ КАК ТЗ
	//|ГДЕ
	//|	ЛОЖЬ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка,
	//|	СУММА(алк_ЗаказПокупателяОбъемныеГруппы.Объем) КАК Объем
	//|ПОМЕСТИТЬ ВТ_ОбъемЗаказа
	//|ИЗ
	//|	Документ.алк_ЗаказПокупателя.ОбъемныеГруппы КАК алк_ЗаказПокупателяОбъемныеГруппы
	//|ГДЕ
	//|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка.Проведен
	//|	И алк_ЗаказПокупателяОбъемныеГруппы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	//|	И ЛОЖЬ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	алк_ЗаказПокупателяОбъемныеГруппы.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Номер,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Наименование,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.ДопНомер,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Контрагент.Код,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Договор.Код,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Дата,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.ДопДата,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.УсловияПоставки.Код,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Договор.ВалютаРасчетов.Код,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
	//|	алк_ЗаказПокупателяОбъемныеГруппы.стрКатегорияПЭО,
	//|	ВТ_ОбъемЗаказа.Объем,
	//|	алк_ЗаказПокупателяОбъемныеГруппы.Объем КАК ОбъемГруппы,
	//|	алк_ЗаказПокупателяОбъемныеГруппы.ИдентификаторГруппы,
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Закрыт
	//|ПОМЕСТИТЬ ВТ_Заказы
	//|ИЗ
	//|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ЗаказПокупателя.ОбъемныеГруппы КАК алк_ЗаказПокупателяОбъемныеГруппы
	//|		ПО алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы = алк_ЗаказПокупателяОбъемныеГруппы.ИдентификаторГруппы
	//|			И алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = алк_ЗаказПокупателяОбъемныеГруппы.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемЗаказа КАК ВТ_ОбъемЗаказа
	//|		ПО алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = ВТ_ОбъемЗаказа.Ссылка
	//|ГДЕ
	//|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Проведен
	//|	И алк_ЗаказПокупателяЗапасыАссортимент.Номенклатура.Код = ""ПБ-00000001""
	//|	И алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	//|	И алк_ЗаказПокупателяОбъемныеГруппы.Ссылка.Проведен
	//|	И алк_ЗаказПокупателяОбъемныеГруппы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	//|	И ЛОЖЬ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_КатегорияНоменклатурыПЭО.Ссылка,
	//|	алк_КатегорияНоменклатурыПЭО.Наименование
	//|ПОМЕСТИТЬ ВТ_КатегорииПЭО
	//|ИЗ
	//|	Справочник.алк_КатегорияНоменклатурыПЭО КАК алк_КатегорияНоменклатурыПЭО
	//|ГДЕ
	//|	НЕ алк_КатегорияНоменклатурыПЭО.ПометкаУдаления
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ПараметрыХарактеристик.Порода.Код КАК WoodKindCode,
	//|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Thickness,
	//|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Width,
	//|	ВЫБОР
	//|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	//|			ТОГДА ""All""
	//|		ИНАЧЕ алк_ПараметрыХарактеристик.Сорт.Код
	//|	КОНЕЦ КАК GradeCode,
	//|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК MinLength,
	//|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК MaxLength,
	//|	"""" КАК CurrencyCode,
	//|	0 КАК Cost,
	//|	10 КАК Margin,
	//|	0 КАК VolumeShipped,
	//|	0 КАК VolumeReserved,
	//|	ВТ_Заказы.ИдентификаторГруппы КАК GroupNumber,
	//|	ВТ_Заказы.Номер,
	//|	ВТ_Заказы.Наименование,
	//|	ВТ_Заказы.ДопНомер,
	//|	ВТ_Заказы.КонтрагентКод,
	//|	ВТ_Заказы.ДоговорКод,
	//|	ВТ_Заказы.Дата,
	//|	ВТ_Заказы.ДопДата,
	//|	ВТ_Заказы.УсловияПоставкиКод,
	//|	ВТ_Заказы.ДоговорВалютаРасчетовКод,
	//|	ВТ_Заказы.Ссылка,
	//|	МАКСИМУМ(ВТ_Заказы.Объем) КАК Объем,
	//|	МАКСИМУМ(ВТ_Заказы.ОбъемГруппы) КАК ОбъемГруппы,
	//|	ВТ_Заказы.ИдентификаторГруппы,
	//|	ВТ_Заказы.Закрыт,
	//|	ВТ_КатегорииПЭО.Ссылка.Код КАК КодКатегорияПЭО
	//|ПОМЕСТИТЬ ВТ_ЗаказыИтог
	//|ИЗ
	//|	ВТ_Заказы КАК ВТ_Заказы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//|		ПО ВТ_Заказы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегорииПЭО КАК ВТ_КатегорииПЭО
	//|		ПО (ВТ_Заказы.стрКатегорияПЭО ПОДОБНО ""%"" + ВТ_КатегорииПЭО.Наименование + ""%"")
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	//|			ТОГДА ""All""
	//|		ИНАЧЕ алк_ПараметрыХарактеристик.Сорт.Код
	//|	КОНЕЦ,
	//|	алк_ПараметрыХарактеристик.Порода.Код,
	//|	ВТ_Заказы.ИдентификаторГруппы,
	//|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	//|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000,
	//|	ВТ_Заказы.Номер,
	//|	ВТ_Заказы.КонтрагентКод,
	//|	ВТ_Заказы.Наименование,
	//|	ВТ_Заказы.Закрыт,
	//|	ВТ_Заказы.ДопНомер,
	//|	ВТ_Заказы.УсловияПоставкиКод,
	//|	ВТ_Заказы.ДоговорВалютаРасчетовКод,
	//|	ВТ_Заказы.Дата,
	//|	ВТ_Заказы.Ссылка,
	//|	ВТ_Заказы.ДопДата,
	//|	ВТ_Заказы.ДоговорКод,
	//|	ВТ_КатегорииПЭО.Ссылка.Код,
	//|	ВТ_Заказы.ИдентификаторГруппы,
	//|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТЗ.ЗаказПокупателя,
	//|	ТЗ.ИдентификаторТовара,
	//|	ТЗ.СортКод,
	//|	ТЗ.ДлинаММ,
	//|	ТЗ.ТолщинаММ,
	//|	ТЗ.ШиринаММ,
	//|	ТЗ.СерийныеНомера
	//|ПОМЕСТИТЬ ТЗ_А
	//|ИЗ
	//|	&ТЗ1 КАК ТЗ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПОДСТРОКА(СТРОКА(ГОД(алк_АддендумыТовары.Ссылка.Дата)), 4, 2) + ""А"" + алк_АддендумыТовары.Ссылка.Номер КАК Номер,
	//|	алк_АддендумыТовары.Ссылка.Наименование,
	//|	алк_АддендумыТовары.Ссылка.НомерАддендума,
	//|	алк_АддендумыТовары.Ссылка.Контрагент.Код,
	//|	алк_АддендумыТовары.Ссылка.Договор.Код,
	//|	алк_АддендумыТовары.Ссылка.Дата,
	//|	алк_АддендумыТовары.Ссылка.ДатаАддендума,
	//|	алк_АддендумыТовары.Ссылка.КодУсловийПоставки.Наименование КАК КодУсловийПоставкиКод,
	//|	алк_АддендумыТовары.Ссылка.Договор.ВалютаРасчетов.Код,
	//|	алк_АддендумыТовары.Ссылка.Ссылка,
	//|	алк_АддендумыТовары.Ссылка.Статус,
	//|	алк_АддендумыТовары.ИдентификаторТовара,
	//|	алк_АддендумыТовары.Номенклатура,
	//|	алк_АддендумыТовары.Количество,
	//|	алк_АддендумыТовары.Цена,
	//|	алк_АддендумыТовары.Сумма,
	//|	алк_АддендумыТовары.ПредставлениеТовара,
	//|	алк_АддендумыТовары.ПредставлениеВручную,
	//|	алк_АддендумыТовары.КатегорияПЭО,
	//|	алк_АддендумыТовары.НомерСтроки,
	//|	алк_АддендумыТовары.Ссылка.Валюта.Код
	//|ПОМЕСТИТЬ ВТ_АктуальныеАдд
	//|ИЗ
	//|	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
	//|ГДЕ
	//|	алк_АддендумыТовары.Ссылка.Проведен
	//|	И алк_АддендумыТовары.Номенклатура.Код = ""ПБ-00000001""
	//|	И алк_АддендумыТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_АддендумыСоставТоваров.Ссылка,
	//|	алк_АддендумыСоставТоваров.ИдентификаторТовара,
	//|	алк_АддендумыСоставТоваров.Порода,
	//|	алк_АддендумыСоставТоваров.Сорт,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ПараметрыХарактеристик.Характеристика) КАК Характеристика,
	//|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
	//|	МИНИМУМ(алк_ПараметрыХарактеристик.Длина.ДлинаММ) КАК МинДлинаДлинаММ,
	//|	МАКСИМУМ(алк_ПараметрыХарактеристик.Длина.ДлинаММ) КАК МаксДлинаДлинаММ
	//|ПОМЕСТИТЬ ВТ_СоставТоваров
	//|ИЗ
	//|	Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
	//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//|		ПО алк_АддендумыСоставТоваров.Сорт = алк_ПараметрыХарактеристик.Сорт
	//|			И алк_АддендумыСоставТоваров.Порода = алк_ПараметрыХарактеристик.Порода
	//|			И (алк_ПараметрыХарактеристик.Сечение.ШиринаММ >= алк_АддендумыСоставТоваров.ШиринаОт)
	//|			И (ВЫБОР
	//|				КОГДА алк_АддендумыСоставТоваров.ШиринаДо = 0
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ алк_ПараметрыХарактеристик.Сечение.ШиринаММ <= алк_АддендумыСоставТоваров.ШиринаДо
	//|			КОНЕЦ)
	//|			И (алк_ПараметрыХарактеристик.Сечение.ТолщинаММ >= алк_АддендумыСоставТоваров.ТолщинаОт)
	//|			И (ВЫБОР
	//|				КОГДА алк_АддендумыСоставТоваров.ТолщинаДо = 0
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ алк_ПараметрыХарактеристик.Сечение.ТолщинаММ <= алк_АддендумыСоставТоваров.ТолщинаДо
	//|			КОНЕЦ)
	//|			И (алк_ПараметрыХарактеристик.Длина.ДлинаММ >= алк_АддендумыСоставТоваров.ДлинаОт)
	//|			И (ВЫБОР
	//|				КОГДА алк_АддендумыСоставТоваров.ДлинаДо = 0
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ алк_ПараметрыХарактеристик.Длина.ДлинаММ <= алк_АддендумыСоставТоваров.ДлинаДо
	//|			КОНЕЦ)
	//|			И (алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности >= алк_АддендумыСоставТоваров.ВлажностьОт)
	//|			И (ВЫБОР
	//|				КОГДА алк_АддендумыСоставТоваров.ВлажностьДо = 0
	//|					ТОГДА ИСТИНА
	//|				ИНАЧЕ алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности <= алк_АддендумыСоставТоваров.ВлажностьДо
	//|			КОНЕЦ)
	//|ГДЕ
	//|	алк_АддендумыСоставТоваров.Ссылка В
	//|			(ВЫБРАТЬ
	//|				ВТ_АктуальныеАдд.Ссылка
	//|			ИЗ
	//|				ВТ_АктуальныеАдд КАК ВТ_АктуальныеАдд)
	//|	И НЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ = 0
	//|				И алк_ПараметрыХарактеристик.Сечение.ШиринаММ = 0
	//|				И алк_ПараметрыХарактеристик.Сечение.ТолщинаММ = 0)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	алк_АддендумыСоставТоваров.Ссылка,
	//|	алк_АддендумыСоставТоваров.ИдентификаторТовара,
	//|	алк_АддендумыСоставТоваров.Порода,
	//|	алк_АддендумыСоставТоваров.Сорт,
	//|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	//|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_АктуальныеАдд.Ссылка,
	//|	СУММА(ВТ_АктуальныеАдд.Количество) КАК Количество
	//|ПОМЕСТИТЬ ВТ_ОбъемАдд
	//|ИЗ
	//|	ВТ_АктуальныеАдд КАК ВТ_АктуальныеАдд
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_АктуальныеАдд.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_АктуальныеАдд.Номер,
	//|	ВТ_АктуальныеАдд.Наименование,
	//|	ВТ_АктуальныеАдд.НомерАддендума,
	//|	ВТ_АктуальныеАдд.КонтрагентКод,
	//|	ВТ_АктуальныеАдд.ДоговорКод,
	//|	ВТ_АктуальныеАдд.Дата,
	//|	ВТ_АктуальныеАдд.ДатаАддендума,
	//|	ВТ_АктуальныеАдд.КодУсловийПоставкиКод,
	//|	ВТ_АктуальныеАдд.ДоговорВалютаРасчетовКод,
	//|	ВТ_АктуальныеАдд.Ссылка,
	//|	ВТ_АктуальныеАдд.Статус,
	//|	ВТ_АктуальныеАдд.ИдентификаторТовара,
	//|	ВТ_АктуальныеАдд.Номенклатура,
	//|	ВТ_АктуальныеАдд.Количество КАК КоличествоПоГруппе,
	//|	ВТ_АктуальныеАдд.Цена,
	//|	ВТ_АктуальныеАдд.Сумма,
	//|	ВТ_АктуальныеАдд.ПредставлениеТовара,
	//|	ВТ_АктуальныеАдд.ПредставлениеВручную,
	//|	ВТ_АктуальныеАдд.КатегорияПЭО,
	//|	ВТ_СоставТоваров.Порода,
	//|	ВЫБОР
	//|		КОГДА ВТ_СоставТоваров.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	//|			ТОГДА ""All""
	//|		ИНАЧЕ ВТ_СоставТоваров.Сорт.Код
	//|	КОНЕЦ КАК СортКод,
	//|	ВТ_ОбъемАдд.Количество КАК КоличествоПоАдд,
	//|	ВТ_АктуальныеАдд.НомерСтроки,
	//|	ВТ_СоставТоваров.СечениеШиринаММ,
	//|	ВТ_СоставТоваров.СечениеТолщинаММ,
	//|	ВТ_СоставТоваров.МинДлинаДлинаММ,
	//|	ВТ_СоставТоваров.МаксДлинаДлинаММ,
	//|	ВТ_АктуальныеАдд.ВалютаКод
	//|ПОМЕСТИТЬ ВТ_АддИтог
	//|ИЗ
	//|	ВТ_АктуальныеАдд КАК ВТ_АктуальныеАдд
	//|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_СоставТоваров КАК ВТ_СоставТоваров
	//|		ПО ВТ_АктуальныеАдд.Ссылка = ВТ_СоставТоваров.Ссылка
	//|			И ВТ_АктуальныеАдд.ИдентификаторТовара = ВТ_СоставТоваров.ИдентификаторТовара
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемАдд КАК ВТ_ОбъемАдд
	//|		ПО ВТ_АктуальныеАдд.Ссылка = ВТ_ОбъемАдд.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.Номер, """") КАК OrderCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.Наименование, """") КАК OrderName,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.ДопНомер, """") КАК OrderNumDoc,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.КонтрагентКод, """") КАК ContragentCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.ДоговорКод, """") КАК ContractCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.Дата, """") КАК DateCreate,
	//|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТ_ЗаказыИтог.ДопДата, МЕСЯЦ, 1), """") КАК ShipmentDate,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.ДопДата, """") КАК ActivationDate,
	//|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТ_ЗаказыИтог.ДопДата, МЕСЯЦ, 1), """") КАК CompletionDate,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.КонтрагентКод, """") КАК ConsigneeCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.УсловияПоставкиКод, """") КАК IncotermsCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.WoodKindCode, """") КАК WoodKindCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.Thickness, 0) КАК Thickness,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.Width, 0) КАК Width,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.КодКатегорияПЭО, """") КАК TypeProdCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.GradeCode, """") КАК GradeCode,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.MinLength, 0) КАК MinLength,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.MaxLength, 0) КАК MaxLength,
	//|	"""" КАК CurrencyCode,
	//|	0 КАК Cost,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.ОбъемГруппы, 0) КАК VolumeOrdered,
	//|	10 КАК Margin,
	//|	0 КАК VolumeShipped,
	//|	0 КАК VolumeReserved,
	//|	ВЫБОР
	//|		КОГДА ВТ_ЗаказыИтог.Закрыт
	//|			ТОГДА 4
	//|		ИНАЧЕ 3
	//|	КОНЕЦ КАК Status,
	//|	ЕСТЬNULL(ВТ_ЗаказыИтог.GroupNumber, """") КАК GroupNumber,
	//|	ЕСТЬNULL(ТЗ.СерийныеНомера, """") КАК PacketNumbers
	//|ИЗ
	//|	ВТ_ЗаказыИтог КАК ВТ_ЗаказыИтог
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
	//|		ПО ВТ_ЗаказыИтог.GroupNumber = ТЗ.ИдентификаторТовара
	//|			И (ВТ_ЗаказыИтог.MaxLength * 1000 = ТЗ.ДлинаММ)
	//|			И ВТ_ЗаказыИтог.Thickness = ТЗ.ТолщинаММ
	//|			И ВТ_ЗаказыИтог.Width = ТЗ.ШиринаММ
	//|			И ВТ_ЗаказыИтог.Ссылка = ТЗ.ЗаказПокупателя
	//|			И ВТ_ЗаказыИтог.GradeCode = ТЗ.СортКод
	//|ГДЕ
	//|	ЛОЖЬ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ВТ_АддИтог.Номер, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.Наименование, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.НомерАддендума, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.КонтрагентКод, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.ДоговорКод, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.Дата, """"),
	//|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТ_АддИтог.ДатаАддендума, МЕСЯЦ, 1), """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.ДатаАддендума, """"),
	//|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТ_АддИтог.ДатаАддендума, МЕСЯЦ, 1), """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.КонтрагентКод, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.КодУсловийПоставкиКод, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.Порода.Код, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.СечениеТолщинаММ, 0),
	//|	ЕСТЬNULL(ВТ_АддИтог.СечениеШиринаММ, 0),
	//|	ЕСТЬNULL(ВТ_АддИтог.КатегорияПЭО.Код, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.СортКод, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.МинДлинаДлинаММ, 0) / 1000,
	//|	ЕСТЬNULL(ВТ_АддИтог.МаксДлинаДлинаММ, 0) / 1000,
	//|	ЕСТЬNULL(ВТ_АддИтог.ВалютаКод, """"),
	//|	ЕСТЬNULL(ВТ_АддИтог.Цена, 0),
	//|	ЕСТЬNULL(ВТ_АддИтог.КоличествоПоГруппе, 0),
	//|	10,
	//|	0,
	//|	0,
	//|	ВЫБОР
	//|		КОГДА ВТ_АддИтог.Статус = ЗНАЧЕНИЕ(Перечисление.алк_СтатусыАддендума.Закрыт)
	//|			ТОГДА 4
	//|		ИНАЧЕ 3
	//|	КОНЕЦ,
	//|	ЕСТЬNULL(ВТ_АддИтог.НомерСтроки, """"),
	//|	ЕСТЬNULL(ТЗ_А.СерийныеНомера, """")
	//|ИЗ
	//|	ВТ_АддИтог КАК ВТ_АддИтог
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_А КАК ТЗ_А
	//|		ПО ВТ_АддИтог.Ссылка = ТЗ_А.ЗаказПокупателя
	//|			И ВТ_АддИтог.ИдентификаторТовара = ТЗ_А.ИдентификаторТовара
	//|			И ВТ_АддИтог.МаксДлинаДлинаММ = ТЗ_А.ДлинаММ
	//|			И ВТ_АддИтог.СечениеТолщинаММ = ТЗ_А.ТолщинаММ
	//|			И ВТ_АддИтог.СечениеШиринаММ = ТЗ_А.ШиринаММ
	//|			И ВТ_АддИтог.СортКод = ТЗ_А.СортКод
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	OrderCode";
	
	ЗапросТекст = "ВЫБРАТЬ
	              |	ТЗ.ЗаказПокупателя,
	              |	ТЗ.ИдентификаторТовара,
	              |	ТЗ.СортКод,
	              |	ТЗ.ДлинаММ,
	              |	ТЗ.ТолщинаММ,
	              |	ТЗ.ШиринаММ,
	              |	ТЗ.СерийныеНомера
	              |ПОМЕСТИТЬ ТЗ_А
	              |ИЗ
	              |	&ТЗ1 КАК ТЗ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ПОДСТРОКА(СТРОКА(ГОД(алк_АддендумыТовары.Ссылка.Дата)), 4, 2) + ""А"" + алк_АддендумыТовары.Ссылка.Номер КАК Номер,
	              |	алк_АддендумыТовары.Ссылка.Наименование,
	              |	алк_АддендумыТовары.Ссылка.НомерАддендума,
	              |	алк_АддендумыТовары.Ссылка.Контрагент.Код,
	              |	алк_АддендумыТовары.Ссылка.Договор.Код,
	              |	алк_АддендумыТовары.Ссылка.Дата,
	              |	алк_АддендумыТовары.Ссылка.ДатаАддендума,
	              |	алк_АддендумыТовары.Ссылка.КодУсловийПоставки.Наименование КАК КодУсловийПоставкиКод,
	              |	алк_АддендумыТовары.Ссылка.Договор.ВалютаРасчетов.Код,
	              |	алк_АддендумыТовары.Ссылка.Ссылка,
	              |	алк_АддендумыТовары.Ссылка.Статус,
	              |	алк_АддендумыТовары.ИдентификаторТовара,
	              |	алк_АддендумыТовары.Номенклатура,
	              |	алк_АддендумыТовары.Количество,
	              |	алк_АддендумыТовары.Цена,
	              |	алк_АддендумыТовары.Сумма,
	              |	алк_АддендумыТовары.ПредставлениеТовара,
	              |	алк_АддендумыТовары.ПредставлениеВручную,
	              |	алк_АддендумыТовары.КатегорияПЭО,
	              |	алк_АддендумыТовары.НомерСтроки,
	              |	алк_АддендумыТовары.Ссылка.Валюта.Код,
	              |	алк_АддендумыТовары.Ссылка.ОжидаемыйСрокОтгрузки
	              |ПОМЕСТИТЬ ВТ_АктуальныеАдд
	              |ИЗ
	              |	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
	              |ГДЕ
	              |	алк_АддендумыТовары.Ссылка.Проведен
	              |	И алк_АддендумыТовары.Номенклатура.Код = ""ПБ-00000001""
	              |	И алк_АддендумыТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	              |	И алк_АддендумыТовары.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.алк_СтатусыАддендума.ВРаботе), ЗНАЧЕНИЕ(Перечисление.алк_СтатусыАддендума.Закрыт))
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	алк_АддендумыСоставТоваров.Ссылка,
	              |	алк_АддендумыСоставТоваров.ИдентификаторТовара,
	              |	алк_АддендумыСоставТоваров.Порода,
	              |	алк_АддендумыСоставТоваров.Сорт,
	              |	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	              |	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
	              |	алк_АддендумыСоставТоваров.ДлинаОт КАК МинДлинаДлинаММ,
	              |	алк_АддендумыСоставТоваров.ДлинаДо КАК МаксДлинаДлинаММ
	              |ПОМЕСТИТЬ ВТ_СоставТоваров
	              |ИЗ
	              |	Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
	              |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	              |		ПО алк_АддендумыСоставТоваров.Сорт = алк_ПараметрыХарактеристик.Сорт
	              |			И алк_АддендумыСоставТоваров.Порода = алк_ПараметрыХарактеристик.Порода
	              |			И (алк_ПараметрыХарактеристик.Сечение.ШиринаММ >= алк_АддендумыСоставТоваров.ШиринаОт)
	              |			И (ВЫБОР
	              |				КОГДА алк_АддендумыСоставТоваров.ШиринаДо = 0
	              |					ТОГДА ИСТИНА
	              |				ИНАЧЕ алк_ПараметрыХарактеристик.Сечение.ШиринаММ <= алк_АддендумыСоставТоваров.ШиринаДо
	              |			КОНЕЦ)
	              |			И (алк_ПараметрыХарактеристик.Сечение.ТолщинаММ >= алк_АддендумыСоставТоваров.ТолщинаОт)
	              |			И (ВЫБОР
	              |				КОГДА алк_АддендумыСоставТоваров.ТолщинаДо = 0
	              |					ТОГДА ИСТИНА
	              |				ИНАЧЕ алк_ПараметрыХарактеристик.Сечение.ТолщинаММ <= алк_АддендумыСоставТоваров.ТолщинаДо
	              |			КОНЕЦ)
	              |			И (алк_ПараметрыХарактеристик.Длина.ДлинаММ >= алк_АддендумыСоставТоваров.ДлинаОт)
	              |			И (ВЫБОР
	              |				КОГДА алк_АддендумыСоставТоваров.ДлинаДо = 0
	              |					ТОГДА ИСТИНА
	              |				ИНАЧЕ алк_ПараметрыХарактеристик.Длина.ДлинаММ <= алк_АддендумыСоставТоваров.ДлинаДо
	              |			КОНЕЦ)
	              |			И (алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности >= алк_АддендумыСоставТоваров.ВлажностьОт)
	              |			И (ВЫБОР
	              |				КОГДА алк_АддендумыСоставТоваров.ВлажностьДо = 0
	              |					ТОГДА ИСТИНА
	              |				ИНАЧЕ алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности <= алк_АддендумыСоставТоваров.ВлажностьДо
	              |			КОНЕЦ)
	              |ГДЕ
	              |	алк_АддендумыСоставТоваров.Ссылка В
	              |			(ВЫБРАТЬ
	              |				ВТ_АктуальныеАдд.Ссылка
	              |			ИЗ
	              |				ВТ_АктуальныеАдд КАК ВТ_АктуальныеАдд)
	              |	И НЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ = 0
	              |				И алк_ПараметрыХарактеристик.Сечение.ШиринаММ = 0
	              |				И алк_ПараметрыХарактеристик.Сечение.ТолщинаММ = 0)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_АддендумыСоставТоваров.Ссылка,
	              |	алк_АддендумыСоставТоваров.ИдентификаторТовара,
	              |	алк_АддендумыСоставТоваров.Порода,
	              |	алк_АддендумыСоставТоваров.Сорт,
	              |	алк_ПараметрыХарактеристик.Сечение.ШиринаММ,
	              |	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ,
	              |	алк_АддендумыСоставТоваров.ДлинаОт,
	              |	алк_АддендумыСоставТоваров.ДлинаДо
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_АктуальныеАдд.Ссылка,
	              |	СУММА(ВТ_АктуальныеАдд.Количество) КАК Количество
	              |ПОМЕСТИТЬ ВТ_ОбъемАдд
	              |ИЗ
	              |	ВТ_АктуальныеАдд КАК ВТ_АктуальныеАдд
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВТ_АктуальныеАдд.Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_АктуальныеАдд.Номер,
	              |	ВТ_АктуальныеАдд.Наименование,
	              |	ВТ_АктуальныеАдд.НомерАддендума,
	              |	ВТ_АктуальныеАдд.КонтрагентКод,
	              |	ВТ_АктуальныеАдд.ДоговорКод,
	              |	ВТ_АктуальныеАдд.Дата,
	              |	ВТ_АктуальныеАдд.ДатаАддендума,
	              |	ВТ_АктуальныеАдд.КодУсловийПоставкиКод,
	              |	ВТ_АктуальныеАдд.ДоговорВалютаРасчетовКод,
	              |	ВТ_АктуальныеАдд.Ссылка,
	              |	ВТ_АктуальныеАдд.Статус,
	              |	ВТ_АктуальныеАдд.ИдентификаторТовара,
	              |	ВТ_АктуальныеАдд.Номенклатура,
	              |	ВТ_АктуальныеАдд.Количество КАК КоличествоПоГруппе,
	              |	ВТ_АктуальныеАдд.Цена,
	              |	ВТ_АктуальныеАдд.Сумма,
	              |	ВТ_АктуальныеАдд.ПредставлениеТовара,
	              |	ВТ_АктуальныеАдд.ПредставлениеВручную,
	              |	ВТ_АктуальныеАдд.КатегорияПЭО,
	              |	ВТ_СоставТоваров.Порода,
	              |	ВЫБОР
	              |		КОГДА ВТ_СоставТоваров.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	              |			ТОГДА ""All""
	              |		ИНАЧЕ ВТ_СоставТоваров.Сорт.Код
	              |	КОНЕЦ КАК СортКод,
	              |	ВТ_ОбъемАдд.Количество КАК КоличествоПоАдд,
	              |	ВТ_АктуальныеАдд.НомерСтроки,
	              |	ВТ_СоставТоваров.СечениеШиринаММ,
	              |	ВТ_СоставТоваров.СечениеТолщинаММ,
	              |	ВТ_СоставТоваров.МинДлинаДлинаММ,
	              |	ВТ_СоставТоваров.МаксДлинаДлинаММ,
	              |	ВТ_АктуальныеАдд.ВалютаКод,
	              |	ВТ_АктуальныеАдд.ОжидаемыйСрокОтгрузки
	              |ПОМЕСТИТЬ ВТ_АддИтог
	              |ИЗ
	              |	ВТ_АктуальныеАдд КАК ВТ_АктуальныеАдд
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставТоваров КАК ВТ_СоставТоваров
	              |		ПО ВТ_АктуальныеАдд.Ссылка = ВТ_СоставТоваров.Ссылка
	              |			И ВТ_АктуальныеАдд.ИдентификаторТовара = ВТ_СоставТоваров.ИдентификаторТовара
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъемАдд КАК ВТ_ОбъемАдд
	              |		ПО ВТ_АктуальныеАдд.Ссылка = ВТ_ОбъемАдд.Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЕСТЬNULL(ВТ_АддИтог.Номер, """") КАК OrderCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.Наименование, """") КАК OrderName,
	              |	ЕСТЬNULL(ВТ_АддИтог.НомерАддендума, """") КАК OrderNumDoc,
	              |	ЕСТЬNULL(ВТ_АддИтог.КонтрагентКод, """") КАК ContragentCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.ДоговорКод, """") КАК ContractCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.Дата, """") КАК DateCreate,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ВТ_АддИтог.ОжидаемыйСрокОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_АддИтог.ДатаАддендума, МЕСЯЦ, 1)
	              |			ИНАЧЕ ВТ_АддИтог.ОжидаемыйСрокОтгрузки
	              |		КОНЕЦ, """") КАК ShipmentDate,
	              |	ЕСТЬNULL(ВТ_АддИтог.ДатаАддендума, """") КАК ActivationDate,
	              |	ЕСТЬNULL(ВЫБОР
	              |			КОГДА ВТ_АддИтог.ОжидаемыйСрокОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
	              |				ТОГДА ДОБАВИТЬКДАТЕ(ВТ_АддИтог.ДатаАддендума, МЕСЯЦ, 1)
	              |			ИНАЧЕ ВТ_АддИтог.ОжидаемыйСрокОтгрузки
	              |		КОНЕЦ, """") КАК CompletionDate,
	              |	ЕСТЬNULL(ВТ_АддИтог.КонтрагентКод, """") КАК ConsigneeCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.КодУсловийПоставкиКод, """") КАК IncotermsCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.Порода.Код, """") КАК WoodKindCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.СечениеТолщинаММ, 0) КАК Thickness,
	              |	ЕСТЬNULL(ВТ_АддИтог.СечениеШиринаММ, 0) КАК Width,
	              |	ЕСТЬNULL(ВТ_АддИтог.КатегорияПЭО.Код, """") КАК TypeProdCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.СортКод, """") КАК GradeCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.МинДлинаДлинаММ, 0) / 1000 КАК MinLength,
	              |	ЕСТЬNULL(ВТ_АддИтог.МаксДлинаДлинаММ, 0) / 1000 КАК MaxLength,
	              |	ЕСТЬNULL(ВТ_АддИтог.ВалютаКод, """") КАК CurrencyCode,
	              |	ЕСТЬNULL(ВТ_АддИтог.Цена, 0) КАК Cost,
	              |	ЕСТЬNULL(ВТ_АддИтог.КоличествоПоГруппе, 0) КАК VolumeOrdered,
	              |	10 КАК Margin,
	              |	0 КАК VolumeShipped,
	              |	0 КАК VolumeReserved,
	              |	ВЫБОР
	              |		КОГДА ВТ_АддИтог.Статус = ЗНАЧЕНИЕ(Перечисление.алк_СтатусыАддендума.Закрыт)
	              |			ТОГДА 4
	              |		ИНАЧЕ 3
	              |	КОНЕЦ КАК Status,
	              |	ЕСТЬNULL(ВТ_АддИтог.НомерСтроки, """") КАК GroupNumber,
	              |	ЕСТЬNULL(ТЗ_А.СерийныеНомера, """") КАК PacketNumbers
	              |ИЗ
	              |	ВТ_АддИтог КАК ВТ_АддИтог
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_А КАК ТЗ_А
	              |		ПО ВТ_АддИтог.Ссылка = ТЗ_А.ЗаказПокупателя
	              |			И ВТ_АддИтог.ИдентификаторТовара = ТЗ_А.ИдентификаторТовара
	              |			И ВТ_АддИтог.МаксДлинаДлинаММ = ТЗ_А.ДлинаММ
	              |			И ВТ_АддИтог.СечениеТолщинаММ = ТЗ_А.ТолщинаММ
	              |			И ВТ_АддИтог.СечениеШиринаММ = ТЗ_А.ШиринаММ
	              |			И ВТ_АддИтог.СортКод = ТЗ_А.СортКод
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	OrderCode";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса10()

Функция ПолучитьТекстЗапросаOrderShipment()

	ЗапросТекст =
	"ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер
	|ПОМЕСТИТЬ ВТ_Пакеты
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Проведен
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура В(&СписокНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПОДСТРОКА(СТРОКА(ГОД(алк_ТранспортировкаЗапасовЗапасы.Заказ.Дата)), 4, 2) + ""А"" + алк_ТранспортировкаЗапасовЗапасы.Заказ.Номер КАК OrderCode,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Заказ.Контрагент.Код, """") КАК ContragentCode,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Заказ.Договор.Код, """") КАК ContractCode,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата, """") КАК DateCreate,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель.Код, """") КАК ConsigneeCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК Thickness,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК Width,
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """") КАК TypeProdCode,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	|			ТОГДА ""All""
	|		ИНАЧЕ ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Код, """")
	|	КОНЕЦ КАК GradeCode,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Заказ.Договор.ВалютаРасчетов.Код, """") КАК CurrencyCode,
	|	СУММА(0) КАК Cost,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length,
	|	СУММА(ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Объем, 0)) КАК VolumeShipped,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата, """") КАК ShipmentDate
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ТранспортировкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_Пакеты.СерийныйНомер
	|					ИЗ
	|						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|		ПО алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Проведен
	|	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура В(&СписокНоменклатуры)
	|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И НЕ алк_ТранспортировкаЗапасовЗапасы.Заказ = ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Грузополучатель.Код, """"),
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """"),
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Код, """"),
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	|			ТОГДА ""All""
	|		ИНАЧЕ ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Код, """")
	|	КОНЕЦ,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Заказ.Контрагент.Код, """"),
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Заказ.Договор.Код, """"),
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата, """"),
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Заказ.Договор.ВалютаРасчетов.Код, """"),
	|	ПОДСТРОКА(СТРОКА(ГОД(алк_ТранспортировкаЗапасовЗапасы.Заказ.Дата)), 4, 2) + ""А"" + алк_ТранспортировкаЗапасовЗапасы.Заказ.Номер,
	|	ЕСТЬNULL(алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	OrderCode,
	|	TypeProdCode,
	|	WoodKindCode,
	|	GradeCode,
	|	Length,
	|	Thickness,
	|	Width";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса11()

Функция ПолучитьТекстЗапросаLumberProduction_Старый()

	ЗапросТекст =
	"ВЫБРАТЬ
	|	алк_ВыпускПродукцииСерииОбороты.СерийныйНомер,
	|	алк_ВыпускПродукцииСерииОбороты.Характеристика,
	|	алк_ВыпускПродукцииСерииОбороты.КоличествоПакетовОборот
	|ПОМЕСТИТЬ ВТ_ПакетыПродукция
	|ИЗ
	|	РегистрНакопления.алк_ВыпускПродукцииСерии.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			,
	|			Номенклатура.КатегорияНоменклатуры.Код = ""00-000002""
	|				И НЕ СерийныйНомер.Наименование ПОДОБНО ""НЗ%"") КАК алк_ВыпускПродукцииСерииОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ПараметрыХарактеристик.Объем,
	|	алк_ПараметрыХарактеристик.КоличествоРеквизитов
	|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_ПакетыПродукция.Характеристика
	|			ИЗ
	|				ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	|	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """") КАК TypeProdCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """") КАК GradeCode,
	|	СУММА(ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.Объем, 0)) КАК Volume
	|ИЗ
	|	ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ПакетыПродукция.СерийныйНомер
	|					ИЗ
	|						ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО ВТ_ПакетыПродукция.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	|		ПО ВТ_ПакетыПродукция.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
	|	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """")";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса12()

Функция ПолучитьТекстЗапросаLumberProduction()

	ЗапросТекст =
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
	|	алк_ОстаткиЗапасовОбороты.Характеристика,
	|	СРЕДНЕЕ(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК КоличествоОборот
	|ПОМЕСТИТЬ ВТ_ПакетыПродукция
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			Регистратор,
	|			Номенклатура.КатегорияНоменклатуры.Код = ""00-000002""
	|				И НЕ СерийныйНомер.Наименование ПОДОБНО ""НЗ%"") КАК алк_ОстаткиЗапасовОбороты
	|ГДЕ
	|	(алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|			ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Производство)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
	|	алк_ОстаткиЗапасовОбороты.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ПараметрыХарактеристик.Объем,
	|	алк_ПараметрыХарактеристик.КоличествоРеквизитов
	|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_ПакетыПродукция.Характеристика
	|			ИЗ
	|				ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """") КАК TypeProdCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """") КАК GradeCode,
	|	СУММА(ЕСТЬNULL(ВТ_ПакетыПродукция.КоличествоОборот, 0)) КАК Volume
	|ИЗ
	|	ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ПакетыПродукция.СерийныйНомер
	|					ИЗ
	|						ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|		ПО ВТ_ПакетыПродукция.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	|		ПО ВТ_ПакетыПродукция.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """")";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса12()

Функция ПолучитьТекстЗапросаLumberProduction_1_Старый()

	ЗапросТекст =
	"ВЫБРАТЬ
	|	алк_ВыпускПродукцииСерииОбороты.СерийныйНомер,
	|	алк_ВыпускПродукцииСерииОбороты.Характеристика,
	|	алк_ВыпускПродукцииСерииОбороты.КоличествоПакетовОборот
	|ПОМЕСТИТЬ ВТ_ПакетыПродукция
	|ИЗ
	|	РегистрНакопления.алк_ВыпускПродукцииСерии.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			,
	|			Номенклатура.КатегорияНоменклатуры.Код = ""00-000002""
	|				И НЕ СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
	|				И НЕ СерийныйНомер.Наименование ПОДОБНО ""МЛ%"") КАК алк_ВыпускПродукцииСерииОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ПараметрыХарактеристик.Объем,
	|	алк_ПараметрыХарактеристик.КоличествоРеквизитов
	|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_ПакетыПродукция.Характеристика
	|			ИЗ
	|				ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	|	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """") КАК TypeProdCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """") КАК GradeCode,
	|	СУММА(ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.Объем, 0)) КАК Volume
	|ИЗ
	|	ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ПакетыПродукция.СерийныйНомер
	|					ИЗ
	|						ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО ВТ_ПакетыПродукция.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	|		ПО ВТ_ПакетыПродукция.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
	|	ЕСТЬNULL(алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """")";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса12()

Функция ПолучитьТекстЗапросаLumberProduction_1()

	ЗапросТекст =
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
	|	алк_ОстаткиЗапасовОбороты.Характеристика,
	|	СРЕДНЕЕ(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК КоличествоОборот
	|ПОМЕСТИТЬ ВТ_ПакетыПродукция
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			Регистратор,
	|			Номенклатура.КатегорияНоменклатуры.Код = ""00-000002""	
	|				И НЕ СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
	|				И НЕ СерийныйНомер.Наименование ПОДОБНО ""МЛ%"") КАК алк_ОстаткиЗапасовОбороты
	|ГДЕ
	|	(алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_СборкаЗапасов
	|			ИЛИ алк_ОстаткиЗапасовОбороты.Регистратор ССЫЛКА Документ.алк_Производство)
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
	|	алк_ОстаткиЗапасовОбороты.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Влажность,
	|	алк_ПараметрыХарактеристик.Объем,
	|	алк_ПараметрыХарактеристик.КоличествоРеквизитов
	|ПОМЕСТИТЬ ВТ_ПараметрыХарактеристик
	|ИЗ
	|	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|ГДЕ
	|	алк_ПараметрыХарактеристик.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТ_ПакетыПродукция.Характеристика
	|			ИЗ
	|				ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """") КАК WoodKindCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ThicknessProd,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК WidthProd,
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """") КАК TypeProdCode,
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """") КАК GradeCode,
	|	СУММА(ЕСТЬNULL(ВТ_ПакетыПродукция.КоличествоОборот, 0)) КАК Volume
	|ИЗ
	|	ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ_ПакетыПродукция.СерийныйНомер
	|					ИЗ
	|						ВТ_ПакетыПродукция КАК ВТ_ПакетыПродукция)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|		ПО ВТ_ПакетыПродукция.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыХарактеристик КАК ВТ_ПараметрыХарактеристик
	|		ПО ВТ_ПакетыПродукция.Характеристика = ВТ_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Порода.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО.Код, """"),
	|	ЕСТЬNULL(ВТ_ПараметрыХарактеристик.Сорт.Код, """")";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса12()



Функция ПолучитьПакетыПоЗаказам_НаНовыхРегистрах(ДатаОстатков)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЗаказПокупателя", Новый ОписаниеТипов("ДокументСсылка.алк_ЗаказПокупателя"));
	ТЗ.Колонки.Добавить("ИдентификаторТовара", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)));
	ТЗ.Колонки.Добавить("СортКод", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(9)));
	ТЗ.Колонки.Добавить("ДлинаММ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,0)));
	ТЗ.Колонки.Добавить("ТолщинаММ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,0)));
	ТЗ.Колонки.Добавить("ШиринаММ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,0)));
	ТЗ.Колонки.Добавить("СерийныеНомера", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки()));
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
		|			ТОГДА ""All""
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Сорт.Код
		|	КОНЕЦ КАК СортКод,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
		|	алк_ОстаткиЗапасовОстатки.Характеристика
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&ДатаОстатков,
		|			СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
		|				И Номенклатура.Код = ""ПБ-00000001"") КАК алк_ОстаткиЗапасовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер,
		|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум
		|ПОМЕСТИТЬ ВТ_ПакетыПоАдд
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(
		|			&ДатаОстатков,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВТ.СерийныйНомер
		|				ИЗ
		|					ВТ КАК ВТ)) КАК алк_ПакетыПоАддендумамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер,
		|	алк_ПакетыИсторияЗаказовСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВТ.Характеристика,
		|	ВТ.СортКод,
		|	ВТ.ДлинаММ,
		|	ВТ.ТолщинаММ,
		|	ВТ.ШиринаММ
		|ПОМЕСТИТЬ ВТ_ПакетыПоЗаказам
		|ИЗ
		|	РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(
		|			&ДатаОстатков,
		|			СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ.СерийныйНомер
		|					ИЗ
		|						ВТ КАК ВТ)
		|				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.алк_ЗаказПокупателя.ПустаяСсылка)) КАК алк_ПакетыИсторияЗаказовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер = ВТ.СерийныйНомер
		|ГДЕ
		|	НЕ алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВТ_ПакетыПоАдд.СерийныйНомер
		|				ИЗ
		|					ВТ_ПакетыПоАдд КАК ВТ_ПакетыПоАдд)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка КАК ЗаказПокупателя,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы,
		|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика
		|ПОМЕСТИТЬ ВТ_Ассортимен
		|ИЗ
		|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
		|ГДЕ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка.Проведен
		|	И алк_ЗаказПокупателяЗапасыАссортимент.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ПакетыПоЗаказам.ЗаказПокупателя
		|			ИЗ
		|				ВТ_ПакетыПоЗаказам КАК ВТ_ПакетыПоЗаказам)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПакетыПоЗаказам.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВТ_Ассортимен.ИдентификаторГруппы КАК ИдентификаторТовара,
		|	ВТ_ПакетыПоЗаказам.СортКод КАК СортКод,
		|	ВТ_ПакетыПоЗаказам.ДлинаММ КАК ДлинаММ,
		|	ВТ_ПакетыПоЗаказам.ТолщинаММ КАК ТолщинаММ,
		|	ВТ_ПакетыПоЗаказам.ШиринаММ КАК ШиринаММ,
		|	ВТ_ПакетыПоЗаказам.СерийныйНомер
		|ИЗ
		|	ВТ_ПакетыПоЗаказам КАК ВТ_ПакетыПоЗаказам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ассортимен КАК ВТ_Ассортимен
		|		ПО ВТ_ПакетыПоЗаказам.Характеристика = ВТ_Ассортимен.Характеристика
		|			И ВТ_ПакетыПоЗаказам.ЗаказПокупателя = ВТ_Ассортимен.ЗаказПокупателя
		|ИТОГИ ПО
		|	ЗаказПокупателя,
		|	ИдентификаторТовара,
		|	СортКод,
		|	ДлинаММ,
		|	ТолщинаММ,
		|	ШиринаММ";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказПокупателя = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказПокупателя.Следующий() Цикл		
		ВыборкаИдентификаторТовара = ВыборкаЗаказПокупателя.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока ВыборкаИдентификаторТовара.Следующий() Цикл
			ВыборкаСортКод = ВыборкаИдентификаторТовара.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  		
			Пока ВыборкаСортКод.Следующий() Цикл 				
				ВыборкаДлинаММ = ВыборкаСортКод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  		
				Пока ВыборкаДлинаММ.Следующий() Цикл				
					ВыборкаТолщинаММ = ВыборкаДлинаММ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);				
					Пока ВыборкаТолщинаММ.Следующий() Цикл					
						ВыборкаШиринаММ = ВыборкаТолщинаММ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаШиринаММ.Следующий() Цикл 					
							
							НоваяСтрока = ТЗ.Добавить();
							СписокПакетов = ""; 
							ВыборкаДетальныеЗаписи = ВыборкаШиринаММ.Выбрать(); 	
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								Если СписокПакетов = "" Тогда
									СписокПакетов = "" + ВыборкаДетальныеЗаписи.СерийныйНомер;					
								Иначе
									СписокПакетов = СписокПакетов + ";" + ВыборкаДетальныеЗаписи.СерийныйНомер;	
								КонецЕсли; 
							КонецЦикла;
							
							ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаШиринаММ);		
							НоваяСтрока.СерийныеНомера = СписокПакетов;
						КонецЦикла;	
					КонецЦикла;					
				КонецЦикла; 			
			КонецЦикла;  		
		КонецЦикла;   	
	КонецЦикла;
	
	Возврат ТЗ;		

КонецФункции // ПолучитьПакетыПоЗаказам()

Функция ПолучитьПакетыПоАддендумам(ДатаОстатков)      
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЗаказПокупателя", Новый ОписаниеТипов("ДокументСсылка.алк_Аддендумы")); 
	ТЗ.Колонки.Добавить("ИдентификаторТовара", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	ТЗ.Колонки.Добавить("СортКод", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(9)));
	ТЗ.Колонки.Добавить("ДлинаММ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,0)));
	ТЗ.Колонки.Добавить("ТолщинаММ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,0)));
	ТЗ.Колонки.Добавить("ШиринаММ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,0)));
	ТЗ.Колонки.Добавить("СерийныеНомера", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки()));	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
		|			ТОГДА ""All""
		|		ИНАЧЕ алк_ПараметрыХарактеристик.Сорт.Код
		|	КОНЕЦ КАК СортКод,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК СечениеТолщинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК СечениеШиринаММ
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&ДатаОстатков,
		|			СтруктурнаяЕдиница.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)
		|				И Номенклатура.Код = ""ПБ-00000001"") КАК алк_ОстаткиЗапасовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум КАК ЗаказПокупателя,
		|	алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПакетыПоАддендумамСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ПакетыПоАдд
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(
		|			&ДатаОстатков,
		|			СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВТ.СерийныйНомер
		|				ИЗ
		|					ВТ КАК ВТ)) КАК алк_ПакетыПоАддендумамСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПакетыПоАдд.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ПакетыПоАдд.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ВТ.СортКод КАК СортКод,
		|	ВТ.ДлинаДлинаММ КАК ДлинаММ,
		|	ВТ.СечениеТолщинаММ КАК ТолщинаММ,
		|	ВТ.СечениеШиринаММ КАК ШиринаММ,
		|	ПакетыПоАдд.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	(ВЫБРАТЬ
		|		МаксПериодПривязкиПакета.СерийныйНомер КАК СерийныйНомер,
		|		ВТ_ПакетыПоАдд.ЗаказПокупателя КАК ЗаказПокупателя,
		|		ВТ_ПакетыПоАдд.ИдентификаторТовара КАК ИдентификаторТовара
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВТ_ПакетыПоАдд.СерийныйНомер КАК СерийныйНомер,
		|			МАКСИМУМ(ВТ_ПакетыПоАдд.Период) КАК Период
		|		ИЗ
		|			ВТ_ПакетыПоАдд КАК ВТ_ПакетыПоАдд
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТ_ПакетыПоАдд.СерийныйНомер) КАК МаксПериодПривязкиПакета
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПакетыПоАдд КАК ВТ_ПакетыПоАдд
		|			ПО МаксПериодПривязкиПакета.СерийныйНомер = ВТ_ПакетыПоАдд.СерийныйНомер
		|				И МаксПериодПривязкиПакета.Период = ВТ_ПакетыПоАдд.Период) КАК ПакетыПоАдд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО ПакетыПоАдд.СерийныйНомер = ВТ.СерийныйНомер
		|ГДЕ
		|	НЕ ПакетыПоАдд.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка)
		|ИТОГИ ПО
		|	ЗаказПокупателя,
		|	ИдентификаторТовара,
		|	СортКод,
		|	ДлинаММ,
		|	ТолщинаММ,
		|	ШиринаММ";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказПокупателя = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказПокупателя.Следующий() Цикл		
		ВыборкаИдентификаторТовара = ВыборкаЗаказПокупателя.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока ВыборкаИдентификаторТовара.Следующий() Цикл
			ВыборкаСортКод = ВыборкаИдентификаторТовара.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  		
			Пока ВыборкаСортКод.Следующий() Цикл 				
				ВыборкаДлинаММ = ВыборкаСортКод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  		
				Пока ВыборкаДлинаММ.Следующий() Цикл				
					ВыборкаТолщинаММ = ВыборкаДлинаММ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);				
					Пока ВыборкаТолщинаММ.Следующий() Цикл					
						ВыборкаШиринаММ = ВыборкаТолщинаММ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаШиринаММ.Следующий() Цикл 					
							
							НоваяСтрока = ТЗ.Добавить();
							СписокПакетов = ""; 
							ВыборкаДетальныеЗаписи = ВыборкаШиринаММ.Выбрать(); 	
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								Если СписокПакетов = "" Тогда
									СписокПакетов = "" + ВыборкаДетальныеЗаписи.СерийныйНомер;					
								Иначе
									СписокПакетов = СписокПакетов + ";" + ВыборкаДетальныеЗаписи.СерийныйНомер;	
								КонецЕсли; 
							КонецЦикла;
							
							ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаШиринаММ);		
							НоваяСтрока.СерийныеНомера = СписокПакетов;
						КонецЦикла;	
					КонецЦикла;					
				КонецЦикла; 			
			КонецЦикла;  		
		КонецЦикла;   	
	КонецЦикла;
	
	Возврат ТЗ;	

КонецФункции // ПолучитьПакетыПоЗаказам()

Функция ФормируемСтруктуруТЗДляОбменаLumberStore()
	
	ФормируемаяТЗ = Новый ТаблицаЗначений;
	
	ФормируемаяТЗ.Колонки.Добавить("StoreCode");
	ФормируемаяТЗ.Колонки.Добавить("PacketNumber");
	ФормируемаяТЗ.Колонки.Добавить("WoodKindCode");
	ФормируемаяТЗ.Колонки.Добавить("ThicknessProd");
	ФормируемаяТЗ.Колонки.Добавить("WidthProd");
	ФормируемаяТЗ.Колонки.Добавить("TypeProdCode");
	ФормируемаяТЗ.Колонки.Добавить("GradeCode");
	ФормируемаяТЗ.Колонки.Добавить("Volume");
	ФормируемаяТЗ.Колонки.Добавить("Wetness");
	ФормируемаяТЗ.Колонки.Добавить("SawType");
	ФормируемаяТЗ.Колонки.Добавить("PacketCode");
	ФормируемаяТЗ.Колонки.Добавить("WorkCenterCode");
	ФормируемаяТЗ.Колонки.Добавить("DateCreate");
	ФормируемаяТЗ.Колонки.Добавить("DateIncome"); 
	ФормируемаяТЗ.Колонки.Добавить("SelfCost");
	ФормируемаяТЗ.Колонки.Добавить("Struct",Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат ФормируемаяТЗ;  
	
КонецФункции

Функция ФормируемСтруктуруТЗДляОбменаLumberInTunnels()
	
	ФормируемаяТЗ = Новый ТаблицаЗначений;
	
	ФормируемаяТЗ.Колонки.Добавить("TunnelCode");
	ФормируемаяТЗ.Колонки.Добавить("PacketNumber");
	ФормируемаяТЗ.Колонки.Добавить("WoodKindCode");
	ФормируемаяТЗ.Колонки.Добавить("ThicknessProd");
	ФормируемаяТЗ.Колонки.Добавить("WidthProd");
	ФормируемаяТЗ.Колонки.Добавить("TypeProdCode");
	ФормируемаяТЗ.Колонки.Добавить("GradeCode");
	ФормируемаяТЗ.Колонки.Добавить("Volume");
	ФормируемаяТЗ.Колонки.Добавить("Wetness");
	ФормируемаяТЗ.Колонки.Добавить("SawType");
	ФормируемаяТЗ.Колонки.Добавить("PacketCode");
	ФормируемаяТЗ.Колонки.Добавить("WorkCenterCode");
	ФормируемаяТЗ.Колонки.Добавить("DateCreate");
	ФормируемаяТЗ.Колонки.Добавить("DateIncome");
	ФормируемаяТЗ.Колонки.Добавить("DateOutcome");
	ФормируемаяТЗ.Колонки.Добавить("SelfCost");
	ФормируемаяТЗ.Колонки.Добавить("Struct",Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат ФормируемаяТЗ;  
	
КонецФункции

Функция ДобавлениеКолонкиСтруктурыКолДлинБревен(СтруктураТЗ,ТЗ)	
				
	Для Каждого эл ИЗ ТЗ Цикл 
		
		//добавляемое поле (таблица значений)
		Struct = Новый ТаблицаЗначений;
		
		Struct.Колонки.Добавить("Count");
		
		Struct.Колонки.Добавить("Length");
		
		strStruct = Struct.Добавить();
		
		strStruct.Count = эл.Count; 
		
		strStruct.Length = эл.Length;
		//\\
		
		//добавляем строку в новую ТЗ
		стрФормируемаяТЗ = СтруктураТЗ.Добавить();
		
		ЗаполнитьЗначенияСвойств(стрФормируемаяТЗ,эл);
		
		стрФормируемаяТЗ.Struct = Struct;
		//\\
				
	КонецЦикла;
	
	Возврат СтруктураТЗ;
	
КонецФункции

//////УСТАРЕВШИЕ от 20240820 //////////////////////////////////   

Функция ПолучитьТекстЗапросаLumberStoreStruct()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер.Наименование,
	|	алк_ОстаткиЗапасовОстатки.Характеристика,
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПакеты
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			Номенклатура В (&СписокНоменклатуры)
	|				И (СтруктурнаяЕдиница.Код В (""00-000005"", ""ПБ-000095"", ""ПБ-000097"", ""00-000001"")
	|					ИЛИ СтруктурнаяЕдиница.Код = ""ПБ-000031""
	|						И Штабель = &ПустойШтабель)) КАК алк_ОстаткиЗапасовОстатки
	|ГДЕ
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиПакеты.СерийныйНомер.Представление КАК PacketNumber,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Объем = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ОстаткиПакеты.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(6, 0))
	|	КОНЕЦ КАК Count,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000 КАК Length
	|ИЗ
	|	ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО ВТ_ОстаткиПакеты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	PacketNumber";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса5()

Функция ПолучитьТекстЗапросаLumberInTunnels()

	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	алк_ЗагрузкаВКамеруНоменклатура.Ссылка.Дата КАК ДатаЗагрузки,
	|	алк_ЗагрузкаВКамеруНоменклатура.СерийныйНомер
	|ПОМЕСТИТЬ ВТ_ЗагрузкаВКамеру
	|ИЗ
	|	Документ.алк_ЗагрузкаВКамеру.Номенклатура КАК алк_ЗагрузкаВКамеруНоменклатура
	|ГДЕ
	|	алк_ЗагрузкаВКамеруНоменклатура.Ссылка.Проведен
	|	И алк_ЗагрузкаВКамеруНоменклатура.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаОстатков, МЕСЯЦ, -&Дельта) И ДОБАВИТЬКДАТЕ(&ДатаОстатков, МЕСЯЦ, &Дельта)
	|	И (алк_ЗагрузкаВКамеруНоменклатура.Ссылка.СтруктурнаяЕдиницаПолучатель.Код = ""ПБ-000031""
	|			ИЛИ алк_ЗагрузкаВКамеруНоменклатура.Ссылка.СтруктурнаяЕдиницаПолучатель.Код = ""ПБ-000090"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.Дата КАК ДатаВыгрузки,
	|	алк_ВыгрузкаИзКамерыНоменклатура.СерийныйНомер
	|ПОМЕСТИТЬ ВТ_ВыгрузкаИзКамеры
	|ИЗ
	|	Документ.алк_ВыгрузкаИзКамеры.Номенклатура КАК алк_ВыгрузкаИзКамерыНоменклатура
	|ГДЕ
	|	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.Проведен
	|	И алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаОстатков, МЕСЯЦ, -&Дельта) И ДОБАВИТЬКДАТЕ(&ДатаОстатков, МЕСЯЦ, &Дельта)
	|	И (алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.СтруктурнаяЕдиница.Код = ""ПБ-000031""
	|			ИЛИ алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.СтруктурнаяЕдиница.Код = ""ПБ-000090"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.Штабель.Код,
	|	алк_ОстаткиЗапасовОстатки.Характеристика,
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПакеты
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			СтруктурнаяЕдиница.Код = ""ПБ-000031""
	|				ИЛИ СтруктурнаяЕдиница.Код = ""ПБ-000090"") КАК алк_ОстаткиЗапасовОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер,
	|	МИНИМУМ(алк_ОстаткиЗапасовОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатаСозданияПакета
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	|			,
	|			,
	|			Секунда,
	|			СерийныйНомер В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиПакеты.СерийныйНомер
	|				ИЗ
	|					ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты)) КАК алк_ОстаткиЗапасовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиПакеты.ШтабельКод КАК TunnelCode,
	|	ВТ_ОстаткиПакеты.СерийныйНомер.Представление КАК PacketNumber,
	|	алк_ПараметрыХарактеристик.Порода.Код КАК WoodKindCode,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ThicknessProd,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК WidthProd,
	|	ПОДСТРОКА(ВТ_ОстаткиПакеты.СерийныйНомер.Наименование, 1, 2) КАК TypeProdCode,
	|	ВЫБОР
	|		КОГДА алк_ПараметрыХарактеристик.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
	|			ТОГДА ""All""
	|		ИНАЧЕ алк_ПараметрыХарактеристик.Сорт.Код
	|	КОНЕЦ КАК GradeCode,
	|	ВТ_ОстаткиПакеты.КоличествоОстаток КАК Volume,
	|	0 КАК Wetness,
	|	0 КАК SawType,
	|	""СП"" КАК PacketCode,
	|	&КодРабочегоЦентраВыпустившегоПакет КАК WorkCenterCode,
	|	ЕСТЬNULL(ВТ_ДатаСозданияПакета.Период, """") КАК DateCreate,
	|	ЕСТЬNULL(ВТ_ЗагрузкаВКамеру.ДатаЗагрузки, """") КАК DateIncome,
	|	ЕСТЬNULL(ВТ_ВыгрузкаИзКамеры.ДатаВыгрузки, """") КАК DateOutcome,
	|	0 КАК SelfCost
	|ИЗ
	|	ВТ_ОстаткиПакеты КАК ВТ_ОстаткиПакеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО ВТ_ОстаткиПакеты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаСозданияПакета КАК ВТ_ДатаСозданияПакета
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = ВТ_ДатаСозданияПакета.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗагрузкаВКамеру КАК ВТ_ЗагрузкаВКамеру
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = ВТ_ЗагрузкаВКамеру.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыгрузкаИзКамеры КАК ВТ_ВыгрузкаИзКамеры
	|		ПО ВТ_ОстаткиПакеты.СерийныйНомер = ВТ_ВыгрузкаИзКамеры.СерийныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	PacketNumber";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса6()

Функция ПолучитьТекстЗапросаLumberInTunnelsStruct()
	
	ЗапросТекст =
	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.СерийныйНомер.Представление, """") КАК PacketNumber,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) <> 0
	|			ТОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(5, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Count,
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) / 1000 КАК Length
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			(СтруктурнаяЕдиница.Код = ""ПБ-000031""
	|				ИЛИ СтруктурнаяЕдиница.Код = ""ПБ-000090"")
	|				И Штабель <> ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)) КАК алк_ОстаткиЗапасовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика";
	
	Возврат ЗапросТекст;

КонецФункции // ПолучитьТекстЗапроса7()

///////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
