
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.алк_ЗаказПокупателя.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		РфпСервер.ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьЗаказыПокупателейПоОбъемнымГруппам(ДополнительныеСвойства, Движения, Отказ);  
		РфпСервер.ОтразитьДвиженияПоОсткамПоЗаказам(ДополнительныеСвойства, Движения, Отказ);

		
		// Отражение по регистрам сведений
		РфпСервер.ОтразитьОбъемныеГруппыПредставление(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьАссортиментныеГруппыПредставление(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьИДентификаторыГруппХарактеристик(ДополнительныеСвойства, Движения, Отказ);
		
		// СерийныеНомера
		Если Закрыт Тогда
			
			РфпСервер.ОтразитьПакетыИсторияЗаказов(ДополнительныеСвойства, Движения, Отказ);
	
		КонецЕсли; 
				
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		// Контроль
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
