
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.алк_НормыРасходаИВыпуска.Записывать = Истина;
	Для Каждого ТекСтрокаНормы Из Нормы Цикл
		Движение = Движения.алк_НормыРасходаИВыпуска.Добавить();
		Движение.Период = Дата;   
		Движение.ДатаНачалаДействия = ДатаНачалаДействия;  
		Движение.ДатаОкончанияДействия = ДатаОкончанияДействия;
		Движение.ОперацияПроизводства = Операция;
		Движение.Номенклатура = ТекСтрокаНормы.Номенклатура;
		Движение.Характеристика = ТекСтрокаНормы.Характеристика;
		Движение.ВидДвижения = ТекСтрокаНормы.ВидДвижения;
		Движение.ВариантЗависимости = ТекСтрокаНормы.ВариантЗависимости;
		Движение.НоменклатураОснование = Номенклатура;   
		Движение.ХарактеристикаОснования = Характеристика;
		Движение.ВидДвиженияОснования = Перечисления.алк_ВидДвиженияНормы.Продукция;  
		Движение.ЦелеваяОснование = Целевая;
		Движение.Норма = ТекСтрокаНормы.Норма;
	КонецЦикла;
КонецПроцедуры  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Характеристика) И Номенклатура.ИспользоватьХарактеристики Тогда 
		Отказ = Истина;  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка! Учет по номенклатуре ведется в разрезе характеристик. Заполните характеристику.",,Характеристика);
		Возврат;
	КонецЕсли;
КонецПроцедуры


