
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
		СтандартнаяОбработка = Ложь;
		
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
		УстановитьОтбор(Настройки, "П1", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
		УстановитьОтбор(Настройки, "П2", Справочники.СтруктурныеЕдиницы.ОсновнойСклад);
		
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		Настройки,
		ДанныеРасшифровки);
		
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПолучитьСтруктуруЗаголовковПолей(), МакетКомпоновки);
		//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураДинамическихЗаголовков(), МакетКомпоновки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		,
		ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		
		// ***
		
		//СКД_РаспиловкаРасчетн = ПолучитьМакет("СКД_РаспиловкаРасчетный");
		//ТД_РаспиловкаРасчетн  = СформироватьПоСКД(СКД_РаспиловкаРасчетн, Неопределено);
		//
		//ДокументРезультат.Вывести(ТД_РаспиловкаРасчетн);
		
		//ДобавитьОтчет(ДокументРезультат, ТД_РаспиловкаРасчетн);
		
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2);
		//КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СлужебныеПроцедуры
	
	// ТДПриемник - табличный документ, в кот. устанавливается новый формат
	// Отчет - табличный документ, на основании кот. будет установлен новый формат
	//
	Процедура ДобавитьОтчет(ТДПриемник, Отчет)
		
		НачалоНовогоФорматаСтрок = ТДПриемник.ВысотаТаблицы + 1;
		ОбластьПрямоугольная = Отчет.Область(1, , Отчет.ВысотаТаблицы, );
		ТДПриемник.ВставитьОбласть(ОбластьПрямоугольная, ТДПриемник.Область(НачалоНовогоФорматаСтрок, 1));
		ТДПриемник.Область(НачалоНовогоФорматаСтрок, , 
		НачалоНовогоФорматаСтрок + Отчет.ВысотаТаблицы - 1, ).СоздатьФорматСтрок();
		// назначим ширину колонок у новой области формата строк
		
		Для Счетчик = 1 По Отчет.ШиринаТаблицы Цикл
			ТДПриемник.Область(НачалоНовогоФорматаСтрок, Счетчик).ШиринаКолонки = Отчет.Область(1, Счетчик).ШиринаКолонки;
		КонецЦикла;
		ТДПриемник.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецПроцедуры // ДобавитьОтчет 
	
	Функция СформироватьПоСКД(СхемаКомпоновкиДанных, Параметры)
		
		КомпоновщикНастроек1 = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек1.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
		КомпоновщикНастроек1.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
		Настройки = КомпоновщикНастроек1.ПолучитьНастройки();
		
		//УстановитьОтбор(Настройки, "Ссылка", Параметры.Ссылка);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		Настройки,
		);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(
		МакетКомпоновки,
		,
		);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции	
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	#КонецОбласти
	
	ЭтоОтчетУНФ = Ложь;
	
#КонецЕсли
