
&НаКлиенте
Процедура ПосмотретьСправку(Команда)
	
	Если Модифицированность И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СправкиНДФЛДляПередачиВНалоговыйОрган", "Реестр2011", МассивОбъектов, ЭтаФорма, Новый Структура());
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьРеестр(Команда)
	
	Если Модифицированность И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.Ссылка);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СправкиНДФЛДляПередачиВНалоговыйОрган", "Справки2НДФЛ", МассивОбъектов, ЭтаФорма, Новый Структура());
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОрганизацииСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СотрудникиОрганизации.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Сотрудник)Тогда
		ДанныеСотрудника = ДанныеСотрудникаНаСервере(ТекущиеДанные.Сотрудник);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСотрудника);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеСотрудникаНаСервере(Сотрудник)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФИОФизЛиц.Фамилия,
	|	ФИОФизЛиц.Имя,
	|	ФИОФизЛиц.Отчество,
	|	Сотрудники.Физлицо.ИНН КАК ИНН,
	|	Сотрудники.Физлицо.ДатаРождения КАК ДатаРождения,
	|	Сотрудники.Физлицо.Гражданство КАК Гражданство,
	|	ДокументыФизическихЛиц.Серия КАК СерияДокумента,
	|	ДокументыФизическихЛиц.Номер КАК НомерДокумента,
	|	ДокументыФизическихЛиц.ВидДокумента,
	|	КонтактнаяИнформация.ЗначенияПолей КАК АдресРФ
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛиц
	|		ПО Сотрудники.Физлицо = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО Сотрудники.Физлицо = ДокументыФизическихЛиц.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Ссылка = Сотрудники.Физлицо)
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФизЛицаПоПрописке)) ГДЕ Сотрудники.Ссылка = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, ИНН, ДатаРождения, Гражданство, ВидДокумента, СерияДокумента, НомерДокумента, АдресРФ");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСотрудника ,Выборка);
	КонецЕсли;
	
	Возврат ДанныеСотрудника;
	
КонецФункции
