
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Свойство("ПараметрыЗаполнения") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ПараметрыЗаполнения);
	Если Параметры.ПараметрыЗаполнения.Свойство("МассивСостава") Тогда
		Для Каждого элемент из Параметры.ПараметрыЗаполнения.МассивСостава Цикл
			СтрокаСостава = Состав.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаСостава, элемент);
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоставКатегорииПЭО(Команда)
	Результат = Новый Структура("Ключ,МассивСостава"
	,Ключ
	,ПолучитьМассивСостава());
	
	Закрыть(Результат);
КонецПроцедуры 

&НаСервере
Функция ПолучитьМассивСостава()
	// удаляем пустые строки
	ПустыеСтроки = Состав.НайтиСтроки(Новый Структура ("Длина,Сечение,Порода,Влажность"
	,Справочники.Длины.ПустаяСсылка()
	,Справочники.РазмерСечения.ПустаяСсылка()
	,Справочники.Породы.ПустаяСсылка()
	,Справочники.Влажность.ПустаяСсылка()));
	
	Для Каждого эл ИЗ ПустыеСтроки Цикл 
		Состав.Удалить(эл);
	КонецЦикла;
	//\\
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Состав.Выгрузить());	
КонецФункции

&НаКлиенте
Процедура ОтменитьИзменения(Команда)
	Закрыть();
КонецПроцедуры
