	
#Область ПроцедурыЗаполненияДокумента
	
// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
КонецПроцедуры

// Обработчик заполнения документа на основании Приходной накладной.
//
// Параметры:
//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
//
Процедура ЗаполнитьПоПеремещениеЗапасов(ДанныеЗаполнения, Операция = "") Экспорт
	
	// Заполнение шапки документа.
	ДокументОснование 	= ДанныеЗаполнения.Ссылка;
	Организация 		= ДанныеЗаполнения.Организация;
	СтруктурнаяЕдиница 	= ДанныеЗаполнения.СтруктурнаяЕдиницаПолучатель;
	Направление 		= ДанныеЗаполнения.Направление;
	
	Для Каждого ТекСтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл
		НоваяСтрока = Запасы.Добавить();			
		НоваяСтрока.КоличествоПакетов = ТекСтрокаЗапасы.КоличествоПакетов;
		НоваяСтрока.Номенклатура = ТекСтрокаЗапасы.Номенклатура;
		НоваяСтрока.СерийныйНомер = ТекСтрокаЗапасы.СерийныйНомер;			
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоПеремещениюЗапасов() 

// Обработчик заполнения на основании данных заполнения.
//
// Параметры:
//  ДанныеЗаполнения - Структура.
//
Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ОнЖе = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьЗапасыПоТЧДокументыОснования();
	
КонецПроцедуры

Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	Запасы.Очистить();
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ПеремещениеЗапасов") Тогда
		
		ЗаполнитьПоПеремещениеЗапасов(ДокументОснование);
		
	КонецЕсли
	
	
КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()

#КонецОбласти


#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_РасформированиеПакетов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	
	// для древестных гранул есть движениетолько по регистру запасы алк_ЗапасыНаСкладахСерии
	
	Если Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда
		
		РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ); 
		
	Иначе 
		
		Если Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
			РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);		
		КонецЕсли;
		
		РфпСервер.ОтразитьЗапасыОрганизацииСерии(ДополнительныеСвойства, Движения, Отказ);  
		
	КонецЕсли;
	
	// Отражение по "Последовательностям"
	РфпСервер.ОтразитьДокументыПоследовательностиПродукция(ДополнительныеСвойства, Движения, Отказ);
	
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	
	ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата);
	
	Если ЗаписыватьДвиженияВНовыеРегистры Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);    
	
	
	//Если НЕ Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда
	//	Отказ = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизацииСерии");
	//Иначе
	//	//Отказ = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии");
	//	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии", Отказ);
	//КонецЕсли; 
	
	// Контроль остатков  
	Если ЗаписыватьДвиженияВНовыеРегистры Тогда
		Движения.алк_ОстаткиЗапасов.Записать(); 
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);  
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
		
		Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
		КонецЕсли; 
		
	Иначе
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		СтратегияЗаполнения[Тип("ДокументСсылка.алк_ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);			
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Соберем массив для контроля остатков  
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|  алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		РезультатЗапроса = Запрос.Выполнить();  
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
		
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

	
	
	
