
Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
	
	ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	
	Если ОбрПараметр <> Неопределено Тогда
		
		ОбрПараметр.Использование = Истина;
		ОбрПараметр.Значение      = Значение;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроизвестиДлительноеВычисление(СтруктураПараметров, АдресХранилища) Экспорт
	
	тдБиржаОстатки = СформироватьБиржаОстатки(СтруктураПараметров.ДатаСмены);	
	ПоместитьВоВременноеХранилище(тдБиржаОстатки, АдресХранилища);
	
КонецПроцедуры

Функция СформироватьБиржаОстатки(ДатаСмены)
	
	СхемаКомпоновкиДанных = Отчеты.алк_СхемыОперативногоМонитора.ПолучитьМакет("БиржаОстатки");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//Настройки = СхемаКомпоновкиДанных.ВариантыНастроек["Вариант1"].Настройки;
	
	УстановитьОтбор(Настройки, "П1", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	УстановитьОтбор(Настройки, "Период", ДатаСмены);
	
	//ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Период");
	//Для каждого стрПараметр Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//	Если стрПараметр.Параметр = ПараметрКомпоновки Тогда
	//		Если Не ЗначениеЗаполнено(стрПараметр.Значение) Тогда
	//			УстановитьПараметрПользовательскойНастройки(КомпоновщикНастроек.ПользовательскиеНастройки, "НаДату", ТекущаяДата());	
	//		КонецЕсли; 
	//	КонецЕсли; 	
	//КонецЦикла; 
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);  
	
	Описание = "Результат показывает остатки на участке сортированных лесоматериалов биржи 
	|ЦЛП по сортам и сечениям. ""Некондиция"", включает объем ЛМ не переданных на ответхрание
	|и возвращенных в штабель ""Возврат окорки""."; 
	
	
	Возврат Новый Структура("Результат, Описание", Результат, Описание);
	
КонецФункции


