
//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	//#Область ОбработчикиСобытий
	//
	//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	//	
	//	Сообщить("32");
	//	
	//	СтандартнаяОбработка = Ложь;
	//	
	//	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	//	
	//	//УстановитьОтбор(Настройки, "П1", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	//	
	//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//	МакетКомпоновки = КомпоновщикМакета.Выполнить(
	//	СхемаКомпоновкиДанных,
	//	Настройки,
	//	ДанныеРасшифровки);
	//	
	//	//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПолучитьСтруктуруЗаголовковПолей(), МакетКомпоновки);
	//	//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураДинамическихЗаголовков(), МакетКомпоновки);
	//	
	//	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//	ПроцессорКомпоновки.Инициализировать(
	//	МакетКомпоновки,
	//	,
	//	ДанныеРасшифровки);
	//	
	//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	//	
	//	//ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
	//	//КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	//	
	//	//ОбработатьРезультат(ДокументРезультат, 1);
	//	
	//КонецПроцедуры
	//
	//#КонецОбласти
	//
	//Процедура ОбработатьРезультат(ТабДок, НомСтроки)
	//	
	//	//ТабДок = Новый ТабличныйДокумент;
	//	
	//	выс = ТабДок.ВысотаТаблицы;
	//	
	//	мНомеровКолонок = Новый Массив;
	//	
	//	Для шир = 1 По ТабДок.ШиринаТаблицы Цикл
	//		
	//		стр = НРег(ТабДок.Область(выс, шир, выс, шир).Текст);
	//		Если Найти(стр, "ххх") > 0 Тогда
	//			
	//			мНомеровКолонок.Добавить(шир);
	//			
	//		КонецЕсли;
	//		
	//		
	//	КонецЦикла;
	//	
	//	ТаблицаСумм = Новый ТаблицаЗначений;
	//	ТаблицаСумм.Колонки.Добавить("НомерКолонки");
	//	ТаблицаСумм.Колонки.Добавить("СуммаКолонки");
	//	
	//	Для каждого НомерК Из мНомеровКолонок Цикл
	//		
	//		Результат = 0;
	//		
	//		Для выс = 7 По ТабДок.ВысотаТаблицы - 1 Цикл
	//			
	//			стр = ТабДок.Область(выс, НомерК, выс, НомерК).Текст;
	//			
	//			Если ТипЗнч(стр) = Тип("Строка") Тогда
	//				Попытка
	//					ЗначениеЯчейки = Число(стр);
	//					Результат = Результат + ЗначениеЯчейки;
	//				Исключение
	//				    //ОписаниеОшибки()
	//				КонецПопытки; 		
	//			КонецЕсли; 
	//			
	//		КонецЦикла; 
	//		
	//		НоваяСтрока = ТаблицаСумм.Добавить();
	//		НоваяСтрока.НомерКолонки = НомерК;
	//		НоваяСтрока.СуммаКолонки = Результат;
	//		
	//	КонецЦикла; 
	//	
	//	Для каждого стрТСумм Из ТаблицаСумм Цикл
	//		
	//		ТабДок.Область(ТабДок.ВысотаТаблицы, стрТСумм.НомерКолонки, ТабДок.ВысотаТаблицы, стрТСумм.НомерКолонки).Текст = стрТСумм.СуммаКолонки;
	//		
	//	КонецЦикла; 
	//	
	//	//////////////////////////////////////////////////////////// Процент выхода (Общий итог) //////////////////////////////////////////////////
	//	
	//	выс = ТабДок.ВысотаТаблицы;
	//	
	//	мНомеровКолонок = Новый Массив;
	//	
	//	Для шир = 1 По ТабДок.ШиринаТаблицы Цикл
	//		
	//		стр = НРег(ТабДок.Область(выс, шир, выс, шир).Текст);
	//		Если Найти(стр, "%%%") > 0 Тогда
	//			
	//			мНомеровКолонок.Добавить(шир);
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	Для каждого НомерК Из мНомеровКолонок Цикл
	//		
	//		Распилено = Число(?(ЗначениеЗаполнено(ТабДок.Область(выс, НомерК-2, выс, НомерК-2).Текст), ТабДок.Область(выс, НомерК-2, выс, НомерК-2).Текст, 0));
	//		Получено  = Число(?(ЗначениеЗаполнено(ТабДок.Область(выс, НомерК-1, выс, НомерК-1).Текст), ТабДок.Область(выс, НомерК-1, выс, НомерК-1).Текст, 0));

	//		ТабДок.Область(выс, НомерК, выс, НомерК).Текст = ?(Распилено <> 0 , Получено/Распилено * 100, 0);
	//		
	//		
	//	КонецЦикла;
	//	
	//	
	//КонецПроцедуры
	//
	//
	//Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
	//	
	//	ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	//	
	//	Если ОбрПараметр <> Неопределено Тогда
	//		
	//		ОбрПараметр.Использование = Истина;
	//		ОбрПараметр.Значение      = Значение;
	//		
	//	КонецЕсли; 
	//	
	//КонецПроцедуры
	//
	//ЭтоОтчетУНФ = Ложь;
	
//#КонецЕсли
