
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВыгрузкаИзКамеры, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();
		
		ДанныеДокументаВыгрузкаИзКамеры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаВыгрузкаИзКамеры, "Смена, Дата, СушильнаяКамера");
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВыгрузкаИзКамеры);
		Запрос.УстановитьПараметр("Период", ДанныеДокументаВыгрузкаИзКамеры.Дата);
		//Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		//Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		//Запрос.УстановитьПараметр("Смена", ДанныеДокументаВыгрузкаИзКамеры.Смена);
		//Запрос.УстановитьПараметр("ЯчейкаВыгрузки", ПолучитьЯчейкуПоКамере(ДанныеДокументаВыгрузкаИзСушильнойКамеры.СушильнаяКамера));
		//Запрос.УстановитьПараметр("ОперацияВыгрузка", Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВыгрузкаИзСушильнойКамеры);
		
		//Дубоделов Э.А 13.02.2023
		//Параметр, отвечающий за формирование таблиц с движениями по алк_ПроизводствоОборот и алк_ОстаткиЗапасов
		ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(ДанныеДокументаВыгрузкаИзКамеры.Дата); 
		
        Запрос.УстановитьПараметр("ЗаписыватьДвиженияВНовыеРегистры", ЗаписыватьДвиженияВНовыеРегистры);
		//Дубоделов Э.А
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", 			МассивРезультатовЗапроса[1].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПакетыВСушильныхКамерах", 			МассивРезультатовЗапроса[2].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПиломатериалыПереданныеНаСушку", 	МассивРезультатовЗапроса[3].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладахСерии", 			МассивРезультатовЗапроса[4].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыПакетов",	 			МассивРезультатовЗапроса[5].Выгрузить());
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции",  		МассивРезультатовЗапроса[6].Выгрузить());
		
		Если ЗаписыватьДвиженияВНовыеРегистры Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов",  			МассивРезультатовЗапроса[1].Выгрузить());
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот",  		МассивРезультатовЗапроса[2].Выгрузить());
		КонецЕсли;
		
	КонецПроцедуры

	#КонецОбласти
	
		
	#Область СервисныеПроцедурыИФункции
	
	////ТА может убрать (теперь всегда будет заполнена сушильная камера)	
	//Функция ПолучитьЯчейкуПоКамере(СушильнаяКамера)
	//	
	//	Если Не ЗначениеЗаполнено(СушильнаяКамера) Тогда			
	//		Возврат Справочники.Ячейки.ПустаяСсылка();			
	//	КонецЕсли; 
	//	
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Ячейки.Ссылка
	//	|ИЗ
	//	|	Справочник.Ячейки КАК Ячейки
	//	|ГДЕ
	//	|	Ячейки.Наименование = &Наименование";
	//	
	//	//ТА убрала наименование
	//	Запрос.УстановитьПараметр("Наименование", СушильнаяКамера);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если РезультатЗапроса.Пустой() Тогда
	//		
	//		НоваяЯчейка = Справочники.Ячейки.СоздатьЭлемент();	
	//		НоваяЯчейка.Владелец = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс
	//		
	//		//ТА убрала наименование
	//		НоваяЯчейка.Наименование = СушильнаяКамера;			
	//		НоваяЯчейка.Записать();
	//		
	//	    Возврат НоваяЯчейка.Ссылка;
	//		
	//	КонецЕсли; 
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	//	КонецЦикла;
	//			
	//КонецФункции // ПолучитьЯчейкуПоКамере()
	
	//ТА поменяла добавлен Штабель и учтен получатель
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса ="ВЫБРАТЬ
		              |	&Период КАК Период,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.Организация КАК Организация,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.СерийныйНомер КАК СерийныйНомер,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Номенклатура КАК Номенклатура,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Характеристика КАК Характеристика,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Сертификат КАК Сертификат,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Объем КАК Объем,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.СушильнаяКамера КАК СушильнаяКамера,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.НомерСтроки КАК НомерСтроки,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.ШтабельПолучателя,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.СтруктурнаяЕдиницаПолучатель,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.Участок,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.ДатаСмены,
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.Смена
		              |ПОМЕСТИТЬ ВТ_ТаблицаДвижений
		              |ИЗ
		              |	Документ.алк_ВыгрузкаИзКамеры.Номенклатура КАК алк_ВыгрузкаИзКамерыНоменклатура
		              |ГДЕ
		              |	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка = &Ссылка
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	ВТ_ТаблицаДвижений.Период КАК Период,
		              |	ВТ_ТаблицаДвижений.Организация КАК Организация,
		              |	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		              |	ВТ_ТаблицаДвижений.СушильнаяКамера КАК Штабель,
		              |	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		              |	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		              |	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		              |	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		              |	ВТ_ТаблицаДвижений.Объем КАК Количество,
		              |	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Расход) КАК ВидДвижения
		              |ИЗ
		              |	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		              |ГДЕ
		              |	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	ВТ_ТаблицаДвижений.Период,
		              |	ВТ_ТаблицаДвижений.Организация,
		              |	ВТ_ТаблицаДвижений.СтруктурнаяЕдиницаПолучатель,
		              |	ВТ_ТаблицаДвижений.ШтабельПолучателя,
		              |	ВТ_ТаблицаДвижений.Номенклатура,
		              |	ВТ_ТаблицаДвижений.Характеристика,
		              |	ВТ_ТаблицаДвижений.Сертификат,
		              |	ВТ_ТаблицаДвижений.СерийныйНомер,
		              |	ВТ_ТаблицаДвижений.Объем,
		              |	ЗНАЧЕНИЕ(ВидДВиженияНакопления.Приход)
		              |ИЗ
		              |	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		              |ГДЕ
		              |	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		              |;
		              |
		              |////////////////////////////////////////////////////////////////////////////////
		              |ВЫБРАТЬ
		              |	ВТ_ТаблицаДвижений.Период КАК Период,
		              |	NULL КАК Бригада,
		              |	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства,
		              |	ВТ_ТаблицаДвижений.ДатаСмены КАК ДатаСмены,
		              |	ВТ_ТаблицаДвижений.Номенклатура КАК Номенклатура,
		              |	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка) КАК Операция,
		              |	ВТ_ТаблицаДвижений.Организация КАК Организация,
		              |	ВТ_ТаблицаДвижений.СерийныйНомер КАК СерийныйНомер,
		              |	ВТ_ТаблицаДвижений.Сертификат КАК Сертификат,
		              |	ВТ_ТаблицаДвижений.СтруктурнаяЕдиница КАК Склад,
		              |	ВТ_ТаблицаДвижений.СушильнаяКамера КАК Штабель,
		              |	ВТ_ТаблицаДвижений.Смена КАК Смена,
		              |	ВТ_ТаблицаДвижений.Характеристика КАК Характеристика,
		              |	ВТ_ТаблицаДвижений.Участок КАК Участок,
		              |	ВТ_ТаблицаДвижений.Объем КАК Количество
		              |ИЗ
		              |	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		              |ГДЕ
		              |	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	ВТ_ТаблицаДвижений.Период,
		              |	NULL,
		              |	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
		              |	ВТ_ТаблицаДвижений.ДатаСмены,
		              |	ВТ_ТаблицаДвижений.Номенклатура,
		              |	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка),
		              |	ВТ_ТаблицаДвижений.Организация,
		              |	ВТ_ТаблицаДвижений.СерийныйНомер,
		              |	ВТ_ТаблицаДвижений.Сертификат,
		              |	ВТ_ТаблицаДвижений.СтруктурнаяЕдиницаПолучатель,
		              |	ВТ_ТаблицаДвижений.ШтабельПолучателя,
		              |	ВТ_ТаблицаДвижений.Смена,
		              |	ВТ_ТаблицаДвижений.Характеристика,
		              |	ВТ_ТаблицаДвижений.Участок,
		              |	ВТ_ТаблицаДвижений.Объем
		              |ИЗ
		              |	ВТ_ТаблицаДвижений КАК ВТ_ТаблицаДвижений
		              |ГДЕ
		              |	&ЗаписыватьДвиженияВНовыеРегистры = ИСТИНА";  
				
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти
	
	
	
#КонецЕсли
