
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ВыгрузкаИзКамеры.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
	//алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
		
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект); 
	
	// Контроль
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 
		
	КонтрольЗаполнения(Отказ); 
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Номенклатура.Очистить();
	Если ДанныеЗаполнения = Неопределено Тогда
		
		СвойствоОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
		СвойствоПодразделение = ПланыВидовХарактеристик.НастройкиПользователей.ОсновноеПодразделение;
		
		СписокНастроек = Новый Массив;
		СписокНастроек.Добавить(СвойствоОрганизация);
		СписокНастроек.Добавить(СвойствоПодразделение);

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Настройка,
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь
		|	И НастройкиПользователей.Настройка В(&СписокНастроек)";
		Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
		Запрос.УстановитьПараметр("СписокНастроек", СписокНастроек);
		
		ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
			
			Если ВыборкаИзРезультатаЗапроса.Настройка = СвойствоОрганизация Тогда
				Организация = ВыборкаИзРезультатаЗапроса.Значение;
			КонецЕсли;
			
			Если ВыборкаИзРезультатаЗапроса.Настройка = СвойствоПодразделение Тогда
				СтруктурнаяЕдиница = ВыборкаИзРезультатаЗапроса.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_ЗагрузкаВКамеру") Тогда
		
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СушильнаяКамера = ДанныеЗаполнения.СушильнаяКамера;  
		
		Участок = ДанныеЗаполнения.Участок;
		
		СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиницаПолучатель;
		Для Каждого ТекСтрокаНоменклатура Из ДанныеЗаполнения.Номенклатура Цикл
			НоваяСтрока = Номенклатура.Добавить();
			НоваяСтрока.Количество = ТекСтрокаНоменклатура.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаНоменклатура.Номенклатура;
			НоваяСтрока.Объем = ТекСтрокаНоменклатура.Объем;
			НоваяСтрока.СерийныйНомер = ТекСтрокаНоменклатура.СерийныйНомер;
			НоваяСтрока.Сертификат = ТекСтрокаНоменклатура.Сертификат;
			НоваяСтрока.Характеристика = ТекСтрокаНоменклатура.Характеристика;
		КонецЦикла;
	КонецЕсли;

	//Если ЗначениеЗаполнено(Смена) Тогда
	//	Дата = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Смена, ТекущаяДатаСеанса()).ДатаВремяКонцаСмены;
	//Иначе
	//	Дата = ТекущаяДатаСеанса();
	//КонецЕсли;
	
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь(); 

КонецПроцедуры



// проверка 
// - соответствие пакетов загрузки и выгрузки
// - дублирования выгрузки
// - дата выгрузки познее даты загрузки
Процедура КонтрольЗаполнения(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли; 
	
	
	//соответствие пакетов загрузки и выгрузки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамерыНоменклатура.СерийныйНомер,
		|	алк_ВыгрузкаИзКамерыНоменклатура.Объем
		|ПОМЕСТИТЬ ВТ_ПакетыВыгрузка
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамеры.Номенклатура КАК алк_ВыгрузкаИзКамерыНоменклатура
		|ГДЕ
		|	алк_ВыгрузкаИзКамерыНоменклатура.Ссылка.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруНоменклатура.СерийныйНомер,
		|	алк_ЗагрузкаВКамеруНоменклатура.Объем
		|ПОМЕСТИТЬ ВТ_ПакетыЗагрузка
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеру.Номенклатура КАК алк_ЗагрузкаВКамеруНоменклатура
		|ГДЕ
		|	алк_ЗагрузкаВКамеруНоменклатура.Ссылка = &ДокОснование
		|	И алк_ЗагрузкаВКамеруНоменклатура.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_ПакетыВыгрузка.СерийныйНомер, ВТ_ПакетыЗагрузка.СерийныйНомер) КАК Пакет,
		|	ЕСТЬNULL(ВТ_ПакетыВыгрузка.Объем, 0) - ЕСТЬNULL(ВТ_ПакетыЗагрузка.Объем, 0) КАК Объем
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ПакетыЗагрузка КАК ВТ_ПакетыЗагрузка
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПакетыВыгрузка КАК ВТ_ПакетыВыгрузка
		|		ПО ВТ_ПакетыЗагрузка.СерийныйНомер = ВТ_ПакетыВыгрузка.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Пакет,
		|	ВТ_Итог.Объем
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВТ_Итог.Объем <> 0";  
	
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Проверьте пакет: " + ВыборкаДетальныеЗаписи.Пакет + ", расхождение объема: " + ВыборкаДетальныеЗаписи.Объем);
		Отказ = Истина;
		
	КонецЦикла;
	
	//дублирования выгрузки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВыгрузкаИзКамеры.Ссылка
		|ИЗ
		|	Документ.алк_ВыгрузкаИзКамеры КАК алк_ВыгрузкаИзКамеры
		|ГДЕ
		|	алк_ВыгрузкаИзКамеры.Ссылка <> &Ссылка
		|	И алк_ВыгрузкаИзКамеры.ДокументОснование = &ДокументОснование
		|	И алк_ВыгрузкаИзКамеры.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Для выбранного документа загрузки уже существует проведенный документ выгрузки: " + ВыборкаДетальныеЗаписи.Ссылка);
		Отказ = Истина;
		
	КонецЦикла;

	//дата выгрузки познее даты загрузки
	
	Если Дата < ДокументОснование.Дата Тогда 		
		Сообщить("У выбранного документа загрузки дата позднее даты выгрузки (текущего документа)!");
		Отказ = Истина; 	
	КонецЕсли; 
	
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);

КонецПроцедуры

#КонецОбласти