
Процедура ПередЗаписью(Отказ)	
	
	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Номенклатура.Наименование
		                      |ИЗ
		                      |	Справочник.Номенклатура КАК Номенклатура
		                      |ГДЕ
		                      |	Номенклатура.Наименование = &Наименование");
		Запрос.УстановитьПараметр("Наименование",Наименование);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
           	Сообщить("ВТ с таким именем уже существует");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = СокрЛП(ТекстЗапроса);
	
	Если Прав(ТекстЗапроса, 1) = ";" Тогда
		ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1); //Удалим последний символ 	
	КонецЕсли;
	
КонецПроцедуры
