#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Процедура - обработчик события ОбработкаЗаполнения.
	//
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
			
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);			
		КонецЕсли; 
				
	КонецПроцедуры
	
		// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		//Если ДанныеЗаполнения.Свойство("Основание") Тогда
		//	
		//КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		//
		//Если ДанныеЗаполнения.Свойство("ВидТранспортировки") Тогда
		//	ВидТранспортировки = ДанныеЗаполнения.ВидТранспортировки;	
		//КонецЕсли;	
		
	КонецПроцедуры

	
	// Обработчик заполнения документа на основании Заказа покупателя.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения, Операция = "") Экспорт
		
		Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.алк_ЗаказПокупателя") Тогда
			Возврат;	
		КонецЕсли;
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование 	= ДанныеЗаполнения.Ссылка;
		ЗаказПокупателя              	= ДанныеЗаполнения.Ссылка;
		Направление              		= ДанныеЗаполнения.Направление;
		Организация 					= ДанныеЗаполнения.Организация;
		
		//    можно заполнить табличную часть, но зачем? ...
		//Для каждого Стр Из  Цикл
		//
		//	
		//
		//КонецЦикла; 
		//НоваяСтрока = ЭтотОбъект[ИмяТабличнойЧасти].Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

				
	КонецПроцедуры //ЗаполнитьПоЗаказуПокупателя()

	#КонецОбласти
	
	
	#Область СобытияОбъекта
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		//Данные = ЗаказПокупателя;
		//ПредставлениеПоЗаказуПокупателя = Данные.Наименование + " ("+ Данные.Контрагент + ")";		
		
	КонецПроцедуры
	
	#КонецОбласти 
	
#КонецЕсли




