
Процедура ВыгрузитьОтгрузки() Экспорт
	
	
	
// закоменнтировал ниже т.к. повторяет выгрузку обработчика фонового задания. Перенаправил туда. 	
	
 //   Запрос = Новый Запрос;
 //   Запрос.Текст = 
 //   "ВЫБРАТЬ
 //   |	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Номенклатура) КАК Товар,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
 //   |	ВЫБОР
 //   |		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.КатегорияНоменклатуры = ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ШпонКусковой)
 //   |			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
 //   |		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
 //   |	КОНЕЦ КАК Объем,
 //   |	ВЫБОР
 //   |		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Железнодорожная)
 //   |			ТОГДА ИСТИНА
 //   |		ИНАЧЕ ЛОЖЬ
 //   |	КОНЕЦ КАК ЖД,
 //   |	ВЫБОР
 //   |		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
 //   |			ТОГДА ИСТИНА
 //   |		ИНАЧЕ ЛОЖЬ
 //   |	КОНЕЦ КАК Авто,
 //   |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД КАК ДатаОП,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000) КАК Длина,
 //   |	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
 //   |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.НомерНакладной,
 //   |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС КАК НомерВагона,
 //   |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер КАК НомерОП,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ) КАК Толщина,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ШиринаММ) КАК Ширина,
 //   |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СкладПолучательСсылка,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель) КАК СкладПолучатель,
 //   |	алк_ПараметрыХарактеристик.Влажность
 //   |ИЗ
 //   |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
 //   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
 //   |		ПО алк_ТранспортировкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
 //   |ГДЕ
 //   |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Проведен
 //   |	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.Дата >= &ДатаОт
 //   |	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД
 //   |	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
 //   |
 //   |ОБЪЕДИНИТЬ ВСЕ
 //   |
 //   |ВЫБРАТЬ
 //   |	алк_ОтгрузкаЩепыЗапасы.Ссылка,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Номенклатура),
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Порода),
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт),
 //   |	алк_ОтгрузкаЩепыЗапасы.ВесНетто,
 //   |	ИСТИНА,
 //   |	ЛОЖЬ,
 //   |	алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаКУчету_ТД,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000),
 //   |	0,
 //   |	алк_ОтгрузкаЩепыЗапасы.Ссылка.НомерНакладной,
 //   |	алк_ОтгрузкаЩепыЗапасы.Ссылка.ИдентификаторТС,
 //   |	алк_ОтгрузкаЩепыЗапасы.Ссылка.Номер,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ),
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ШиринаММ),
 //   |	алк_ОтгрузкаЩепыЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
 //   |	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель),
 //   |	алк_ПараметрыХарактеристик.Влажность
 //   |ИЗ
 //   |	Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
 //   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
 //   |		ПО алк_ОтгрузкаЩепыЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
 //   |ГДЕ
 //   |	алк_ОтгрузкаЩепыЗапасы.Ссылка.Проведен
 //   |	И алк_ОтгрузкаЩепыЗапасы.Ссылка.Дата >= &ДатаОт
 //   |	И алк_ОтгрузкаЩепыЗапасы.Ссылка.ВыгружатьВ_ТД
 //   |	И алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаКУчету_ТД <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
 //   
 //   //Запрос.УстановитьПараметр("ДатаОт", СДаты);
 //   Запрос.УстановитьПараметр("ДатаОт", ТекущаяДата() - 3600*24*30);
 //   
 //   РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
 //   
 //   Результат = РезультатЗапроса.Выгрузить();	
 //   Результат.Колонки.Добавить("УИД");
 //   Гр = Справочники.Влажность.НайтиПоКоду("000000001");
 //   
 //   Для каждого стрРезультат Из Результат Цикл
 //   	
 //   	стрРезультат.УИД = стрРезультат.Ссылка.УникальныйИдентификатор();
 //   	
 //   	Отбор = Новый Структура("Объект", стрРезультат.СкладПолучательСсылка);		
 //   	тзНаименование = РегистрыСведений.алк_НаименованиеТД.СрезПоследних( , Отбор); 
 //   	
 //   	Если тзНаименование.Количество() <> 0 Тогда
 //   		стрРезультат.СкладПолучатель = тзНаименование[0].Наименование;
 //   	Иначе
 //   		стрРезультат.СкладПолучатель = стрРезультат.СкладПолучатель;
 //   	КонецЕсли; 
 //   	
 //   	Если стрРезультат.Товар = "Карандаш" Тогда
 //   		
 //   		стрРезультат.Товар = "Карандаши"; 
 //   		
 //   	КонецЕсли; 
 //   	
 //   	Если стрРезультат.Товар = "Пиломатериал" Тогда
 //   		
 //   		Если стрРезультат.Влажность = Гр Тогда
 //   			
 //   			//стрРезультат.Сорт = стрРезультат.Сорт + " Gr"; 
 //   			
 //   		Иначе
 //   			
 //   			стрРезультат.Сорт = стрРезультат.Сорт + " KD";
 //   			
 //   		КонецЕсли;
 //   		
 //   	КонецЕсли; 
 //
 //   КонецЦикла; 
 //   
 //   ЗначениеВФайл("\\rfp04-srv023\exchange\ALK_OT_TD_1.txt", Результат);
		
КонецПроцедуры
 
Процедура ВыгрузитьОтгрузки_Объект(ОбъектВыгрузки) Экспорт
		
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Номенклатура) КАК Товар,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
	//|	ВЫБОР
	//|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.КатегорияНоменклатуры = ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ШпонКусковой)
	//|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.ВесНетто
	//|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	//|	КОНЕЦ КАК Объем,
	//|	ВЫБОР
	//|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Железнодорожная)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЖД,
	//|	ВЫБОР
	//|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВидТранспортировки = ЗНАЧЕНИЕ(Перечисление.алк_ВидыТранспортировки.Автомобильная)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК Авто,
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ДатаКУчету_ТД КАК ДатаОП,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000) КАК Длина,
	//|	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав КАК Количество,
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.НомерНакладной,
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ИдентификаторТС КАК НомерВагона,
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Номер КАК НомерОП,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ) КАК Толщина,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ШиринаММ) КАК Ширина,
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель КАК СкладПолучательСсылка,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ТранспортировкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель) КАК СкладПолучатель,
	//|	алк_ПараметрыХарактеристик.Влажность
	//|ИЗ
	//|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//|		ПО алк_ТранспортировкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	//|ГДЕ
	//|	алк_ТранспортировкаЗапасовЗапасы.Ссылка.Проведен
	//|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВыгружатьВ_ТД
	//|	И алк_ТранспортировкаЗапасовЗапасы.Ссылка = &Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	алк_ОтгрузкаЩепыЗапасы.Ссылка,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Номенклатура),
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Порода),
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт),
	//|	алк_ОтгрузкаЩепыЗапасы.ВесНетто,
	//|	ИСТИНА,
	//|	ЛОЖЬ,
	//|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаКУчету_ТД,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина.ДлинаММ / 1000),
	//|	0,
	//|	алк_ОтгрузкаЩепыЗапасы.Ссылка.НомерНакладной,
	//|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ИдентификаторТС,
	//|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Номер,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ),
	//|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение.ШиринаММ),
	//|	алк_ОтгрузкаЩепыЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель,
	//|	ПРЕДСТАВЛЕНИЕ(алк_ОтгрузкаЩепыЗапасы.Ссылка.СтруктурнаяЕдиницаПолучатель),
	//|	алк_ПараметрыХарактеристик.Влажность
	//|ИЗ
	//|	Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	//|		ПО алк_ОтгрузкаЩепыЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	//|ГДЕ
	//|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Проведен
	//|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.ВыгружатьВ_ТД
	//|	И алк_ОтгрузкаЩепыЗапасы.Ссылка = &Ссылка";
	//
	////Запрос.УстановитьПараметр("ДатаОт", СДаты);
	////Запрос.УстановитьПараметр("ДатаОт", ТекущаяДата() - 3600*24*30);
	//Запрос.УстановитьПараметр("Ссылка", ОбъектВыгрузки);

	//РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	//
	//Результат = РезультатЗапроса.Выгрузить();	
	//Результат.Колонки.Добавить("УИД");
	//Гр = Справочники.Влажность.НайтиПоКоду("000000001");
	//
	//Для каждого стрРезультат Из Результат Цикл
	//	
	//	стрРезультат.УИД = стрРезультат.Ссылка.УникальныйИдентификатор();
	//	
	//	Отбор = Новый Структура("Объект", стрРезультат.СкладПолучательСсылка);		
	//	тзНаименование = РегистрыСведений.алк_НаименованиеТД.СрезПоследних( , Отбор); 
	//	
	//	Если тзНаименование.Количество() <> 0 Тогда
	//		стрРезультат.СкладПолучатель = тзНаименование[0].Наименование;
	//	Иначе
	//		стрРезультат.СкладПолучатель = стрРезультат.СкладПолучатель;
	//	КонецЕсли; 
	//	
	//	Если стрРезультат.Товар = "Карандаш" Тогда
	//		
	//		стрРезультат.Товар = "Карандаши"; 
	//		
	//	КонецЕсли; 
	//	
	//	Если стрРезультат.Товар = "Пиломатериал" Тогда
	//		
	//		Если стрРезультат.Влажность = Гр Тогда
	//			
	//			//стрРезультат.Сорт = стрРезультат.Сорт + " Gr"; 
	//			
	//		Иначе
	//			
	//			стрРезультат.Сорт = стрРезультат.Сорт + " KD";
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли; 

	//КонецЦикла; 
	//
	//ЗначениеВФайл("\\rfp04-srv023\exchange\ALK_OT_TD_1.txt", Результат);
		
КонецПроцедуры
