
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВводПоказателей, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВводПлановыхПоказателейФинансыПлан.ДатаПлатежа КАК Период,
		|	алк_ВводПлановыхПоказателейФинансыПлан.Сумма,
		|	алк_ВводПлановыхПоказателейФинансыПлан.Факт,
		|	алк_ВводПлановыхПоказателейФинансыПлан.Контрагент,
		|	алк_ВводПлановыхПоказателейФинансыПлан.КатегорияНоменклатуры
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.ФинансыПлан КАК алк_ВводПлановыхПоказателейФинансыПлан
		|ГДЕ
		|	алк_ВводПлановыхПоказателейФинансыПлан.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.ЗаказПокупателя,
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.Сумма КАК Сумма,
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.Объем КАК Объем,
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.ОПСумма КАК ОПСумма,
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.ОПОбъем КАК ОПОбъем,
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.СтоимостьПеревозки КАК СтоимостьПеревозки,
		|	&Период,
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.Комментарий
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.ОтгрузкиПлан КАК алк_ВводПлановыхПоказателейОтгрузкиПлан
		|ГДЕ
		|	алк_ВводПлановыхПоказателейОтгрузкиПлан.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводПлановыхПоказателейПроизводство.КатегорияНоменклатуры,
		|	алк_ВводПлановыхПоказателейПроизводство.Сорт,
		|	СУММА(алк_ВводПлановыхПоказателейПроизводство.ПЗ_Объем) КАК ПЗ_Объем,
		|	СУММА(алк_ВводПлановыхПоказателейПроизводство.ОП_Объем) КАК ОП_Объем,
		|	&Период
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.Производство КАК алк_ВводПлановыхПоказателейПроизводство
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПроизводство.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВводПлановыхПоказателейПроизводство.КатегорияНоменклатуры,
		|	алк_ВводПлановыхПоказателейПроизводство.Сорт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводПлановыхПоказателейПроизводствоПоДням.КатегорияНоменклатуры,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДням.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДням.Смена,
		|	алк_ВводПлановыхПоказателейПроизводство.Сорт,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДням.ПЗ_Объем * алк_ВводПлановыхПоказателейПроизводство.КоэффПЗ КАК ПЗ_Объем,
		|	&Период
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.ПроизводствоПоДням КАК алк_ВводПлановыхПоказателейПроизводствоПоДням
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.Производство КАК алк_ВводПлановыхПоказателейПроизводство
		|		ПО алк_ВводПлановыхПоказателейПроизводствоПоДням.КатегорияНоменклатуры = алк_ВводПлановыхПоказателейПроизводство.КатегорияНоменклатуры
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПроизводство.Ссылка = &Ссылка
		|	И алк_ВводПлановыхПоказателейПроизводствоПоДням.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямС.КатегорияНоменклатуры,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямС.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямС.Смена,
		|	алк_ВводПлановыхПоказателейПроизводствоС.Сорт,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямС.ПЗ_Объем * алк_ВводПлановыхПоказателейПроизводствоС.КоэффПЗ КАК ПЗ_Объем,
		|	&Период
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.ПроизводствоПоДнямС КАК алк_ВводПлановыхПоказателейПроизводствоПоДнямС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.ПроизводствоС КАК алк_ВводПлановыхПоказателейПроизводствоС
		|		ПО алк_ВводПлановыхПоказателейПроизводствоПоДнямС.КатегорияНоменклатуры = алк_ВводПлановыхПоказателейПроизводствоС.КатегорияНоменклатуры
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПроизводствоС.Ссылка = &Ссылка
		|	И алк_ВводПлановыхПоказателейПроизводствоПоДнямС.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямН.КатегорияНоменклатуры,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямН.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямН.Смена,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДнямН.ПЗ_Объем * алк_ВводПлановыхПоказателейПроизводствоН.КоэффПЗ КАК ПЗ_Объем,
		|	&Период,
		|	алк_ВводПлановыхПоказателейПроизводствоН.Номенклатура
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.ПроизводствоПоДнямН КАК алк_ВводПлановыхПоказателейПроизводствоПоДнямН
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.ПроизводствоН КАК алк_ВводПлановыхПоказателейПроизводствоН
		|		ПО алк_ВводПлановыхПоказателейПроизводствоПоДнямН.КатегорияНоменклатуры = алк_ВводПлановыхПоказателейПроизводствоН.КатегорияНоменклатуры
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПроизводствоН.Ссылка = &Ссылка
		|	И алк_ВводПлановыхПоказателейПроизводствоПоДнямН.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ПлановыйПоказатель КАК ПроизводственныйПоказатель,
		|	ЕСТЬNULL(алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводстваПосменно.Значение, 0) КАК Значение,
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.Ссылка.Организация,
		|	ЕСТЬNULL(алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводстваПосменно.Дата, алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.Ссылка.Дата) КАК Период,
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ЗначениеГодовое,
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводстваПосменно.Смена
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.ПлановыеПоказателиПроизводства КАК алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.ПлановыеПоказателиПроизводстваПосменно КАК алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводстваПосменно
		|		ПО алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.Ссылка = алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводстваПосменно.Ссылка
		|			И алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ПлановыйПоказатель = алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводстваПосменно.ПлановыйПоказатель
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.Ссылка = &Ссылка
		|	И НЕ алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ПлановыйПоказатель.алк_ОперацияПроизводства В (ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Подано), ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Получено))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(алк_ВводПлановыхПоказателейПоданоПоДням.ПЗ_Объем) КАК Значение,
		|	алк_ПоказателиПроизводства.Ссылка КАК ПроизводственныйПоказатель,
		|	алк_ВводПлановыхПоказателейПоданоПоДням.ДатаСмены КАК Период,
		|	алк_ВводПлановыхПоказателейПоданоПоДням.Ссылка.Организация КАК Организация,
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ЗначениеГодовое КАК ЗначениеГодовое,
		|	ЛОЖЬ КАК НаКаждыйДень
		|ИЗ
		|	Справочник.алк_ПоказателиПроизводства КАК алк_ПоказателиПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.ПоданоПоДням КАК алк_ВводПлановыхПоказателейПоданоПоДням
		|		ПО (алк_ПоказателиПроизводства.алк_ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Подано))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.ПлановыеПоказателиПроизводства КАК алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства
		|		ПО алк_ПоказателиПроизводства.алк_ОперацияПроизводства = алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ПлановыйПоказатель.алк_ОперацияПроизводства
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПоданоПоДням.Ссылка = &Ссылка
		|	И алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПоказателиПроизводства.Ссылка,
		|	алк_ВводПлановыхПоказателейПоданоПоДням.Ссылка.Организация,
		|	алк_ВводПлановыхПоказателейПоданоПоДням.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ЗначениеГодовое
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(алк_ВводПлановыхПоказателейПолученоПиломатериаловПоДням.ПЗ_Объем),
		|	алк_ПоказателиПроизводства.Ссылка,
		|	алк_ВводПлановыхПоказателейПолученоПиломатериаловПоДням.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПолученоПиломатериаловПоДням.Ссылка.Организация,
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ЗначениеГодовое,
		|	ЛОЖЬ
		|ИЗ
		|	Справочник.алк_ПоказателиПроизводства КАК алк_ПоказателиПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.ПолученоПиломатериаловПоДням КАК алк_ВводПлановыхПоказателейПолученоПиломатериаловПоДням
		|		ПО (алк_ПоказателиПроизводства.алк_ОперацияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Получено))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.ПлановыеПоказателиПроизводства КАК алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства
		|		ПО алк_ПоказателиПроизводства.алк_ОперацияПроизводства = алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ПлановыйПоказатель.алк_ОперацияПроизводства
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПолученоПиломатериаловПоДням.Ссылка = &Ссылка
		|	И алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВводПлановыхПоказателейПолученоПиломатериаловПоДням.Ссылка.Организация,
		|	алк_ПоказателиПроизводства.Ссылка,
		|	алк_ВводПлановыхПоказателейПолученоПиломатериаловПоДням.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПлановыеПоказателиПроизводства.ЗначениеГодовое
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(алк_ВводПлановыхПоказателейПроизводствоПоДням.ПЗ_Объем * алк_ВводПлановыхПоказателейПроизводство.КоэффОП),
		|	алк_ВводПлановыхПоказателейПроизводство.ПлановыйПоказатель,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДням.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПроизводство.Ссылка.Организация,
		|	СУММА(алк_ВводПлановыхПоказателейПроизводствоПоДням.ПЗ_Объем * алк_ВводПлановыхПоказателейПроизводство.КоэффОП),
		|	ИСТИНА
		|ИЗ
		|	Документ.алк_ВводПлановыхПоказателей.ПроизводствоПоДням КАК алк_ВводПлановыхПоказателейПроизводствоПоДням
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ВводПлановыхПоказателей.Производство КАК алк_ВводПлановыхПоказателейПроизводство
		|		ПО алк_ВводПлановыхПоказателейПроизводствоПоДням.Ссылка = алк_ВводПлановыхПоказателейПроизводство.Ссылка
		|ГДЕ
		|	алк_ВводПлановыхПоказателейПроизводство.Ссылка = &Ссылка
		|	И алк_ВводПлановыхПоказателейПроизводствоПоДням.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ВводПлановыхПоказателейПроизводство.ПлановыйПоказатель,
		|	алк_ВводПлановыхПоказателейПроизводствоПоДням.ДатаСмены,
		|	алк_ВводПлановыхПоказателейПроизводство.Ссылка.Организация";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВводПоказателей);
		Запрос.УстановитьПараметр("Период", НачалоМесяца(ДокументСсылкаВводПоказателей.Дата));

		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаФинансыПлан", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтгрузкиПлан", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоПлан", МассивРезультатов[2].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоПосменноПлан", МассивРезультатов[3].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоПосменноПланС", МассивРезультатов[4].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоПосменноПланН", МассивРезультатов[5].Выгрузить());
		
		//Сергеева ГО записываем плановые показатели на каждый день
		ДатаПериод = ДокументСсылкаВводПоказателей.Дата;
		КолДнейВМесяце = День(КонецМесяца(ДатаПериод));
		ТЗ = МассивРезультатов[6].Выгрузить();
		//ТЗ.Очистить(); 				
		//ДатаОкончания = НачалоДня(КонецМесяца(ДатаПериод));
		//Выборка = МассивРезультатов[6].Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	Если  Выборка.ПроизводственныйПоказатель.алк_ОперацияПроизводства = Перечисления.алк_ОперацииПроизводства.Остатки Тогда
		//		ТЧ = ТЗ.Добавить();
		//		ЗаполнитьЗначенияСвойств(ТЧ,Выборка);
		//		ТЧ.Период = НачалоМесяца(ДатаПериод);
		//	Иначе 				
		//		ДатаНачала = НачалоМесяца(ДатаПериод);
		//		Пока ДатаНачала <= ДатаОкончания Цикл
		//			ТЧ = ТЗ.Добавить();
		//			ЗаполнитьЗначенияСвойств(ТЧ,Выборка);
		//			ТЧ.Значение = Выборка.Значение / КолДнейВМесяце;
		//			Если ДатаНачала = НачалоМесяца(ДатаПериод) Тогда
		//				ТЧ.ЗначениеГодовое	 = Выборка.ЗначениеГодовое;
		//			Иначе
		//				ТЧ.ЗначениеГодовое 	 = 0;
		//			КонецЕсли;
		//			
		//			ТЧ.Период = ДатаНачала;
		//			ДатаНачала = ДатаНачала + 86400;
		//		КонецЦикла;
		//	КонецЕсли; 			
		//КонецЦикла;
		
		ИтогПроизводство = 0;
		Выборка = МассивРезультатов[7].Выбрать();
		Пока Выборка.Следующий() Цикл
			ТЧ = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(ТЧ,Выборка);
			Если Не Выборка.НаКаждыйДень Тогда
				Если Выборка.Период = НачалоМесяца(Выборка.Период)  Тогда
					ТЧ.ЗначениеГодовое	 = Выборка.ЗначениеГодовое;
				Иначе
					ТЧ.ЗначениеГодовое	 = 0;
				КонецЕсли;
			КонецЕсли; 			
		КонецЦикла;
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтразитьПлановыеПоказатели", ТЗ);
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
