
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		              
		// Инициализация дополнительных свойств для проведения документа.
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа.
		Документы.алк_ВводПлановыхПоказателей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей.
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета.
		ОтразитьПлановыеПоказателиСводка();
		РфпСервер.ОтразитьФинансыПлан(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОтгрузкиПлан(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьПроизводствоПлан(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьПроизводствоПосменноПлан(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьПроизводствоПосменноПланС(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьПроизводствоПосменноПланН(ДополнительныеСвойства, Движения, Отказ);
		
		//Сергеева Г.О. оперсводка плановые показатели ++
		РфпСервер.ОтразитьПлановыеПоказатели(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. оперсводка плановые показатели --

		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	КонецПроцедуры
	
	#КонецОбласти 
	
	Процедура ОтразитьПлановыеПоказателиСводка()
		
		// регистр алк_ПлановыеПоказателиСводка
		Движения.алк_ПлановыеПоказателиСводка.Записывать = Истина;
		Движения.алк_ПлановыеПоказателиСводка.Очистить();
		
		//поступление Ель 
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПоступлениеСырья12_1;
		Движение.Значение = ОП_ПоступилоСырьяЕль;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПоступлениеСырья12_1;
		Движение.Значение = ПЗ_ПоступилоСырьяЕль; 
		//\\
		
		//поступление Лц
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПоступилоСырья3_1;
		Движение.Значение = ОП_ПоступилоСырьяЛиственница;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПоступилоСырья3_1;
		Движение.Значение = ПЗ_ПоступилоСырьяЛиственница;
		//\\
		
		//поступления сырья всего
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПоступлениеСырья_1;
		Движение.Значение = ОП_ПоступлениеСырья_1;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПоступлениеСырья_1;
		Движение.Значение = ПЗ_ПоступлениеСырья_1; 
		//\\
		
		//остатки сырья на складе, вкл. МЛП
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОстатокБиржа_1;
		Движение.Значение = ОП_ОстатокНаСкладе;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОстатокБиржа_1;
		Движение.Значение = ПЗ_ОстатокНаСкладе;
		//\\
		
		//в том числе несортированное (ель)
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОстатокБиржаЕльНесортированная;
		Движение.Значение = ОП_ОстатокЕльНесортированная;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОстатокБиржаЕльНесортированная;
		Движение.Значение = ПЗ_ОстатокЕльНесортированная; 
		//\\
		
		//остаток сырья (лц)
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОстатокБиржа3_1;
		Движение.Значение = ОП_ОстатокЛиственница;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОстатокБиржа3_1;
		Движение.Значение = ПЗ_ОстатокЛиственница;
		//\\
		
		//в том числе несортированное (лц)
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОстатокБиржаЛцНесортированная;
		Движение.Значение = ОП_ОстатокЛиственницаНесортированная;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОстатокБиржаЛцНесортированная;
		Движение.Значение = ПЗ_ОстатокЛиственницаНесортированная;  
		//\\
		
		//остаток сырья (ель)
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОстатокБиржа12_1;
		Движение.Значение = ПЗ_ОстатокЕль;                                                            
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОстатокБиржа12_1;
		Движение.Значение = ОП_ОстатокЕль;
		//\\
		
		//отгружено машинами
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОтгруженоМашинами_1;
		Движение.Значение = ОП_ОтгруженоМашинами;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОтгруженоМашинами_1;
		Движение.Значение = ПЗ_ОтгруженоМашинами;
		//\\
		
		//отгружено вагонами
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОтгруженоВагонами_1;
		Движение.Значение = ОП_ОтгруженоВагонами;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОтгруженоВагонами_1;
		Движение.Значение = ПЗ_ОтгруженоВагонами; 
		//\\
		
		//отгружено контейнерами 
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОтгруженоКонтейнерами_1;
		Движение.Значение = ОП_ОтгруженоКонтейнерами;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОтгруженоКонтейнерами_1;
		Движение.Значение = ПЗ_ОтгруженоКонтейнерами;
		//\\
		
		//отгружено всего
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОтгруженоВсего_1;
		Движение.Значение = ОП_ОтгруженоВсего;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОтгруженоВсего_1;
		Движение.Значение = ПЗ_ОтгруженоВсего; 
		//\\
		
		//произведено
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПроизведеноПилмат;
		Движение.Значение = ОП_ПроизведеноПилмат;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПроизведеноПилмат;
		Движение.Значение = ПЗ_ПроизведеноПилмат;
		//\\
		
		//остатки на СГП
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ОстатокПилмата;
		Движение.Значение = ОП_ОстатокПилмата;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ОстатокПилмата;
		Движение.Значение = ПЗ_ОстатокПилмата; 
		//\\
		
		//?
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПоступленияДС;
		Движение.Значение = ОП_ПоступленияДС;
		
		//подано в пр-во
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПоданоВПроизводство;
		Движение.Значение = ОП_ПоданоВПроизводство;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПоданоВПроизводство;
		Движение.Значение = ПЗ_ПоданоВПроизводство;
		//\\
		
		//получено пм
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПолученоПиломатериалов;
		Движение.Значение = ОП_ПолученоПиломатериалов;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПолученоПиломатериалов;
		Движение.Значение = ПЗ_ПолученоПиломатериалов;
		//\\	
		
		//?
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПоступлениеСырьяЦПШ;
		Движение.Значение = ОП_ПоступилоСырьяЦПШ;  
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПоступлениеСырьяЦПШ;
		Движение.Значение = ПЗ_ПоступилоСырьяЦПШ;  
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОЖ_ПоступлениеСырьяЦПШ;
		Движение.Значение = ОЖ_ПоступилоСырьяЦПШ;
		//\\
		
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОП_ПоступилоСырьяМЛ;
		Движение.Значение = ОП_ПоступилоСырьяМЛ;  
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ПЗ_ПоступилоСырьяМЛ;
		Движение.Значение = ПЗ_ПоступилоСырьяМЛ;
		
		Движение = Движения.алк_ПлановыеПоказателиСводка.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Справочники.алк_СводкаПлановыеПоказатели.ОЖ_ПоступилоСырьяМЛ;
		Движение.Значение = ОЖ_ПоступилоСырьяМЛ;

		
				
	КонецПроцедуры
		
Процедура ПриЗаписи(Отказ)
	
	//ДОБАВИМ ОПЕРАЦИИ В ЗАДАНИЕ
	
	//Для расчета по показателям ДГ
	//план
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.НайтиПоКоду("000000419"),
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.План);
	
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.Упаковка,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.План);
	//\\ 
	
	//бюджет
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.НайтиПоКоду("000000419"),
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Бюджет);  
	
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.Упаковка,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Бюджет);
	//\\   
	
	//ДЛЯ ОПЕРСВОДКИ ПМ
	//план
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.Приемка,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.План);
	
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.Распил,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.План); 
	
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.ПереданоВОтгрузку,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.План);
	
	//бюджет 
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.Приемка,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Бюджет);  
	
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.Распил,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Бюджет);  
	
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	НачалоМесяца(Дата),
	Справочники.алк_ОперацииПроизводства.ПереданоВОтгрузку,
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Бюджет);
	//\\ 
	
	//\\
КонецПроцедуры  

#КонецЕсли


