
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Вариант, Направление, КатегорияНоменклатуры"
		, 5
		, ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы")
		, ПолучитьКатегорийНоменклатуры());

	ОткрытьФорму("Обработка.алк_РабочееМестоОператораЦЛП.Форма.ФормаИнициализации", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере

Функция ПолучитьКатегорийНоменклатуры()

	Возврат Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000007"); //Пилеты (кат)

КонецФункции // ПолучитьКатегорийНоменклатуры()
 