
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// Процедура - обработчик события ОбработкаПроведения объекта.
	//
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа.
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа.
		Документы.алк_ВнутренняяПередачаМеждуОрганизациями.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей.
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		//РФП закомментили 31.10.2023
		//// Отражение в разделах учета.
		//РфпСервер.ОтразитьПередачиСобственныеСерии(ДополнительныеСвойства, Движения, Отказ);
		//\\
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		
		//РФП закомментили 31.10.2023
		//// Контроль
		//ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ПередачиСобственныеСерии");

		//Если ОтказПоКонтролю Тогда
		//	
		//	Отказ = Истина;
		//	
		//КонецЕсли; 
		//\\
	КонецПроцедуры
	
	
	
#КонецЕсли
