
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	ПодготовитьДанныеДляРНОстаткиЗапасов(ДокументСсылка, ДополнительныеСвойства); 
	ПодготовитьДанныеДляПроизводствоОборот(ДокументСсылка, ДополнительныеСвойства); 
КонецПроцедуры

Процедура ПодготовитьДанныеДляРНОстаткиЗапасов(ДокументСсылка, ДополнительныеСвойства)
	
	// В запросе перемещения из производства ЦЛП (со склада "Буферный склад ЦЛП") устанавливается период для каждого пакета.
	// если пакет выпущен/перемещен в пределах смены к которой относится перемещение, 
	// то данное перемещение двигает пакет после его последнего движения (+1 секунда).
	// Если движения были за границами смены документа, устанавливается время документа.
	// Применяется только для пакетированной продукции, для непакетированной устанавливается время документа.
			
	#Область ЗапросПеремещениеИзПроизводстваЦЛП
	
	ЗапросПеремещениеИзПроизводстваЦЛП = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ПеремещениеЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	алк_ПеремещениеЗапасы.Ссылка.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА алк_ПеремещениеЗапасы.Ссылка.Смена.Код = ""000000001""
	|			ТОГДА ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 8 * 3600)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 20 * 3600)
	|	КОНЕЦ КАК ДатаНачалаСмены,
	|	ВЫБОР
	|		КОГДА алк_ПеремещениеЗапасы.Ссылка.Смена.Код = ""000000001""
	|			ТОГДА ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 20 * 3600 - 1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(алк_ПеремещениеЗапасы.Ссылка.ДатаСмены, СЕКУНДА, 32 * 3600 - 1)
	|	КОНЕЦ КАК ДатаКонцаСмены,
	|	алк_ПеремещениеЗапасы.Ссылка.СкладОтправитель КАК СкладОтправитель
	|ПОМЕСТИТЬ ВТ_Пакеты
	|ИЗ
	|	Документ.алк_Перемещение.Запасы КАК алк_ПеремещениеЗапасы
	|ГДЕ
	|	алк_ПеремещениеЗапасы.Ссылка = &ДокументСсылка
	|	И НЕ алк_ПеремещениеЗапасы.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Пакеты.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_Пакеты.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_Пакеты.ДатаНачалаСмены КАК ДатаНачалаСмены,
	|	ВТ_Пакеты.ДатаКонцаСмены КАК ДатаКонцаСмены,
	|	алк_ОстаткиЗапасовОбороты.Период КАК Период,
	|	ВЫБОР
	|		КОГДА алк_ОстаткиЗапасовОбороты.Период МЕЖДУ ВТ_Пакеты.ДатаНачалаСмены И ВТ_Пакеты.ДатаКонцаСмены
	|			ТОГДА алк_ОстаткиЗапасовОбороты.Период
	|		ИНАЧЕ ВТ_Пакеты.ДатаДокумента
	|	КОНЕЦ КАК Дата
	|ПОМЕСТИТЬ ВТ_ДатыПакетов
	|ИЗ
	|	ВТ_Пакеты КАК ВТ_Пакеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	|				ДОБАВИТЬКДАТЕ(&КонецСмены, ЧАС, -24),
	|				&КонецСмены,
	|				Регистратор,
	|				(СерийныйНомер, СтруктурнаяЕдиница) В
	|					(ВЫБРАТЬ
	|						ВТ_Пакеты.СерийныйНомер,
	|						ВТ_Пакеты.СкладОтправитель
	|					ИЗ
	|						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ОстаткиЗапасовОбороты
	|		ПО ВТ_Пакеты.СерийныйНомер = алк_ОстаткиЗапасовОбороты.СерийныйНомер
	|ГДЕ
	|	алк_ОстаткиЗапасовОбороты.Регистратор <> &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыПакетов.СерийныйНомер КАК СерийныйНомер,
	|	МАКСИМУМ(ВТ_ДатыПакетов.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ДатаИтог
	|ИЗ
	|	ВТ_ДатыПакетов КАК ВТ_ДатыПакетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДатыПакетов.СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ОстаткиЗапасов.Период КАК Период,
	|	алк_ОстаткиЗапасов.ВидДвижения КАК ВидДвижения,
	|	алк_ОстаткиЗапасов.Организация КАК Организация,
	|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	алк_ОстаткиЗапасов.Штабель КАК Штабель,
	|	алк_ОстаткиЗапасов.Номенклатура КАК Номенклатура,
	|	алк_ОстаткиЗапасов.Характеристика КАК Характеристика,
	|	алк_ОстаткиЗапасов.Сертификат КАК Сертификат,
	|	алк_ОстаткиЗапасов.СерийныйНомер КАК СерийныйНомер,
	|	алк_ОстаткиЗапасов.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Движения
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ПеремещениеЗапасы.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	алк_ПеремещениеЗапасы.Ссылка.Организация,
	|	алк_ПеремещениеЗапасы.Ссылка.СкладОтправитель,
	|	алк_ПеремещениеЗапасы.Ссылка.ШтабельОтправитель,
	|	алк_ПеремещениеЗапасы.Номенклатура,
	|	алк_ПеремещениеЗапасы.Характеристика,
	|	алк_ПеремещениеЗапасы.Сертификат,
	|	алк_ПеремещениеЗапасы.СерийныйНомер,
	|	алк_ПеремещениеЗапасы.Количество
	|ИЗ
	|	Документ.алк_Перемещение.Запасы КАК алк_ПеремещениеЗапасы
	|ГДЕ
	|	алк_ПеремещениеЗапасы.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ПеремещениеЗапасы.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	алк_ПеремещениеЗапасы.Ссылка.Организация,
	|	алк_ПеремещениеЗапасы.Ссылка.СкладПолучатель,
	|	алк_ПеремещениеЗапасы.Ссылка.ШтабельПолучатель,
	|	алк_ПеремещениеЗапасы.Номенклатура,
	|	алк_ПеремещениеЗапасы.Характеристика,
	|	алк_ПеремещениеЗапасы.Сертификат,
	|	алк_ПеремещениеЗапасы.СерийныйНомер,
	|	алк_ПеремещениеЗапасы.Количество
	|ИЗ
	|	Документ.алк_Перемещение.Запасы КАК алк_ПеремещениеЗапасы
	|ГДЕ
	|	алк_ПеремещениеЗапасы.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_ДатаИтог.Дата ЕСТЬ NULL
	|			ТОГДА ВТ_Движения.Период
	|		КОГДА ВТ_ДатаИтог.Дата = &КонецСмены
	|			ТОГДА ВТ_ДатаИтог.Дата
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ДатаИтог.Дата, СЕКУНДА, 1)
	|	КОНЕЦ КАК Период,
	|	ВТ_Движения.ВидДвижения КАК ВидДвижения,
	|	ВТ_Движения.Организация КАК Организация,
	|	ВТ_Движения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_Движения.Штабель КАК Штабель,
	|	ВТ_Движения.Номенклатура КАК Номенклатура,
	|	ВТ_Движения.Характеристика КАК Характеристика,
	|	ВТ_Движения.Сертификат КАК Сертификат,
	|	ВТ_Движения.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_Движения.Количество КАК Количество
	|ИЗ
	|	ВТ_Движения КАК ВТ_Движения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаИтог КАК ВТ_ДатаИтог
	|		ПО ВТ_Движения.СерийныйНомер = ВТ_ДатаИтог.СерийныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДвижения УБЫВ,
	|	Период";	
	
	#КонецОбласти
	
#Область ЗапросПеремещение
	
	ЗапросПеремещение = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ОстаткиЗапасов.Период КАК Период,
	|	алк_ОстаткиЗапасов.ВидДвижения КАК ВидДвижения,
	|	алк_ОстаткиЗапасов.Организация КАК Организация,
	|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	алк_ОстаткиЗапасов.Штабель КАК Штабель,
	|	алк_ОстаткиЗапасов.Номенклатура КАК Номенклатура,
	|	алк_ОстаткиЗапасов.Характеристика КАК Характеристика,
	|	алк_ОстаткиЗапасов.Сертификат КАК Сертификат,
	|	алк_ОстаткиЗапасов.СерийныйНомер КАК СерийныйНомер,
	|	алк_ОстаткиЗапасов.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
	|ГДЕ
	|	ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ПеремещениеЗапасы.Период, алк_ПеремещениеЗапасы.Ссылка.Дата),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	алк_ПеремещениеЗапасы.Ссылка.Организация,
	|	алк_ПеремещениеЗапасы.Ссылка.СкладОтправитель,
	|	алк_ПеремещениеЗапасы.Ссылка.ШтабельОтправитель,
	|	алк_ПеремещениеЗапасы.Номенклатура,
	|	алк_ПеремещениеЗапасы.Характеристика,
	|	алк_ПеремещениеЗапасы.Сертификат,
	|	алк_ПеремещениеЗапасы.СерийныйНомер,
	|	алк_ПеремещениеЗапасы.Количество
	|ИЗ
	|	Документ.алк_Перемещение.Запасы КАК алк_ПеремещениеЗапасы
	|ГДЕ
	|	алк_ПеремещениеЗапасы.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ПеремещениеЗапасы.Период, алк_ПеремещениеЗапасы.Ссылка.Дата),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	алк_ПеремещениеЗапасы.Ссылка.Организация,
	|	алк_ПеремещениеЗапасы.Ссылка.СкладПолучатель,
	|	алк_ПеремещениеЗапасы.Ссылка.ШтабельПолучатель,
	|	алк_ПеремещениеЗапасы.Номенклатура,
	|	алк_ПеремещениеЗапасы.Характеристика,
	|	алк_ПеремещениеЗапасы.Сертификат,
	|	алк_ПеремещениеЗапасы.СерийныйНомер,
	|	алк_ПеремещениеЗапасы.Количество
	|ИЗ
	|	Документ.алк_Перемещение.Запасы КАК алк_ПеремещениеЗапасы
	|ГДЕ
	|	алк_ПеремещениеЗапасы.Ссылка = &ДокументСсылка";	
	
	#КонецОбласти
	
	Запрос = новый запрос();
	
	//Если ДокументСсылка.СкладОтправитель.Код = "ПБ-000003" Тогда  		
	//	Запрос.Текст = ЗапросПеремещениеИзПроизводстваЦЛП;  
	//Иначе
		Запрос.Текст = ЗапросПеремещение;		
	//КонецЕсли;
	
	ВремяСмены = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(ДокументСсылка.Смена, ДокументСсылка.ДатаСмены);
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("КонецСмены", ВремяСмены.ДатаВремяКонцаСмены);
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", ТаблицаДвижений);

КонецПроцедуры

Процедура ПодготовитьДанныеДляПроизводствоОборот(ДокументСсылка, ДополнительныеСвойства); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(алк_ПеремещениеЗапасы.Период, алк_Перемещение.Дата) КАК Период,
	               |	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеРасход) КАК Операция,
	               |	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Списано) КАК ВидДвиженияПроизводства,
	               |	алк_Перемещение.Участок КАК Участок,
	               |	алк_Перемещение.Организация КАК Организация,
	               |	алк_ПеремещениеЗапасы.Номенклатура КАК Номенклатура,
	               |	алк_ПеремещениеЗапасы.Характеристика КАК Характеристика,
	               |	алк_ПеремещениеЗапасы.Сертификат КАК Сертификат,
	               |	алк_Перемещение.СкладОтправитель КАК Склад,
	               |	алк_Перемещение.ШтабельОтправитель КАК Штабель,
	               |	алк_Перемещение.ДатаСмены КАК ДатаСмены,
	               |	алк_Перемещение.Смена КАК Смена,
	               |	алк_ПеремещениеЗапасы.СерийныйНомер КАК СерийныйНомер,
	               |	алк_ПеремещениеЗапасы.Количество КАК Количество
	               |ИЗ
	               |	Документ.алк_Перемещение КАК алк_Перемещение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_Перемещение.Запасы КАК алк_ПеремещениеЗапасы
	               |		ПО алк_Перемещение.Ссылка = алк_ПеремещениеЗапасы.Ссылка
	               |ГДЕ
	               |	алк_Перемещение.Ссылка = &ДокументСсылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(алк_ПеремещениеЗапасы.Период, алк_Перемещение.Дата),
	               |	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.ПеремещениеПриход),
	               |	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
	               |	ЗНАЧЕНИЕ(Справочник.алк_Участки.ПустаяСсылка),
	               |	алк_Перемещение.Организация,
	               |	алк_ПеремещениеЗапасы.Номенклатура,
	               |	алк_ПеремещениеЗапасы.Характеристика,
	               |	алк_ПеремещениеЗапасы.Сертификат,
	               |	алк_Перемещение.СкладПолучатель,
	               |	алк_Перемещение.ШтабельПолучатель,
	               |	алк_Перемещение.ДатаСмены,
	               |	алк_Перемещение.Смена,
	               |	алк_ПеремещениеЗапасы.СерийныйНомер,
	               |	алк_ПеремещениеЗапасы.Количество
	               |ИЗ
	               |	Документ.алк_Перемещение КАК алк_Перемещение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_Перемещение.Запасы КАК алк_ПеремещениеЗапасы
	               |		ПО алк_Перемещение.Ссылка = алк_ПеремещениеЗапасы.Ссылка
	               |ГДЕ
	               |	алк_Перемещение.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", ТаблицаДвижений);
	
КонецПроцедуры


// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
 Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
				
		
	КонецПроцедуры // ДобавитьКомандыПечати()
	
