
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) тогда 
		Дата = ТекущаяДата();
	КонецЕсли;
	
	//если передача на сушку
	//Если СкладОтправитель = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000003") И СкладПолучатель = Справочники.СтруктурныеЕдиницы.СушильныйБуфер Тогда 
	//	ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены,  Смена); 	
	//	Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, "ПеремещениеНаСушкуПилмат");
	//КонецЕсли; 
	//\\
	
	//Назначим период для каждого пакета 
	Для Каждого стр ИЗ Запасы Цикл 
		
		ТЧСерийныеНомера = Новый ТаблицаЗначений;
		ТЧСерийныеНомера.Колонки.Добавить("СерийныйНомер",Новый ОписаниеТипов("СправочникСсылка.СерийныеНомера")); 
		
		СТРТЧСерийныеНомера = ТЧСерийныеНомера.Добавить();
		СТРТЧСерийныеНомера.СерийныйНомер = стр.СерийныйНомер;
	
		стр.Период = РфпСервер.ПолучитьПоследнийПериодПакета(Ссылка,Дата,ДатаСмены
		,Смена,СкладОтправитель,ШтабельОтправитель,ТЧСерийныеНомера,Участок)[0].Дата; 
	КонецЦикла;
	//\\
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПроверитьДатыЗапасов(Отказ); //Дата проведения выходила за границы смены Дубоделов Э.А 25.05.2023
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	алк_ОстаткиЗапасов.СерийныйНомер
			|ИЗ
			|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|	И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
		РезультатЗапроса = Запрос.Выполнить();	
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
	
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель
			|ИЗ
			|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|	И алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
				
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
				
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.алк_Перемещение.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);  
	
	РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ); 
	//\\
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);
	//РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов_КонтрольСерийныхНомеров", Отказ);
	//
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры


// Выполняет проверку, есть ли пакеты с периодами выходящими за период смены
// Параметры:
//  Отказ
//
// Дубоделов Э.А 25.05.2023
Процедура ПроверитьДатыЗапасов(Отказ)
	
	//НачалоКонецСмены = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Смена, ДатаСмены);
	//СтрокиОшибки = Новый Массив;
	//
	//Для Каждого СтрокаЗапасы ИЗ Запасы Цикл
	//	Если СтрокаЗапасы.Период <> Дата(1,1,1) 
	//		И (НачалоКонецСмены.ДатаВремяНачалаСмены > СтрокаЗапасы.Период
	//		ИЛИ НачалоКонецСмены.ДатаВремяКонцаСмены < СтрокаЗапасы.Период) Тогда
	//		Отказ = Истина;
	//		СтрокиОшибки.Добавить(СтрокаЗапасы);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если Отказ Тогда
	//	Сообщить("Невозможно провести документ, период не входит в смену для пакетов:");
	//	Для Каждого Строка Из СтрокиОшибки Цикл
	//		Сообщить("Строка номер " + Строка.НомерСтроки + ", " + Строка.СерийныйНомер + ";");
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры			
		
Процедура ЗаполнитьЗапасыПередаваемыеНаСушкуИзПроизводства() Экспорт 
	
	Запасы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ПроизводствоПродукция.Номенклатура КАК Номенклатура,
	|	алк_ПроизводствоПродукция.СерийныйНомер КАК СерийныйНомер,
	|	алк_ПроизводствоПродукция.Характеристика КАК Характеристика,
	|	алк_ПроизводствоПродукция.Количество КАК Количество,
	|	алк_ПроизводствоПродукция.Сертификат КАК Сертификат,
	|	алк_ПроизводствоПродукция.Период КАК Период
	|ИЗ
	|	Документ.алк_Производство.Продукция КАК алк_ПроизводствоПродукция
	|ГДЕ
	|	алк_ПроизводствоПродукция.Ссылка.Смена = &Смена
	|	И алк_ПроизводствоПродукция.Ссылка.ДатаСмены = &ДатаСмены
	|	И алк_ПроизводствоПродукция.СерийныйНомер.Наименование ПОДОБНО ""СП%""
	|	И алк_ПроизводствоПродукция.Ссылка.Участок.Код <> ""000000046""";	
	
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	
	ВыборкаИзРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИзРезультатаЗапроса);
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры
	
	