

#Область ПроцедурыЗаполненияДокумента

// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	РфпЗаполнениеОбъектов.ЗаполнитьДокумент(ЭтотОбъект);
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)                            
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//Движения.алк_ОстаткиНесортированного.Очистить();
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_ПриемкаЛесопродукции.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	
	// Отражение в разделах учета
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьУчетЛесопродукцииГОСТ(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьУчетЛесопродукцииТД(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьОстаткиНесортированного(ДополнительныеСвойства, Движения, Отказ);
	
	//Сергеева Г.О. Оборотный регистр ++
	РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);
	//Сергеева Г.О. Оборотный регистр --
	
	//Сергеева Г.О. ++
	РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
	//Сергеева Г.О. --
	
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
	Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --
	
	// Отражение по "Последовательностям"
	РфпСервер.ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть(); 
	
	// Контроль
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);
	// 
	
	// отключение контроля в настройках
	
	СтруктураОтбора = Новый Структура("Параметр", "ОтключитьКонтрольПриемка");
	НастройкаКонтроля = РегистрыСведений.алк_ДополнительныеНастройки.СрезПоследних(,СтруктураОтбора);
	
	КонтролькВыключен = Ложь;
	
	Если НастройкаКонтроля.Количество() > 0 Тогда
		КонтролькВыключен = НастройкаКонтроля[0].Булево;
	КонецЕсли;
	
	Если КонтролькВыключен Тогда  	
		Отказ = Ложь;
	КонецЕсли; 
	
	// 

	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СортБаланс = Справочники.Сорта.НайтиПоКоду("000000011", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
	СортДрова = Справочники.Сорта.НайтиПоКоду("000000012", Истина, , Справочники.КатегорииНоменклатуры.Пиловочник);
		
	Если Не ЗначениеЗаполнено(ДатаСмены) Или Не ЗначениеЗаполнено(Смена) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнены параметры смены!";
		Сообщение.Сообщить(); 
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	Для каждого стрОУ Из ПиловочникОУ Цикл
		
		Если Не стрОУ.Штабель.Несоответствие И стрОУ.Сорт = СортДрова Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не корректно указан штабель!";
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Для каждого стрОУ Из ПиловочникГОСТ Цикл
		
		Если стрОУ.Основная Тогда
			Продолжить;	
		КонецЕсли; 
	
		Если Не стрОУ.Штабель.Несоответствие И стрОУ.Сорт = СортДрова Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не корректно указан штабель!";
			Сообщение.Сообщить(); 
			
			Прервать;
			
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Партия) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка записи! Поле ""Партия"" должно быть обязательно заполнено, выберите входящую отгрузку из списка, или создайте входящую отгрузку вручную",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	НомерНакладнойВрег = Врег(СтрЗаменить(НомерНакладной, " ", "")); 
	НомерВагонаВРег = Врег(СтрЗаменить(НомерВагона, " ", "")); 
	
	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		ПараметрыСмены = Новый Структура("ДатаСмены, Смена", ДатаСмены, Смена); 
		
		Дата = РфпСервер.ПолучитьДатуВремяПоВидуДокумента(ПараметрыСмены, ЭтотОбъект.Ссылка.Метаданные().Имя);
		
	КонецЕсли; 
	
	ЗаполнитьХарактеристикиНаСервере();
	ОбъемКУчету = ПиловочникГОСТ.Итог("Объем");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ЗначениеЗаполнено(Партия) Тогда
		
		РезультатПроверки = ПроверитьПартиюНаДубли();
		
		Если РезультатПроверки <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Ошибка проведения! Обнаружено несколько актов приемки по одной партии! %1", СтрСоединить(РезультатПроверки, ", ")),,,,Отказ); 
			
		ИначеЕсли Не Партия.Проведен тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Ошибка проведения! Для проведения приемки лесопродукции, документ %1 должен быть проведен", Партия),,,, Отказ)
			
		КонецЕсли;  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасов.Характеристика,
		|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
		|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
		
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		
	КонецЕсли; 		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Обработка","алк_УправлениеПоследовательностями") Тогда 
		Возврат;
	КонецЕсли;   
	
	Если ДополнительныеСвойства.Свойство("Обработка","УниверсальныеПодборИОбработкаОбъектовУФ") Тогда 
		Возврат;
	КонецЕсли;
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	алк_ОценкаСырьяПродукция.Ссылка
	//|ИЗ
	//|	Документ.алк_ОценкаСырья.Продукция КАК алк_ОценкаСырьяПродукция
	//|ГДЕ
	//|	алк_ОценкаСырьяПродукция.Партия = &Партия
	//|	И алк_ОценкаСырьяПродукция.Ссылка.Проведен
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	алк_ОценкаСырьяПродукция.Ссылка";
	//
	//Запрос.УстановитьПараметр("Партия", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Сообщить("Изменения документа запрещены! Требуется отменить проведение документа: " + ВыборкаДетальныеЗаписи.Ссылка);		
	//	Отказ = Истина;
	//	Возврат;
	//КонецЦикла; 
	
	Если Партия.Статус = Перечисления.алк_СтатусыВходящейОтгрузки.ВПути 
		или Партия.Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл 
		или Не ЗначениеЗаполнено(Партия.Статус) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("В выбранной партии %1 должен быть установлен статус ""Разгружен"". Невозможно отсортировать не разгруженный транспорт.", Партия)
			, Партия, "Партия", "Объект.Партия", Отказ);
	ИначеЕсли ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		Документы.рфп_ОтгрузкаВагона.УстановитьСтатусПартии(Партия, Перечисления.алк_СтатусыВходящейОтгрузки.Принят);
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)   
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства); 
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПиФ

Функция ПроверитьПартиюНаДубли()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПриемкаЛесопродукции.Ссылка как Ссылка
	|ИЗ
	|	Документ.алк_ПриемкаЛесопродукции КАК алк_ПриемкаЛесопродукции
	|ГДЕ
	|	алк_ПриемкаЛесопродукции.Проведен
	|	И алк_ПриемкаЛесопродукции.Партия = &Партия
	|	И алк_ПриемкаЛесопродукции.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Партия", ЭтотОбъект.Партия);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
КонецФункции // ПроверитьПартиюНаДубли()

&НаСервере
Процедура ЗаполнитьХарактеристикиНаСервере()
	
	пвхПорода  = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
	пвхСорт    = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
	пвхДлина   = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
	пвхСечение = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
	
	Для каждого стрПиловочникУ Из ПиловочникОУ Цикл 
		
		Если стрПиловочникУ.Основная Тогда
			Продолжить;	
		КонецЕсли; 
		
		ТаблицаСвойств = Новый ТаблицаЗначений;
		ТаблицаСвойств.Колонки.Добавить("Свойство");
		ТаблицаСвойств.Колонки.Добавить("Значение");
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхПорода;
		НоваяСтрока.Значение = стрПиловочникУ.Порода;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСорт;
		НоваяСтрока.Значение = стрПиловочникУ.Сорт;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхДлина;
		НоваяСтрока.Значение = стрПиловочникУ.Длина;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСечение;
		НоваяСтрока.Значение = стрПиловочникУ.Сечение;
		
		стрПиловочникУ.Характеристика = АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(стрПиловочникУ.Номенклатура, ТаблицаСвойств);
				
		Если Не ЗначениеЗаполнено(стрПиловочникУ.Характеристика) Тогда 
			
			Если ЗначениеЗаполнено(стрПиловочникУ.Порода) 
				И ЗначениеЗаполнено(стрПиловочникУ.Сорт)
				И ЗначениеЗаполнено(стрПиловочникУ.Длина)
				И ЗначениеЗаполнено(стрПиловочникУ.Сечение) Тогда

					стрПиловочникУ.Характеристика = АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(стрПиловочникУ.Номенклатура, ТаблицаСвойств);			
			
			КонецЕсли;		
				
		КонецЕсли;
		
		//стрПиловочникУ.Характеристика = Характеристика; 
		
		Если стрПиловочникУ.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найдена характеристика: Порода - " + стрПиловочникУ.Порода + " Сорт - " + стрПиловочникУ.Сорт +
			" Длина - " + стрПиловочникУ.Длина + " Сечение - " + стрПиловочникУ.Сечение;
			Сообщение.Сообщить();
			
		КонецЕсли;  
	
	КонецЦикла; 
	
	Для каждого стрПиловочникГОСТ Из ПиловочникГОСТ Цикл
		
		Если стрПиловочникГОСТ.Основная Тогда
			Продолжить;	
		КонецЕсли; 
		
		ТаблицаСвойств = Новый ТаблицаЗначений;
		ТаблицаСвойств.Колонки.Добавить("Свойство");
		ТаблицаСвойств.Колонки.Добавить("Значение");
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхПорода;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Порода;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСорт;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Сорт;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхДлина;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Длина;
		
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Свойство = пвхСечение;
		НоваяСтрока.Значение = стрПиловочникГОСТ.Сечение;
		
		стрПиловочникГОСТ.Характеристика = АлгоритмыСвойстваИХарактеристики.ПолучитьХарактеристикуПоПараметрам(стрПиловочникГОСТ.Номенклатура, ТаблицаСвойств); 
		
		Если Не ЗначениеЗаполнено(стрПиловочникГОСТ.Характеристика) Тогда 
			
			Если ЗначениеЗаполнено(стрПиловочникГОСТ.Порода) 
				И ЗначениеЗаполнено(стрПиловочникГОСТ.Сорт)
				И ЗначениеЗаполнено(стрПиловочникГОСТ.Длина)
				И ЗначениеЗаполнено(стрПиловочникГОСТ.Сечение) Тогда

					стрПиловочникГОСТ.Характеристика = АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(стрПиловочникГОСТ.Номенклатура, ТаблицаСвойств);			
			
			КонецЕсли;
				
		КонецЕсли;
					
			
		Если стрПиловочникГОСТ.Характеристика = ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка") Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найдена характеристика: Порода - " + стрПиловочникГОСТ.Порода + " Сорт - " + стрПиловочникГОСТ.Сорт +
			" Длина - " + стрПиловочникГОСТ.Длина + " Сечение - " + стрПиловочникГОСТ.Сечение;
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	
КонецПроцедуры

#КонецОбласти 





