
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСборкаСухихПакетов, СтруктураДополнительныеСвойства) Экспорт
		     				
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаДанныеДокумента();
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСборкаСухихПакетов);
		Запрос.УстановитьПараметр("Период", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылкаСборкаСухихПакетов, "Дата"));
		Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);		
		Запрос.УстановитьПараметр("НоменклатураСП", Справочники.Номенклатура.НайтиПоКоду("ПБ-00000012"));   // Пиломатериал СП
		Запрос.УстановитьПараметр("Ячейка", Справочники.Ячейки.ПустаяСсылка());   
		Запрос.УстановитьПараметр("СкладЦЛП", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000003")); // Склад ЦЛП
		
		ВыгрузкаИзРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("алк_ПиломатериалыПереданныеНаСушку", ВыгрузкаИзРезультатаЗапроса);
		
		Запрос.Текст = ТекстЗапросаДанныеДокумента_ЗапасыОрганизации();
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЛесопродукции", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыОрганизации", МассивРезультатов[1].Выгрузить());  // из прихода исключены пакеты НЗ
       	
	КонецПроцедуры

	#КонецОбласти
	
		
	#Область СервисныеПроцедурыИФункции
	
	Функция ТекстЗапросаДанныеДокумента_ЗапасыОрганизации()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Организация,
		|	&СкладЦЛП КАК СтруктурнаяЕдиница,
		|	алк_СборкаСухихПакетовПродукция.Номенклатура,
		|	алк_СборкаСухихПакетовПродукция.Сертификат,
		|	алк_СборкаСухихПакетовПродукция.Количество,
		|	алк_СборкаСухихПакетовПродукция.Объем КАК Объем,
		|	алк_СборкаСухихПакетовПродукция.ХарактеристикаПродукции КАК Характеристика,
		|	&Ячейка,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК ДатаСмены,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Смена
		|ИЗ
		|	Документ.алк_СборкаСухихПакетов.Продукция КАК алк_СборкаСухихПакетовПродукция
		|ГДЕ
		|	алк_СборкаСухихПакетовПродукция.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияРасход,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Организация,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.СтруктурнаяЕдиница,
		|	алк_СборкаСухихПакетовПродукция.НоменклатураСырье,
		|	алк_СборкаСухихПакетовПродукция.Сертификат,
		|	алк_СборкаСухихПакетовПродукция.Количество,
		|	алк_СборкаСухихПакетовПродукция.ОбъемСырье,
		|	алк_СборкаСухихПакетовПродукция.ХарактеристикаСырье,
		|	&Ячейка,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Смена
		|ИЗ
		|	Документ.алк_СборкаСухихПакетов.Продукция КАК алк_СборкаСухихПакетовПродукция
		|ГДЕ
		|	алк_СборкаСухихПакетовПродукция.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияПриход КАК ВидДвижения,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Организация,
		|	&СкладЦЛП КАК СтруктурнаяЕдиница,
		|	алк_СборкаСухихПакетовПродукция.Номенклатура,
		|	алк_СборкаСухихПакетовПродукция.Сертификат,
		|	алк_СборкаСухихПакетовПродукция.Количество,
		|	алк_СборкаСухихПакетовПродукция.Объем КАК Объем,
		|	алк_СборкаСухихПакетовПродукция.ХарактеристикаПродукции КАК Характеристика,
		|	&Ячейка,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК ДатаСмены,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Смена
		|ИЗ
		|	Документ.алк_СборкаСухихПакетов.Продукция КАК алк_СборкаСухихПакетовПродукция
		|ГДЕ
		|	алк_СборкаСухихПакетовПродукция.Ссылка = &Ссылка
		|	И НЕ алк_СборкаСухихПакетовПродукция.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияРасход,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Организация,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.СтруктурнаяЕдиница,
		|	алк_СборкаСухихПакетовПродукция.НоменклатураСырье,
		|	алк_СборкаСухихПакетовПродукция.Сертификат,
		|	алк_СборкаСухихПакетовПродукция.Количество,
		|	алк_СборкаСухихПакетовПродукция.ОбъемСырье,
		|	алк_СборкаСухихПакетовПродукция.ХарактеристикаСырье,
		|	&Ячейка,
		|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Смена
		|ИЗ
		|	Документ.алк_СборкаСухихПакетов.Продукция КАК алк_СборкаСухихПакетовПродукция
		|ГДЕ
		|	алк_СборкаСухихПакетовПродукция.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&ВидДвиженияРасход КАК ВидДвижения,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.Организация,
		|	алк_СборкаСухихПакетовПродукция.Ссылка.СтруктурнаяЕдиница,
		|	&НоменклатураСП КАК Номенклатура,
		|	алк_СборкаСухихПакетовПродукция.Сертификат,
		|	алк_СборкаСухихПакетовПродукция.Количество,
		|	алк_СборкаСухихПакетовПродукция.ОбъемСырье КАК Объем,
		|	ЛОЖЬ КАК Сухой,
		|	алк_СборкаСухихПакетовПродукция.ХарактеристикаСырье КАК Характеристика
		|ИЗ
		|	Документ.алк_СборкаСухихПакетов.Продукция КАК алк_СборкаСухихПакетовПродукция
		|ГДЕ
		|	алк_СборкаСухихПакетовПродукция.Ссылка = &Ссылка";
				
		Возврат ТекстЗапроса;
		
	КонецФункции

	
	#КонецОбласти
	
#КонецЕсли
