
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Список.Отбор.Элементы.Очистить();
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		ЭтотОбъект.Заголовок = "Серийные номера " + Параметры.Отбор.Владелец;
	ИначеЕсли Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		ЭтотОбъект.Заголовок = "Серийные номера " + Параметры.ТекущаяСтрока.Владелец;
	КонецЕсли;
	
	Если Параметры.Свойство("ПоказатьПроданные") Тогда
	    ПоказатьПроданные = Параметры.ПоказатьПроданные;
	Иначе	
		ПоказатьПроданные = Ложь;
	КонецЕсли;
	
	
	Если Параметры.Свойство("ДатаОстатков") Тогда
	    Список.Параметры.УстановитьЗначениеПараметра("ДатаОстатков", Параметры.ДатаОстатков);
	Иначе	
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОстатков", Дата(1,1,1));
	КонецЕсли;
	
	
	Если Параметры.Свойство("ТолькоСОстатками") Тогда
	    ТолькоПакетыНаОстатках = Параметры.ТолькоСОстатками;
		Элементы.ПоказатьПроданные.Видимость = Ложь; 
	Иначе	
		ТолькоПакетыНаОстатках = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ВсеОрганизации", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация); 
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеОрганизации", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Организация", ""); 
	КонецЕсли; 
	
	Если Параметры.Свойство("СтруктурнаяЕдиница") Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСтруктурныеЕдиницы", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСтруктурныеЕдиницы", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", ""); 
	КонецЕсли;
	
	Если Параметры.Свойство("Штабель") Тогда
	    Список.Параметры.УстановитьЗначениеПараметра("ВсеШтабеля", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("Штабель", Параметры.Штабель);		
	Иначе	
	    Список.Параметры.УстановитьЗначениеПараметра("ВсеШтабеля", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Штабель", "");
	КонецЕсли;
	
	Если Параметры.Свойство("Аддендум") Тогда
	    Список.Параметры.УстановитьЗначениеПараметра("Аддендум", Параметры.Аддендум);      
		Список.Параметры.УстановитьЗначениеПараметра("ДобавитьОтборПоАддендуму", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоАддендуму", ЗначениеЗаполнено(Параметры.Аддендум)); 
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКатегорииПЭО", ЗначениеЗаполнено(Параметры.Аддендум));
		Элементы.ОтборПоАддендуму.Видимость = ЗначениеЗаполнено(Параметры.Аддендум);
		ОтборПоАддендуму = ЗначениеЗаполнено(Параметры.Аддендум); 
		Элементы.ОтборПоКатегорииПЭО.Видимость = ЗначениеЗаполнено(Параметры.Аддендум);
		ОтборПоКатегорииПЭО = ЗначениеЗаполнено(Параметры.Аддендум);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Аддендум", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоАддендуму", Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКатегорииПЭО", Ложь);  
		Список.Параметры.УстановитьЗначениеПараметра("ДобавитьОтборПоАддендуму", Ложь); 
		Элементы.ОтборПоАддендуму.Видимость = Ложь;  
		Элементы.ОтборПоКатегорииПЭО.Видимость = Ложь; 
	КонецЕсли; 
	
	Если Параметры.Свойство("СтруктурнаяЕдиницаДобавитьОтбор") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СтруктурнаяЕдиница" 
		, 
		,ВидСравненияКомпоновкиДанных.ВСписке,
		,Ложь
		,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;  
	
	Если Параметры.Свойство("ШтабельДобавитьОтбор") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Штабель" 
		, 
		,ВидСравненияКомпоновкиДанных.ВСписке,
		,Ложь
		,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Номенклатура" 
		,Параметры.Номенклатура 
		,ВидСравненияКомпоновкиДанных.ВСписке,
		,Истина
		,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если Параметры.Свойство("АддендумОтбор") Тогда    
		Список.Параметры.УстановитьЗначениеПараметра("ДобавитьОтборПоАддендуму", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Аддендум" 
		, 
		,ВидСравненияКомпоновкиДанных.ВСписке
		,
		,Ложь
		,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли; 
		
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоПакетыНаОстатках", ТолькоПакетыНаОстатках);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПроданные", ПоказатьПроданные);
	
	Элементы.Продан.Видимость = ПоказатьПроданные;
	Элементы.Количество.Видимость = ТолькоПакетыНаОстатках;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроданныеПриИзменении(Элемент)
	
	Элементы.Продан.Видимость = ПоказатьПроданные;
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПроданные", ПоказатьПроданные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоАддендумуПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоАддендуму", ОтборПоАддендуму);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКатегорииПЭО", ОтборПоАддендуму);
	
	ОтборПоКатегорииПЭО = ОтборПоАддендуму;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКатегорииПЭОПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоКатегорииПЭО", ОтборПоКатегорииПЭО);
КонецПроцедуры
