

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Цех) Тогда 		
		Цех = Участок.Цех;             	
	КонецЕсли;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	// требуется проверить наличие уже проведенных документов данном периоде
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ГрафикРаботыУчастка.Ссылка
		|ИЗ
		|	Документ.алк_ГрафикРаботыУчастка КАК алк_ГрафикРаботыУчастка
		|ГДЕ
		|	алк_ГрафикРаботыУчастка.Проведен
		|	И алк_ГрафикРаботыУчастка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И алк_ГрафикРаботыУчастка.Ссылка <> &Ссылка
		|	И алк_ГрафикРаботыУчастка.Участок = &Участок";
	
	Запрос.УстановитьПараметр("Дата1", 		НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2", 		КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("Участок", 	Участок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщить("Может быть только один заполненный график работы участка в месяц!");  	
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщить("Требуется отменить проведение документа: " + ВыборкаДетальныеЗаписи.Ссылка);		
		Отказ = Истина;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		// регистр алк_ГрафикСмен
		Движения.алк_ГрафикСмен.Записывать = Истина;
		Для Каждого ТекСтрокаВремяРаботы Из ВремяРаботы Цикл
			Движение = Движения.алк_ГрафикСмен.Добавить();
			Движение.ДатаСмены =  ТекСтрокаВремяРаботы.Дата;
			Движение.Смена = ТекСтрокаВремяРаботы.Смена;
			Движение.Участок = Участок;
			Движение.Бригада = Справочники.Бригады.НайтиПоНаименованию(ТекСтрокаВремяРаботы.Бригада);
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)	
	
	ТабличнаяЧасть.Очистить();  
		
	Для каждого Стр Из ВремяРаботы Цикл 		
		Стр.ППР = Ложь;
		Стр.ППР_ночь = Ложь;	
	КонецЦикла;
		
КонецПроцедуры
  