
&НаКлиенте
Процедура Подобрать(Команда)
	
	Если Не ЗначениеЗаполнено(Префикс) Тогда 
		Префикс = "ШП"
	КонецЕсли;
	
	ТекстПоиска = Префикс + "-"+Прав(Год,2)+"-" + ФОРМАТ(НомерПоиска,"ЧЦ=6; ЧВН=; ЧГ=0");
	
	Если ЗначениеЗаполнено(Аддендум) Тогда		
		Номер = ПолучитьСерийныйНомер(ТекстПоиска, Аддендум, Склад);		
	Иначе 		
		Номер = ПолучитьСерийныйНомерЗаказ(ТекстПоиска, Склад);		
	КонецЕсли; 

	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Номер) Тогда		
		Сообщить("Пакет не найден!");	
		Возврат;
	КонецЕсли; 
	
	НомерПоиска = "";
	
	ОповеститьОВыборе(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(номер));
	
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСерийныйНомер(ТекстПоиска, Аддендум, Склад)
	
	
	Результат = Справочники.СерийныеНомера.ПустаяСсылка();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НайденныйСН
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование ПОДОБНО &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК Ссылка,
		|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Количество,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)) КАК Порода,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) КАК Сорт,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) КАК Длина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК Ширина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100) КАК Влажность,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК Толщина,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)) КАК Припуск,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)) КАК КатегорияПЭО,
		|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|ПОМЕСТИТЬ ВТ_СН
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ОстаткиЗапасовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100),
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_АддендумыСоставТоваров.ИдентификаторТовара КАК ИдентификаторТовара,
		|	алк_АддендумыСоставТоваров.Порода КАК Порода,
		|	алк_АддендумыСоставТоваров.Сорт КАК Сорт,
		|	алк_АддендумыСоставТоваров.ШиринаОт КАК ШиринаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ШиринаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ШиринаДо
		|	КОНЕЦ КАК ШиринаДо,
		|	алк_АддендумыСоставТоваров.ТолщинаОт КАК ТолщинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ТолщинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ТолщинаДо
		|	КОНЕЦ КАК ТолщинаДо,
		|	алк_АддендумыСоставТоваров.ДлинаОт КАК ДлинаОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ДлинаДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ДлинаДо
		|	КОНЕЦ КАК ДлинаДо,
		|	алк_АддендумыСоставТоваров.ВлажностьОт КАК ВлажностьОт,
		|	ВЫБОР
		|		КОГДА алк_АддендумыСоставТоваров.ВлажностьДо = 0
		|			ТОГДА 999999
		|		ИНАЧЕ алк_АддендумыСоставТоваров.ВлажностьДо
		|	КОНЕЦ КАК ВлажностьДо,
		|	алк_АддендумыСоставТоваров.ВариантПрипуска КАК ВариантПрипуска,
		|	алк_АддендумыТовары.КатегорияПЭО КАК КатегорияПЭО,
		|	алк_АддендумыСоставТоваров.Характеристика КАК Характеристика,
		|	алк_АддендумыТовары.Номенклатура
		|ПОМЕСТИТЬ ВТ_СоставАддендума
		|ИЗ
		|	Документ.алк_Аддендумы.СоставТоваров КАК алк_АддендумыСоставТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|		ПО алк_АддендумыСоставТоваров.Ссылка = алк_АддендумыТовары.Ссылка
		|ГДЕ
		|	алк_АддендумыСоставТоваров.Ссылка = &Аддендум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СН.Ссылка КАК Ссылка,
		|	ВТ_СН.Количество КАК Количество
		|ИЗ
		|	ВТ_СН КАК ВТ_СН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоставАддендума КАК ВТ_СоставАддендума
		|		ПО (ВТ_СН.Порода = ВТ_СоставАддендума.Порода
		|				ИЛИ ВТ_СоставАддендума.Порода = ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)
		|					И ВТ_СН.Сорт = ВТ_СоставАддендума.Сорт
		|				ИЛИ ВТ_СоставАддендума.Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)
		|					И ВТ_СН.Длина >= ВТ_СоставАддендума.ДлинаОт
		|					И ВТ_СН.Длина <= ВТ_СоставАддендума.ДлинаДо
		|					И ВТ_СН.Ширина >= ВТ_СоставАддендума.ШиринаОт
		|					И ВТ_СН.Ширина <= ВТ_СоставАддендума.ШиринаДо
		|					И ВТ_СН.Влажность >= ВТ_СоставАддендума.ВлажностьОт
		|					И ВТ_СН.Влажность <= ВТ_СоставАддендума.ВлажностьДо
		|					И ВТ_СН.Толщина >= ВТ_СоставАддендума.ТолщинаОт
		|					И ВТ_СН.Толщина <= ВТ_СоставАддендума.ТолщинаДо
		|					И ВТ_СН.Припуск = ВТ_СоставАддендума.ВариантПрипуска
		|				ИЛИ ВТ_СоставАддендума.ВариантПрипуска = ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)
		|				ИЛИ ИСТИНА
		|					И ВТ_СН.КатегорияПЭО = ВТ_СоставАддендума.КатегорияПЭО
		|				ИЛИ ВТ_СоставАддендума.КатегорияПЭО = ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)
		|					И ВТ_СН.Характеристика = ВТ_СоставАддендума.Характеристика
		|				ИЛИ ВТ_СоставАддендума.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					И ВТ_СоставАддендума.Номенклатура = ВТ_СН.Номенклатура)";
	
	Запрос.УстановитьПараметр("Аддендум", Аддендум);
	Запрос.УстановитьПараметр("Наименование", ТекстПоиска);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции 


&НаСервереБезКОнтекста
Функция ПолучитьСерийныйНомерЗаказ(ТекстПоиска, Склад)	
	
	Результат = Справочники.СерийныеНомера.ПустаяСсылка();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НайденныйСН
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование ПОДОБНО &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК Ссылка,
		|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Количество,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)) КАК Порода,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) КАК Сорт,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) КАК Длина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК Ширина,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100) КАК Влажность,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК Толщина,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)) КАК Припуск,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)) КАК КатегорияПЭО,
		|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|ПОМЕСТИТЬ ВТ_СН
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ОстаткиЗапасовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_НайденныйСН.Ссылка
		|					ИЗ
		|						ВТ_НайденныйСН КАК ВТ_НайденныйСН)) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Влажность.ЗначениеВлажности, 100),
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, ЗНАЧЕНИЕ(Справочник.Породы.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт, ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0),
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0),
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_СН.Ссылка КАК Ссылка,
		|	ВТ_СН.Количество КАК Количество
		|ИЗ
		|	ВТ_СН КАК ВТ_СН";
	
	Запрос.УстановитьПараметр("Наименование", ТекстПоиска);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции 




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Аддендум") Тогда 		
		Аддендум = Параметры.Аддендум; 
	КонецЕсли;
	
	Если Параметры.Свойство("Участок") Тогда 
		Если Параметры.Участок.Код = "000000040" Тогда  
			Префикс = "ПМ";
			Элементы.Префикс.Видимость = Истина; 
		ИначеЕсли Параметры.Участок.Код = "000000039" Тогда
			Префикс = "ДГ";
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда 		
		Склад = Параметры.Склад; 		
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда 		
		
		Дата = Параметры.Дата;		
		Год = Формат(Дата, "ДФ=yyyy");
		
	КонецЕсли;  	
	
КонецПроцедуры  

