
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#Область ИнициализацияДаных

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ПодобратьХарактеристику(ДокументСсылка); 
	СформироватьДвиженияОстаткиНесортированного(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьДвиженияОборотыПроизводства(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьДвиженияПроизводствоОборот(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура СформироватьДвиженияОборотыПроизводства(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки КАК Период,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	СУММА(рфп_ОтгрузкаВагонаПиловочник.Объем) КАК Объем,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.РазгруженСобственнымиСилами
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСобственнымиСилами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСиламиПодрядчика)
	|	КОНЕЦ КАК Операция
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1 КАК Поле1
	|			ИЗ
	|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	|			ГДЕ
	|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки = &ПустаяДата
	|	И рфп_ОтгрузкаВагонаПиловочник.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.алк_СтатусыВходящейОтгрузки.Разгружен), ЗНАЧЕНИЕ(Перечисление.алк_СтатусыВходящейОтгрузки.Принят))
	|
	|СГРУППИРОВАТЬ ПО
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.РазгруженСобственнымиСилами
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСобственнымиСилами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСиламиПодрядчика)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	СУММА(рфп_ОтгрузкаВагонаПиловочник.Объем),
	|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.ПоступилоНаБиржу)
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1 КАК Поле1
	|			ИЗ
	|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	|			ГДЕ
	|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	МассивРезультатов = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьДвиженияОстаткиНесортированного(ДокументСсылка, СтруктураДополнительныеСвойства);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия КАК Период,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад КАК СтруктурнаяЕдиница,
	|	рфп_ОтгрузкаВагонаПиловочник.Порода,
	|	СУММА(рфп_ОтгрузкаВагонаПиловочник.Объем) КАК Объем,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.Дата > &ДатаЗапрета
	|			ТОГДА рфп_ОтгрузкаВагонаПиловочник.Длина
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|	КОНЕЦ КАК Длина,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка КАК Партия
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.алк_статусыВходящейОтгрузки.ВПути)
	|
	|СГРУППИРОВАТЬ ПО
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад,
	|	рфп_ОтгрузкаВагонаПиловочник.Порода,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка,
	|	ВЫБОР
	|		КОГДА рфп_ОтгрузкаВагонаПиловочник.Ссылка.Дата > &ДатаЗапрета
	|			ТОГДА рфп_ОтгрузкаВагонаПиловочник.Длина
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Длины.ПустаяСсылка)
	|	КОНЕЦ";
	//"ВЫБРАТЬ
	//|	алк_ВходящийТранспорт.Дата КАК Период,
	//|	&ВидДвиженияПриход КАК ВидДвижения,
	//|	алк_ВходящийТранспорт.Организация,
	//|	алк_ВходящийТранспорт.СтруктурнаяЕдиница,
	//|	алк_ВходящийТранспорт.Порода,
	//|	алк_ВходящийТранспорт.НомерВагонаВРег Как НомерВагона,
	//|	алк_ВходящийТранспорт.НомерНакладнойВРег Как НомерНакладной,
	//|	алк_ВходящийТранспорт.Объем
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Документ.алк_ВходящийТранспорт КАК алк_ВходящийТранспорт
	//|ГДЕ
	//|	алк_ВходящийТранспорт.Ссылка = &Ссылка
	//|	И 1 В
	//|			(ВЫБРАТЬ
	//|				1 КАК Поле1
	//|			ИЗ
	//|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	//|			ГДЕ
	//|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	алк_ОстаткиНесортированного.Регистратор,
	//|	алк_ОстаткиНесортированного.НомерНакладной,
	//|	алк_ОстаткиНесортированного.Объем
	//|ПОМЕСТИТЬ ВТ_Движения
	//|ИЗ
	//|	РегистрНакопления.алк_ОстаткиНесортированного КАК алк_ОстаткиНесортированного
	//|ГДЕ
	//|	алк_ОстаткиНесортированного.Регистратор = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ.Период,
	//|	ВТ.ВидДвижения,
	//|	ВТ.Организация,
	//|	ВТ.СтруктурнаяЕдиница,
	//|	ВТ.Порода,
	//|	ВТ.НомерВагона,
	//|	ВТ.НомерНакладной,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ВТ_Движения.Объем, 0) = 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0) = 0
	//|						ТОГДА ВТ.Объем
	//|					ИНАЧЕ -алк_ОстаткиНесортированногоОстатки.ОбъемОстаток
	//|				КОНЕЦ
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0) = 0
	//|					ТОГДА ВТ_Движения.Объем
	//|				ИНАЧЕ ВТ.Объем
	//|			КОНЕЦ
	//|	КОНЕЦ КАК Объем
	//|ИЗ
	//|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиНесортированного.Остатки(
	//|				,
	//|				(НомерВагона, НомерНакладной, Организация, Порода, СтруктурнаяЕдиница) В
	//|					(ВЫБРАТЬ
	//|						ВТ.НомерВагона,
	//|						ВТ.НомерНакладной,
	//|						ВТ.Организация,
	//|						ВТ.Порода,
	//|						ВТ.СтруктурнаяЕдиница
	//|					ИЗ
	//|						ВТ КАК ВТ)) КАК алк_ОстаткиНесортированногоОстатки
	//|		ПО ВТ.НомерНакладной = алк_ОстаткиНесортированногоОстатки.НомерНакладной
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Движения КАК ВТ_Движения
	//|		ПО ВТ.НомерНакладной = ВТ_Движения.НомерНакладной";
	
	//Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	//Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	//Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	
	Запрос.УстановитьПараметр("ДатаЗапрета", '20240723'); //добавили длину, чтобы выводить в Оперсводках Данько Т. А. 24.07.2024Г.  
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНесортированного", МассивРезультатов[0].Выгрузить());
	
КонецПроцедуры

Процедура СформироватьДвиженияПроизводствоОборот(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	//определяем смену для даты прибытия и даты разгрузки
	ДатаПрибытия = ДокументСсылка.ДатаПрибытия;
	
	ДатаРазгрузки = ДокументСсылка.ДатаРазгрузки; 
	
	Участок =  ДокументСсылка.Участок; 
	
	Если ДатаПрибытия = Дата(1,1,1) Тогда  
		ДатаСменыПрибытия = Дата(1,1,1); 
		СменаПрибытия = Справочники.алк_Смены.ПустаяСсылка(); 
	Иначе      
		ПараметрыСменыПрибытия = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Участок, ДатаПрибытия); 
		ДатаСменыПрибытия = ПараметрыСменыПрибытия.ДатаСмены; 
		СменаПрибытия = ПараметрыСменыПрибытия.Смена;
	КонецЕсли;
	
	Если ДатаРазгрузки = Дата(1,1,1) Тогда 
		ДатаСменыРазгрузки = Дата(1,1,1); 
		СменаРазгрузки = Справочники.алк_Смены.ПустаяСсылка();
	Иначе  
		ПараметрыСменыРазгрузки = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Участок, ДатаРазгрузки); 
		ДатаСменыРазгрузки = ПараметрыСменыРазгрузки.ДатаСмены;
		СменаРазгрузки = ПараметрыСменыРазгрузки.Смена;
	КонецЕсли;
	//\\
	
	Запрос = Новый Запрос;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия КАК Период,
	|	&ДатаСменыПрибытия КАК ДатаСмены,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Объем КАК Количество,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Прибыло) КАК Операция,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано) КАК ВидДвиженияПроизводства,
	|	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад,
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	&СменаПрибытия КАК Смена,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Участок
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО рфп_ОтгрузкаВагонаПиловочник.Порода = алк_ПараметрыХарактеристик.Порода
	|			И рфп_ОтгрузкаВагонаПиловочник.Сорт = алк_ПараметрыХарактеристик.Сорт
	|			И рфп_ОтгрузкаВагонаПиловочник.Длина = алк_ПараметрыХарактеристик.Длина
	|			И рфп_ОтгрузкаВагонаПиловочник.Сечение = алк_ПараметрыХарактеристик.Сечение
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаПрибытия = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки,
	|	&ДатаСменыРазгрузки,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Организация,
	|	рфп_ОтгрузкаВагонаПиловочник.Объем,
	|	ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Разгружено),
	|	ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано),
	|	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Склад,
	|	алк_ПараметрыХарактеристик.Характеристика,
	|	&СменаРазгрузки,
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка.Участок
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО рфп_ОтгрузкаВагонаПиловочник.Порода = алк_ПараметрыХарактеристик.Порода
	|			И рфп_ОтгрузкаВагонаПиловочник.Сорт = алк_ПараметрыХарактеристик.Сорт
	|			И рфп_ОтгрузкаВагонаПиловочник.Длина = алк_ПараметрыХарактеристик.Длина
	|			И рфп_ОтгрузкаВагонаПиловочник.Сечение = алк_ПараметрыХарактеристик.Сечение
	|ГДЕ
	|	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	|	И НЕ рфп_ОтгрузкаВагонаПиловочник.Ссылка.ДатаРазгрузки = &ПустаяДата";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 
	Запрос.УстановитьПараметр("СменаПрибытия", СменаПрибытия);
	Запрос.УстановитьПараметр("СменаРазгрузки",СменаРазгрузки);
	Запрос.УстановитьПараметр("ДатаСменыПрибытия", ДатаСменыПрибытия);
	Запрос.УстановитьПараметр("ДатаСменыРазгрузки",ДатаСменыРазгрузки);
				
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПроизводствоОборот", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьСтатусПартии(ДокументСсылка, НовыйСтатус, СобственнымиСилами=Ложь) Экспорт
	
	Если (НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен
		ИЛИ НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл)
		И ДобавитьМесяц(ДокументСсылка.Дата, 2) < ТекущаяДата() тогда
		Сообщить("Запрещено изменять статус документа "+ДокументСсылка+" с даты которого прошло более двух месяцев");
		Возврат;
	КонецЕсли;
	Попытка 
		Объект = ДокументСсылка.ПолучитьОбъект();
		Объект.ДополнительныеСвойства.Вставить("ТребуетсяКонтрольДатыЗапрета", Ложь);
		
		Если НовыйСтатус = Объект.Статус тогда
			Возврат;
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл И Не ЗначениеЗаполнено(Объект.ДатаПрибытия) тогда
			Объект.ДатаПрибытия = ТекущаяДата();
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен тогда
			Если Не ЗначениеЗаполнено(Объект.ДатаПрибытия) тогда
				Объект.ДатаПрибытия = ТекущаяДата();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Объект.ДатаРазгрузки) тогда
				Объект.ДатаРазгрузки = ТекущаяДата();
			КонецЕсли;
			Объект.РазгруженСобственнымиСилами = СобственнымиСилами;
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Принят 
			И не Объект.Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен тогда
			Сообщить("Входящая отгрузка должна находиться в статусе разгружен");
			Возврат;
		КонецЕсли;
		
		Объект.Статус = НовыйСтатус;
		
		Если Объект.ПометкаУдаления тогда
			Объект.ПометкаУдаления = Ложь;
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		ИначеЕсли НовыйСтатус = Перечисления.алк_СтатусыВходящейОтгрузки.Принят тогда
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
		Иначе
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(
			"УстановкаСтатусаРФП_ОтгрузкаВагона", 
			УровеньЖурналаРегистрации.Ошибка, , 
			Строка(ДокументСсылка), 
			СтрШаблон("Не удалось записать документ %1, при установке статуса %2. (Документы.рфп_ОтгрузкаВагона.ММ) %3", ДокументСсылка, НовыйСтатус, ОписаниеОшибки()));
	КонецпоПытки;
КонецПроцедуры

//создает хар-ку, если не найдена
Процедура ПодобратьХарактеристику(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	               |	рфп_ОтгрузкаВагонаПиловочник.Порода,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сорт,
	               |	рфп_ОтгрузкаВагонаПиловочник.Длина,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сечение
	               |ИЗ
	               |	Документ.рфп_ОтгрузкаВагона.Пиловочник КАК рфп_ОтгрузкаВагонаПиловочник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО рфп_ОтгрузкаВагонаПиловочник.Порода = алк_ПараметрыХарактеристик.Порода
	               |			И рфп_ОтгрузкаВагонаПиловочник.Сорт = алк_ПараметрыХарактеристик.Сорт
	               |			И рфп_ОтгрузкаВагонаПиловочник.Длина = алк_ПараметрыХарактеристик.Длина
	               |			И рфп_ОтгрузкаВагонаПиловочник.Сечение = алк_ПараметрыХарактеристик.Сечение
	               |ГДЕ
	               |	рфп_ОтгрузкаВагонаПиловочник.Ссылка = &Ссылка
	               |	И алк_ПараметрыХарактеристик.Характеристика ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(алк_ПараметрыХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	               |	рфп_ОтгрузкаВагонаПиловочник.Номенклатура,
	               |	рфп_ОтгрузкаВагонаПиловочник.Порода,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сорт,
	               |	рфп_ОтгрузкаВагонаПиловочник.Длина,
	               |	рфп_ОтгрузкаВагонаПиловочник.Сечение";
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	РезЗ = Запрос.Выполнить();
	Если РезЗ.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = РезЗ.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
		ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство");
		ТаблицаСвойствИЗначений.Колонки.Добавить("Значение");
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Порода);
		НоваяСтрокаСвойств.Значение = Выборка.Порода; 
		
		Если Выборка.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002") Тогда  
			НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
			НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сорт);
			НоваяСтрокаСвойств.Значение = Выборка.Сорт; 
		КонецЕсли;
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Длина);
		НоваяСтрокаСвойств.Значение = Выборка.Длина;
		
		НоваяСтрокаСвойств = ТаблицаСвойствИЗначений.Добавить();
		НоваяСтрокаСвойств.Свойство = АлгоритмыСвойстваИХарактеристики.ПолучитьВидСвойства(Перечисления.ФиксированныеДопРеквизиты.Сечение);
		НоваяСтрокаСвойств.Значение = Выборка.Сечение;
		
		Попытка
			АлгоритмыСвойстваИХарактеристики.СоздатьХарактеристикуПоНаборуСвойств(Выборка.Номенклатура, ТаблицаСвойствИЗначений);  
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка при создании характеристики!",,,,ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

