
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ДополнительныеСвойства.Свойство("ОбменДанными") И ДополнительныеСвойства.ОбменДанными.Свойство("Загрузка") И ДополнительныеСвойства.ОбменДанными.Загрузка тогда 
		Возврат;	
	КонецЕсли;
	СвязанныйАктПриемки = Документы.рфп_ОтгрузкаВагона.ПустаяСсылка();
	Если Ссылка <> СвязанныйАктПриемки тогда
		СвязанныйАктПриемки = Документы.алк_ПриемкаЛесопродукции.НайтиПоРеквизиту("Партия", Ссылка);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если СвязанныйАктПриемки.Проведен тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Ошибка! Документ не может быть отменен, пока по нему проведен документ приемки лесопродукции",,,,Отказ);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ДатаРазгрузки < ДатаПрибытия И 
		(Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Принят Или 
		Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Разгружен) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Ошибка! Документ не может быть записан. Дата разгрузки не может быть меньше даты прибытия!",,,,Отказ);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статус) тогда
		Статус = Перечисления.алк_СтатусыВходящейОтгрузки.ВПути;
	КонецЕсли;
	НомерНакладной = Врег(СтрЗаменить(НомерНакладной, " ", "")); 
	НомерВагона = Врег(СтрЗаменить(НомерВагона, " ", ""));  
	
	Если Не ЗначениеЗаполнено(Участок) Тогда 
		Участок = Справочники.алк_Участки.НайтиПоКоду("000000001");	
	КонецЕсли;
	
	Если СвязанныйАктПриемки.Проведен И Статус <> Перечисления.алк_СтатусыВходящейОтгрузки.Принят Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Ошибка! По данному документу есть проведенный документ ""Приемка лесопродукции на биржу"", поменяйте статус на ""Принят""!",,,,Отказ);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = Перечисления.алк_СтатусыВходящейОтгрузки.Прибыл;
	ДатаПрибытия = ТекущаяДата();
	ДатаРазгрузки = Дата(1,1,1);
	Загружен = Ложь;
	Номер = "";
	Дата = ТекущаяДата();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Движения.алк_ОстаткиНесортированного.Очистить();
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.рфп_ОтгрузкаВагона.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	РфпСервер.ОтразитьОстаткиНесортированного(ДополнительныеСвойства, Движения, Отказ);
	РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);  
	РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ); 
	
КонецПроцедуры

