
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображатьОтгруженные = "НеОтгруженные";
	УстановитьОтборПоОтгруженным(?(ОтображатьОтгруженные = "НеОтгруженные", Истина, Ложь));
	
	УстановитьОтборПоЗаказуНаСервере();
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтображатьОтгруженныеПриИзменении(Элемент)
	
	УстановитьОтборПоОтгруженным(?(ОтображатьОтгруженные = "НеОтгруженные", Истина, Ложь));	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("Заказ", ТекущиеДанные.Ссылка);
	
	// Из этой формы использован стандартный алгоритм выбора
	//ОповеститьОВыборе(СтруктураВыбора); 
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытий

&НаСервере
Процедура УстановитьОтборПоОтгруженным(Использование)
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Отгрузка", , Использование);
	
КонецПроцедуры //УстановитьОтборПоНаправлению()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заказ") Тогда
		
		ПараметрЗаказ = Параметры.Заказ;
		
	Иначе 
		
		ПараметрЗаказ = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоЗаказуНаСервере()
	
	Если ПараметрЗаказ <> Неопределено Тогда
		УстановитьПользовательскуюНастройку(Список.КомпоновщикНастроек, Список.КомпоновщикНастроек.ПользовательскиеНастройки, "Заказ", ПараметрЗаказ);	
	КонецЕсли; 
	
КонецПроцедуры
 

&НаСервере
Процедура УстановитьПользовательскуюНастройку(КомпоновщикНастроекКомпоновкиДанных, ПользовательскиеНастройки, ИмяНастройки, ПравоеЗначение)
	
	// Разобраться почему не работает???
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяНастройки);
	ЭлементОтбора = Неопределено;
	
	Для Каждого Элемент Из КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбора = Элемент;
			Прервать;	
		КонецЕсли;			
	КонецЦикла;
	
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
	
	Элемент.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.ПравоеЗначение   = ПравоеЗначение;
	Элемент.Использование    = Истина;
	
	//Идентификатор = КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	//Отбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	//
	//ОтборПоПолю = Неопределено;
	//ПолеХХХ = Новый ПолеКомпоновкиДанных(ИмяНастройки);
	//
	//Для каждого ЭлементОтбора Из Отбор.Элементы  Цикл
	//	Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И
	//		ЭлементОтбора.ЛевоеЗначение = ПолеХХХ Тогда
	//		ОтборПоСкладу = ЭлементОтбора;
	//		Прервать;
	//	КонецЕсли; 	
	//КонецЦикла; 
	//
	//Если ОтборПоПолю = Неопределено Тогда
	//	
	//	ОтборПоПолю = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ОтборПоПолю.ЛевоеЗначение = ПолеХХХ;
	//	ОтборПоПолю.Использование = Истина;
	//	
	//	ОтборПоПолю.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	//	ОтборПоПолю.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
	//	Элементы.Список.СоздатьЭлементыФормыПользовательскихНастроек();
	//	
	//Иначе
	//	ОтборПоПолю.Использование = Не ОтборПоПолю.Использование;
	//КонецЕсли; 
	//
	//ОтборПоПолю.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборПоПолю.ПравоеЗначение = ПравоеЗначение;
	
КонецПроцедуры	

#КонецОбласти


Процедура Конец()
КонецПроцедуры


