
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ТекТЧ) Тогда 
		Возврат;
	КонецЕсли;  
		
	ПроверяемыеРеквизиты.Очистить();
	
	Если ТекТЧ = "Продукция" ИЛИ ТекТЧ = "Материалы" ИЛИ ТекТЧ = "Отходы" Тогда //УДАЛИТЬ //ИЛИ ТекТЧ = "ДополнительныеМатериалы"  Тогда  
		
		ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".Количество"); 
		ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".Номенклатура");
		ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".Период");
		
		//Если ТекТЧ = "Продукция" ИЛИ ТекТЧ = "Материалы" Тогда //УДАЛИТЬ  
			ПроверяемыеРеквизиты.Добавить(ТекТЧ + ".КоличествоШтук");
		//КонецЕсли; //УДАЛИТЬ
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
