
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	      
	Список.Отбор.Элементы.Очистить(); 
	
	Если ЗначениеЗаполнено(Параметры.РежимВыбора) Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;
	
	Если Параметры.Свойство("Аддендум") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Аддендум", Параметры.Аддендум);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	    
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("ИдентификаторТовара", 	ТекущиеДанные.ИдентификаторТовара);
	СтруктураВыбора.Вставить("ПредставлениеТовара", 	ТекущиеДанные.ПредставлениеТовара);
	СтруктураВыбора.Вставить("КоличествоВПроизводство", ТекущиеДанные.Количество);  
	
	ОповеститьОВыборе(СтруктураВыбора); 
	 
КонецПроцедуры     

































