Процедура ОтразитьПроводки_алк_ОборотыПроизводства(Регистратор) Экспорт
	ОборотыПроизводства = РегистрыНакопления.алк_ОборотыПроизводства.СоздатьНаборЗаписей();
	ОборотыПроизводства.Отбор.Регистратор.Установить(Регистратор);
	ОборотыПроизводства.Прочитать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Характеристика,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
		|	СУММА(ЕСТЬNULL(алк_ПриемкаЛесопродукцииПиловочникГОСТ.Объем, 0)) КАК Объем,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель,
		|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.Поступление) КАК Операция,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Организация
		|ИЗ
		|	Документ.алк_ПриемкаЛесопродукции.ПиловочникГОСТ КАК алк_ПриемкаЛесопродукцииПиловочникГОСТ
		|ГДЕ
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Порода,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Характеристика,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Штабель,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Номенклатура,
		|	алк_ПриемкаЛесопродукцииПиловочникГОСТ.Ссылка.Организация";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор); 	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ОборотыПроизводства.Очистить();
	Иначе
		Возврат;
	КонецЕсли;	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = ОборотыПроизводства.Добавить();
		Движение.Период = Регистратор.Дата;
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ОборотыПроизводства.Записать();
КонецПроцедуры

Процедура РФП_ПриЗаписиДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(Источник,Отказ,РежимЗаписи,РежимПроведения);
КонецПроцедуры

// Дубоделов Э.А 
Функция ЗаписыватьДвиженияВНовыеРегистры(ДатаДокумента) Экспорт
	
	ДатаНачалаЗаписи = Константы.алк_ДатаВремяНачалаВводаПоказателейЦЛПДГ.Получить();
	
	Если ДатаНачалаЗаписи <> Дата("00010101") И ДатаНачалаЗаписи <= ДатаДокумента Тогда 
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

Функция ЗаписыватьДвиженияВРегистрТоварыВПуи(ДатаДокумента) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ДополнительныеНастройкиСрезПоследних.Дата
	               |ИЗ
	               |	РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаТоваровВПути"") КАК алк_ДополнительныеНастройкиСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ДатаНачалаЗаписи = Выборка.Дата; 
	КонецЦикла;
		
	Если ДатаНачалаЗаписи <> Дата("00010101") И ДатаНачалаЗаписи <= ДатаДокумента Тогда 
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции