
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	ПериодСт.ДатаНачала    = Объект.ДатаНачало;
	ПериодСт.ДатаОкончания = Объект.ДатаОкончание;  
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаНачало    = ПериодСт.ДатаНачала;
	Объект.ДатаОкончание = ПериодСт.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти 


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	
	Объект.ДатаНачало = Объект.ДатаСмены;
	Объект.ДатаОкончание = Объект.ДатаСмены;
	
	ПериодСт.ДатаНачала    = Объект.ДатаНачало;
	ПериодСт.ДатаОкончания = Объект.ДатаОкончание;
	
	Объект.Дата = КонецДня(Объект.ДатаСмены);
	Объект.Смена = ПредопределенноеЗначение("Перечисление.Смены.смена_8_20");
	
КонецПроцедуры

	
#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПередачиСобственныеСерииОстатки.Номенклатура,
	|	алк_ПередачиСобственныеСерииОстатки.СерийныйНомер КАК СерийныйНомер,
	|	алк_ПередачиСобственныеСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов,
	|	алк_ПараметрыПакетовСрезПоследних.Объем
	|ИЗ
	|	РегистрНакопления.алк_ПередачиСобственныеСерии.Остатки КАК алк_ПередачиСобственныеСерииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
	|		ПО алк_ПередачиСобственныеСерииОстатки.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерийныйНомер
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериод(Команда)
	
	ЗаполнитьЗаПериодНаСервере();
	//РФП 31.10.2023
	//ЗаполнитьЗаПериодЩепаНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьЗаПериодДляПередачиНаИД(Команда) 
	ЗаполнитьЗаПериодНаСервереДляПередачиНаИД();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаПериодДляПередачиНаТД(Команда)
	ЗаполнитьЗаПериодДляПередачиНаТДНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаПериодНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка КАК СсылкаТЗ
	|ПОМЕСТИТЬ втТранспортировки
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД >= &НачалоПериода
	|	И алк_ТранспортировкаЗапасов.ДатаКУчету_ТД <= &КонецПериода
	|	И алк_ТранспортировкаЗапасов.Проведен
	|	И алк_ТранспортировкаЗапасов.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасов.Грузоотправитель.Код = ""ПБ-000006""
	|	И (НЕ алк_ТранспортировкаЗапасов.Покупатель.Код = ""ПБ-000446""
	|			ИЛИ алк_ТранспортировкаЗапасов.Покупатель = ЗНАЧЕНИЕ(справочник.Контрагенты.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	1 КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование КАК Основание
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|			ПО алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование = алк_РасходнаяНакладнаяЗапасы.Ссылка
	|		ПО (алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = алк_ТранспортировкаЗапасовЗапасы.Ссылка)
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				втТранспортировки.СсылкаТЗ
	|			ИЗ
	|				втТранспортировки КАК втТранспортировки)
	|	И алк_ТранспортировкаЗапасовЗапасы.Номенклатура В(&МассивНоменклатуры)
	|	И алк_РасходнаяНакладнаяЗапасы.СерийныйНомер = алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания); 
	
	МассивНоменклатуры = Новый Массив;
	
	Если Объект.Участок = РазрешенныйУчастокДГСГП() Тогда //ДГ СГП   
		
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018")); //Пеллеты 
		
	Иначе
		
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001")); //Пилмат
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00000000002")); //Шпон 
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000006")); //Карандаш 
	    МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017")); //Отходы производства п/м (Хар-ка)  
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("ПБ-00000002")); //Пиловочник
		
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры); 

	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаПериодНаСервереДляПередачиНаИД() 
	
	Объект.ОрганизацияОтправитель = Справочники.Организации.НайтиПоКоду("00-000001");
	Объект.ОрганизацияПолучатель = Справочники.Организации.НайтиПоКоду("ПБ-000003");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка КАК СсылкаТЗ
	|ПОМЕСТИТЬ втТранспортировки
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД >= &НачалоПериода
	|	И алк_ТранспортировкаЗапасов.ДатаКУчету_ТД <= &КонецПериода
	|	И алк_ТранспортировкаЗапасов.Проведен
	|	И алк_ТранспортировкаЗапасов.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасов.Покупатель.Код = ""ПБ-000446""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	1 КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование КАК Основание
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|			ПО алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование = алк_РасходнаяНакладнаяЗапасы.Ссылка
	|		ПО (алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = алк_ТранспортировкаЗапасовЗапасы.Ссылка)
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				втТранспортировки.СсылкаТЗ
	|			ИЗ
	|				втТранспортировки КАК втТранспортировки)
	|	И алк_РасходнаяНакладнаяЗапасы.СерийныйНомер = алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания);  

	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаПериодДляПередачиНаТДНаСервере()
	
	Объект.ОрганизацияОтправитель = Справочники.Организации.НайтиПоКоду("ПБ-000003");
	Объект.ОрганизацияПолучатель = Справочники.Организации.НайтиПоКоду("ПБ-000002");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасов.Ссылка КАК СсылкаТЗ
	|ПОМЕСТИТЬ втТранспортировки
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.ДатаКУчету_ТД >= &НачалоПериода
	|	И алк_ТранспортировкаЗапасов.ДатаКУчету_ТД <= &КонецПериода
	|	И алк_ТранспортировкаЗапасов.Проведен
	|	И алк_ТранспортировкаЗапасов.ВыгружатьВ_ТД
	|	И алк_ТранспортировкаЗапасов.Продавец.Код = ""ПБ-000006""
	|	И алк_ТранспортировкаЗапасов.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер КАК СерийныйНомер,
	|	ВЫБОР
	|		КОГДА алк_ТранспортировкаЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения.Код = ""168""
	|			ТОГДА алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав / 1000
	|		ИНАЧЕ алк_ТранспортировкаЗапасовЗапасы.Объем
	|	КОНЕЦ КАК Объем,
	|	1 КАК КоличествоПакетов,
	|	алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование КАК Основание
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ТранспортировкаЗапасов.ДокументыОснования КАК алк_ТранспортировкаЗапасовДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_РасходнаяНакладная.Запасы КАК алк_РасходнаяНакладнаяЗапасы
	|			ПО алк_ТранспортировкаЗапасовДокументыОснования.ДокументОснование = алк_РасходнаяНакладнаяЗапасы.Ссылка
	|		ПО (алк_ТранспортировкаЗапасовДокументыОснования.Ссылка = алк_ТранспортировкаЗапасовЗапасы.Ссылка)
	|ГДЕ
	|	алк_ТранспортировкаЗапасовЗапасы.Ссылка В
	|			(ВЫБРАТЬ
	|				втТранспортировки.СсылкаТЗ
	|			ИЗ
	|				втТранспортировки КАК втТранспортировки)
	|	И алк_РасходнаяНакладнаяЗапасы.СерийныйНомер = алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",   Справочники.Организации.НайтиПоКоду("ПБ-000003"));

	РезультатЗапроса = Запрос.Выполнить(); //  РезультатЗапроса.Выгрузить() 
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать

#КонецОбласти 

// Нач мод [Пакушев И.С.] [16.03.2018] 
// Обращение № [0000000000] [ТекстЗаявки]
// Было
// Стало


&НаСервере
Процедура ЗаполнитьЗаПериодЩепаНаСервере()
	
Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОтгрузкаЩепыЗапасы.Номенклатура,
	|	1 КАК КоличествоПакетов,
	|	алк_ОтгрузкаЩепыЗапасы.ОбъемТаможня КАК Объем,
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.Ссылка КАК Основание
	|ИЗ
	|	РегистрНакопления.алк_ПередачиСобственныеСерии.Обороты(
	|			,
	|			,
	|			,
	|			Основание ССЫЛКА Документ.алк_ОтгрузкаЩепы
	|				И (Основание.ДатаКУчету_ТД МЕЖДУ &НачалоПериода И &КонецПериода)) КАК алк_ПередачиСобственныеСерииОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ОтгрузкаЩепы.Запасы КАК алк_ОтгрузкаЩепыЗапасы
	|		ПО алк_ПередачиСобственныеСерииОбороты.Основание = алк_ОтгрузкаЩепыЗапасы.Ссылка
	|ГДЕ
	|	алк_ОтгрузкаЩепыЗапасы.Ссылка.ДатаКУчету_ТД МЕЖДУ &НачалоПериода И &КонецПериода
	|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.Проведен
	|	И алк_ОтгрузкаЩепыЗапасы.Ссылка.ВыгружатьВ_ТД";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",  ПериодСт.ДатаОкончания);

	РезультатЗапроса = Запрос.Выполнить();
				
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтр = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,ВыборкаДетальныеЗаписи);
		
	КонецЦикла; 
	
КонецПроцедуры  

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазрешенныйУчастокДГСГП()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Участки.Ссылка
	               |ИЗ
	               |	Справочник.алк_Участки КАК алк_Участки
	               |ГДЕ
	               |	алк_Участки.Код = ""000000039""
	               |	И НЕ алк_Участки.ЭтоГруппа";
	Запрос.УстановитьПараметр("",);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;	
КонецФункции

// Кон мод [Пакушев И.С.] [16.03.2018]



