//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения объекта.
	//
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если ОбменДанными.Загрузка = Истина Тогда
			Возврат;
		КонецЕсли;
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.алк_ПеремещениеЛесопродукции.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета 	
		РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ); 
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов ++
		Если РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата) Тогда 
			РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
			РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
		КонецЕсли;
		//Дубоделов Э.А алк_ПроизводствоОборот, алк_ОстаткиЗапасов --

		//Сергеева Г.О. Оборотный регистр ++  
		РфпСервер.ОтразитьОборотыПроизводства(ДополнительныеСвойства, Движения, Отказ);  			
		РфпСервер.ОтразитьОстаткиЛесопродукции(ДополнительныеСвойства, Движения, Отказ);
		//Сергеева Г.О. Оборотный регистр --
		
		БиржаЦЛП = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ);
		
		Если СтруктурнаяЕдиница = БиржаЦЛП ИЛИ СтруктурнаяЕдиницаПолучатель = БиржаЦЛП Тогда
			
			// Отражение по "Последовательностям"
			РфпСервер.ОтразитьДокументыПоследовательностиБиржа(ДополнительныеСвойства, Движения, Отказ);
			
		КонецЕсли; 
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		
		Если Дата > '20231001075959' Тогда  // 01.10.23 - провели инвентаризацию и перевели на новый регистр  
			
			РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.Проведение);
			
		Иначе // старый контроль
			
			// Контроль (временно)
			
			//ОтказПоКонтролю = Контроль(РежимПроведения, ДополнительныеСвойства, ВидДокумента);
			ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизации");
			
			Если ОтказПоКонтролю И Не ПропускатьМинус Тогда
				
				Отказ = Истина;
				
			КонецЕсли; 	
			
		КонецЕсли;   	
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  
		
		
		
	КонецПроцедуры // ОбработкаПроведения()
	
	#КонецОбласти
	
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			
		КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		//
		//Если ДанныеЗаполнения.Свойство("ВидТранспортировки") Тогда
		//	ВидТранспортировки = ДанныеЗаполнения.ВидТранспортировки;	
		//КонецЕсли;	
		
	КонецПроцедуры
	
	
	
	#КонецОбласти


Процедура Конец()	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
		
		Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
		КонецЕсли; 
		
	Иначе
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		//СтратегияЗаполнения[Тип("ДокументСсылка.алк_ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
		//
		//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_ПеремещениеЗапасов")
		//	И ДанныеЗаполнения.Ссылка.ВидОперации <> Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство Тогда
		//	
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Основанием может являться документ с видом операции ""Возврат на производство""!";
		//	Сообщение.Сообщить();
		//	
		//	Возврат;
		//	
		//КонецЕсли; 
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);			
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;

	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства); 
		
	Если Дата > '20231001075959' Тогда  // 01.10.23 - провели инвентаризацию и перевели на новый регистр  
		
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
		
	Иначе // старый контроль
		
		// Контроль (временно)
		
		//ОтказПоКонтролю = Контроль(РежимПроведения, ДополнительныеСвойства, ВидДокумента);
		ОтказПоКонтролю = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимЗаписиДокумента.ОтменаПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизации");
		
		Если ОтказПоКонтролю И Не ПропускатьМинус Тогда
			
			Отказ = Истина;
			
		КонецЕсли; 	
		
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();  

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Возврат;
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель
			|ИЗ
			|	РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
			|ГДЕ
			|	алк_ОстаткиЗапасов.Регистратор = &Регистратор
			|	И НЕ алк_ОстаткиЗапасов.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	алк_ОстаткиЗапасов.Характеристика,
			|	алк_ОстаткиЗапасов.СтруктурнаяЕдиница,
			|	алк_ОстаткиЗапасов.Штабель";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);	
	
		ДополнительныеСвойства.Вставить("ТЧХарактеристикДоЗаписи",Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	Если ВидДокумента = Перечисления.алк_ВидыДокументовПеремещенияЛесопродукции.ПередачаНаЦПШ Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЯчейкаПолучатель) И СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000001") Тогда 
		Сообщить("Ошибка! Заполните ячейку (штабель) получателя.");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры





















