
#Область Печать

Функция СформироватьПечатнуюФормуЭтикетки(МассивОбъектов,ДопПараметры=Неопределено) Экспорт
	
	Возврат СформироватьПечатнуюФормуЭтикетки_Общая(МассивОбъектов, Ложь, ДопПараметры);
	
КонецФункции

Функция СформироватьПечатнуюФормуЭтикетки_Оперативно(МассивОбъектов) Экспорт
	
	Возврат СформироватьПечатнуюФормуЭтикетки_Общая(МассивОбъектов, Истина);
		
КонецФункции

Функция СформироватьПечатнуюФормуЭтикетки_Общая(МассивОбъектов, Оперативно = Истина, ДополнительныеПараметрыПечати = Неопределено) Экспорт   // на базе оперативного
	
	ПФМ = ПолучитьРазрешенныйУчастокПФМ();
	
   	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если ТекущаяДата() > '20220811080000' Тогда  // с 11.08.2022 - сертификат не используется
		ПечататьСертификат = Ложь;	
	Иначе  
		ПечататьСертификат = Истина;	
	КонецЕсли;
	
	Счетчик = 1;
		
	Для каждого СерийныйНомер Из МассивОбъектов Цикл
		
		Если Не ЗначениеЗаполнено(СерийныйНомер) Тогда
			Продолжить;	
		КонецЕсли;
		
		РегистрыСведений.РФП_ПечатьЭтикеток.СформироватьЗаписьРегистраСведений(СерийныйНомер);		
		
	#Область Пиломатериал  
		// Пиломатериал		
		Если СерийныйНомер.Владелец = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Пиломатериал) Тогда 
			
			Запрос = Новый Запрос; 
			
			//Закомментировано условие 06.05.2025 обр.17986 
			//Было
			//Если СтрНайти(""+СерийныйНомер, "МЛ")>0 Тогда 			
			//	Запрос.Текст = ТекстЗапросаПиломатериал(Оперативно);				
			//Иначе                                                           			
			//	Запрос.Текст = ТекстЗапросаПиломатериал_Остатки();				
			//КонецЕсли;  
			//Стало
			Запрос.Текст = ТекстЗапросаПиломатериал_Остатки();
			//\\ 		  		
			
			Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер); 
			Запрос.УстановитьПараметр("Ссылка", СерийныйНомер);

			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			
			ВыборкаДетальныеЗаписи.Следующий();  
			
			//Закомментировано условие 06.05.2025 обр.17986 
			//Было
			//Если СтрНайти(""+СерийныйНомер, "МЛ")>0 Тогда 			
			//	ДатаСмены = ВыборкаДетальныеЗаписи.ДатаСмены;				
			//Иначе                                                           			
			//	ДатаСмены = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(ПФМ, ВыборкаДетальныеЗаписи.ПериодУпаковки).ДатаСмены;
			//КонецЕсли;
			//Стало
			ПараметрыСмены = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(ПФМ, ВыборкаДетальныеЗаписи.ПериодУпаковки);
			Если Не ПараметрыСмены = NULL тогда
				ДатаСмены = ПараметрыСмены.ДатаСмены;
			Иначе
				Сообщить("Ошибка получения даты смены производства пакеты для текущего пользователя!");
				Возврат ТабличныйДокумент;
			КонецЕсли;
			//\\
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сечение) 
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Длина) Тогда  	
				
				Макет = ПолучитьМакет("ЭтикеткаПиломатериал");
				
				Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат) Или Не ПечататьСертификат Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка2"); 
				ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
				ИначеЕсли СтрНайти(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать, "PEFC") Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
					ОбластьМакета.Параметры.ПредставлениеНаПечать = ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать;
				Иначе
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка");   				
				КонецЕсли; 
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ПараметрыПакета_Новые");
				ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				Областьмакета.Параметры.НомерПакета = ВыборкаДетальныеЗаписи.НомерПакета;
				ОбластьМакета.Параметры.СечДл = "" + ВыборкаДетальныеЗаписи.Сечение + " Х " + ВыборкаДетальныеЗаписи.Длина;
				ОбластьМакета.Параметры.ДатаУпаковки = Формат(ДатаСмены, "ДФ=dd.MM.yyyy");
				
				
				ОбластьМакета.Параметры.Упаковщик = ПараметрыСеанса.ТекущийПользователь.Наименование;
				// штрихкод
				РазмерШрифта = 80;
				Рисунок = ОбластьМакета.Рисунки.ШтрихКод;
				
				Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
				КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
				
				НаименованиеПакета = "" + СерийныйНомер;
				
				//Пакеты спрефиксом МЛ меняем на печать на ПМ и добавляем идентификатор номера квартала (0000168020) 
				Если Лев(НаименованиеПакета, 2) = "МЛ" Тогда
					СНПоЧастям = СтрРазделить(НаименованиеПакета, "-");	
					НомерСН = Прав(СНПоЧастям[2], 5);
					НомерКвартала = Цел((Месяц(ДатаСмены)+2)/3);
					НаименованиеПакета = "ПМ-" + СНПоЧастям[1] + "-" + НомерКвартала +	НомерСН;
					Областьмакета.Параметры.НомерПакета = НаименованиеПакета;
				КонецЕсли;
				///\\\
				
				ПрефиксЛатиницей = Транслит(Сред(НаименованиеПакета, 1,2));
				
				ЗначениеШтрихкода = ПрефиксЛатиницей + Сред(НаименованиеПакета,3); 
				
				Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина", Рисунок.Ширина / КоличествоМиллиметровВПикселе);
					ПараметрыШтрихкода.Вставить("Высота", Рисунок.Высота / КоличествоМиллиметровВПикселе);
					ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеШтрихкода);
					ПараметрыШтрихкода.Вставить("ТипКода", 99);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
					ПараметрыШтрихкода.Вставить("РазмерШрифта", ?(РазмерШрифта = 0, 24, РазмерШрифта));
					Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
				КонецЕсли; 
				
				ЧислоКопийЭтикетки = РегистрыСведений.РФП_ПечатьЭтикеток.ПолучитьЧислоКопийЭтикетки(СерийныйНомер);
				
				Если ЧислоКопийЭтикетки = Неопределено Тогда 
					ОбластьМакета.Параметры.НомерЭкземпляра = 1;
					ОбластьМакета.Параметры.ДатаЭкз = ТекущаяДата();
				Иначе
					ОбластьМакета.Параметры.НомерЭкземпляра = ЧислоКопийЭтикетки.ЧислоКопий;
					ОбластьМакета.Параметры.ДатаЭкз = ЧислоКопийЭтикетки.ДатаКопии;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				//Если СтрДлина(ВыборкаДетальныеЗаписи.Длина) > 4 Тогда
				//	ОбластьСечение = ТабличныйДокумент.Область("ОбластьСечение"); 
				//	ОбластьСечение.Шрифт = Новый Шрифт(ОбластьСечение.Шрифт, , 55);
				//КонецЕсли; 
			Иначе
				Сообщить("У пакета не установлена характеристика!");				
			КонецЕсли;
			
		КонецЕсли;
	#КонецОбласти
	
#Область ПиломатериалСП
// Пиломатериал	СП	
		Если СерийныйНомер.Владелец = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ПиломатериалСП) Тогда 
			
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ЧислоКопийЭтикетки = 2; 
			Макет = ПолучитьМакет("ЭтикеткаПиломатериалНовые");
			
			Запрос = Новый Запрос; 
			
			//Закомментировано условие 06.05.2025 обр.17986 
			//Было
			//Если СтрНайти(""+СерийныйНомер, "МС")>0 И Оперативно = Истина Тогда 			
			//	Запрос.Текст = ТекстЗапросаПиломатериал(Оперативно);				
			//Иначе                                                           			
			//	Запрос.Текст = ТекстЗапросаПиломатериал_Остатки(Оперативно);				
			//КонецЕсли;  
			//Стало
			Запрос.Текст = ТекстЗапросаПиломатериал_Остатки();
			//\\			
			Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
			Запрос.УстановитьПараметр("Ссылка", СерийныйНомер);
			
			РезультатЗапроса = Запрос.Выполнить(); 
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			
			ВыборкаДетальныеЗаписи.Следующий(); 
			
			//Закомментировано условие 06.05.2025 обр.17986 
			//Было
			//Если СтрНайти(""+СерийныйНомер, "МС")>0 Тогда 			
			//	ДатаСмены = ВыборкаДетальныеЗаписи.ДатаСмены;				
			//Иначе                                                           			
			//	ДатаСмены = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(ПФМ, ВыборкаДетальныеЗаписи.ПериодУпаковки).ДатаСмены;
			//КонецЕсли;
			//Стало
			ПараметрыСмены = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(ПФМ, ВыборкаДетальныеЗаписи.ПериодУпаковки);
			Если Не ПараметрыСмены = NULL тогда
				ДатаСмены = ПараметрыСмены.ДатаСмены;
			Иначе
				Сообщить("Ошибка получения даты смены производства пакеты для текущего пользователя!");
				Возврат ТабличныйДокумент;
			КонецЕсли;
			//\\
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			//контроль вывода пустых этикеток
			Если Не (ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сечение) 
					И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Длина)) Тогда 
					
					Сообщить("У пакета не установлена характеристика!");
					
					Возврат ТабличныйДокумент;                          				
				
			КонецЕсли;
			
			Для Экземпляр = 1 по ЧислоКопийЭтикетки цикл  
				Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат) Или Не ПечататьСертификат Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка2"); 
				ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
				ИначеЕсли СтрНайти(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать, "PEFC") Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
					ОбластьМакета.Параметры.ПредставлениеНаПечать = ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать;
				Иначе
					ОбластьМакета = Макет.ПолучитьОбласть("Шапка");   				
				КонецЕсли; 
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ПараметрыПакета_Новые");
				ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				Областьмакета.Параметры.НомерПакета = ВыборкаДетальныеЗаписи.НомерПакета;
				ОбластьМакета.Параметры.СечДл = "" + ВыборкаДетальныеЗаписи.Сечение + " Х " + ВыборкаДетальныеЗаписи.Длина;
				ОбластьМакета.Параметры.ДатаУпаковки = Формат(ДатаСмены, "ДФ=dd.MM.yyyy");
				
				
				ОбластьМакета.Параметры.Упаковщик = ПараметрыСеанса.ТекущийПользователь.Наименование;
				// штрихкод
				РазмерШрифта = 80;
				
				ЧислоКопийЭтикетки = РегистрыСведений.РФП_ПечатьЭтикеток.ПолучитьЧислоКопийЭтикетки(СерийныйНомер);
				
				Если ЧислоКопийЭтикетки = Неопределено Тогда 
					ОбластьМакета.Параметры.НомерЭкземпляра = 1;
					ОбластьМакета.Параметры.ДатаЭкз = ТекущаяДата();
				Иначе
					ОбластьМакета.Параметры.НомерЭкземпляра = ЧислоКопийЭтикетки.ЧислоКопий;
					ОбластьМакета.Параметры.ДатаЭкз = ЧислоКопийЭтикетки.ДатаКопии;
				КонецЕсли;  
				
				ТабличныйДокумент.Вывести(ОбластьМакета); 
				
				Если Экземпляр = 1 тогда
					Разделитель = Макет.ПолучитьОбласть("ПустаяСтрока");
					ТабличныйДокумент.Вывести(Разделитель);
				КонецЕсли;
				
			КонецЦикла; 
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		КонецЕсли;
	#КонецОбласти
 
	#Область Шпон 		
		// Шпон		
		Если СерийныйНомер.Владелец = Справочники.Номенклатура.Шпон  Тогда 
			//Если пакет уже был списан или реализован то не печатаем	
			МассивСН = Новый Массив;	
			МассивСН.Добавить(СерийныйНомер);
			
			СтруктураСерийныхНомеров = РегистрыНакопления.алк_ОстаткиЗапасов.ПолучитьСтруктуруОстатковПакетов(МассивСН, ТекущаяДата());
			
			Если СтруктураСерийныхНомеров.Количество() > 0 Тогда 
				
				Если ДополнительныеПараметрыПечати <> Неопределено И ДополнительныеПараметрыПечати.Свойство("КоличествоЭкземпляровНаПечать") Тогда 
					КоличествоЭкземпляровНаПечать = ДополнительныеПараметрыПечати.КоличествоЭкземпляровНаПечать;
				Иначе
					КоличествоЭкземпляровНаПечать = Неопределено;	
				КонецЕсли;

				Макет = ПолучитьМакет("ЭтикеткаШпон");
							
				Запрос = Новый Запрос;
				Запрос.Текст = ТекстЗапросаШпон();
							
				Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				КоличествоЗаписейВВыборке = ВыборкаДетальныеЗаписи.Количество();
				
				ВыборкаДетальныеЗаписи.Следующий();	
				
				//Если пакет сборный то запишем в журнал
				Если КоличествоЗаписейВВыборке > 1 Тогда
					Сообщить("Пакет сборный, Необходимо проверить этикетку");
					ЗаписьЖурналаРегистрации("ПечатьСборнойЭтикетки",,,,"Печать сборной этикетки: " + Строка(ВыборкаДетальныеЗаписи.СерийныйНомер), УровеньЖурналаРегистрации.Ошибка);
				КонецЕсли;	
						
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат) И ПечататьСертификат Тогда 		
					Шапка = Макет.ПолучитьОбласть("ШапкаС");				
				Иначе 		
					Шапка = Макет.ПолучитьОбласть("ШапкаБезСертификата");			
				КонецЕсли;
				
				Шапка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				
				Этикетка = Макет.ПолучитьОбласть("Этикетка"); 	
				
				Этикетка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				
				// штрихкод
				РазмерШрифта = 80;
				Рисунок = Этикетка.Рисунки.ШтрихКод;
				
				Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
				КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
				
				НаименованиеПакета = "" + СерийныйНомер;
				
				ПрефиксЛатиницей = Транслит(Сред(НаименованиеПакета, 1,2));
				
				ЗначениеШтрихкода = ПрефиксЛатиницей + Сред(НаименованиеПакета,3); 
				
				Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
					ПараметрыШтрихкода = Новый Структура;
					ПараметрыШтрихкода.Вставить("Ширина", Рисунок.Ширина / КоличествоМиллиметровВПикселе);
					ПараметрыШтрихкода.Вставить("Высота", Рисунок.Высота / КоличествоМиллиметровВПикселе);
					ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеШтрихкода);
					ПараметрыШтрихкода.Вставить("ТипКода", 99);
					ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
					ПараметрыШтрихкода.Вставить("РазмерШрифта", ?(РазмерШрифта = 0, 24, РазмерШрифта));
					Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
				КонецЕсли; 	
								
				ТабличныйДокумент.Вывести(Шапка);	
				ТабличныйДокумент.Вывести(Этикетка);
				ТабличныйДокумент.ОтображатьСетку = ложь;
				ТабличныйДокумент.ОтображатьЗаголовки  = ложь;
				ТабличныйДокумент.ПолеСверху = 0;
				ТабличныйДокумент.ПолеСнизу = 0;
				ТабличныйДокумент.КоличествоЭкземпляров=?(КоличествоЭкземпляровНаПечать = Неопределено, 2, КоличествоЭкземпляровНаПечать);
				ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
				ТабличныйДокумент.АвтоМасштаб = Истина;
			Иначе
				Сообщить("Пакет уже был списан / отгружен"); 
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	#КонецОбласти

	#Область ШпонКусковой
		//ШпонКусковой		
		Если СерийныйНомер.Владелец = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ШпонКусковой)  Тогда
			
			Макет = ПолучитьМакет("ЭтикеткаШпонКусковой");
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапросаШпонКусковой(Оперативно);			
			
			Запрос.УстановитьПараметр("Ссылка", СерийныйНомер);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
								
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат) Или Не ПечататьСертификат Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2"); 
			ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
			ИначеЕсли СтрНайти(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать, "PEFC") Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
				ОбластьМакета.Параметры.ПредставлениеНаПечать = ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать;
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");   				
			КонецЕсли; 
			
			Если ВыборкаДетальныеЗаписи.ПородаСсылка = Справочники.Породы.НайтиПоНаименованию("Лиственница") Тогда
				
				ОбластьМакета.Параметры.НаименованиеНоменклатуры = "ШПОН ЛИСТВЕННИЧНЫЙ";
				ОбластьМакета.Параметры.НаименованиеНомАнгл      = "VENEER LARCH";
				
			КонецЕсли; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПараметрыПакета");
			ОбластьМакета.Параметры.Длина   = ВыборкаДетальныеЗаписи.ДлинаММ;
			ОбластьМакета.Параметры.Ширина  = ВыборкаДетальныеЗаписи.Сечение.ШиринаММ;
			ОбластьМакета.Параметры.Толщина = ВыборкаДетальныеЗаписи.Сечение.ТолщинаММ;
			
			ОбластьМакета.Параметры.Объём = ВыборкаДетальныеЗаписи.Объем;
			ОбластьМакета.Параметры.Сорт  = "Кусковой шпон";
			ОбластьМакета.Параметры.Количество = ВыборкаДетальныеЗаписи.Количество;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьНомерПакета");
			ОбластьМакета.Параметры.НомерПакета = ВыборкаДетальныеЗаписи.НомерПакета;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодвал");
			ОбластьМакета.Параметры.ВесНетто     = ВыборкаДетальныеЗаписи.ВесНетто;
			ОбластьМакета.Параметры.ВесБрутто    = ВыборкаДетальныеЗаписи.ВесБрутто;
			ОбластьМакета.Параметры.ДатаУпаковки = Формат(ВыборкаДетальныеЗаписи.ДатаСмены, "ДФ=dd.MM.yyyy");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
#КонецОбласти

#Область ДревесныеГранулыИД
	
	Если СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018") //ДГ 
		//ИЛИ СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000040") //Фанера ИД
		ИЛИ СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000041") //Топливные брикеты
		Тогда
		
		ПечатьНаПоловинеСтраницы = Ложь;
		ПечатьНаЧетвертиСтраницы = Ложь;
		ДатаСмены = Неопределено;
		Смена = Неопределено;
		
		Если ДополнительныеПараметрыПечати <> Неопределено Тогда
			Если ДополнительныеПараметрыПечати.Свойство("ДатаСмены") Тогда
				ДатаСмены = ДополнительныеПараметрыПечати.ДатаСмены;	
			КонецЕсли;   
			
			Если ДополнительныеПараметрыПечати.Свойство("КоличествоЭкземпляровНаПечать") Тогда 
				КоличествоЭкземпляровНаПечать = ДополнительныеПараметрыПечати.КоличествоЭкземпляровНаПечать;
			Иначе
				КоличествоЭкземпляровНаПечать = Неопределено;	
			КонецЕсли;
			
			Если ДополнительныеПараметрыПечати.Свойство("Смена") Тогда
				Смена = ДополнительныеПараметрыПечати.Смена;	
			КонецЕсли;

			Если ДополнительныеПараметрыПечати.Свойство("ПечатьНаПоловинеСтраницы") Тогда
				ПечатьНаПоловинеСтраницы = ДополнительныеПараметрыПечати.ПечатьНаПоловинеСтраницы;
			КонецЕсли;
			
			Если ДополнительныеПараметрыПечати.Свойство("ПечатьНаЧетвертиСтраницы") Тогда
				ПечатьНаЧетвертиСтраницы = ДополнительныеПараметрыПечати.ПечатьНаЧетвертиСтраницы;		
			КонецЕсли;
			
			Если ПечатьНаПоловинеСтраницы ИЛИ ПечатьНаЧетвертиСтраницы Тогда	
				ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 	
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.АвтоМасштаб  = Истина; 
		
		Если МассивОбъектов.Количество() = 1 И (ПечатьНаПоловинеСтраницы Или ПечатьНаЧетвертиСтраницы) Тогда
			ТабличныйДокумент.АвтоМасштаб  = Ложь; 
			ТабличныйДокумент.МасштабПечати = 65;	
		КонецЕсли; 

		Если Не ЗначениеЗаполнено(СерийныйНомер) Тогда
			Продолжить;	
		КонецЕсли; 
			
		Макет = ПолучитьМакет("ЭтикеткаДГ");
		
		Область = Макет.ПолучитьОбласть("Область2");
		
		Область.Параметры.ДатаСмены 	= Формат(ДатаСмены, "ДФ=yyyy-MM-dd"); 		
		Область.Параметры.Смена 		= Смена;
		
		// штрихкод
		
		РазмерШрифта = 60;
		Рисунок = Область.Рисунки.ШтрихКод;
		
		Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
		КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
		
		НаименованиеПакета = "" + СерийныйНомер;
		
		ПрефиксЛатиницей = Транслит(Сред(НаименованиеПакета, 1,2));
		
		ЗначениеШтрихкода = ПрефиксЛатиницей + Сред(НаименованиеПакета,3); 
		
		Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина", Рисунок.Ширина / КоличествоМиллиметровВПикселе);
			ПараметрыШтрихкода.Вставить("Высота", Рисунок.Высота / КоличествоМиллиметровВПикселе);
			ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеШтрихкода);
			ПараметрыШтрихкода.Вставить("ТипКода", 99);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта", ?(РазмерШрифта = 0, 24, РазмерШрифта));
			Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		КонецЕсли; 
		
		Если ПечатьНаПоловинеСтраницы Тогда
			
			Если Счетчик%2 = 0 Тогда   //четное
				ТабличныйДокумент.Присоединить(Область);  
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ТабличныйДокумент.Вывести(Область);								
			КонецЕсли; 
			
		ИначеЕсли ПечатьНаЧетвертиСтраницы Тогда
			
			Если Счетчик%2 = 0 Тогда   //четное
				ТабличныйДокумент.Присоединить(Область); 
				Если Счетчик%4 = 0 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			Иначе
				ТабличныйДокумент.Вывести(Область);								
			КонецЕсли;			
			
		Иначе			
			ТабличныйДокумент.Вывести(Область);		
			ТабличныйДокумент.КоличествоЭкземпляров=?(КоличествоЭкземпляровНаПечать = Неопределено, 2, КоличествоЭкземпляровНаПечать);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 
		
		
		
	КонецЕсли;
#КонецОбласти

#Область ФанераИД
Если СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000040") Тогда  //Фанера ИД    
	
	//Если ДополнительныеПараметрыПечати <> Неопределено Тогда  
	//	
	//	Если ДополнительныеПараметрыПечати.Свойство("КоличествоЭкземпляровНаПечать") Тогда 
	//		КоличествоЭкземпляровНаПечать = ДополнительныеПараметрыПечати.КоличествоЭкземпляровНаПечать;
	//	Иначе
	//		КоличествоЭкземпляровНаПечать = Неопределено;	
	//	КонецЕсли;
	//	
	//КонецЕсли; 
	
	Если ДополнительныеПараметрыПечати.Свойство("JAS") Тогда 
		ВключитьJAS = ДополнительныеПараметрыПечати.JAS;
	Иначе
		ВключитьJAS = Истина;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаФанераИД();
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	Запрос.УстановитьПараметр("Операция", Справочники.алк_ОперацииПроизводства.УпаковкаФанеры);
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("Ошибка получения данных по пакету. Проверьте наличие документов: ""Производства"" и ""Норм расхода и выпуска"" у пакета!");
		Возврат ТабличныйДокумент;
	КонецЕсли; 

	Макет = ПолучитьМакет("ЭтикеткаИД");	
	Область = Макет.ПолучитьОбласть("Область");   
	
	Если НЕ ВключитьJAS Тогда 
		Область.Рисунки.Удалить(Область.Области.JAS);
	КонецЕсли;
	
	//Формируем ШтрихКод
	Рисунок = Область.Рисунки.ШтрихКод;
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	НаименованиеПакета = "" + СерийныйНомер;
	
	ПрефиксЛатиницей = Транслит(Сред(НаименованиеПакета, 1,2));
	
	ЗначениеШтрихкода = ПрефиксЛатиницей + Сред(НаименованиеПакета,3); 
	
	Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина", Рисунок.Ширина / КоличествоМиллиметровВПикселе);
		ПараметрыШтрихкода.Вставить("Высота", Рисунок.Высота / КоличествоМиллиметровВПикселе);
		ПараметрыШтрихкода.Вставить("Штрихкод", ЗначениеШтрихкода);
		ПараметрыШтрихкода.Вставить("ТипКода", 99);
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
		ПараметрыШтрихкода.Вставить("РазмерШрифта", 26);
		Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	КонецЕсли;
	//\\
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		ЗаполнитьЗначенияСвойств(Область.Параметры,ВыборкаДетальныеЗаписи);
		Область.Параметры.ДатаУпаковки = Формат(ВыборкаДетальныеЗаписи.ДатаУпаковки, "ДФ=dd-MM-yyyy");
		
		КолЗвездочек = ВыборкаДетальныеЗаписи.ЭмиссияF;
		ИмяЗведочки = "✩";
		Для Счетчик = 1 ПО КолЗвездочек Цикл 
			ИмяЭмиссияF = ИмяЗведочки + ИмяЭмиссияF; 
		КонецЦикла;
		Область.Параметры.ЭмиссияF = ИмяЭмиссияF; 
		
		Если ВыборкаДетальныеЗаписи.ТолщинаММ - Цел(ВыборкаДетальныеЗаписи.ТолщинаММ) = 0 Тогда
			ИмяТолщинаММ = Формат(ВыборкаДетальныеЗаписи.ТолщинаММ,"ЧДЦ=0");
		Иначе  
			ИмяТолщинаММ = Формат(ВыборкаДетальныеЗаписи.ТолщинаММ,"ЧДЦ=1");
		КонецЕсли; 
		
		Область.Параметры.Размер = СтрЗаменить(ИмяТолщинаММ, Символы.НПП, "") + "*" + СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.ШиринаММ), Символы.НПП, "") + "*" + СтрЗаменить(Строка(ВыборкаДетальныеЗаписи.ДлинаММ), Символы.НПП, "");
	
	КонецЦикла;
	
	//1/2 печать  
	ТабличныйДокумент.МасштабПечати = 100;	
	ТабличныйДокумент.ЭкземпляровНаСтранице = 2;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ФАНЕРА_ИД";
	ТабличныйДокумент.Вывести(Область);
	//\\

КонецЕсли; 

#КонецОбласти

	#Область Карандаши  
		// Карандаши
		
		Если СерийныйНомер.Владелец = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Карандаши)  Тогда
			
			Макет = ПолучитьМакет("ЭтикеткаКарандаш");
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапросаКарандаши(Оперативно);
			
			
			Запрос.УстановитьПараметр("Ссылка", СерийныйНомер);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат) Или Не ПечататьСертификат Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2"); 
			ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
			ИначеЕсли СтрНайти(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать, "PEFC") Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
				ОбластьМакета.Параметры.ПредставлениеНаПечать = ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать;
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");   				
			КонецЕсли;  
			
			Если ВыборкаДетальныеЗаписи.ПородаСсылка = Справочники.Породы.НайтиПоНаименованию("Лиственница") Тогда
				
				ОбластьМакета.Параметры.НаименованиеНоменклатуры = "КАРАНДАШ ЛИСТВЕННИЧНЫЙ";
				ОбластьМакета.Параметры.НаименованиеНомАнгл      = "LARCH CORE";
				
			КонецЕсли; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПараметрыПакета2");
			
			ДиаметрММ = ВыборкаДетальныеЗаписи.Сечение.ДиаметрММ;			
			
			Если ДиаметрММ = 0 Тогда 				
				ОбластьМакета.Параметры.Диаметр = "75-120"; 
				ОбластьМакета.Параметры.Количество = "" + ВыборкаДетальныеЗаписи.Количество + " kg";  
			Иначе                                    				
				ОбластьМакета.Параметры.Диаметр = ДиаметрММ;
				ОбластьМакета.Параметры.Количество = "" + ВыборкаДетальныеЗаписи.Количество + " pcs";  
			КонецЕсли; 			
			
			ОбластьМакета.Параметры.Длина   = ВыборкаДетальныеЗаписи.ДлинаММ;
						
			ОбластьМакета.Параметры.Объём = ВыборкаДетальныеЗаписи.Объем;
						
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьНомерПакета");
			ОбластьМакета.Параметры.НомерПакета = ВыборкаДетальныеЗаписи.НомерПакета;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодвал");
			ОбластьМакета.Параметры.ВесНетто     = ВыборкаДетальныеЗаписи.ВесНетто;
			ОбластьМакета.Параметры.ВесБрутто    = ВыборкаДетальныеЗаписи.ВесБрутто;
			ОбластьМакета.Параметры.ДатаУпаковки = Формат(ВыборкаДетальныеЗаписи.ДатаСмены, "ДФ=dd.MM.yyyy");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
	#КонецОбласти

	#Область ЧуракОцилиндрованный
		// Чурак оцилиндрованный (кат)	
		Если СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000016") Тогда  // Чурак оцилиндрованный (кат)
			
			Макет = ПолучитьМакет("ЭтикеткаКарандаш");
			
			Запрос = Новый Запрос;
			Запрос.Текст =  ТекстЗапросаКарандаши(Оперативно);
						
			Запрос.УстановитьПараметр("Ссылка", СерийныйНомер);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); ВыборкаДетальныеЗаписи.Следующий();
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат) Или Не ПечататьСертификат Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2"); 
			ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
			ИначеЕсли СтрНайти(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать, "PEFC") Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
				ОбластьМакета.Параметры.ПредставлениеНаПечать = ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать;
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");   				
			КонецЕсли;  
			
			Если ВыборкаДетальныеЗаписи.ПородаСсылка = Справочники.Породы.НайтиПоНаименованию("Лиственница") Тогда
				
				ОбластьМакета.Параметры.НаименованиеНоменклатуры = "ОЦИЛИНДРОВАННОЕ БРЕВНО";//"ЧУРАК ОЦИЛИНДРОВАННЫЙ";
				ОбластьМакета.Параметры.НаименованиеНомАнгл      = "ЛИСТВЕННИЧНОЕ";//"LARCH ROUNDED";
				
			КонецЕсли; 
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПараметрыПакета2");
			
			ДиаметрММ = ВыборкаДетальныеЗаписи.Сечение.ДиаметрММ;			
			
			Если ДиаметрММ = 0 Тогда 				
				ОбластьМакета.Параметры.Диаметр = "120≈"; 
				ОбластьМакета.Параметры.Количество = "" + ВыборкаДетальныеЗаписи.Количество + " kg";  
			Иначе                                    				
				ОбластьМакета.Параметры.Диаметр = ДиаметрММ;
				ОбластьМакета.Параметры.Количество = "" + ВыборкаДетальныеЗаписи.Количество + " pcs";  
			КонецЕсли; 			
			
			ОбластьМакета.Параметры.Длина   = ВыборкаДетальныеЗаписи.ДлинаММ;
						
			ОбластьМакета.Параметры.Объём = ВыборкаДетальныеЗаписи.Объем;
						
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьНомерПакета");
			ОбластьМакета.Параметры.НомерПакета = ВыборкаДетальныеЗаписи.НомерПакета;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодвал");
			ОбластьМакета.Параметры.ВесНетто     = ВыборкаДетальныеЗаписи.ВесНетто;
			ОбластьМакета.Параметры.ВесБрутто    = ВыборкаДетальныеЗаписи.ВесБрутто;
			ОбластьМакета.Параметры.ДатаУпаковки = Формат(ВыборкаДетальныеЗаписи.ДатаСмены, "ДФ=dd.MM.yyyy");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
	#КонецОбласти

	#Область ОтходыПМ 
		// Отходы ПМ		
		Если СерийныйНомер.Владелец = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.ОтходыПилмат)  
			Или СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017") Тогда   // Отходы в пакетах
			
			Макет = ПолучитьМакет("ЭтикеткаОтходыПМ");
			
			Запрос = Новый Запрос; 
			
			Если СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017") И НЕ Оперативно Тогда //Побочная продукция из нач стр
				//по новому механизму
				Запрос.Текст = ТекстЗапросаПиломатериал_Остатки();
				Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);   
			Иначе   
				//по старому механизму
				Запрос.Текст = ТекстЗапросаПиломатериал(Оперативно);
				Запрос.УстановитьПараметр("Ссылка", СерийныйНомер);
			КонецЕсли;
				
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			ВыборкаДетальныеЗаписи.Следующий();
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат) Или Не ПечататьСертификат Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2"); 
			ИначеЕсли Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать) Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
			ИначеЕсли СтрНайти(ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать, "PEFC") Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
				ОбластьМакета.Параметры.ПредставлениеНаПечать = ВыборкаДетальныеЗаписи.Сертификат.ПредставлениеНаПечать;
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");   				
			КонецЕсли;  
			
			Если СерийныйНомер.Владелец = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000017") И НЕ Оперативно Тогда //Побочная продукция из нач стр
				ПараметрыСмены = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(ПФМ, ВыборкаДетальныеЗаписи.ПериодУпаковки);
				Если Не ПараметрыСмены = NULL тогда
					ДатаСмены = ПараметрыСмены.ДатаСмены;
				Иначе
					Сообщить("Ошибка получения даты смены производства пакеты для текущего пользователя!");
					Возврат ТабличныйДокумент;
				КонецЕсли;
			Иначе  
				ДатаСмены = ВыборкаДетальныеЗаписи.ДатаСмены; 
			КонецЕсли;
				
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПараметрыПакета");
			ОбластьМакета.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьМакета.Параметры.НомерПакета = ВыборкаДетальныеЗаписи.НомерПакета;
			ОбластьМакета.Параметры.ДатаУпаковки = Формат(ДатаСмены, "ДФ=dd.MM.yyyy");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			//Если СтрДлина(ВыборкаДетальныеЗаписи.Длина) > 4 Тогда
			//	//ОбластьСечение = ТабличныйДокумент.Область("ОбластьСечение"); 
			//	//ОбластьСечение.Шрифт = Новый Шрифт(ОбластьСечение.Шрифт, , 65);
			//КонецЕсли; 

		КонецЕсли;
	#КонецОбласти	
	
	Счетчик = Счетчик + 1;
	
	КонецЦикла;
	
	ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.Нет;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


Функция ТекстЗапросаПиломатериал(Оперативно)
	
	Если Оперативно Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Наименование КАК НомерПакета,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК ПородаА,
		|	ВЫРАЗИТЬ(алк_ПараметрыПакетовОперативныйСрезПоследних.Объем КАК ЧИСЛО(15, 2)) КАК Объем,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.КоличествоСостав КАК Количество,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесНеттоТаможня КАК ВесНетто,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесБруттоТаможня КАК ВесБрутто,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина) КАК Длина,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение) КАК Сечение,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ПериодУпаковки КАК ПериодУпаковки,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ДатаСмены КАК ДатаСмены,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Влажность) КАК Влажность,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Сертификат КАК Сертификат,
		|	алк_ПараметрыХарактеристик.Характеристика.Владелец.Наименование КАК Номенклатура
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовОперативныйСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &Ссылка";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СерийныеНомера.Наименование КАК НомерПакета,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК ПородаА,
		|	ВЫРАЗИТЬ(алк_ПараметрыПакетовСрезПоследних.Объем КАК ЧИСЛО(15, 3)) КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК Количество,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНетто,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБрутто,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Длина) КАК Длина,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сечение) КАК Сечение,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ДатаСмены,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Влажность) КАК Влажность
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &Ссылка";
		          		
	КонецЕсли; 

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаПиломатериал(Оперативно)




Функция ТекстЗапросаПиломатериал_Остатки()  
	
	// похожее есть в  модуле РфпПолучениеДанныхСервер.ПолучитьПараметрыПакетаПоОстаткам(СерийныйНомер);  - но нет времени делать переход универсально
	
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК Пакет,
		|	МИНИМУМ(алк_ОстаткиЗапасовОбороты.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПериодУпаковки
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Регистратор, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК Пакет,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
		|	алк_ОстаткиЗапасовОбороты.Сертификат КАК Сертификат,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура КАК Номенклатура,
		|	алк_ОстаткиЗапасовОбороты.КоличествоПриход КАК Объем,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.БоковаяДоска, ЛОЖЬ) КАК БоковаяДоска,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.ДлинаММ, 0) КАК ДлинаММ,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ШиринаММ, 0) КАК ШиринаММ,
		|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Сечение.ТолщинаММ, 0) КАК ТолщинаММ,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоШирине, 0) КАК ПрипускПоШирине,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоТолщине, 0) КАК ПрипускПоТолщине,
		|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск.ПрипускПоДлине, 0) КАК ПрипускПоДлине,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(алк_ОстаткиЗапасовОбороты.КоличествоПриход / алк_ПараметрыХарактеристик.Объем)
		|	КОНЕЦ КАК КоличествоСостав,
		|	алк_ОстаткиЗапасовОбороты.Период КАК Период,
		|	алк_ОстаткиЗапасовОбороты.Номенклатура.ЕдиницаИзмерения.Код = ""168"" КАК УчетПоВесу
		|ПОМЕСТИТЬ ВТ_Обороты
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Регистратор, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних(, СерийныйНомер = &СерийныйНомер) КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|		ПО алк_ОстаткиЗапасовОбороты.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Порода КАК Порода,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность КАК Влажность,
		|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска КАК БоковаяДоска,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Сорт КАК Сорт,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3 КАК ПлотностьКгМ3,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг КАК ВесТарыКг,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ВТ_Плотность
		|ИЗ
		|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
		|			,
		|			(Характеристика, БоковаяДоска) В
		|				(ВЫБРАТЬ
		|					ВТ_Обороты.Характеристика,
		|					ВТ_Обороты.БоковаяДоска
		|				ИЗ
		|					ВТ_Обороты КАК ВТ_Обороты)) КАК алк_ПлотностьНоменклатурыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
		|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Сорт,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
		|	2
		|ИЗ
		|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
		|			,
		|			Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|				И (Номенклатура, Порода, Влажность, БоковаяДоска) В
		|					(ВЫБРАТЬ
		|						ВТ_Обороты.Номенклатура,
		|						ВТ_Обороты.Порода,
		|						ВТ_Обороты.Влажность,
		|						ВТ_Обороты.БоковаяДоска
		|					ИЗ
		|						ВТ_Обороты КАК ВТ_Обороты)) КАК алк_ПлотностьНоменклатурыСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Порода,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Влажность,
		|	алк_ПлотностьНоменклатурыСрезПоследних.БоковаяДоска,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика,
		|	алк_ПлотностьНоменклатурыСрезПоследних.Сорт,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
		|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
		|	3
		|ИЗ
		|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
		|			,
		|			Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|				И (Номенклатура, Порода, БоковаяДоска) В
		|					(ВЫБРАТЬ
		|						ВТ_Обороты.Номенклатура,
		|						ВТ_Обороты.Порода,
		|						ВТ_Обороты.БоковаяДоска
		|					ИЗ
		|						ВТ_Обороты КАК ВТ_Обороты)) КАК алк_ПлотностьНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВТ_Плотность.Номенклатура КАК Номенклатура,
		|	ВТ_Плотность.Порода КАК Порода,
		|	ВТ_Плотность.Влажность КАК Влажность,
		|	ВТ_Плотность.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Плотность.Характеристика КАК Характеристика,
		|	ВТ_Плотность.Сорт КАК Сорт,
		|	ВТ_Плотность.ПлотностьКгМ3 КАК ПлотностьКгМ3,
		|	ВТ_Плотность.ВесТарыКг КАК ВесТарыКг,
		|	ВТ_Плотность.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ ВТ_ПлотностьИтог
		|ИЗ
		|	ВТ_Плотность КАК ВТ_Плотность
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Обороты.Пакет КАК Пакет,
		|	ВТ_Обороты.Характеристика КАК Характеристика,
		|	ВТ_Обороты.Номенклатура КАК Номенклатура,
		|	ВТ_Обороты.Порода КАК Порода,
		|	ВТ_Обороты.Сорт КАК Сорт,
		|	ВТ_Обороты.Длина КАК Длина,
		|	ВТ_Обороты.Сечение КАК Сечение,
		|	ВТ_Обороты.Влажность КАК Влажность,
		|	ВТ_Обороты.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Обороты.КоличествоСостав КАК КоличествоСостав,
		|	ВТ_Обороты.Сертификат КАК Сертификат,
		|	ВЫБОР
		|		КОГДА ВТ_Обороты.УчетПоВесу
		|			ТОГДА ОКР(ВТ_Обороты.Объем * 1000 / ВТ_ПлотностьИтог.ПлотностьКгМ3, 3)
		|		ИНАЧЕ ВТ_Обороты.Объем
		|	КОНЕЦ КАК Объем,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ВТ_Обороты.УчетПоВесу
		|				ТОГДА ОКР(ВТ_Обороты.Объем * 1000 / ВТ_ПлотностьИтог.ПлотностьКгМ3, 2)
		|			ИНАЧЕ ОКР((ВТ_Обороты.ДлинаММ + ВТ_Обороты.ПрипускПоДлине) * (ВТ_Обороты.ШиринаММ + ВТ_Обороты.ПрипускПоШирине) * (ВТ_Обороты.ТолщинаММ + ВТ_Обороты.ПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000, 3)
		|		КОНЕЦ) КАК ОбъемТаможня,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ВТ_Обороты.УчетПоВесу
		|				ТОГДА ВТ_Обороты.Объем
		|			ИНАЧЕ ОКР(ВТ_ПлотностьИтог.ПлотностьКгМ3 * (ВТ_Обороты.ДлинаММ + ВТ_Обороты.ПрипускПоДлине) * (ВТ_Обороты.ШиринаММ + ВТ_Обороты.ПрипускПоШирине) * (ВТ_Обороты.ТолщинаММ + ВТ_Обороты.ПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000000, 3)
		|		КОНЕЦ) КАК ВесНеттоТаможня,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ВТ_Обороты.УчетПоВесу
		|				ТОГДА ОКР(ВТ_ПлотностьИтог.ВесТарыКг / 1000 + ВТ_Обороты.Объем, 3)
		|			ИНАЧЕ ОКР(ВТ_ПлотностьИтог.ВесТарыКг / 1000 + ВТ_ПлотностьИтог.ПлотностьКгМ3 * (ВТ_Обороты.ДлинаММ + ВТ_Обороты.ПрипускПоДлине) * (ВТ_Обороты.ШиринаММ + ВТ_Обороты.ПрипускПоШирине) * (ВТ_Обороты.ТолщинаММ + ВТ_Обороты.ПрипускПоТолщине) * ВТ_Обороты.КоличествоСостав / 1000000000000, 3)
		|		КОНЕЦ) КАК ВесБруттоТаможня,
		|	СРЕДНЕЕ(1) КАК Порядок,
		|	ВТ_Обороты.Период КАК Период,
		|	ВТ_ПлотностьИтог.ПлотностьКгМ3 КАК ПлотностьКгМ3,
		|	ВТ_ПлотностьИтог.ВесТарыКг КАК ВесТарыКг
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТ_Обороты КАК ВТ_Обороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлотностьИтог КАК ВТ_ПлотностьИтог
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Обороты.Пакет,
		|	ВТ_Обороты.Характеристика,
		|	ВТ_Обороты.Порода,
		|	ВТ_Обороты.Сорт,
		|	ВТ_Обороты.Длина,
		|	ВТ_Обороты.Сечение,
		|	ВТ_Обороты.Влажность,
		|	ВТ_Обороты.Сертификат,
		|	ВТ_Обороты.Номенклатура,
		|	ВТ_Обороты.КоличествоСостав,
		|	ВТ_Обороты.БоковаяДоска,
		|	ВТ_Обороты.Период,
		|	ВТ_ПлотностьИтог.ПлотностьКгМ3,
		|	ВТ_ПлотностьИтог.ВесТарыКг,
		|	ВЫБОР
		|		КОГДА ВТ_Обороты.УчетПоВесу
		|			ТОГДА ОКР(ВТ_Обороты.Объем * 1000 / ВТ_ПлотностьИтог.ПлотностьКгМ3, 3)
		|		ИНАЧЕ ВТ_Обороты.Объем
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СерийныеНомера.Ссылка КАК Пакет,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ПериодУпаковки,
		|	алк_ПараметрыХарактеристик.Характеристика КАК Характеристика,
		|	СерийныеНомера.Владелец КАК Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыХарактеристик.Влажность КАК Влажность,
		|	алк_ПараметрыПакетовСрезПоследних.БоковаяДоска КАК БоковаяДоска,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат КАК Сертификат,
		|	алк_ПараметрыПакетовСрезПоследних.Припуск КАК Припуск,
		|	алк_ПараметрыПакетовСрезПоследних.Объем КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня КАК ОбъемТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНеттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоТаможня,
		|	алк_ПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО,
		|	2 КАК Порядок,
		|	алк_ПараметрыПакетовСрезПоследних.Габарит КАК Габарит,
		|	алк_ПараметрыПакетовСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ПоПараметрамПакетов
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, СерийныйНомер.Ссылка = &СерийныйНомер) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Пакет КАК Пакет,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Порода КАК Порода,
		|	ВТ.Сорт КАК Сорт,
		|	ВТ.Длина КАК Длина,
		|	ВТ.Сечение КАК Сечение,
		|	ВТ.Влажность КАК Влажность,
		|	ВТ.БоковаяДоска КАК БоковаяДоска,
		|	ВТ.КоличествоСостав КАК КоличествоСостав,
		|	ВТ.Сертификат КАК Сертификат,
		|	ВТ.Объем КАК Объем,
		|	ВТ.ОбъемТаможня КАК ОбъемТаможня,
		|	ВТ.ВесНеттоТаможня КАК ВесНеттоТаможня,
		|	ВТ.ВесБруттоТаможня КАК ВесБруттоТаможня,
		|	ВТ.Порядок КАК Порядок,
		|	ВТ.Период КАК Период,
		|	ВТ.ПлотностьКгМ3 / 1000 КАК Плотность,
		|	ВТ.ВесТарыКг / 1000 КАК ВесТары
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ КАК ВТ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПоПараметрамПакетов.Пакет,
		|	ВТ_ПоПараметрамПакетов.Характеристика,
		|	ВТ_ПоПараметрамПакетов.Номенклатура,
		|	ВТ_ПоПараметрамПакетов.Порода,
		|	ВТ_ПоПараметрамПакетов.Сорт,
		|	ВТ_ПоПараметрамПакетов.Длина,
		|	ВТ_ПоПараметрамПакетов.Сечение,
		|	ВТ_ПоПараметрамПакетов.Влажность,
		|	ВТ_ПоПараметрамПакетов.БоковаяДоска,
		|	ВТ_ПоПараметрамПакетов.КоличествоСостав,
		|	ВТ_ПоПараметрамПакетов.Сертификат,
		|	ВТ_ПоПараметрамПакетов.Объем,
		|	ВТ_ПоПараметрамПакетов.ОбъемТаможня,
		|	ВТ_ПоПараметрамПакетов.ВесНеттоТаможня,
		|	ВТ_ПоПараметрамПакетов.ВесБруттоТаможня,
		|	ВТ_ПоПараметрамПакетов.Порядок,
		|	ВТ_ПоПараметрамПакетов.Период,
		|	NULL,
		|	NULL
		|ИЗ
		|	ВТ_ПоПараметрамПакетов КАК ВТ_ПоПараметрамПакетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВТ_Итог.Пакет.Наименование КАК НомерПакета,
		|	ВТ_Итог.Пакет КАК СерийныйНомер,
		|	ВТ_Итог.Порода КАК Порода,
		|	ВТ_Итог.Сорт КАК Сорт,
		|	ВТ_Итог.Порода.НаименованиеАнгл КАК ПородаА,
		|	ВТ_Итог.Объем КАК Объем,
		|	ВТ_Итог.КоличествоСостав КАК КоличествоСостав,
		|	ВТ_Итог.ВесНеттоТаможня КАК ВесНетто,
		|	ВТ_Итог.ВесБруттоТаможня КАК ВесБрутто,
		|	ВТ_Итог.Длина КАК Длина,
		|	ВТ_Итог.Сечение КАК Сечение,
		|	ВТ_ПериодУпаковки.Период КАК ПериодУпаковки,
		|	ВТ_Итог.Влажность КАК Влажность,
		|	ВТ_Итог.Сертификат КАК Сертификат,
		|	ВТ_Итог.Номенклатура КАК Номенклатура,
		|	ВТ_Итог.Характеристика КАК Характеристика,
		|	ВТ_Итог.ОбъемТаможня КАК ОбъемТаможня,
		|	ВТ_Итог.БоковаяДоска КАК БоковаяДоска,
		|	ВТ_Итог.Порядок КАК Порядок,
		|	ВТ_Итог.Плотность КАК Плотность,
		|	ВТ_Итог.ВесТары КАК ВесТары,
		|	ВТ_Итог.КоличествоСостав КАК Количество
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодУпаковки КАК ВТ_ПериодУпаковки
		|		ПО ВТ_Итог.Пакет = ВТ_ПериодУпаковки.Пакет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	ВТ_Итог.Период УБЫВ";
		
		Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаПиломатериал(Оперативно)

Функция ТекстЗапросаШпон()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Объем,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
	|			ТОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.Сертификат КАК Сертификат,
	|	алк_ОстаткиЗапасовОстатки.Номенклатура.Наименование + "" "" + алк_ПараметрыХарактеристик.Порода.Наименование КАК НаименованиеПродукта,
	|	алк_ОстаткиЗапасовОстатки.Номенклатура.ПредставлениеНаАнглийском + "" "" + алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК НаименованиеПродуктаАнгл,
	|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК Длина,
	|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК Ширина,
	|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК Толщина,
	|	алк_ПараметрыХарактеристик.Сорт.НаименовАнгл КАК Сорт,
	|	алк_ПроизводствоОборот.ДатаСмены КАК ДатаУпаковки,
	|	алк_ПроизводствоОборот.Бригада КАК Бригада,
	|	алк_ОстаткиЗапасовОстатки.Номенклатура КАК Номенклатура,
	|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
	|	алк_ПараметрыХарактеристик.Порода КАК Порода,
	|	алк_ПараметрыХарактеристик.Сорт КАК СортСсылка
	|ПОМЕСТИТЬ втИтогБезВеса
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ПроизводствоОборот КАК алк_ПроизводствоОборот
	|		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ПроизводствоОборот.СерийныйНомер
	|ГДЕ
	|	алк_ПроизводствоОборот.СерийныйНомер = &СерийныйНомер
	|	И алк_ПроизводствоОборот.Операция В (ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Упаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Переупаковка), ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.СборкаРазборкаПакета))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3 КАК ПлотностьКгМ3,
	|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг КАК ВесТарыКг,
	|	алк_ПлотностьНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ втПлотностьПриоритет
	|ИЗ
	|	РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	|			,
	|			(Номенклатура, Характеристика) В
	|				(ВЫБРАТЬ
	|					ВТ.Номенклатура,
	|					ВТ.Характеристика
	|				ИЗ
	|					втИтогБезВеса КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
	|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
	|	втИтогБезВеса.Характеристика,
	|	втИтогБезВеса.Номенклатура,
	|	2
	|ИЗ
	|	втИтогБезВеса КАК втИтогБезВеса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	|				,
	|				(Номенклатура, Порода, Сорт) В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура,
	|						ВТ.Порода,
	|						ВТ.СортСсылка КАК Сорт
	|					ИЗ
	|						втИтогБезВеса КАК ВТ)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	|		ПО втИтогБезВеса.Номенклатура = алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура
	|			И втИтогБезВеса.Порода = алк_ПлотностьНоменклатурыСрезПоследних.Порода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ПлотностьНоменклатурыСрезПоследних.ПлотностьКгМ3,
	|	алк_ПлотностьНоменклатурыСрезПоследних.ВесТарыКг,
	|	втИтогБезВеса.Характеристика,
	|	втИтогБезВеса.Номенклатура,
	|	3
	|ИЗ
	|	втИтогБезВеса КАК втИтогБезВеса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПлотностьНоменклатуры.СрезПоследних(
	|				,
	|				(Номенклатура, Порода) В
	|						(ВЫБРАТЬ
	|							ВТ.Номенклатура,
	|							ВТ.Порода
	|						ИЗ
	|							втИтогБезВеса КАК ВТ)
	|					И Сорт = ЗНАЧЕНИЕ(Справочник.Сорта.ПустаяСсылка)) КАК алк_ПлотностьНоменклатурыСрезПоследних
	|		ПО втИтогБезВеса.Номенклатура = алк_ПлотностьНоменклатурыСрезПоследних.Номенклатура
	|			И втИтогБезВеса.Порода = алк_ПлотностьНоменклатурыСрезПоследних.Порода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтогБезВеса.Объем,
	|	втИтогБезВеса.Количество,
	|	втИтогБезВеса.СерийныйНомер,
	|	втИтогБезВеса.Сертификат,
	|	втИтогБезВеса.НаименованиеПродукта,
	|	втИтогБезВеса.НаименованиеПродуктаАнгл,
	|	втИтогБезВеса.Длина,
	|	втИтогБезВеса.Ширина,
	|	втИтогБезВеса.Толщина,
	|	втИтогБезВеса.Сорт,
	|	втИтогБезВеса.ДатаУпаковки КАК ДатаСменыУпаковки,
	|	втИтогБезВеса.Бригада,
	|	ВЫРАЗИТЬ(втИтогБезВеса.Объем * ЕСТЬNULL(Плотность.ПлотностьКгМ3, 0) / 1000 КАК ЧИСЛО(15, 3)) КАК ВесНетто,
	|	ВЫРАЗИТЬ((втИтогБезВеса.Объем * ЕСТЬNULL(Плотность.ПлотностьКгМ3, 0) + ЕСТЬNULL(Плотность.ВесТарыКг, 0)) / 1000 КАК ЧИСЛО(15, 3)) КАК ВесБрутто
	|ИЗ
	|	втИтогБезВеса КАК втИтогБезВеса
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			втПлотностьПриоритет.ПлотностьКгМ3 КАК ПлотностьКгМ3,
	|			втПлотностьПриоритет.ВесТарыКг КАК ВесТарыКг,
	|			втПлотностьПриоритет.Характеристика КАК Характеристика,
	|			втПлотностьПриоритет.Номенклатура КАК Номенклатура,
	|			втПлотностьПриоритет.Приоритет КАК Приоритет
	|		ИЗ
	|			втПлотностьПриоритет КАК втПлотностьПриоритет
	|		ГДЕ
	|			(втПлотностьПриоритет.Номенклатура, втПлотностьПриоритет.Характеристика, втПлотностьПриоритет.Приоритет) В
	|					(ВЫБРАТЬ
	|						втПлотностьПриоритет.Номенклатура,
	|						втПлотностьПриоритет.Характеристика,
	|						МИНИМУМ(втПлотностьПриоритет.Приоритет) КАК Приоритет
	|					ИЗ
	|						втПлотностьПриоритет КАК втПлотностьПриоритет
	|					СГРУППИРОВАТЬ ПО
	|						втПлотностьПриоритет.Номенклатура,
	|						втПлотностьПриоритет.Характеристика)) КАК Плотность
	|		ПО втИтогБезВеса.Номенклатура = Плотность.Номенклатура
	|			И втИтогБезВеса.Характеристика = Плотность.Характеристика";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ТекстЗапросаПиломатериал(Оперативно)

Функция ТекстЗапросаШпонКусковой(Оперативно)
	
	Если Оперативно Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Наименование КАК НомерПакета,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК ПородаА,
		|	ВЫРАЗИТЬ(алк_ПараметрыПакетовОперативныйСрезПоследних.Объем КАК ЧИСЛО(15, 3)) КАК Объем,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.КоличествоСостав КАК Количество,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесНеттоТаможня КАК ВесНетто,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесБруттоТаможня КАК ВесБрутто,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ПериодУпаковки,
		|	алк_ПараметрыХарактеристик.Порода КАК ПородаСсылка,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ДатаСмены,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Смена,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Сертификат
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовОперативныйСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &Ссылка";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СерийныеНомера.Наименование КАК НомерПакета,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК ПородаА,
		|	ВЫРАЗИТЬ(алк_ПараметрыПакетовСрезПоследних.Объем КАК ЧИСЛО(15, 3)) КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК Количество,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНетто,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБрутто,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ДатаСмены,
		|	алк_ПараметрыХарактеристик.Порода КАК ПородаСсылка,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &Ссылка";
		            	
	КонецЕсли; 

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаШпонКусковой(Оперативно)

Функция ТекстЗапросаКарандаши(Оперативно)
	
	Если Оперативно Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Наименование КАК НомерПакета,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК ПородаА,
		|	ВЫРАЗИТЬ(алк_ПараметрыПакетовОперативныйСрезПоследних.Объем КАК ЧИСЛО(15, 3)) КАК Объем,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.КоличествоСостав КАК Количество,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесНеттоТаможня КАК ВесНетто,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ВесБруттоТаможня КАК ВесБрутто,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ПериодУпаковки,
		|	алк_ПараметрыХарактеристик.Порода КАК ПородаСсылка,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.ДатаСмены,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Смена,
		|	алк_ПараметрыПакетовОперативныйСрезПоследних.Сертификат
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(, Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)) КАК алк_ПараметрыПакетовОперативныйСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовОперативныйСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &Ссылка"; 		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СерийныеНомера.Наименование КАК НомерПакета,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(алк_ПараметрыХарактеристик.Порода) КАК Порода,
		|	ПРЕДСТАВЛЕНИЕ(алк_ПараметрыХарактеристик.Сорт) КАК Сорт,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК ПородаА,
		|	ВЫРАЗИТЬ(алк_ПараметрыПакетовСрезПоследних.Объем КАК ЧИСЛО(15, 3)) КАК Объем,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК Количество,
		|	алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНетто,
		|	алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБрутто,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ПараметрыХарактеристик.Сечение КАК Сечение,
		|	алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ДатаСмены,
		|	алк_ПараметрыХарактеристик.Порода КАК ПородаСсылка,
		|	алк_ПараметрыПакетовСрезПоследних.СертификатFSC,
		|	алк_ПараметрыПакетовСрезПоследних.Сертификат
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|		ПО СерийныеНомера.Ссылка = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	СерийныеНомера.Ссылка = &Ссылка";	
		
	КонецЕсли; 

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаКарандаши(Оперативно)

Функция ТекстЗапросаФанераИД()

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.Период КАК Период,
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	НРЕГ(алк_ПараметрыХарактеристик.Порода.Наименование) КАК Порода,
		|	алк_ПараметрыХарактеристик.Порода.НаименованиеАнгл КАК ПородаАнгл,
		|	алк_ПараметрыХарактеристик.Сорт.НаименованиеДляПечати КАК Сорт,
		|	алк_ПараметрыХарактеристик.Сорт.НаименовАнгл КАК СортАнгл,
		|	алк_ПараметрыХарактеристик.Поверхность.НаименованиеДляПечати КАК Поверхность,
		|	алк_ПараметрыХарактеристик.Поверхность.НаименованиеДляПечатиАнгл КАК ПоверхностьАнгл,
		|	алк_ПараметрыХарактеристик.Сечение.ТолщинаММ КАК ТолщинаММ,
		|	алк_ПараметрыХарактеристик.Сечение.ШиринаММ КАК ШиринаММ,
		|	алк_ПараметрыХарактеристик.Длина.ДлинаММ КАК ДлинаММ,
		|	алк_ОстаткиЗапасовОбороты.КоличествоОборот КАК КоличествоОборот,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(алк_ОстаткиЗапасовОбороты.КоличествоОборот / алк_ПараметрыХарактеристик.Объем)
		|	КОНЕЦ КАК КоличествоШтук
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(, , Регистратор, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО алк_ОстаткиЗапасовОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(вт.Период) КАК Период
		|ПОМЕСТИТЬ МинПериод
		|ИЗ
		|	вт КАК вт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	МинПериод.Период КАК Период,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.ЭмиссияE, 0) КАК ЭмиссияE,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.ЭмиссияM, 0) КАК ЭмиссияM,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.ЭмиссияF, 0) КАК ЭмиссияF,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.Марка, """") КАК Марка,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.МаркаАнгл, """") КАК МаркаАнгл,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.Адгезия, """") КАК Адгезия,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.АдгезияАнгл, """") КАК АдгезияАнгл,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.Прочность, 0) КАК Прочность,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.КоэффициентЭффективногоПоперечногоСечения, 0) КАК КоэффициентЭффективногоПоперечногоСечения,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.Класс, 0) КАК Класс,
		|	ЕСТЬNULL(алк_НормыРасходаИВыпуска.Плотность, 0) КАК Плотность
		|ПОМЕСТИТЬ НормыРасходаИВыпуска
		|ИЗ
		|	МинПериод КАК МинПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_НормыРасходаИВыпуска КАК алк_НормыРасходаИВыпуска
		|		ПО МинПериод.Период >= алк_НормыРасходаИВыпуска.ДатаНачалаДействия
		|			И МинПериод.Период <= алк_НормыРасходаИВыпуска.ДатаОкончанияДействия
		|ГДЕ
		|	алк_НормыРасходаИВыпуска.Проведен
		|	И алк_НормыРасходаИВыпуска.Характеристика В
		|			(ВЫБРАТЬ
		|				вт.Характеристика КАК Характеристика
		|			ИЗ
		|				вт КАК вт)
		|	И алк_НормыРасходаИВыпуска.Операция = &Операция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(алк_ПроизводствоОборотОбороты.СерийныйНомер) КАК СерийныйНомер,
		|	МАКСИМУМ(алк_ПроизводствоОборотОбороты.ПериодСекунда) КАК ПериодСекунда
		|ПОМЕСТИТЬ ВТ_СборкаРазборка
		|ИЗ
		|	РегистрНакопления.алк_ПроизводствоОборот.Обороты(
		|			,
		|			,
		|			Авто,
		|			СерийныйНомер = &СерийныйНомер
		|				И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.СборкаРазборкаПакета)
		|				И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)) КАК алк_ПроизводствоОборотОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НормыРасходаИВыпуска.Период КАК ДатаУпаковки,
		|	вт.СерийныйНомер КАК СерийныйНомер,
		|	вт.Порода КАК Порода,
		|	вт.ПородаАнгл КАК ПородаАнгл,
		|	вт.Сорт КАК Сорт,
		|	вт.СортАнгл КАК СортАнгл,
		|	вт.Поверхность КАК Поверхность,
		|	вт.ПоверхностьАнгл КАК ПоверхностьАнгл,
		|	вт.ТолщинаММ КАК ТолщинаММ,
		|	вт.ШиринаММ КАК ШиринаММ,
		|	вт.ДлинаММ КАК ДлинаММ,
		|	вт.КоличествоОборот КАК Объем,
		|	вт.КоличествоШтук КАК КоличествоШтук,
		|	НормыРасходаИВыпуска.ЭмиссияE КАК ЭмиссияE,
		|	НормыРасходаИВыпуска.ЭмиссияM КАК ЭмиссияM,
		|	НормыРасходаИВыпуска.ЭмиссияF КАК ЭмиссияF,
		|	НормыРасходаИВыпуска.Марка КАК Марка,
		|	НормыРасходаИВыпуска.МаркаАнгл КАК МаркаАнгл,
		|	НормыРасходаИВыпуска.Адгезия КАК Адгезия,
		|	НормыРасходаИВыпуска.АдгезияАнгл КАК АдгезияАнгл,
		|	НормыРасходаИВыпуска.Прочность КАК Прочность,
		|	НормыРасходаИВыпуска.КоэффициентЭффективногоПоперечногоСечения КАК КоэффициентЭффективногоПоперечногоСечения,
		|	НормыРасходаИВыпуска.Класс КАК Класс,
		|	ОКР(НормыРасходаИВыпуска.Плотность * вт.КоличествоОборот / 1000, 3) КАК Вес,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	НормыРасходаИВыпуска КАК НормыРасходаИВыпуска
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО НормыРасходаИВыпуска.Период = вт.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СборкаРазборка.ПериодСекунда,
		|	вт.СерийныйНомер,
		|	вт.Порода,
		|	вт.ПородаАнгл,
		|	вт.Сорт,
		|	вт.СортАнгл,
		|	вт.Поверхность,
		|	вт.ПоверхностьАнгл,
		|	вт.ТолщинаММ,
		|	вт.ШиринаММ,
		|	вт.ДлинаММ,
		|	вт.КоличествоОборот,
		|	вт.КоличествоШтук,
		|	NULL,
		|	NULL,
		|	0,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	2
		|ИЗ
		|	ВТ_СборкаРазборка КАК ВТ_СборкаРазборка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ВТ_СборкаРазборка.СерийныйНомер = вт.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Итог.ДатаУпаковки КАК ДатаУпаковки,
		|	ВТ_Итог.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_Итог.Порода КАК Порода,
		|	ВТ_Итог.ПородаАнгл КАК ПородаАнгл,
		|	ВТ_Итог.Сорт КАК Сорт,
		|	ВТ_Итог.СортАнгл КАК СортАнгл,
		|	ВТ_Итог.Поверхность КАК Поверхность,
		|	ВТ_Итог.ПоверхностьАнгл КАК ПоверхностьАнгл,
		|	ВТ_Итог.ТолщинаММ КАК ТолщинаММ,
		|	ВТ_Итог.ШиринаММ КАК ШиринаММ,
		|	ВТ_Итог.ДлинаММ КАК ДлинаММ,
		|	ВТ_Итог.Объем КАК Объем,
		|	ВТ_Итог.КоличествоШтук КАК КоличествоШтук,
		|	ВТ_Итог.ЭмиссияE КАК ЭмиссияE,
		|	ВТ_Итог.ЭмиссияM КАК ЭмиссияM,
		|	ВТ_Итог.ЭмиссияF КАК ЭмиссияF,
		|	ВТ_Итог.Марка КАК Марка,
		|	ВТ_Итог.МаркаАнгл КАК МаркаАнгл,
		|	ВТ_Итог.Адгезия КАК Адгезия,
		|	ВТ_Итог.АдгезияАнгл КАК АдгезияАнгл,
		|	ВТ_Итог.Прочность КАК Прочность,
		|	ВТ_Итог.КоэффициентЭффективногоПоперечногоСечения КАК КоэффициентЭффективногоПоперечногоСечения,
		|	ВТ_Итог.Класс КАК Класс,
		|	ВТ_Итог.Вес КАК Вес,
		|	ВТ_Итог.Приоритет КАК Приоритет
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет"; 
	
	Возврат ТекстЗапроса;
		
КонецФункции

#КонецОбласти 

&НаСервере
Функция Транслит(Вход) 
	Если Вход = "ШП" Тогда
		Выход = "SH";
	Иначе
		Коды = Новый Соответствие;
	    Коды.Вставить("ё","yo");
	    Коды.Вставить("Ё","Yo");
	    Нач = КодСимвола("А");
	    Англ = "A" "B" "V" "G" "D" "E" "Zh" "Z" "I" "Y" "K" "L" "M" "N" "O" "P" "R" "S" "T" "U" "F" "Kh" "Ts" "Ch" "Sh" "Shch" "" "Y" "" "E" "Yu" "Ya" "a" "b" "v" "g" "d" "e" "zh" "z" "i" "y" "k" "l" "m" "n" "o" "p" "r" "s" "t" "u" "f" "kh" "ts" "ch" "sh" "shch" "" "y" "" "e" "yu" "ya";
	    Для К = Нач по КодСимвола("я") Цикл
	        Коды.Вставить(Символ(К), СтрПолучитьСтроку(Англ, К - Нач + 1));
	    КонецЦикла;
	    Выход = "";
	    Для К=1 по СтрДлина(Вход) Цикл
	        Бкв = Сред(Вход,К,1);
	        Зн = Коды.Получить(Бкв);
	        Выход = Выход + ?(Зн = Неопределено, Бкв, Зн);
		КонецЦикла;
	КонецЕсли;
    Возврат Выход;
КонецФункции


Функция ПолучитьРазрешенныйУчастокПФМ() 
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	алк_Участки.Ссылка
	                      |ИЗ
	                      |	Справочник.алк_Участки КАК алк_Участки
	                      |ГДЕ
	                      |	алк_Участки.Код В (""000000004"", ""000000026"", ""000000044"")");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции












































