
&НаКлиенте
Процедура Подбор(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Номенклатура);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	Форма = ОткрытьФорму(СтрокаКоманды, ПараметрыФормы, Элементы.СписокРезультат);
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаКоманды = Параметры.СтрокаКоманды;
	
	Если СтрНайти(СтрокаКоманды, "ХарактеристикиНоменклатуры") Тогда	
		Номенклатура  = Параметры.Номенклатура; 
	Иначе
		Номенклатура  = Параметры.Номенклатура.КатегорияНоменклатуры;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередатьСписок(Команда)
	
	СписокСсылок = Новый СписокЗначений;
	Для каждого стрРезультат Из Объект.СписокРезультат Цикл
		СписокСсылок.Добавить(стрРезультат.СпрСсылка);	
	КонецЦикла; 
	
	ОповеститьОВыборе(СписокСсылок);   
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРезультатОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура("СпрСсылка", ВыбранноеЗначение); 
	
	МассивНайденых = Объект.СписокРезультат.НайтиСтроки(ПараметрыОтбора);
	Если МассивНайденых.Количество() <> 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	НоваяСтрока = Объект.СписокРезультат.Добавить();
	НоваяСтрока.СпрСсылка = ВыбранноеЗначение;
	
КонецПроцедуры
