
Процедура ИнициализироватьДанныеДокумента(Документ, ДополнительныеСвойства) Экспорт
	
	ДополнительныеСвойства.Вставить("ПлановыеПоказателиПроизводства", ПолучитьПлановыеПоказателиПроизводства(Документ));
	
КонецПроцедуры

Функция ПолучитьПлановыеПоказателиПроизводства(Документ)
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	алк_УстановкаПлановыхПоказателейПоказатели.Период,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Смена,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Показатель,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Значение,
	|	алк_УстановкаПлановыхПоказателейПоказатели.Ссылка.ЭтоБюджет,
	|	ИСТИНА КАК Активность
	|ИЗ
	|	Документ.алк_УстановкаПлановыхПоказателей.Показатели КАК алк_УстановкаПлановыхПоказателейПоказатели
	|ГДЕ
	|	алк_УстановкаПлановыхПоказателейПоказатели.Ссылка = &Документ");
	Запрос.УстановитьПараметр("Документ", Документ);
	ТаблицаРегистра = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРегистра;

КонецФункции

Процедура ДобавитьДвижениеРегистраПлановыеПоказателиПроизводства(Документ, ДополнительныеСвойства, Отказ) Экспорт
	
	Если ДополнительныеСвойства.ПлановыеПоказателиПроизводства.Количество() = 0 тогда
		Сообщить("Не указаны производственные показатели, либо за выбранный период нет рабочих дней");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Движения = Документ.Движения.алк_ПлановыеПоказателиПроизводства;
	Движения.Записывать = Истина;
	
	Движения.Загрузить(ДополнительныеСвойства.ПлановыеПоказателиПроизводства);

КонецПроцедуры	
