
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Документы.алк_УстановкаПлановыхПоказателей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	Документы.алк_УстановкаПлановыхПоказателей.ДобавитьДвижениеРегистраПлановыеПоказателиПроизводства(ЭтотОбъект, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры
