&НаКлиенте
Процедура ДляВсехПородПриИзменении(Элемент)
	УстановитьВидимостьПород();
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьКатегориюПоНоменклатуре();
	УстановитьВидимостьПород();
КонецПроцедуры

Процедура УстановитьВидимостьПород()
	Элементы.Породы.Видимость = не Объект.ДляВсехПород;
	Если Объект.ДляВсехПород тогда
		Объект.Породы.Очистить();
	Конецесли;
КонецПроцедуры

Процедура ЗаполнитьКатегориюПоНоменклатуре()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	Номенклатура.КатегорияНоменклатуры
	              |ИЗ
	              |	Справочник.Номенклатура КАК Номенклатура
	              |ГДЕ
	              |	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.КатегорияНоменклатуры = Выборка.КатегорияНоменклатуры;
		Возврат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ЗаполнитьКатегориюПоНоменклатуре();
КонецПроцедуры
