
&НаСервере
Процедура ЗагрузитьРапортаНаСервере()
	
	
	// Нач мод [Пакушев И.С.] [21.06.2018] 
	// Обращение № [0000000000] [ТекстЗаявки]
	// Стало
	РфпСерверРегламентные.алкЗагрузкаРапортовШпон();
	// Было
	
	//	Для й = 1 По 3 Цикл
	//		
	//		Если й = 1 Тогда
	//			
	//			тРапортаЛущение = новый ТаблицаЗначений;
	//			
	//			Попытка
	//				
	//				тРапортаЛущение = ЗначениеИзФайла("\\rfp04-srv023\exchange\ALK_TO_ALogK_Raport1.txt");
	//				
	//			Исключение
	//				
	//				Продолжить;
	//				
	//			Конецпопытки;
	//			
	//			Если тРапортаЛущение.Количество() = 0 Тогда
	//				
	//				Возврат;
	//				
	//			КонецЕсли; 
	//			
	//			Для каждого стрРапорт Из тРапортаЛущение Цикл
	//				
	//				НеобходимаяСсылка = Документы.рфп_РапортЛущение.ПолучитьСсылку(Новый УникальныйИдентификатор(стрРапорт.УИД));
	//				
	//				Если НеобходимаяСсылка.ПолучитьОбъект() <> Неопределено Тогда
	//					
	//					ОбъектРапорт = НеобходимаяСсылка.ПолучитьОбъект();
	//					
	//				Иначе
	//					
	//					ОбъектРапорт = Документы.рфп_РапортЛущение.СоздатьДокумент();
	//					
	//					ОбъектРапорт.УстановитьСсылкуНового(НеобходимаяСсылка);
	//					
	//				КонецЕсли; 
	//				
	//				ОбъектРапорт.Дата = стрРапорт.Дата;
	//				ОбъектРапорт.Номер = стрРапорт.Номер;
	//				ОбъектРапорт.ДатаСмены = стрРапорт.ДатаСмены;
	//				ОбъектРапорт.Смена = ?(стрРапорт.Смена = "день", Перечисления.Смены.смена_8_20, Перечисления.Смены.смена_20_8);
	//				
	//				ОбъектРапорт.ОбъемЩепы = стрРапорт.Объем;
	//				
	//				Попытка
	//					ОбъектРапорт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//				Исключение
	//					//ОписаниеОшибки()
	//				КонецПопытки; 
	//				
	//			КонецЦикла;	 
	//			
	//		ИначеЕсли й = 2  Тогда 
	//			
	//			тРапортаРебро = новый ТаблицаЗначений;
	//			
	//			Попытка
	//				
	//				тРапортаРебро = ЗначениеИзФайла("\\rfp04-srv023\exchange\ALK_TO_ALogK_Raport2.txt");
	//				
	//			Исключение
	//				
	//				Возврат;
	//				
	//			Конецпопытки;
	//			
	//			Если тРапортаРебро.Количество() = 0 Тогда
	//				
	//				Продолжить;
	//				
	//			КонецЕсли; 
	//			
	//			Для каждого стрРапорт Из тРапортаРебро Цикл
	//				
	//				НеобходимаяСсылка = Документы.рфп_РапортРебросклей.ПолучитьСсылку(Новый УникальныйИдентификатор(стрРапорт.УИД));
	//				
	//				Если НеобходимаяСсылка.ПолучитьОбъект() <> Неопределено Тогда
	//					
	//					ОбъектРапорт = НеобходимаяСсылка.ПолучитьОбъект();
	//					
	//				Иначе
	//					
	//					ОбъектРапорт = Документы.рфп_РапортРебросклей.СоздатьДокумент();
	//					
	//					ОбъектРапорт.УстановитьСсылкуНового(НеобходимаяСсылка);
	//					
	//				КонецЕсли; 
	//				
	//				ОбъектРапорт.Дата = стрРапорт.Дата;
	//				ОбъектРапорт.Номер = стрРапорт.Номер;
	//				ОбъектРапорт.ДатаСмены = стрРапорт.ДатаСмены;
	//				ОбъектРапорт.Смена = ?(стрРапорт.Смена = "день", Перечисления.Смены.смена_8_20, Перечисления.Смены.смена_20_8);
	//				ОбъектРапорт.ОбъемЩепы = стрРапорт.Объем;
	//				
	//				Попытка
	//					ОбъектРапорт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//				Исключение
	//					//ОписаниеОшибки()
	//				КонецПопытки; 
	//				
	//			КонецЦикла;
	//			
	//		ИначеЕсли й = 3  Тогда 
	//			
	//			тРапортаОкорка = новый ТаблицаЗначений;
	//			
	//			Попытка
	//				
	//				тРапортаОкорка = ЗначениеИзФайла("\\rfp04-srv023\exchange\ALK_TO_ALogK_Raport3.txt");
	//				
	//			Исключение
	//				
	//				Возврат;
	//				
	//			Конецпопытки;
	//			
	//			Если тРапортаОкорка.Количество() = 0 Тогда
	//				
	//				Продолжить;
	//				
	//			КонецЕсли; 
	//			
	//			Для каждого стрРапорт Из тРапортаОкорка Цикл
	//				
	//				НеобходимаяСсылка = Документы.рфп_РапортОкорка.ПолучитьСсылку(Новый УникальныйИдентификатор(стрРапорт.УИД));
	//				
	//				Если НеобходимаяСсылка.ПолучитьОбъект() <> Неопределено Тогда
	//					
	//					ОбъектРапорт = НеобходимаяСсылка.ПолучитьОбъект();
	//					
	//				Иначе
	//					
	//					ОбъектРапорт = Документы.рфп_РапортОкорка.СоздатьДокумент();
	//					
	//					ОбъектРапорт.УстановитьСсылкуНового(НеобходимаяСсылка);
	//					
	//				КонецЕсли; 
	//				
	//				ОбъектРапорт.Дата = стрРапорт.Дата;
	//				ОбъектРапорт.Номер = стрРапорт.Номер;
	//				ОбъектРапорт.ДатаСмены = стрРапорт.ДатаСмены;
	//				ОбъектРапорт.Смена = ?(стрРапорт.Смена = "день", Перечисления.Смены.смена_8_20, Перечисления.Смены.смена_20_8);
	//				ОбъектРапорт.ОбъемКоры = стрРапорт.Объем;
	//				
	//				Попытка
	//					ОбъектРапорт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//				Исключение
	//					//ОписаниеОшибки()
	//				КонецПопытки; 
	//				
	//			КонецЦикла;
	
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	
	// Кон мод [Пакушев И.С.] [21.06.2018]
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРапорта(Команда)
	ЗагрузитьРапортаНаСервере();
КонецПроцедуры
