
Функция ПолучитьЗначениеДополнительногоРеквизитаПакета(СерийныйНомер, НаименованиеРеквизита) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Период КАК Период,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.ВидШпона КАК ВидШпона,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск КАК Припуск,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СлойДревесины КАК СлойДревесины,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СортированныйПакет КАК СортированныйПакет,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.УчастокВыпуска КАК УчастокВыпуска,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Досушка КАК Досушка,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Переупаковка КАК Переупаковка,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.БоковаяДоска КАК БоковаяДоска,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Документ КАК Документ,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Габарит КАК Габарит,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|ГДЕ
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер = &СерийныйНомер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи[НаименованиеРеквизита]; 
	КонецЦикла;
	
КонецФункции  

Процедура ДобавитьЗаписьВРегистр(Структура) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.алк_ДополнительныеПараметрыПакетов.СоздатьМенеджерЗаписи();  
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Структура);
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры     
//удаление записи по документу
Процедура УдалитьЗаписьВРегистре(СерийныйНомер, Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.алк_ДополнительныеПараметрыПакетов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СерийныйНомер.Установить(СерийныйНомер);
	
	НаборЗаписей.Прочитать(); 
	
	ЗаписиДляУдаления = Новый Массив; 
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись ИЗ НаборЗаписей Цикл 
		Если Запись.Документ = Документ Тогда 
			ЗаписиДляУдаления.Добавить(Запись);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаписиДляУдаления.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Удаления ИЗ ЗаписиДляУдаления Цикл 
		НаборЗаписей.Удалить(Удаления);
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры