
&НаКлиенте
Процедура АддендумыПредставлениеТовараНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ПараметрыФормы.Вставить("Аддендум"			, Элементы.Аддендумы.ТекущиеДанные.Аддендум);
		
	ОткрытьФорму("Документ.алк_ЗаказНаПроизводство.Форма.ФормаВыбораСтроки", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 	
	
	Если ИсточникВыбора.ИмяФормы = "Документ.алк_ЗаказНаПроизводство.Форма.ФормаВыбораСтроки"  Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда  			
			ЗаполнитьЗначенияСвойств(Элементы.Аддендумы.ТекущиеДанные, ВыбранноеЗначение);				
		КонецЕсли;  	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбщийОбъемАддендума(Аддендум) 
	
	Количество = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АддендумыТовары.Ссылка КАК Ссылка,
		|	СУММА(алк_АддендумыТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|ГДЕ
		|	алк_АддендумыТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_АддендумыТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Аддендум);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  		
		Количество = ВыборкаДетальныеЗаписи.Количество; 	
	КонецЦикла;
	
	Возврат Количество;	

КонецФункции

&НаКлиенте
Процедура АддендумыАддендумПриИзменении(Элемент)	
	
	ТекущиеДанные = Элементы.Аддендумы.ТекущиеДанные;
	
	ТекущиеДанные.ОбщийОбъем = ПолучитьОбщийОбъемАддендума(ТекущиеДанные.Аддендум);
	ТекущиеДанные.ИдентификаторТовара = "";
	ТекущиеДанные.ПредставлениеТовара = "";
	ТекущиеДанные.КоличествоВПроизводство = 0;	
	
КонецПроцедуры
