

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРапортРебро, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рфп_РапортРебросклей.ОбъемЩепы КАК Объем,
		|	&Номенклатура,
		|	рфп_РапортРебросклей.ДатаСмены,
		|	рфп_РапортРебросклей.Смена,
		|	&Период,
		|	&ВидДвижения,
		|	ЗНАЧЕНИЕ(Перечисление.алк_АналитикаЩепа.Ребросклей) КАК Аналитика
		|ИЗ
		|	Документ.рфп_РапортРебросклей КАК рфп_РапортРебросклей
		|ГДЕ
		|	рфп_РапортРебросклей.Ссылка = &Ссылка";
		
		
		Запрос.УстановитьПараметр("Период", ДокументСсылкаРапортРебро.Дата);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРапортРебро.Ссылка);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("Номенклатура", РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(Справочники.КатегорииНоменклатуры.Щепа));
		
		МассивРезультатов = Запрос.ВыполнитьПакет();	
	
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтходы", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
		
#КонецЕсли
