
#Область ОбработкаКомманд

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(СДаты)
	
	Данные = РфпСерверРегламентные.ПолучитьДанные_КомСоединение(СДаты);	
	
	Если Данные = Неопределено Тогда
		
		Возврат;
		
	Конецесли;
	
	тВагоны = Данные.тВагоны;
	тАвто   = Данные.тАвто;
	
	Если твагоны.Количество() = 0 и тАвто.Количество() = 0 Тогда
		
		Возврат;
		
	Конецесли;
	
	РфпСерверРегламентные.ЗагрузитьДокументы_рфп_ОтгрузкаВагона(Данные);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ЗагрузитьДанныеНаСервере(СДаты);
КонецПроцедуры

	
#КонецОбласти 



