#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
		
		ТекстЗапроса = ТекстЗапросаДанныеДокумента();     
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиКамерыГТО", МассивРезультатовЗапроса[0].Выгрузить());  
		//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВремяПропарки", МассивРезультатовЗапроса[1].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СервисныеПроцедурыИФункции
	
	Функция ТекстЗапросаДанныеДокумента()
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка.ДатаНачалаЗагрузки КАК Период,
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка КАК Регистратор,
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка.Склад КАК СтруктурнаяЕдиница,
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка.Камера КАК КамераПропарки,
		|	алк_ЗагрузкаВКамеруГТОСостав.Порода КАК Порода,
		|	алк_ЗагрузкаВКамеруГТОСостав.Длина КАК Длина,
		|	алк_ЗагрузкаВКамеруГТОСостав.Сорт КАК Сотр,
		|	алк_ЗагрузкаВКамеруГТОСостав.Градация КАК Градация,
		|	алк_ЗагрузкаВКамеруГТОСостав.Объем КАК Количество,
		|	&ВидДвиженияПриход КАК ВидДвижения
		|ИЗ
		|	Документ.алк_ЗагрузкаВКамеруГТО.Состав КАК алк_ЗагрузкаВКамеруГТОСостав
		|ГДЕ
		|	алк_ЗагрузкаВКамеруГТОСостав.Ссылка = &Ссылка";
		
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	#КонецОбласти   
	
Процедура ЗаполнитьНормативЗагрузкиПропарки(Состав,ДатаНачалаЗагрузки,ДатаОкончанияЗагрузки,ДатаНачалаПропарки,ДатаОкончанияЗагрузкиНорматив,ДатаОкончанияПропаркиНорматив) Экспорт 
	
	Если Состав.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ДатаНачалаЗагрузки) Тогда  
		ДатаОкончанияЗагрузкиНорматив = "";
		ДатаОкончанияПропаркиНорматив = "";
		Возврат;
	КонецЕсли;
	
	ГрадацияДокумента = Состав[0].Градация;
	
	Если НЕ ЗначениеЗаполнено(ГрадацияДокумента) Тогда 
		ДатаОкончанияЗагрузкиНорматив = "";
		ДатаОкончанияПропаркиНорматив = "";
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
	|ПОМЕСТИТЬ ВТ_Сезон
	|ИЗ
	|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_НормативыПропаркиСрезПоследних.Градация,
	|	алк_НормативыПропаркиСрезПоследних.Сезон,
	|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
	|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
	|ИЗ
	|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
	|			&ДатаСреза,
	|			Градация В (&ГрадацииДокумента)
	|				И Сезон В
	|					(ВЫБРАТЬ
	|						ВТ_Сезон.Сезон
	|					ИЗ
	|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацияДокумента);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаНачалаЗагрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		ДатаОкончанияЗагрузкиНорматив = ДатаНачалаЗагрузки + Выборка.НормативЗагрузки * 3600;    
		ДатаОкончанияПропаркиНорматив = ДатаНачалаПропарки + Выборка.НормативПропарки * 3600;
	КонецЦикла;  
	
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПропарки) Тогда
		ДатаОкончанияПропаркиНорматив = "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияЗагрузки) И НЕ ДатаНачалаПропарки = Дата(1,1,1) Тогда 
		ДатаОкончанияЗагрузки = ДатаНачалаПропарки - 1;
	КонецЕсли;
			
КонецПроцедуры

	
#КонецЕсли
