#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["АктПередачи"].Рекомендуемый = Истина;
	
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Период = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	//Отпустил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	//Получил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	Отпустил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	Получил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;
	
	//Проверим параметры периода
	Если НЕ Период.ДатаНачала = Дата(1,1,1)
		И НЕ Период.ДатаОкончания = Дата(1,1,1)
		И Период.ДатаНачала > Период.ДатаОкончания Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ru = 'Дата начала периода не должна превышать дату окончания.'");
		
		Возврат;
		
	КонецЕсли;
	
	Если Настройки.ПараметрыДанных.Элементы.Найти("ПараметрВарианта").Значение = "1" Тогда 
		ТабличныйДокумент = Сформировать(Период, Отпустил, Получил);
	ИначеЕсли Настройки.ПараметрыДанных.Элементы.Найти("ПараметрВарианта").Значение = "2" Тогда 
		ТабличныйДокумент = СформироватьПоДиаметрам(Период, Отпустил, Получил);
	Иначе
		ТабличныйДокумент = СформироватьПоДиаметрамБезСортов(Период, Отпустил, Получил);
	КонецЕсли;
	ДокументРезультат.Вывести(ТабличныйДокумент);
	ДокументРезультат.ФиксацияСверху = ТабличныйДокумент.ФиксацияСверху;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["АктПередачи"].Теги = НСТР("ru = 'Акт передачи'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["АктПередачи"].СвязанныеПоля, "Контрагент", "Справочник.Контрагенты");
	
КонецПроцедуры

Функция Сформировать(Период, Отпустил, Получил)
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	
	//2018 06 27 есть регистр алк_МатериалыЗатратыВыпуска.
	//В нем недостаточно данных. Поэтому формируем по документам
	//Целесообразность регистра не очевидна.
	//Или отказаться от него и реализовать учет на регистре ЗапасыОрганизации.
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Штабель КАК Штабель,
	|	ВложенныйЗапрос.Материал КАК Материал,
	|	ЕСТЬNULL(алк_ГрадацииСечений.Градация, ВложенныйЗапрос.Сечение) КАК Сечение,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем,
	|	ВложенныйЗапрос.Сертификат КАК Сертификат
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Штабель,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """") КАК Материал,
	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|		СУММА(алк_СборкаЗапасовЗапасы.Объем) КАК Объем,
	|		алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат
	|	ИЗ
	|		Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_СборкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ОсновныеОбъекты КАК алк_ОсновныеОбъекты
	|			ПО алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов = алк_ОсновныеОбъекты.Значение
	|				И (алк_ОсновныеОбъекты.ВидОбъекта = ЗНАЧЕНИЕ(Справочник.алк_ВидыОбъектов.УчастокСортированныхЛМ))
	|	ГДЕ
	|		алк_СборкаЗапасовЗапасы.Ссылка.Проведен
	|		И алк_СборкаЗапасовЗапасы.Ссылка.Дата >= &НачалоПериода
	|		И (алк_СборкаЗапасовЗапасы.Ссылка.Дата <= &КонецПериода
	|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов,
	|		алк_СборкаЗапасовЗапасы.Сертификат,
	|		алк_ПараметрыХарактеристик.Сечение,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """")) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
	|		ПО ВложенныйЗапрос.Сечение = алк_ГрадацииСечений.Сечение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Штабель,
	|	ВложенныйЗапрос.Материал,
	|	ВложенныйЗапрос.Сертификат,
	|	ЕСТЬNULL(алк_ГрадацииСечений.Градация, ВложенныйЗапрос.Сечение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штабель,
	|	Материал,
	|	Сечение
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	Сертификат
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСертификат = Макет.ПолучитьОбласть("Сертификат");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	//ОбластьЗаголовок.Параметры.Валюта = Строка(ПараметрВалюта);
	//ОбластьЗаголовок.Параметры.Контрагент = Контрагент;
	//Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
	//	ОбластьЗаголовок.Параметры.Период = НСтр("ru = 'весь период работы'");
	//Иначе
	//	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(Период.ДатаНачала, КонецПериода);
	//КонецЕсли; 
	
	
	ОбластьЗаголовок.Параметры.Номер = Формат(Период.ДатаНачала,"ДФ=dMM");
	ОбластьЗаголовок.Параметры.Дата = Формат(КонецПериода,"ДФ='dd MMMM yyyy'");
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Вывести(ОбластьШапка);
	
	нпп = 0;
	
	ОбщиеИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщиеИтоги.Следующий();
	стр = ОбщиеИтоги.Выбрать();
	Пока стр.Следующий() Цикл
		нпп = нпп + 1;
		ОбластьСтрока.Параметры.Заполнить(стр);
		ОбластьСтрока.Параметры.нпп = нпп;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьСертификат.Параметры.Заполнить(ОбщиеИтоги);
	
	Сертификат = "" + ОбщиеИтоги.Сертификат;
		
	Если Найти(Сертификат, "controlled") Тогда
		Сертификат = "PEFC controlled sources";		
	ИначеЕсли Найти(Сертификат, "PEFC") Тогда
		Сертификат = "100% " + Сертификат;	
	КонецЕсли; 
	
	ОбластьСертификат.Параметры.Сертификат = Сертификат;
	
	Результат.Вывести(ОбластьСертификат);
	
	ОбластьПодвал.Параметры.Заполнить(ОбщиеИтоги);
	Результат.Вывести(ОбластьПодвал);

	ОбластьПодписи.Параметры.ОтпустилДолжность = Отпустил.Должность;
	ОбластьПодписи.Параметры.ОтпустилФИО = Отпустил.РасшифровкаПодписи;
	ОбластьПодписи.Параметры.ПолучилДолжность = Получил.Должность;
	ОбластьПодписи.Параметры.ПолучилФИО = Получил.РасшифровкаПодписи;
	
	Результат.Вывести(ОбластьПодписи);
	
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьПоДиаметрам(Период, Отпустил, Получил)
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	
	//2018 06 27 есть регистр алк_МатериалыЗатратыВыпуска.
	//В нем недостаточно данных. Поэтому формируем по документам
	//Целесообразность регистра не очевидна.
	//Или отказаться от него и реализовать учет на регистре ЗапасыОрганизации.
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Штабель КАК Штабель,
	|	ВложенныйЗапрос.Материал КАК Материал,
	|	ВложенныйЗапрос.Сечение КАК Сечение,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем,
	|	ВложенныйЗапрос.Сертификат КАК Сертификат
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Штабель,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """") КАК Материал,
	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|		СУММА(алк_СборкаЗапасовЗапасы.Объем) КАК Объем,
	|		алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат
	|	ИЗ
	|		Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_СборкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ОсновныеОбъекты КАК алк_ОсновныеОбъекты
	|			ПО алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов = алк_ОсновныеОбъекты.Значение
	|				И (алк_ОсновныеОбъекты.ВидОбъекта = ЗНАЧЕНИЕ(Справочник.алк_ВидыОбъектов.УчастокСортированныхЛМ))
	|	ГДЕ
	|		алк_СборкаЗапасовЗапасы.Ссылка.Проведен
	|		И алк_СборкаЗапасовЗапасы.Ссылка.Дата >= &НачалоПериода
	|		И (алк_СборкаЗапасовЗапасы.Ссылка.Дата <= &КонецПериода
	|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов,
	|		алк_СборкаЗапасовЗапасы.Сертификат,
	|		алк_ПараметрыХарактеристик.Сечение,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Сорт.Наименование, """")) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Штабель,
	|	ВложенныйЗапрос.Материал,
	|	ВложенныйЗапрос.Сертификат,
	|	ВложенныйЗапрос.Сечение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штабель,
	|	Материал,
	|	ВложенныйЗапрос.Сечение.ДиаметрММ
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	Сертификат
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСертификат = Макет.ПолучитьОбласть("Сертификат");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	//ОбластьЗаголовок.Параметры.Валюта = Строка(ПараметрВалюта);
	//ОбластьЗаголовок.Параметры.Контрагент = Контрагент;
	//Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
	//	ОбластьЗаголовок.Параметры.Период = НСтр("ru = 'весь период работы'");
	//Иначе
	//	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(Период.ДатаНачала, КонецПериода);
	//КонецЕсли; 
	
	
	ОбластьЗаголовок.Параметры.Номер = Формат(Период.ДатаНачала,"ДФ=dMM");
	ОбластьЗаголовок.Параметры.Дата = Формат(КонецПериода,"ДФ='dd MMMM yyyy'");
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Вывести(ОбластьШапка);
	
	нпп = 0;
	
	ОбщиеИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщиеИтоги.Следующий();
	стр = ОбщиеИтоги.Выбрать();
	Пока стр.Следующий() Цикл
		нпп = нпп + 1;
		ОбластьСтрока.Параметры.Заполнить(стр);
		ОбластьСтрока.Параметры.нпп = нпп;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьСертификат.Параметры.Заполнить(ОбщиеИтоги);
	
	Сертификат = "" + ОбщиеИтоги.Сертификат;
		
	Если Найти(Сертификат, "controlled") Тогда
		Сертификат = "PEFC controlled sources";		
	ИначеЕсли Найти(Сертификат, "PEFC") Тогда
		Сертификат = "100% " + Сертификат;	
	КонецЕсли; 
	
	ОбластьСертификат.Параметры.Сертификат = Сертификат;
	
	Результат.Вывести(ОбластьСертификат);
	
	ОбластьПодвал.Параметры.Заполнить(ОбщиеИтоги);
	Результат.Вывести(ОбластьПодвал);

	ОбластьПодписи.Параметры.ОтпустилДолжность = Отпустил.Должность;
	ОбластьПодписи.Параметры.ОтпустилФИО = Отпустил.РасшифровкаПодписи;
	ОбластьПодписи.Параметры.ПолучилДолжность = Получил.Должность;
	ОбластьПодписи.Параметры.ПолучилФИО = Получил.РасшифровкаПодписи;
	
	Результат.Вывести(ОбластьПодписи);
	
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьПоДиаметрамБезСортов(Период, Отпустил, Получил)
	
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	
	//2018 06 27 есть регистр алк_МатериалыЗатратыВыпуска.
	//В нем недостаточно данных. Поэтому формируем по документам
	//Целесообразность регистра не очевидна.
	//Или отказаться от него и реализовать учет на регистре ЗапасыОрганизации.
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Штабель КАК Штабель,
	|	ВложенныйЗапрос.Материал КАК Материал,
	|	ВложенныйЗапрос.Сечение КАК Сечение,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем,
	|	ВложенныйЗапрос.Сертификат КАК Сертификат
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов КАК Штабель,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """") КАК Материал,
	|		алк_ПараметрыХарактеристик.Сечение КАК Сечение,
	|		СУММА(алк_СборкаЗапасовЗапасы.Объем) КАК Объем,
	|		алк_СборкаЗапасовЗапасы.Сертификат КАК Сертификат
	|	ИЗ
	|		Документ.алк_СборкаЗапасов.Запасы КАК алк_СборкаЗапасовЗапасы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО алк_СборкаЗапасовЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ОсновныеОбъекты КАК алк_ОсновныеОбъекты
	|			ПО алк_СборкаЗапасовЗапасы.Ссылка.СтруктурнаяЕдиницаЗапасов = алк_ОсновныеОбъекты.Значение
	|				И (алк_ОсновныеОбъекты.ВидОбъекта = ЗНАЧЕНИЕ(Справочник.алк_ВидыОбъектов.УчастокСортированныхЛМ))
	|	ГДЕ
	|		алк_СборкаЗапасовЗапасы.Ссылка.Проведен
	|		И алк_СборкаЗапасовЗапасы.Ссылка.Дата >= &НачалоПериода
	|		И (алк_СборкаЗапасовЗапасы.Ссылка.Дата <= &КонецПериода
	|				ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		алк_СборкаЗапасовЗапасы.Ссылка.ЯчейкаЗапасов,
	|		алк_СборкаЗапасовЗапасы.Сертификат,
	|		алк_ПараметрыХарактеристик.Сечение,
	|		ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода.Наименование, """") + "", "" + ЕСТЬNULL(алк_ПараметрыХарактеристик.Длина.Наименование, """")) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Штабель,
	|	ВложенныйЗапрос.Материал,
	|	ВложенныйЗапрос.Сертификат,
	|	ВложенныйЗапрос.Сечение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штабель,
	|	Материал,
	|	ВложенныйЗапрос.Сечение.ДиаметрММ
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	Сертификат
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьСертификат = Макет.ПолучитьОбласть("Сертификат");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	//ОбластьЗаголовок.Параметры.Валюта = Строка(ПараметрВалюта);
	//ОбластьЗаголовок.Параметры.Контрагент = Контрагент;
	//Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
	//	ОбластьЗаголовок.Параметры.Период = НСтр("ru = 'весь период работы'");
	//Иначе
	//	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(Период.ДатаНачала, КонецПериода);
	//КонецЕсли; 
	
	
	ОбластьЗаголовок.Параметры.Номер = Формат(Период.ДатаНачала,"ДФ=dMM");
	ОбластьЗаголовок.Параметры.Дата = Формат(КонецПериода,"ДФ='dd MMMM yyyy'");
	
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Вывести(ОбластьШапка);
	
	нпп = 0;
	
	ОбщиеИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщиеИтоги.Следующий();
	стр = ОбщиеИтоги.Выбрать();
	Пока стр.Следующий() Цикл
		нпп = нпп + 1;
		ОбластьСтрока.Параметры.Заполнить(стр);
		ОбластьСтрока.Параметры.нпп = нпп;
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьСертификат.Параметры.Заполнить(ОбщиеИтоги);
	
	Сертификат = "" + ОбщиеИтоги.Сертификат;
		
	Если Найти(Сертификат, "controlled") Тогда
		Сертификат = "PEFC controlled sources";		
	ИначеЕсли Найти(Сертификат, "PEFC") Тогда
		Сертификат = "100% " + Сертификат;	
	КонецЕсли; 
	
	ОбластьСертификат.Параметры.Сертификат = Сертификат;
	
	Результат.Вывести(ОбластьСертификат);
	
	ОбластьПодвал.Параметры.Заполнить(ОбщиеИтоги);
	Результат.Вывести(ОбластьПодвал);

	ОбластьПодписи.Параметры.ОтпустилДолжность = Отпустил.Должность;
	ОбластьПодписи.Параметры.ОтпустилФИО = Отпустил.РасшифровкаПодписи;
	ОбластьПодписи.Параметры.ПолучилДолжность = Получил.Должность;
	ОбластьПодписи.Параметры.ПолучилФИО = Получил.РасшифровкаПодписи;
	
	Результат.Вывести(ОбластьПодписи);
	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли