
&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.Доступность = Ложь;			
	КонецЕсли;
	
	УчастокПриИзмененииНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ алк_ПроизводствоСервер.ДоступностьРолиАдминистраторСистемы() Тогда	
		
		ПараметрыВвода = Новый Структура;
		ПараметрыВвода.Вставить("ДатаСмены", Объект.ДатаСмены);
		ПараметрыВвода.Вставить("Смена", Объект.Смена);
		ПараметрыВвода.Вставить("Операция", Объект.Операция);
		ПараметрыВвода.Вставить("Участок", Объект.Участок); 
		ПараметрыВвода.Вставить("Заголовок", Строка(Объект.Ссылка));
		
		Если алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = алк_ПроизводствоСервер.ПолучитьЦехДГ() Тогда //ДГ 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераДГ.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор());
			
		ИначеЕсли алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000002") Тогда //ЦПШ 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераЦПШ.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор()); 
			
		ИначеЕсли алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000009") Тогда //ИД 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераФанеры.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор());
			
		ИначеЕсли алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000001") //ЦЛП
			ИЛИ алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000006") Тогда  //МЛП 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераЦЛП.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор()); 
			
		Иначе
			
		КонецЕсли;
		
		Отказ = Истина;    
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьЦехПоКоду(КодЦеха)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Цеха.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.алк_Цеха КАК алк_Цеха
	               |ГДЕ
	               |	алк_Цеха.Код = &Код";
	Запрос.УстановитьПараметр("Код",КодЦеха);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.алк_Цеха.ПустаяСсылка();
	
КонецФункции


