&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Элементы.АктОТК.Видимость = ЗначениеЗаполнено(Объект.АктОТК);
	Элементы.ВидНесоответствия.Видимость = ЗначениеЗаполнено(Объект.АктОТК);
	
	Элементы.ЗаполнитьПоАкту.Видимость = (ЗначениеЗаполнено(Объект.АктОТК) и ТипЗнч(Объект.АктОТК)=Тип("ДокументСсылка.алк_АктОТКПоПакетам"));
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать     
	
	Если ПроверитьГруппыДоступа() Тогда
		Элементы.КомментарийОтветственногоСотрудника.Доступность = Истина;  
		Элементы.КомментарийОтветственногоСотрудника.ТолькоПросмотр = Ложь;    
	Иначе 
		Элементы.КомментарийОтветственногоСотрудника.Доступность = Ложь;
		Элементы.КомментарийОтветственногоСотрудника.ТолькоПросмотр  = Истина;  
	КонецЕсли;

	
КонецПроцедуры   

&НаСервере
Функция ПроверитьГруппыДоступа()    
	
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь(); 
	ПолныеПрава = Пользователи.ЭтоПолноправныйПользователь(Пользователь); 
	Если ЗначениеЗаполнено(Объект.ОтветственныйСотрудник) тогда	    
		
		Если (РольДоступна("алк_ДобавлениеКомментарияДокладнаяОТК") И Пользователь = Объект.ОтветственныйСотрудник)  ИЛИ  ПолныеПрава Тогда 
			Возврат Истина;	
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	Иначе   
		
		Если РольДоступна("алк_ДобавлениеКомментарияДокладнаяОТК")  ИЛИ  ПолныеПрава Тогда  
			//Объект.ОтветственныйСотрудник = Пользователь;
			Возврат Истина;	
		Иначе
			Возврат Ложь;
		КонецЕсли;  
		
	КонецЕсли;
 	
КонецФункции


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьПоАктуНаСервере()  
	Заключение = "";
	Для каждого Строка из Объект.АктОТК.Пакеты цикл 
		Заключение = Заключение + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 - %2",
		Строка.СерийныйНомер,Строка.Деффект)+ Символы.ПС;
	конеццикла;
	
	Объект.ЗаключениеПоАкту = Заключение; 
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоАкту(Команда)
	ЗаполнитьПоАктуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПроверитьГруппыДоступа() Тогда
		Элементы.КомментарийОтветственногоСотрудника.Доступность = Истина;  
		Элементы.КомментарийОтветственногоСотрудника.ТолькоПросмотр = Ложь;    
	Иначе 
		Элементы.КомментарийОтветственногоСотрудника.Доступность = Ложь;
		Элементы.КомментарийОтветственногоСотрудника.ТолькоПросмотр  = Истина;  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПроверитьГруппыДоступа() и НЕ ЗначениеЗаполнено(Объект.КомментарийОтветственногоСотрудника) Тогда   
		 Объект.ОтветственныйСотрудник = ПолучитьПустуюСсылкуПользователя();   
	 ИначеЕсли ПроверитьГруппыДоступа() и ЗначениеЗаполнено(Объект.КомментарийОтветственногоСотрудника) и НЕ ЗначениеЗаполнено(Объект.ОтветственныйСотрудник) Тогда
		 Пользователь = ПользователиКлиентСервер.ТекущийПользователь(); 
		 Объект.ОтветственныйСотрудник = Пользователь;
	КонецЕсли;
КонецПроцедуры     

 &НаСервере
 Функция ПолучитьПустуюСсылкуПользователя()
	 
	 Возврат Справочники.Пользователи.ПустаяСсылка();   
	 
КонецФункции


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 

