
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СтруктурнаяЕдиница = ПолучитьСкладНесортированного();		
	УстановитьУсловноеОформление();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСкладНесортированного()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ДополнительныеНастройкиСрезПоследних.Строка
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних КАК алк_ДополнительныеНастройкиСрезПоследних
		|ГДЕ
		|	алк_ДополнительныеНастройкиСрезПоследних.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр", "КодСкладаНесортированного");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КодСклада = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодСклада = ВыборкаДетальныеЗаписи.Строка;		
	КонецЦикла;
	
	Возврат Справочники.СтруктурныеЕдиницы.НайтиПоКоду(КодСклада);
	

КонецФункции // ПолучитьСкладНесортированного()


&НаКлиенте
Процедура РазгруженПриИзменении(Элемент)
	Объект.ДатаРазгрузки = ТекущаяДата();
	УстановитьУсловноеОформление();
КонецПроцедуры

Процедура УстановитьУсловноеОформление()
	Элементы.ГрТранспорт.Видимость = Объект.Разгружен;
КонецПроцедуры