
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ПараметрыФормы = Новый Структура("Вариант, Направление", 2, ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.Лесопиление"));

	ОткрытьФорму("Обработка.алк_РабочееМестоОператораЦЛП.Форма.ФормаИнициализации", ПараметрыФормы);
	
КонецПроцедуры
