

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодПриемки.ДатаНачала    = Объект.ДатаС;
	ПериодПриемки.ДатаОкончания = Объект.ДатаПо;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаС    = ПериодПриемки.ДатаНачала;
	Объект.ДатаПо = ПериодПриемки.ДатаОкончания;
	
КонецПроцедуры


#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ЗаполнитьПродукциюНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УчетЛесопродукцииГОСТОбороты.СтруктурнаяЕдиница,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель,
		|	алк_УчетЛесопродукцииГОСТОбороты.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ГрадацииСечений.Градация КАК Градация,
		|	алк_УчетЛесопродукцииГОСТОбороты.КоличествоПриход КАК Количество,
		|	алк_УчетЛесопродукцииГОСТОбороты.ОбъемПриход КАК Объем,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Партия,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления КАК СтанцияОтправления,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.ВидТранспортировки КАК ВидТранспортировки,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерВагона КАК НомерВагона,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерНакладной КАК НомерНакладной,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель.Несоответствие КАК Некондиция
		|ПОМЕСТИТЬ втПродукция
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииГОСТ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель.Несоответствие В (&П1)
		|				И (Штабель В (&П2)
		|					ИЛИ &ВсеШтабели)) КАК алк_УчетЛесопродукцииГОСТОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
		|			ПО алк_ПараметрыХарактеристик.Сечение = алк_ГрадацииСечений.Сечение
		|		ПО алк_УчетЛесопродукцииГОСТОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления = &СтанцияОтправления
		|	И алк_УчетЛесопродукцииГОСТОбороты.Регистратор.Производитель = &Производитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.СуммаНДС) КАК СуммаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.Всего) КАК Сумма,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Штабель,
		|	втПродукция.Номенклатура КАК Номенклатура,
		|	втПродукция.Порода,
		|	втПродукция.Сорт КАК Сорт,
		|	втПродукция.Длина КАК Длина,
		|	втПродукция.Градация КАК Градация,
		|	СУММА(втПродукция.Количество) КАК Количество,
		|	СУММА(втПродукция.Объем) КАК Объем,
		|	втПродукция.Партия КАК Партия,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.НомерВагона,
		|	втПродукция.НомерНакладной,
		|	втПродукция.Некондиция,
		|	втПродукция.Партия.Сертификат КАК Сертификат,
		|	втПродукция.Партия.СертификатПроизводителя КАК СертификатПроизводителя
		|ИЗ
		|	втПродукция КАК втПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ЦеныНаЛесопродукциюТД.СрезПоследних КАК алк_ЦеныНаЛесопродукциюТДСрезПоследних
		|		ПО втПродукция.Номенклатура = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Номенклатура
		|			И втПродукция.Порода = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Порода
		|			И втПродукция.Сорт = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Сорт
		|			И втПродукция.Длина = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Длина
		|			И втПродукция.Градация = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Градация
		|			И втПродукция.Некондиция = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Некондиция
		|			И втПродукция.СтанцияОтправления = алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтанцияОтправления
		|			И втПродукция.ВидТранспортировки = алк_ЦеныНаЛесопродукциюТДСрезПоследних.ВидТранспортировки
		|
		|СГРУППИРОВАТЬ ПО
		|	втПродукция.Штабель,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	втПродукция.Номенклатура,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Сорт,
		|	втПродукция.Порода,
		|	втПродукция.НомерВагона,
		|	втПродукция.Длина,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.Партия,
		|	втПродукция.Градация,
		|	втПродукция.НомерНакладной,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.Некондиция,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	втПродукция.Партия.Сертификат
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партия,
		|	Номенклатура,
		|	Длина,
		|	Градация,
		|	Сорт
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Запрос.УстановитьПараметр("НачалоПериода", ПериодПриемки.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодПриемки.ДатаОкончания);
	
	Запрос.УстановитьПараметр("Производитель", Объект.Производитель);
	Запрос.УстановитьПараметр("СтанцияОтправления", Объект.СтанцияОтправления);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	Сп = Новый СписокЗначений;
	Сп.Добавить(Истина);
	Сп.Добавить(Ложь);
	
	Запрос.УстановитьПараметр("П1", ?(Объект.ТолькоКондиция, Ложь, Сп));
	Запрос.УстановитьПараметр("П2", Объект.ОтборШтабеля);
	Запрос.УстановитьПараметр("ВсеШтабели", ?(ЗначениеЗаполнено(Объект.ОтборШтабеля), Ложь, Истина));	

	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(ОтборПоСертификатуПроизводителя) Тогда
		
		Отбор = Новый Структура("СертификатПроизводителя", ОтборПоСертификатуПроизводителя);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

	ИначеЕсли ЗначениеЗаполнено(ОтборПоСертификату) Тогда
		
		Отбор = Новый Структура("Сертификат", ОтборПоСертификату);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

		
		ТЗ = РезультатЗапроса.Выгрузить();
	Иначе
		ТЗ = РезультатЗапроса.Выгрузить();
	КонецЕсли; 
	
	Объект.Продукция.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродукцию(Команда)
	ЗаполнитьПродукциюНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродукцияПоСтаройСхеме(Команда)
	ЗаполнитьПродукцияПоСтаройСхемеНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПродукцияПоСтаройСхемеНаСервере(ОтборПоСертификатуПроизводителя, ОтборПоСертификату)  
	
	//20241224 - нужно один раз для КЛПХ заполнить до 11.12
	Если Объект.Производитель <> Справочники.Контрагенты.НайтиПоКоду("ПБ-000148") Тогда 
		Сообщить("Оформить по старой схеме можно только КЛПХ до 11.12.2024!");
		Возврат;
	КонецЕсли; 
	//\\

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УчетЛесопродукцииГОСТОбороты.СтруктурнаяЕдиница,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель,
		|	алк_УчетЛесопродукцииГОСТОбороты.Номенклатура,
		|	алк_ПараметрыХарактеристик.Порода КАК Порода,
		|	алк_ПараметрыХарактеристик.Сорт КАК Сорт,
		|	алк_ПараметрыХарактеристик.Длина КАК Длина,
		|	алк_ГрадацииСечений.Градация КАК Градация,
		|	алк_УчетЛесопродукцииГОСТОбороты.КоличествоПриход КАК Количество,
		|	алк_УчетЛесопродукцииГОСТОбороты.ОбъемПриход КАК Объем,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор КАК Партия,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления КАК СтанцияОтправления,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.ВидТранспортировки КАК ВидТранспортировки,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерВагона КАК НомерВагона,
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.НомерНакладной КАК НомерНакладной,
		|	алк_УчетЛесопродукцииГОСТОбороты.Штабель.Несоответствие КАК Некондиция
		|ПОМЕСТИТЬ втПродукция
		|ИЗ
		|	РегистрНакопления.алк_УчетЛесопродукцииГОСТ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель.Несоответствие В (&П1)
		|				И (Штабель В (&П2)
		|					ИЛИ &ВсеШтабели)) КАК алк_УчетЛесопродукцииГОСТОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ГрадацииСечений КАК алк_ГрадацииСечений
		|			ПО алк_ПараметрыХарактеристик.Сечение = алк_ГрадацииСечений.Сечение
		|		ПО алк_УчетЛесопродукцииГОСТОбороты.Характеристика = алк_ПараметрыХарактеристик.Характеристика
		|ГДЕ
		|	алк_УчетЛесопродукцииГОСТОбороты.Регистратор.СтанцияОтправления = &СтанцияОтправления
		|	И алк_УчетЛесопродукцииГОСТОбороты.Регистратор.Производитель = &Производитель
		|	И алк_УчетЛесопродукцииГОСТОбороты.Регистратор.Партия.Дата < &ДатаОтгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.СуммаНДС) КАК СуммаНДС,
		|	СУММА(втПродукция.Объем * алк_ЦеныНаЛесопродукциюТДСрезПоследних.Всего) КАК Сумма,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Штабель,
		|	втПродукция.Номенклатура КАК Номенклатура,
		|	втПродукция.Порода,
		|	втПродукция.Сорт КАК Сорт,
		|	втПродукция.Длина КАК Длина,
		|	втПродукция.Градация КАК Градация,
		|	СУММА(втПродукция.Количество) КАК Количество,
		|	СУММА(втПродукция.Объем) КАК Объем,
		|	втПродукция.Партия КАК Партия,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.НомерВагона,
		|	втПродукция.НомерНакладной,
		|	втПродукция.Некондиция,
		|	втПродукция.Партия.Сертификат КАК Сертификат,
		|	втПродукция.Партия.СертификатПроизводителя КАК СертификатПроизводителя
		|ИЗ
		|	втПродукция КАК втПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ЦеныНаЛесопродукциюТД.СрезПоследних КАК алк_ЦеныНаЛесопродукциюТДСрезПоследних
		|		ПО втПродукция.Номенклатура = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Номенклатура
		|			И втПродукция.Порода = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Порода
		|			И втПродукция.Сорт = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Сорт
		|			И втПродукция.Длина = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Длина
		|			И втПродукция.Градация = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Градация
		|			И втПродукция.Некондиция = алк_ЦеныНаЛесопродукциюТДСрезПоследних.Некондиция
		|			И втПродукция.СтанцияОтправления = алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтанцияОтправления
		|			И втПродукция.ВидТранспортировки = алк_ЦеныНаЛесопродукциюТДСрезПоследних.ВидТранспортировки
		|
		|СГРУППИРОВАТЬ ПО
		|	втПродукция.Штабель,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.СтавкаНДС,
		|	втПродукция.Номенклатура,
		|	втПродукция.СтруктурнаяЕдиница,
		|	втПродукция.Сорт,
		|	втПродукция.Порода,
		|	втПродукция.НомерВагона,
		|	втПродукция.Длина,
		|	втПродукция.СтанцияОтправления,
		|	втПродукция.Партия,
		|	втПродукция.Градация,
		|	втПродукция.НомерНакладной,
		|	втПродукция.ВидТранспортировки,
		|	втПродукция.Некондиция,
		|	алк_ЦеныНаЛесопродукциюТДСрезПоследних.Цена,
		|	втПродукция.Партия.Сертификат,
		|	втПродукция.Партия.СертификатПроизводителя
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партия,
		|	Номенклатура,
		|	Длина,
		|	Градация,
		|	Сорт
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Запрос.УстановитьПараметр("НачалоПериода", ПериодПриемки.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодПриемки.ДатаОкончания);
	//Запрос.УстановитьПараметр("ДатаОтгрузки", '20240610');
	Запрос.УстановитьПараметр("ДатаОтгрузки", '20241212');
	Запрос.УстановитьПараметр("Производитель", Объект.Производитель);
	Запрос.УстановитьПараметр("СтанцияОтправления", Объект.СтанцияОтправления);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	Сп = Новый СписокЗначений;
	Сп.Добавить(Истина);
	Сп.Добавить(Ложь);
	
	Запрос.УстановитьПараметр("П1", ?(Объект.ТолькоКондиция, Ложь, Сп));
	Запрос.УстановитьПараметр("П2", Объект.ОтборШтабеля);
	Запрос.УстановитьПараметр("ВсеШтабели", ?(ЗначениеЗаполнено(Объект.ОтборШтабеля), Ложь, Истина));	

	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(ОтборПоСертификатуПроизводителя) Тогда
		
		Отбор = Новый Структура("СертификатПроизводителя", ОтборПоСертификатуПроизводителя);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

	ИначеЕсли ЗначениеЗаполнено(ОтборПоСертификату) Тогда
		
		Отбор = Новый Структура("Сертификат", ОтборПоСертификату);
		ТЗ_0 = РезультатЗапроса.Выгрузить();
		ТЗ = ТЗ_0.Скопировать(Отбор);

		
		ТЗ = РезультатЗапроса.Выгрузить();
	Иначе
		ТЗ = РезультатЗапроса.Выгрузить();
	КонецЕсли; 
	
	Объект.Продукция.Загрузить(ТЗ);
	
КонецПроцедуры
	
#КонецОбласти 


