
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("СписокСерийныхНомеров", Параметры.СписокСерийныхНомеров);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСерийныйНомер(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = ТекущиеДанные.Ссылка;
	Закрыть(ВыбранноеЗначение);
КонецПроцедуры
