	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
		Если ЗначениеЗаполнено(Данные.АктОТК) Тогда 
			Представление = "Акт несоответствия " + Данные.Номер + " от " + Формат(Данные.Дата,"ДФ=dd.MM.yyyy");  
			СтандартнаяОбработка=Ложь;
		КонецЕсли;
КонецПроцедуры
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
		Поля.Добавить("Номер");
		Поля.Добавить("Дата");
		Поля.Добавить("АктОТК");
		СтандартнаяОбработка=Ложь;
	КонецПроцедуры
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
				
	КонецПроцедуры
