
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_АктОТК") или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.алк_АктОТКПоПакетам")  Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Номер,Дата");
		АктОТК = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если не ЗначениеЗаполнено(Ответственный) тогда 
	Ответственный = ПараметрыСеанса.ТекущийПользователь;  		
КонецЕсли; 

КонецПроцедуры
 // Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
				
КонецПроцедуры
