
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Перезаполнить(Команда)
	
	Если Объект.Номенклатура.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоДокументуОснованию", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
		Возврат; 
	КонецЕсли;
	
	ПерезаполнитьДокументПоОснованию(Объект.ДокументОснование);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументуОснованию(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ПерезаполнитьДокументПоОснованию(Объект.ДокументОснование);
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()  
	
	ПараметрыСмены = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, Объект.Дата);	
	
	Если ПараметрыСмены = NULL Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ДатаСмены = ПараметрыСмены.ДатаСмены;
	Объект.Смена = ПараметрыСмены.Смена;  
	
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаСменыПриИзмененииНаСервере()
	Объект.Дата = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Объект.Смена, Объект.ДатаСмены).ДатаВремяКонцаСмены;
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ДатаСменыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СменаПриИзмененииНаСервере()
	Объект.Дата = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Объект.Смена, Объект.ДатаСмены).ДатаВремяКонцаСмены;
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	СменаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
Процедура ПерезаполнитьДокументПоОснованию(ДокументОснование)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Заполнить(ДокументОснование);
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) И Не Параметры.Свойство("ПрограммноеСозданиеНаОсновании") Тогда
		Сообщить("Этот документ можно создавать только на основании загрузки!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		Объект.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); //Сушильный комплекс 
		Объект.Участок = Справочники.алк_Участки.НайтиПоКоду("000000024");
	КонецЕсли;
	
	Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.Ангар"), "Ангар 1 (сухие пиломатериалы)");	
	Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Добавить(НазначитьСкладАнгар2(),"Ангар 2 (сухие пиломатериалы)");    
	Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Добавить(ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ХолоднаяЗона"), "Холодная зона (пересортировка)");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Дата = ТекущаяДата();
		
		УчастокПриИзмененииНаСервере();
	КонецЕсли;
	                                                                                                            	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Этот документ можно создавать только на основании загрузки!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НазначитьСкладАнгар2()
	Возврат Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000098");
КонецФункции

#КонецОбласти
