
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Элементы.Список - основной реквизит с динамическим списком
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Если Параметры.МножественныйВыбор <> Неопределено Тогда
		Элементы.Список.МножественныйВыбор = Параметры.МножественныйВыбор;
	КонецЕсли;
	// обход автоматического сохранения пользовательских настроек для разных режимов, спасибо @stolya
	Если Параметры.РежимВыбора И Не ЗначениеЗаполнено(Параметры.КлючПользовательскихНастроек) Тогда
		Параметры.КлючПользовательскихНастроек = "РежимВыбора";
		Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли; 
	
	Если Параметры.Свойство("отборПоХарактеристике") тогда
	   	ТребуетсяОтборПоХарактеристике = Параметры.отборПоХарактеристике;
		Список.Параметры.УстановитьЗначениеПараметра("отборПоХарактеристике", ТребуетсяОтборПоХарактеристике);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("отборПоХарактеристике", Ложь);
	КонецЕсли;
	
	Если Параметры.Свойство("Характеристика") тогда
		Список.Параметры.УстановитьЗначениеПараметра("Характеристика", Параметры.Характеристика);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли; 
	
	Если Параметры.Свойство("Количество") тогда
		Список.Параметры.УстановитьЗначениеПараметра("Количество", Параметры.Количество);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Количество", 0);
	КонецЕсли;
	
	Если Параметры.Свойство("Припуск") тогда
		Список.Параметры.УстановитьЗначениеПараметра("Припуск", Параметры.Припуск);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Припуск", Справочники.алк_ВариантыПрипуска.ПустаяСсылка());
	КонецЕсли;  
	
	Если Параметры.Свойство("Номенклатура") тогда
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
КонецПроцедуры
