
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьКомандыРазделить();
	
КонецПроцедуры

#КонецОбласти 


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	//РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


Процедура Конец()
	
КонецПроцедуры

&НаКлиенте
Процедура Разделить1(Команда)
	
	ТекДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		Если ТекДанные.Номенклатура <> РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Щепа")) Тогда
			Возврат;	
		КонецЕсли; 
		
		ОбъемЩепы = ТекДанные.Объем;
		ТекДанные.Объем = ОбъемЩепы * 0.5;
		
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Кора"));
		НоваяСтрока.Объем = ОбъемЩепы * 0.25;
		НоваяСтрока.ДополнительнаяАналитика = ТекДанные.ДополнительнаяАналитика;
		
		НоваяСтрока = Объект.Запасы.Добавить();
		НоваяСтрока.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Опилки"));
		НоваяСтрока.Объем = ОбъемЩепы * 0.25;
		НоваяСтрока.ДополнительнаяАналитика = ТекДанные.ДополнительнаяАналитика;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	УстановитьВидимостьКомандыРазделить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКомандыРазделить()
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.алк_ВидыДокументаРН_Отходы.ПотреблениеКотельной") Тогда
		Элементы.Разделить.Доступность = Истина;
	Иначе
		Элементы.Разделить.Доступность = Ложь;
	КонецЕсли; 		
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере() 
	
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);

КонецПроцедуры 

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
 




