
&НаКлиенте
Процедура ПроизводствоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Объект.ПЗ_ПроизведеноПилмат = 0 Или Объект.ОП_ПроизведеноПилмат = 0 Тогда		
		Возврат;                                                             		
	КонецЕсли; 	
	
	Если Элемент.ТекущийЭлемент.Имя = "ПроизводствоКоэффОП" Тогда  
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ПроизводствоКоэффПЗ" Тогда  
		Возврат;
	КонецЕсли;
	
	Для каждого стрПроизводство Из Объект.Производство Цикл
		
		стрПроизводство.КоэффПЗ = стрПроизводство.ПЗ_Объем / Объект.ПЗ_ПроизведеноПилмат;
		стрПроизводство.КоэффОП = стрПроизводство.ОП_Объем / Объект.ОП_ПроизведеноПилмат;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Объект.ПЗ_ПроизведеноПилматC = 0 Или Объект.ОП_ПроизведеноПилматC = 0 Тогда
		
		Возврат
		
	КонецЕсли; 	
	
	Для каждого стрПроизводство Из Объект.ПроизводствоС Цикл
		
		стрПроизводство.КоэффПЗ = стрПроизводство.ПЗ_Объем / Объект.ПЗ_ПроизведеноПилматC;
		стрПроизводство.КоэффОП = стрПроизводство.ОП_Объем / Объект.ОП_ПроизведеноПилматC;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоНПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КН_Некондиция = Справочники.КатегорииНоменклатуры.ОтходыПилмат; 
	
	УчастокПриИзмененииНаСервереЦЛП(); 
	ПлановыеПоказателиПроизводстваУчастокДГПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоНПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КатегорияНоменклатуры = КН_Некондиция;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоНПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Объект.ПЗ_ПроизведеноПилматН = 0 Или Объект.ОП_ПроизведеноПилматН = 0 Тогда
		
		Возврат
		
	КонецЕсли; 	
	
	Для каждого стрПроизводство Из Объект.ПроизводствоН Цикл
		
		стрПроизводство.КоэффПЗ = стрПроизводство.ПЗ_Объем / Объект.ПЗ_ПроизведеноПилматН;
		стрПроизводство.КоэффОП = стрПроизводство.ОП_Объем / Объект.ОП_ПроизведеноПилматН;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоПоДнямНПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КатегорияНоменклатуры = КН_Некондиция;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросОчисткиТЧ(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьДаты(Параметры);
    КонецЕсли;	
 
КонецПроцедуры


&НаКлиенте
Процедура КомандаПолученоПиломатериаловПоДням(Команда)
	
	ИмяТабличнойЧасти = Сред(Команда.Имя, 8);
					
	Если Объект[ИмяТабличнойЧасти].Количество() > 0 Тогда	
		Оповещение = Новый ОписаниеОповещения("ОповещениеВопросОчисткиТЧ", ЭтотОбъект, ИмяТабличнойЧасти);	 
   		ПоказатьВопрос(Оповещение,"Табличная часть будет пезаполнена! Продолжить?", РежимДиалогаВопрос.ДаНет);    
	Иначе
		ЗаполнитьДаты(ИмяТабличнойЧасти);  
	КонецЕсли; 
	           	
	Модифицированность = Истина;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьЗначенияТабличныхЧастей(Команда)
	
	ИмяТабличнойЧасти = Сред(Команда.Имя, 18);
	
	Если ИмяТабличнойЧасти = "СортовойПродукции" Тогда
		
		//ИмяТЧЗаМесяц = Элементы.Производство.Имя;
		ИмяТЧЗаДень = Элементы.ПроизводствоПоДням.Имя;  		
		
	ИначеЕсли  ИмяТабличнойЧасти = "СобственногоПотребления" Тогда
		
		//ИмяТЧЗаМесяц = Элементы.ПроизводствоС.Имя; 
		ИмяТЧЗаДень = Элементы.ПроизводствоПоДнямС.Имя;
		
	ИначеЕсли ИмяТабличнойЧасти = "Некондиции" Тогда 
		
		//ИмяТЧЗаМесяц = Элементы.ПроизводствоН.Имя; 
		ИмяТЧЗаДень = Элементы.ПроизводствоПоДнямН.Имя;
		
	ИначеЕсли ИмяТабличнойЧасти = "Подано" Тогда 
		 
		ИмяТЧЗаДень = Элементы.ПоданоПоДням.Имя;
		
	ИначеЕсли ИмяТабличнойЧасти = "ПолученоПм" Тогда 
		 
		ИмяТЧЗаДень = Элементы.ПолученоПиломатериаловПоДням.Имя;
		
	ИначеЕсли ИмяТабличнойЧасти = "ОстаткиНесортированного" Тогда 
		 
		ИмяТЧЗаДень = Элементы.ОстаткиНесортировПоДням.Имя; 
		
	ИначеЕсли ИмяТабличнойЧасти = "ОбъемВСушКамерах" Тогда 
		 
		ИмяТЧЗаДень = Элементы.ОбъемВСушильныхКамерахПоДням.Имя;

	КонецЕсли;
	
	Если  ИмяТЧЗаДень = Неопределено Тогда
		Заполнилось = Истина;
		Возврат;
	КонецЕсли;

	//Заполнилось = Ложь;
	//ЗаполнитьОбъем(ИмяТабличнойЧасти,Заполнилось);  //берется всего за месяц делится на кол-о дней и заполняется тч
	//Если Заполнилось Тогда 
	//	Возврат;
	//КонецЕсли;
	
	УстановитьЗначениеВручную(ИмяТЧЗаДень);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаты(ИмяТабличнойЧасти)
	
	ДатаЦикла 	= НачалоМесяца(Объект.Дата);
	КонецМесяца = КонецМесяца(Объект.Дата);
	
	//ТабличнаяЧасть = РеквизитФормыВЗначение("Объект." + ИмяТабличнойЧасти);	
	Объект[ИмяТабличнойЧасти].Очистить();
	
	ПроверкаВыполнена 	= Ложь;
	ЕстьРеквизит0 		= Ложь;
	ЕстьРеквизит1 		= Ложь;
		
	
	Если ИмяТабличнойЧасти = "ПроизводствоПоДнямН" Тогда
		Пиломатериал_Кат 	= Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000012");	 // Отходы производства пиломатериалов
	Иначе	
		Пиломатериал_Кат 	= Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000002");
	КонецЕсли;
			
	Пока ДатаЦикла <= КонецМесяца Цикл 
		
		НоваяСтр = Объект[ИмяТабличнойЧасти].Добавить();
		
		Если Не ПроверкаВыполнена Тогда 			
			ЕстьРеквизит0 = ЕстьРеквизитОбъекта(НоваяСтр, "Смена");
			ЕстьРеквизит1 = ЕстьРеквизитОбъекта(НоваяСтр, "КатегорияНоменклатуры");
			ПроверкаВыполнена = Истина;
		КонецЕсли; 
				
		Если ЕстьРеквизит1 Тогда
			НоваяСтр.КатегорияНоменклатуры = Пиломатериал_Кат;		
		КонецЕсли;
		
		НоваяСтр.ДатаСмены = ДатаЦикла;
			
		ДатаЦикла = ДатаЦикла + 24*3600;	
		
	КонецЦикла;  
		
	//Если ТипСменЦЛП = Перечисления.алк_ТипСмен.Двухсменка Тогда
	//	
	//	СменаДень = Справочники.алк_Смены.День_2;
	//	СменаНочь = Справочники.алк_Смены.Ночь_2;
	//	
	//	Пока ДатаЦикла <= КонецМесяца Цикл 
	//		
	//		НоваяСтр = Объект[ИмяТабличнойЧасти].Добавить();
	//		
	//		Если Не ПроверкаВыполнена Тогда 			
	//			ЕстьРеквизит0 = ЕстьРеквизитОбъекта(НоваяСтр, "Смена");
	//			ЕстьРеквизит1 = ЕстьРеквизитОбъекта(НоваяСтр, "КатегорияНоменклатуры");
	//			ПроверкаВыполнена = Истина;
	//		КонецЕсли; 
	//		
	//		Если ЕстьРеквизит0 Тогда
	//			НоваяСтр.Смена = СменаДень;		
	//		КонецЕсли;
	//		
	//		Если ЕстьРеквизит1 Тогда
	//			НоваяСтр.КатегорияНоменклатуры = Пиломатериал_Кат;		
	//		КонецЕсли;
	//		
	//		НоваяСтр.ДатаСмены = ДатаЦикла;
	//		
	//		Если ЕстьРеквизит0 Тогда 
	//			
	//			НоваяСтр = Объект[ИмяТабличнойЧасти].Добавить();
	//			
	//			НоваяСтр.Смена = СменаНочь;
	//			
	//			Если ЕстьРеквизит1 Тогда
	//				НоваяСтр.КатегорияНоменклатуры = Пиломатериал_Кат;		
	//			КонецЕсли;
	//			
	//		    НоваяСтр.ДатаСмены = ДатаЦикла;
	//		КонецЕсли;			
	//				 
	//		ДатаЦикла = ДатаЦикла + 24*3600;	
	//		
	//	КонецЦикла;  
	//	
	//ИначеЕсли ТипСменЦЛП = Перечисления.алк_ТипСмен.Трехсменка Тогда 
	//	
	//	СменаДень 	= Справочники.алк_Смены.День_3;
	//	СменаНочь 	= Справочники.алк_Смены.Ночь_3;
	//	СменаВечер 	= Справочники.алк_Смены.Вечер_3;
	//	
	//	Пока ДатаЦикла <= КонецМесяца Цикл 
	//		
	//		НоваяСтр = Объект[ИмяТабличнойЧасти].Добавить();
	//		
	//		Если Не ПроверкаВыполнена Тогда 			
	//			ЕстьРеквизит0 = ЕстьРеквизитОбъекта(НоваяСтр, "Смена");
	//			ЕстьРеквизит1 = ЕстьРеквизитОбъекта(НоваяСтр, "КатегорияНоменклатуры");
	//			ПроверкаВыполнена = Истина;
	//		КонецЕсли; 
	//		
	//		Если ЕстьРеквизит0 Тогда
	//			НоваяСтр.Смена = СменаДень;		
	//		КонецЕсли;
	//		
	//		Если ЕстьРеквизит1 Тогда
	//			НоваяСтр.КатегорияНоменклатуры = Пиломатериал_Кат;		
	//		КонецЕсли;
	//		
	//		НоваяСтр.ДатаСмены = ДатаЦикла;
	//		
	//		Если ЕстьРеквизит0 Тогда 
	//			
	//			НоваяСтр = Объект[ИмяТабличнойЧасти].Добавить();
	//			
	//			НоваяСтр.Смена = СменаВечер;
	//			
	//			Если ЕстьРеквизит1 Тогда
	//				НоваяСтр.КатегорияНоменклатуры = Пиломатериал_Кат;		
	//			КонецЕсли;
	//			
	//		    НоваяСтр.ДатаСмены = ДатаЦикла; 
	//			
	//			НоваяСтр = Объект[ИмяТабличнойЧасти].Добавить();
	//			
	//			НоваяСтр.Смена = СменаНочь;
	//			
	//			Если ЕстьРеквизит1 Тогда
	//				НоваяСтр.КатегорияНоменклатуры = Пиломатериал_Кат;		
	//			КонецЕсли;
	//			
	//		    НоваяСтр.ДатаСмены = ДатаЦикла;
	//			
	//		КонецЕсли;			
	//				 
	//		ДатаЦикла = ДатаЦикла + 24*3600;	
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъем(ИмяТЧЗаДень,ИмяТЧЗаМесяц,Заполнилось=Ложь)  
		
	//Проверки
	ВсегоДнейВТЧ = Объект[ИмяТЧЗаДень].Количество(); 

	Если ВсегоДнейВТЧ = 0 Тогда
		Сообщить("Сначала нужно заполнить дни!");
		Заполнилось = Истина; // чтобы не началось заполнение вручную
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтрокиВТЧКол = Элементы[ИмяТЧЗаДень].ВыделенныеСтроки.Количество();

	Если ВсегоДнейВТЧ <> ВыделенныеСтрокиВТЧКол Тогда
		Возврат;  //значит заполнение идет по отдельным строкам
	КонецЕсли;
	
	ИтогоЗаМесяц = Объект[ИмяТЧЗаМесяц].Итог("ПЗ_Объем");

	Если ИтогоЗаМесяц = 0 Тогда
		Сообщить("Необходимо заполнить значение на вкладке ""за месяц""!");
		Заполнилось = Истина; // чтобы не началось заполнение вручную
		Возврат;
	КонецЕсли;  
	//\\\
	
	ЗначениеЗаДень = ИтогоЗаМесяц/ВсегоДнейВТЧ; 
	ВычисленныйПрограммноОбщийИтог = ОКР(ЗначениеЗаДень,3)*ВсегоДнейВТЧ; 
	
	Для Каждого эл ИЗ Объект[ИмяТЧЗаДень] Цикл 
		эл.ПЗ_Объем = ЗначениеЗаДень;
	КонецЦикла; 
	
	Если ИтогоЗаМесяц <> ВычисленныйПрограммноОбщийИтог Тогда   
		Разница = ИтогоЗаМесяц - ВычисленныйПрограммноОбщийИтог;
		Объект[ИмяТЧЗаДень][ВсегоДнейВТЧ-1].ПЗ_Объем = ЗначениеЗаДень + Разница; 	
	КонецЕсли;
	
	Заполнилось = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьЗначениеВручную(ИмяТекТЧ) 
	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы[ИмяТекТЧ].ВыделенныеСтроки);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = новый ОписаниеОповещения("УстановитьЗначениеЗавершение", ЭтаФорма, Новый Структура("ВыделенныеСтроки, ИмяТекТЧ", ВыделенныеСтроки, ИмяТекТЧ));
	ПоказатьВводЗначения(ОписаниеОповещения, 0, "Введите значение для установки", Тип("Число")); 
КонецПроцедуры       

&НаКлиенте
Процедура УстановитьЗначениеЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Результат);
	ВыделенныеСтроки = Параметры.ВыделенныеСтроки;
	Если ТипЗначения = Тип("Число") тогда
		Для каждого НомерСтроки из ВыделенныеСтроки Цикл
			Если Параметры.ИмяТекТЧ = Элементы.ОстаткиНесортировПоДням.Имя ИЛИ Параметры.ИмяТекТЧ = Элементы.ОбъемВСушильныхКамерахПоДням.Имя Тогда 
				Элементы[Параметры.ИмяТекТЧ].ДанныеСтроки(НомерСтроки).Объем = Результат;
			Иначе 	 
				Элементы[Параметры.ИмяТекТЧ].ДанныеСтроки(НомерСтроки).ПЗ_Объем = Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры 


&НаСервере
// Функция определяет существует ли реквизит у объекта.
//
Функция ЕстьРеквизитОбъекта(НоваяСтр, ИмяРеквизита)
    
    КлючУникальности1   = Новый УникальныйИдентификатор;

    СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности1);

    ЗаполнитьЗначенияСвойств(СтруктураРеквизита, НоваяСтр);
    
    Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности1;
    
КонецФункции // ЕстьРеквизитОбъекта()

&НаКлиенте
Процедура ПлановыеПоказателиПроизводстваОперацияПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено или Не ЗначениеЗаполнено(ТекущаяСтрока.ПлановыйПоказатель) тогда
		Возврат;
	КонецЕсли;
	ПлановыйПоказатель = Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные.ПлановыйПоказатель;
	ПараметрыОтбора = новый структура("ПлановыйПоказатель", ПлановыйПоказатель); 
	результатПоиска = Объект.ПлановыеПоказателиПроизводства.НайтиСтроки(ПараметрыОтбора);
	Если результатПоиска.Количество()>1 тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Плановый показатель: %1, уже подобран в строке %2. Запрещено повторение показателей в одном документе"
			, ПлановыйПоказатель, результатПоиска[0].НомерСтроки));
		Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные.ПлановыйПоказатель = ПредопределенноеЗначение("Справочник.алк_ПоказателиПроизводства.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	ПриУстновкеОтборПоПлановомуПоказателю();
КонецПроцедуры

&НаКлиенте
Процедура ПриУстновкеОтборПоПлановомуПоказателю()
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ПлановыйПоказатель",ПлановыйПоказатель);
	Элементы.ПлановыеПоказателиПроизводстваПосменно.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеПоказателиПроизводстваЗначениеПриИзменении(Элемент)
	//устанавливаем плановый показатель
	ТекущаяСтрока = Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено или Не ЗначениеЗаполнено(ТекущаяСтрока.ПлановыйПоказатель) тогда
		Возврат;
	КонецЕсли;
	ПлановыйПоказатель = Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные.ПлановыйПоказатель;
	
	//Удаляем существующие строки посменно
	Счетчик = 0;
	КоличествоСтрок = Объект.ПлановыеПоказателиПроизводстваПосменно.Количество();
	Пока Счетчик < КоличествоСтрок Цикл
		Если Объект.ПлановыеПоказателиПроизводстваПосменно[Счетчик].ПлановыйПоказатель = ПлановыйПоказатель тогда
			Объект.ПлановыеПоказателиПроизводстваПосменно.Удалить(Объект.ПлановыеПоказателиПроизводстваПосменно[Счетчик]);
			КоличествоСтрок = КоличествоСтрок - 1;
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;
	
	//Автоматически распределяем посменно новое значение
	КоличествоДляРаспределения = Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные.Значение;
	Если КоличествоДляРаспределения = 0 тогда
		Возврат;
	КонецЕсли;
	     
	Если ЗначениеРеквизитаОбъект(ПлановыйПоказатель, "алк_ОперацияПроизводства") = ПредопределенноеЗначение("Перечисление.алк_ОперацииПроизводства.Остатки") тогда
		Смена = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
		Смена.Дата = НачалоМесяца(Объект.Дата);
		Смена.ПлановыйПоказатель = ПлановыйПоказатель;
		Смена.Значение = КоличествоДляРаспределения;
		Возврат;
	ИначеЕсли ЗначениеРеквизитаОбъект(ПлановыйПоказатель, "алк_ОперацияПроизводства") = ПредопределенноеЗначение("Перечисление.алк_ОперацииПроизводства.Подано") 
		или ЗначениеРеквизитаОбъект(ПлановыйПоказатель, "алк_ОперацияПроизводства") = ПредопределенноеЗначение("Перечисление.алк_ОперацииПроизводства.Получено") тогда
		Возврат;
	КонецЕсли;
	КоличествоДнейМесяца = День(КонецМесяца(Объект.Дата)); 
	
	Если ТипСменДГ = ПредопределенноеЗначение("Перечисление.алк_ТипСмен.Двухсменка") Тогда

		КоличествоСмен = КоличествоДнейМесяца * 2;
		ЗначениеВСмену = Окр(КоличествоДляРаспределения/КоличествоСмен, 4);
		Дельта = КоличествоДляРаспределения - КоличествоСмен*ЗначениеВСмену;
		Счетчик = 1;
		ДатаСмены = НачалоМесяца(Объект.Дата);
		
		Пока счетчик <= КоличествоДнейМесяца Цикл
			СменаДень = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
			СменаДень.Дата = ДатаСмены;
			СменаДень.Смена = ПредопределенноеЗначение("Справочник.алк_Смены.День_2");
			СменаДень.ПлановыйПоказатель = ПлановыйПоказатель;
			СменаНочь = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
			СменаНочь.Дата = ДатаСмены;
			СменаНочь.Смена = ПредопределенноеЗначение("Справочник.алк_Смены.Ночь_2");
			СменаНочь.ПлановыйПоказатель = ПлановыйПоказатель;
			СменаДень.Значение = ЗначениеВСмену + Дельта/2;
			СменаНочь.Значение = ЗначениеВСмену + Дельта/2;
			Дельта = 0;
			ДатаСмены = ДатаСмены + 86400;
			счетчик = счетчик + 1;
		КонецЦикла;  
	
	ИначеЕсли ТипСменДГ = ПредопределенноеЗначение("Перечисление.алк_ТипСмен.Трехсменка") Тогда
		
		КоличествоСмен = КоличествоДнейМесяца * 3;
		ЗначениеВСмену = Окр(КоличествоДляРаспределения/КоличествоСмен, 4);
		Дельта = КоличествоДляРаспределения - КоличествоСмен*ЗначениеВСмену;
		Счетчик = 1;
		ДатаСмены = НачалоМесяца(Объект.Дата);
		
		Пока счетчик <= КоличествоДнейМесяца Цикл
			СменаДень = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
			СменаДень.Дата = ДатаСмены;
			СменаДень.Смена = ПредопределенноеЗначение("Справочник.алк_Смены.День_3");
			СменаДень.ПлановыйПоказатель = ПлановыйПоказатель;
			
			СменаВечер = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
			СменаВечер.Дата = ДатаСмены;
			СменаВечер.Смена = ПредопределенноеЗначение("Справочник.алк_Смены.Вечер_3");
			СменаВечер.ПлановыйПоказатель = ПлановыйПоказатель; 
			
			СменаНочь = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
			СменаНочь.Дата = ДатаСмены;
			СменаНочь.Смена = ПредопределенноеЗначение("Справочник.алк_Смены.Ночь_3");
			СменаНочь.ПлановыйПоказатель = ПлановыйПоказатель;
			
			СменаДень.Значение = ЗначениеВСмену + Дельта/3;
			СменаВечер.Значение = ЗначениеВСмену + Дельта/3;
			СменаНочь.Значение = ЗначениеВСмену + Дельта/3;
			
			Дельта = 0;
			ДатаСмены = ДатаСмены + 86400;
			счетчик = счетчик + 1;
		КонецЦикла; 
	
	КонецЕсли;
	
	//КоличествоСмен = КоличествоДнейМесяца * 2;
	//ЗначениеВСмену = Окр(КоличествоДляРаспределения/КоличествоСмен, 4);
	//Дельта = КоличествоДляРаспределения - КоличествоСмен*ЗначениеВСмену;
	//Счетчик = 1;
	//ДатаСмены = НачалоМесяца(Объект.Дата);
	//Пока счетчик <= КоличествоДнейМесяца Цикл
	//	СменаДень = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
	//	СменаДень.Дата = ДатаСмены;
	//	СменаДень.Смена = ПредопределенноеЗначение("Перечисление.Смены.смена_8_20");
	//	СменаДень.ПлановыйПоказатель = ПлановыйПоказатель;
	//	СменаНочь = Объект.ПлановыеПоказателиПроизводстваПосменно.Добавить();
	//	СменаНочь.Дата = ДатаСмены;
	//	СменаНочь.Смена = ПредопределенноеЗначение("Перечисление.Смены.смена_20_8");
	//	СменаНочь.ПлановыйПоказатель = ПлановыйПоказатель;
	//	СменаДень.Значение = ЗначениеВСмену + Дельта/2;
	//	СменаНочь.Значение = ЗначениеВСмену + Дельта/2;
	//	Дельта = 0;
	//	ДатаСмены = ДатаСмены + 86400;
	//	счетчик = счетчик + 1;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеПоказателиПроизводстваПосменноЗначениеПриИзменении(Элемент)
	//Находим изменяемый показатель в своде и заменяем его
	ЗначениеПоказателя = 0;
	Для каждого строка из Объект.ПлановыеПоказателиПроизводстваПосменно Цикл
		Если строка.ПлановыйПоказатель = ПлановыйПоказатель тогда
			ЗначениеПоказателя = ЗначениеПоказателя + строка.Значение;
		КонецЕсли
	КонецЦикла;
	Для каждого строка из Объект.ПлановыеПоказателиПроизводства Цикл
		Если строка.ПлановыйПоказатель = ПлановыйПоказатель тогда
			строка.Значение = ЗначениеПоказателя;
			Возврат;
		КонецЕсли
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПлановыйПоказательПриИзменении(Элемент)
	ПриУстновкеОтборПоПлановомуПоказателю();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриУстновкеОтборПоПлановомуПоказателю();
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеПоказателиПроизводстваПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено или Не ЗначениеЗаполнено(ТекущаяСтрока.ПлановыйПоказатель) тогда
		Возврат;
	КонецЕсли;
	ПлановыйПоказатель = Элементы.ПлановыеПоказателиПроизводства.ТекущиеДанные.ПлановыйПоказатель;
	ПриУстновкеОтборПоПлановомуПоказателю();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъект(Объект, Реквизит)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, Реквизит);
КонецФункции

&НаКлиенте
Процедура ПлановыеПоказателиПроизводстваПриИзменении(Элемент)
	УдалитьСтрокиПосменно();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиПосменно()

	Ключи = Новый Массив;
	
	Для каждого Стр Из Объект.ПлановыеПоказателиПроизводства Цикл  	
		Ключи.Добавить(Стр.ПлановыйПоказатель);    
	КонецЦикла;	
	
	Всего = Объект.ПлановыеПоказателиПроизводстваПосменно.Количество()-1;
	
	Для НС = -Всего По 0 Цикл 		
		Если Ключи.Найти(Объект.ПлановыеПоказателиПроизводстваПосменно[-НС].ПлановыйПоказатель) = Неопределено Тогда  			
			Объект.ПлановыеПоказателиПроизводстваПосменно.Удалить(-НС);		
		КонецЕсли;
	КонецЦикла; 	

КонецПроцедуры

&НаКлиенте
Процедура ПроизводствоУчастокПриИзмененииЦЛП(Элемент)
	УчастокПриИзмененииНаСервереЦЛП();
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервереЦЛП()
	
	ТипСменЦЛП = РфпСервер.ПолучитьТипСмены(Объект.УчастокЦЛП, Объект.Дата);
	
	ПараметрыВыбораСмен = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.УчастокЦЛП, Объект.Дата);
	
	Элементы.ПроизводствоПоДнямСмена.ПараметрыВыбора 			= ПараметрыВыбораСмен;
	Элементы.ПроизводствоПоДнямССмена.ПараметрыВыбора 			= ПараметрыВыбораСмен;
	Элементы.ПроизводствоПоДнямНСмена.ПараметрыВыбора 			= ПараметрыВыбораСмен;
	Элементы.ПоданоПоДнямСмена.ПараметрыВыбора 					= ПараметрыВыбораСмен;
	Элементы.ПолученоПиломатериаловПоДнямСмена.ПараметрыВыбора 	= ПараметрыВыбораСмен;
			
КонецПроцедуры

&НаСервере
Процедура ПлановыеПоказателиПроизводстваУчастокДГПриИзмененииНаСервере()
	
	ТипСменДГ = РфпСервер.ПолучитьТипСмены(Объект.УчастокДГ, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеПоказателиПроизводстваУчастокДГПриИзменении(Элемент)
	ПлановыеПоказателиПроизводстваУчастокДГПриИзмененииНаСервере();
КонецПроцедуры



