// Возвращает сведения о внешнем отчете.
//
// Возвращаемое значение:
//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.5.1");
	ПараметрыРегистрации.Информация = "Отчет по складу";
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.Назначение = Неопределено;
	ПараметрыРегистрации.ОпределитьНастройкиФормы = Ложь;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = "Отчет по складу";
	Команда.Идентификатор = "ОтчетПоСкладу";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
КонецФункции


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
		//СтандартнаяОбработка = Ложь;
		//
		//
		//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		//МакетКомпоновки = КомпоновщикМакета.Выполнить(
		//СхемаКомпоновкиДанных,
		//КомпоновщикНастроек.ПолучитьНастройки(),
		//ДанныеРасшифровки);
		//
		////КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПолучитьСтруктуруЗаголовковПолей(), МакетКомпоновки);
		////КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураДинамическихЗаголовков(), МакетКомпоновки);
		//
		//ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		//ПроцессорКомпоновки.Инициализировать(
		//МакетКомпоновки,
		//,
		//ДанныеРасшифровки);
		//
		//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		//ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		//
		////КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	КонецПроцедуры
	
	#КонецОбласти
	
	ЭтоОтчетУНФ = Ложь;
	
#КонецЕсли
