#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["РеестрТС"].Рекомендуемый = Истина;
	
	УстановитьТегиВариантов(НастройкиВариантов);
	ДобавитьОписанияСвязанныхПолей(НастройкиВариантов);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Период = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	//Отпустил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	//Получил = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Период = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	//Отпустил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Отпустил")).Значение;
	//Получил = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Получил")).Значение;
	
	//Проверим параметры периода
	Если НЕ Период.ДатаНачала = Дата(1,1,1)
		И НЕ Период.ДатаОкончания = Дата(1,1,1)
		И Период.ДатаНачала > Период.ДатаОкончания Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ru = 'Дата начала периода не должна превышать дату окончания.'");
		
		Возврат;
		
	КонецЕсли;
	
	ТабличныйДокумент = Сформировать(Период);
	
	ДокументРезультат.Вывести(ТабличныйДокумент);
	ДокументРезультат.ФиксацияСверху = ТабличныйДокумент.ФиксацияСверху;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТегиВариантов(НастройкиВариантов)
	
	НастройкиВариантов["РеестрТС"].Теги = НСТР("ru = 'Реестр транспортных средств по лесопродукции, отгруженной с ответхранения'");
	
КонецПроцедуры

Процедура ДобавитьОписанияСвязанныхПолей(НастройкиВариантов)
	
	//ОтчетыУНФ.ДобавитьОписаниеПривязки(НастройкиВариантов["АктПередачи"].СвязанныеПоля, "Контрагент", "Справочник.Контрагенты");
	
КонецПроцедуры

Функция Сформировать(Период)
	
	таб = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Д1", НачалоДня(Период.ДатаНачала));
	КонецПериода = ?(Период.ДатаОкончания = '3999-12-31' ИЛИ Период.ДатаОкончания = '0001-01-01', '0001-01-01', КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Д2", КонецПериода);
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, """") КАК Порода,
	|	алк_ВозвратОтветхраненияЗапасы.Ссылка,
	|	алк_ВозвратОтветхраненияЗапасы.Ссылка.НомерТС КАК НомерТС,
	|	алк_ВозвратОтветхраненияЗапасы.Ссылка.Дата КАК Дата,
	|	СУММА(алк_ВозвратОтветхраненияЗапасы.Объем) КАК Объем
	|ИЗ
	|	Документ.алк_ВозвратОтветхранения.Запасы КАК алк_ВозвратОтветхраненияЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ВозвратОтветхраненияЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_ВозвратОтветхраненияЗапасы.Ссылка.Проведен
	|	И алк_ВозвратОтветхраненияЗапасы.Ссылка.Дата МЕЖДУ &Д1 И &Д2
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, """"),
	|	алк_ВозвратОтветхраненияЗапасы.Ссылка,
	|	алк_ВозвратОтветхраненияЗапасы.Ссылка.НомерТС,
	|	алк_ВозвратОтветхраненияЗапасы.Ссылка.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерТС
	|ИТОГИ
	|	СУММА(Объем)
	|ПО
	|	ОБЩИЕ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	РезультатЗапроса = запрос.Выполнить();
	
	Итоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	макет = получитьмакет("Макет");
	шапка = макет.ПолучитьОбласть("Шапка");
	Строка = макет.ПолучитьОбласть("Строка");
	Подвал = макет.ПолучитьОбласть("Подвал");
	шапка.Параметры.период = ПредставлениеПериода(началодня(Запрос.Параметры.Д1), конецдня(Запрос.Параметры.Д2));
	шапка.Параметры.ДатаСоставления = Формат(Запрос.Параметры.Д2,"ДФ=dd.MM.yyyy")+" г.";
	таб.вывести(шапка);
	
	Итоги.Следующий();
	
	стр = Итоги.Выбрать();
	Пока стр.Следующий() Цикл
		Строка.параметры.заполнить(стр);
		таб.вывести(строка);
	КонецЦикла;
	подвал.Параметры.Заполнить(Итоги);
	таб.вывести(Подвал);
	
	Возврат таб;
	
КонецФункции

#КонецОбласти 

ЭтоОтчетУНФ = Истина;

#КонецЕсли