#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаСортировкаЛесопродукции, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_СортировкаЛесопродукцииПиловочник.Номенклатура,
		|	алк_СортировкаЛесопродукцииПиловочник.Порода,
		|	алк_СортировкаЛесопродукцииПиловочник.Сорт,
		|	алк_СортировкаЛесопродукцииПиловочник.Длина,
		|	алк_СортировкаЛесопродукцииПиловочник.Сечение,
		|	алк_СортировкаЛесопродукцииПиловочник.Количество КАК Количество,
		|	алк_СортировкаЛесопродукцииПиловочник.Объем,
		|	&Период,
		|	алк_СортировкаЛесопродукцииПиловочник.Ссылка.ДатаСмены,
		|	алк_СортировкаЛесопродукцииПиловочник.Ссылка.Смена,
		|	алк_СортировкаЛесопродукцииПиловочник.Ссылка.Партия
		|ИЗ
		|	Документ.алк_СортировкаЛесопродукции.Пиловочник КАК алк_СортировкаЛесопродукцииПиловочник
		|ГДЕ
		|	алк_СортировкаЛесопродукцииПиловочник.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСортировкаЛесопродукции);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаСортировкаЛесопродукции.Дата);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСортировкаЛесопродукции", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры
	
	#КонецОбласти
		
	
#КонецЕсли
