
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	тд = Элементы.Список.ТекущиеДанные;
	
	Если Не тд = Неопределено Тогда
		Если Элементы.Список.Развернут(Элементы.Список.ТекущаяСтрока)= Ложь Тогда
			Элементы.Список.Развернуть(Элементы.Список.ТекущаяСтрока,Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
    ТС = Элементы.Список.ТекущаяСтрока; 
    Если Элементы.Список.Развернут(ТС) = Истина Тогда
        Элементы.Список.Свернуть(ТС);
    Иначе
        Элементы.Список.Развернуть(ТС,Ложь);
	КонецЕсли;
	
КонецПроцедуры


