
 
 
 // кнопки времени 
 
&НаКлиенте
Процедура НачалоЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.НачалоЗагрузки, "НачалоЗагрузки");	
	
КонецПроцедуры
&НаКлиенте
Процедура НачалоЗагрузкиПриИзменении(Элемент) 
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "НачалоЗагрузки"); 

	ВводВремениЗавершено(Объект.НачалоЗагрузки, ПараметрыВремени);
     	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.ОкончаниеЗагрузки, "ОкончаниеЗагрузки");
КонецПроцедуры
&НаКлиенте
Процедура ОкончаниеЗагрузкиПриИзменении(Элемент)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "ОкончаниеЗагрузки"); 

	ВводВремениЗавершено(Объект.НачалоЗагрузки, ПараметрыВремени);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяЗапускаКамерыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ВызовФормыВремени(Объект.ВремяЗапускаКамеры, "ВремяЗапускаКамеры");
КонецПроцедуры
&НаКлиенте
Процедура ВремяЗапускаКамерыПриИзменении(Элемент)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ИмяРеквизита", "ВремяЗапускаКамеры"); 

	ВводВремениЗавершено(Объект.ВремяЗапускаКамеры, ПараметрыВремени);
	
КонецПроцедуры 



&НаКлиенте
Процедура ВызовФормыВремени(ДатаВремя, ИмяРеквизита)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ДатаВремя", ДатаВремя);
	ПараметрыВремени.Вставить("ИмяРеквизита", ИмяРеквизита);

	ОписаниеОповещения = Новый ОписаниеОповещения("ВводВремениЗавершено", ЭтотОбъект, ПараметрыВремени);
	                                                // форма,  				Параметры, Владелец,      Уникальность      Окно НавигационнаяСсылка      
	ОткрытьФорму("Документ.алк_ЗагрузкаВКамеруПропарки.Форма.ФормаВводаВремени", ПараметрыВремени, ЭтаФорма,УникальныйИдентификатор,    , 					, ОписаниеОповещения,);
		
КонецПроцедуры

&НаКлиенте
Процедура ВводВремениЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	РезультатЗакрытия = НачалоМинуты(РезультатЗакрытия);
	
	Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда  		
		
		Объект[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия;
		
		Если ДополнительныеПараметры.ИмяРеквизита = "НачалоЗагрузки" Тогда
			
			Объект.Дата = РезультатЗакрытия; 
			
			Объект.Сезон = ПолучитьСезон(Объект.НачалоЗагрузки);
			
			Объект.НормативЗагрузки = ПолучитьНормативЗагрузки(Объект.НачалоЗагрузки, Объект.Сезон);
			
			Если Не ЗначениеЗаполнено(Объект.ОкончаниеЗагрузки) Тогда 		
				Объект.ОкончаниеЗагрузки = Объект.НачалоЗагрузки;	
			КонецЕсли;   
			
			Если Не ЗначениеЗаполнено(Объект.ВремяЗапускаКамеры) Тогда 		
				Объект.ВремяЗапускаКамеры = Объект.НачалоЗагрузки;	
			КонецЕсли; 
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.ИмяРеквизита = "ОкончаниеЗагрузки" Тогда
			Если Не ЗначениеЗаполнено(Объект.ВремяЗапускаКамеры) Или Объект.НачалоЗагрузки = Объект.ВремяЗапускаКамеры Тогда 		
				Объект.ВремяЗапускаКамеры = Объект.ОкончаниеЗагрузки;	
			КонецЕсли;	
		КонецЕсли;

	КонецЕсли;        
			
	Модифицированность = Истина;
	
КонецПроцедуры // ВызовФормыВремени()


////////////////////////////

&НаКлиенте
Процедура НоменклатураГрадацияПропаркиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Номенклатура.ТекущиеДанные;
	
	ТекущиеДанные.НормативноеВремяПропарки = ПолучитьНормативПропарки(Объект.Дата, Объект.Сезон, ТекущиеДанные.ГрадацияПропарки);
	
	
	МаксимальныйНормативПропарки = 0;	
	
	Для каждого Стр Из Объект.Номенклатура Цикл
		
		Если МаксимальныйНормативПропарки < Стр.НормативноеВремяПропарки Тогда
			МаксимальныйНормативПропарки = Стр.НормативноеВремяПропарки;
		КонецЕсли;	
	
	КонецЦикла;
	
	Объект.НормативПропарки = МаксимальныйНормативПропарки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСезон(ДатаСреза)
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();	
	КонецЕсли; 

	Сезон = Перечисления.алк_СезоныПропарки.Лето;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сезон = ВыборкаДетальныеЗаписи.Сезон;
	КонецЦикла;
	
	Возврат Сезон;

КонецФункции // ПолучитьСезон()

&НаСервереБезКонтекста
Функция ПолучитьНормативЗагрузки(ДатаСреза, Сезон)  
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_НормативыПропаркиСрезПоследних
		|ГДЕ
		|	алк_НормативыПропаркиСрезПоследних.Сезон = &Сезон";
	
	Запрос.УстановитьПараметр("ДатаСреза", 	ДатаСреза);
	Запрос.УстановитьПараметр("Сезон", 		Сезон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Норматив = ВыборкаДетальныеЗаписи.НормативЗагрузки; 
	КонецЦикла;
	
	Возврат Норматив;
    	
КонецФункции // ПолучитьНормативЗагрузки()

 &НаСервереБезКонтекста
Функция ПолучитьНормативПропарки(ДатаСреза, Сезон, Градация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_НормативыПропаркиСрезПоследних
		|ГДЕ
		|	алк_НормативыПропаркиСрезПоследних.Градация = &Градация
		|	И алк_НормативыПропаркиСрезПоследних.Сезон = &Сезон";
	
	Запрос.УстановитьПараметр("Градация", 	Градация);
	Запрос.УстановитьПараметр("ДатаСреза", 	ДатаСреза);
	Запрос.УстановитьПараметр("Сезон", 		Сезон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НормативПропарки = ВыборкаДетальныеЗаписи.НормативПропарки;
	КонецЦикла;
	
	Возврат НормативПропарки;

КонецФункции // ПолучитьНормативПропарки()

&НаКлиенте
Процедура СменаПриИзменении(Элемент)  

	Объект.Дата = Объект.ДатаСмены + ?(Объект.Смена = ПредопределенноеЗначение("Перечисление.Смены.смена_8_20"), 3600*8, 3600*20); 	
	Объект.ДатаОкончанияСмены = Объект.Дата + (12*3600 - 1);        	
	
КонецПроцедуры
   
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 

