
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Аддендум") Тогда
		ТолькоСвободные = Истина;
	    Список.Параметры.УстановитьЗначениеПараметра("Аддендум", Параметры.Аддендум); 
		Если Параметры.Аддендум.Товары[0].Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001") Тогда 
			Элементы.КатегорияНоменклатурыПЭО.Видимость = Истина;
			Элементы.Припуск.Видимость = Истина;
		КонецЕсли
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторТовара") Тогда
	    Список.Параметры.УстановитьЗначениеПараметра("ИдентификаторТовара", Параметры.ИдентификаторТовара);
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
	    Номенклатура = Параметры.Номенклатура;
		КатегорияНоменклатуры = Параметры.Номенклатура.КатегорияНоменклатуры;
	КонецЕсли;     
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьПараметрыОтбораСервер()  
	
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоСвободные", ТолькоСвободные);
	Список.Параметры.УстановитьЗначениеПараметра("УчитыватьКатегориюПЭО", УчитыватьКатегориюПЭО);
	Список.Параметры.УстановитьЗначениеПараметра("УчитыватьПрипуск", УчитыватьПрипуск);
		
	Список.Параметры.УстановитьЗначениеПараметра("Порода", Порода.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Сорт", Сорт.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Длина", Длина.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Сечение", Сечение.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Влажность", Влажность.ВыгрузитьЗначения());
	
	Если Порода.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеПорода", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеПорода", Истина);
	КонецЕсли; 
	
	Если Сорт.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСорт", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСорт", Истина);
	КонецЕсли;

	Если Длина.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеДлина", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеДлина", Истина);
	КонецЕсли;

	Если Сечение.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСечение", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСечение", Истина);
	КонецЕсли;

	Если Влажность.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеВлажность", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеВлажность", Истина);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УстановитьПараметрыОтбора(Элемент)
	УстановитьПараметрыОтбораСервер();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыОтбораСервер(); 
КонецПроцедуры

