#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУстановкаЦенПоЗаказу, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Номенклатура,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Ссылка.Заказ КАК Заказ,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Ссылка.Организация,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Характеристика,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Цена,
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.ПредставлениеСтроки КАК ПредставлениеТовара
		|ИЗ
		|	Документ.алк_УстановкаЦенПоЗаказу.ЗапасыАссортимент КАК алк_УстановкаЦенПоЗаказуЗапасыАссортимент
		|ГДЕ
		|	алк_УстановкаЦенПоЗаказуЗапасыАссортимент.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУстановкаЦенПоЗаказу);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаУстановкаЦенПоЗаказу.Дата);
				
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЦеныПродукции", МассивРезультатов[0].Выгрузить());
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли