
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			
		КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		
		Если ДанныеЗаполнения.Свойство("Направление") Тогда
			Направление = ДанныеЗаполнения.Направление;	
		КонецЕсли; 
		
	КонецПроцедуры
	
	
	// Обработчик заполнения документа на основании Заказа покупателя.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоЗаказПокупателя(ДанныеЗаполнения, Операция = "") Экспорт
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Направление = ДанныеЗаполнения.Направление;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Номенклатура,
		|	алк_ЗаказПокупателяЗапасыАссортимент.Характеристика,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ЕдиницаИзмерения,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ПредставлениеСтроки КАК ПредставлениеСтроки,
		|	алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы КАК КлючСвязи,
		|	алк_ЗаказПокупателяОбъемныеГруппы.ПредставлениеАддендум КАК ПредставлениеАддендум,
		|	алк_ЗаказПокупателяОбъемныеГруппы.стрСорт КАК стрСорт
		|ИЗ
		|	Документ.алк_ЗаказПокупателя.ЗапасыАссортимент КАК алк_ЗаказПокупателяЗапасыАссортимент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ЗаказПокупателя.ОбъемныеГруппы КАК алк_ЗаказПокупателяОбъемныеГруппы
		|		ПО алк_ЗаказПокупателяЗапасыАссортимент.ИдентификаторГруппы = алк_ЗаказПокупателяОбъемныеГруппы.ИдентификаторГруппы
		|ГДЕ
		|	алк_ЗаказПокупателяЗапасыАссортимент.Ссылка = &Ссылка
		|	И алк_ЗаказПокупателяОбъемныеГруппы.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(КлючСвязи),
		|	МАКСИМУМ(стрСорт)
		|ПО
		|	ПредставлениеАддендум";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
		
		ВыборкаКлючСвязи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКлючСвязи.Следующий() Цикл
			
			НоваяСтрокаМассив = ЗапасыМассив.Добавить();
			НоваяСтрокаМассив.ПредставлениеСтроки = ?(ЗначениеЗаполнено(ВыборкаКлючСвязи.стрСорт), ВыборкаКлючСвязи.стрСорт + " - ", "") + ВыборкаКлючСвязи.ПредставлениеАддендум;
			НоваяСтрокаМассив.КлючСвязи           = ВыборкаКлючСвязи.КлючСвязи;
			
			мВыборкаДетальныеЗаписи = ВыборкаКлючСвязи.Выбрать();
			
			Пока мВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НоваяСтрокаАссортимент = ЗапасыАссортимент.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаАссортимент, мВыборкаДетальныеЗаписи);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецПроцедуры
	
	// Обработчик заполнения на основании данных заполнения.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура.
	//
	Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
		
		Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			
			ОнЖе = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
			
			Возврат;
			
		КонецЕсли;
		
		ЗаполнитьЗапасыПоТЧДокументыОснования();
		
	КонецПроцедуры
	
	
	Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
		
		ЗапасыАссортимент.Очистить();
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ЗаказПокупателя") Тогда
			
			ЗаполнитьПоЗаказПокупателя(ДокументОснование);
			
		КонецЕсли
		
		
	КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	
	#КонецОбласти
	
	
	#Область ОбработчикиСобытий
	
	// Процедура - обработчик события ОбработкаЗаполнения.
	//
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
			
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ЗаказПокупателя")] = "ЗаполнитьПоЗаказПокупателя";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
			
		КонецЕсли; 
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		// Инициализация дополнительных свойств для проведения документа.
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа.
		Документы.алк_УстановкаЦенПоЗаказу.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей.
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета.
		
		// Отражения в регистрах сведений
		РфпСервер.ОтразитьЦеныПродукции(ДополнительныеСвойства, Движения, Отказ);

		// СерийныеНомера
		//УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
		
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
#КонецЕсли


Процедура Конец()		
КонецПроцедуры


